[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am just a huge fuck up. I don&amp;#39;t have any real friends because they are just sick of me and my problems. I can barely pay for my mental health and no job would want to hire me because of my emotions. So many people I thought I was close with left me and it all hurt but when my dog left my life it really hurt, I still cry every night missing her. I do things with good intent in mind but get condemned for it. People do whatever it takes to preserve their way of living so they stay away from me to do that. I have not been able to learn my lesson and keep everything to myself and I end up in situations and places that are less than pleasant. I have so many problems that I think that are unfixable at this point. People always tell me that if I do that people will miss me and I will hurt whoever but no one ever tells me that it will hurt them, they don&amp;#39;t care, they are just putting it on someone else. And I feel like more of a fuck up when they say that. I don&amp;#39;t have a purpose in living and if I was gone the world would be a better place. I could probably save a life if I wasn&amp;#39;t here, I wouldn&amp;#39;t use up food, water, or the resources someone else needs. I am just a waste of life and my self worth is so little. I am thinking of just cutting my life short and being done with it or going to sleep somewhere outside so someone can kidnap me and murder me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am just a huge fuck up. I don't have any real friends because they are just sick of me and my problems. I can barely pay for my mental health and no job would want to hire me because of my emotions. So many people I thought I was close with left me and it all hurt but when my dog left my life it really hurt, I still cry every night missing her. I do things with good intent in mind but get condemned for it. People do whatever it takes to preserve their way of living so they stay away from me to do that. I have not been able to learn my lesson and keep everything to myself and I end up in situations and places that are less than pleasant. I have so many problems that I think that are unfixable at this point. People always tell me that if I do that people will miss me and I will hurt whoever but no one ever tells me that it will hurt them, they don't care, they are just putting it on someone else. And I feel like more of a fuck up when they say that. I don't have a purpose in living and if I was gone the world would be a better place. I could probably save a life if I wasn't here, I wouldn't use up food, water, or the resources someone else needs. I am just a waste of life and my self worth is so little. I am thinking of just cutting my life short and being done with it or going to sleep somewhere outside so someone can kidnap me and murder me. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2540cl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "AnonymousOutcast", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2540cl/17_and_done/", "name": "t3_2540cl", "created": 1399647358.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2540cl/17_and_done/", "author_flair_text": null, "title": "17 and done", "created_utc": 1399618558.0, "ups": 2, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdhqtm", "gilded": 0, "author": "splinteredruler", "parent_id": "t1_chdhf5l", "approved_by": null, "body": "I am not sure either. It might be worth obtaining some legal advice and seeing what they believe might be the post option for your scenario.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not sure either. It might be worth obtaining some legal advice and seeing what they believe might be the post option for your scenario.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdhqtm", "created": 1399652487.0, "author_flair_text": null, "created_utc": 1399623687.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdhf5l", "gilded": 0, "author": "AnonymousOutcast", "parent_id": "t1_chdhat6", "approved_by": null, "body": "I'm just not sure if I am able to press charges for that reason", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just not sure if I am able to press charges for that reason&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdhf5l", "created": 1399650658.0, "author_flair_text": null, "created_utc": 1399621858.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdhat6", "gilded": 0, "author": "splinteredruler", "parent_id": "t1_chdha4o", "approved_by": null, "body": "If you think that is a good option for you, definitely go for it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think that is a good option for you, definitely go for it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdhat6", "created": 1399649994.0, "author_flair_text": null, "created_utc": 1399621194.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdha4o", "gilded": 0, "author": "AnonymousOutcast", "parent_id": "t1_chdh94m", "approved_by": null, "body": "No.. I was actually thinking of pressing charges against them for all that emotional abuse on a mentally handicapped kid and causing me post trauma. I can't go a day without feeling awful about what happened there.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No.. I was actually thinking of pressing charges against them for all that emotional abuse on a mentally handicapped kid and causing me post trauma. I can&amp;#39;t go a day without feeling awful about what happened there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdha4o", "created": 1399649891.0, "author_flair_text": null, "created_utc": 1399621091.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdh94m", "gilded": 0, "author": "splinteredruler", "parent_id": "t1_chdh4nc", "approved_by": null, "body": "Would calling the school be a better option for you? Or having your parent(s) do so for you? It's incredibly unfortunate that your school dealt so poorly with your aspergers.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would calling the school be a better option for you? Or having your parent(s) do so for you? It&amp;#39;s incredibly unfortunate that your school dealt so poorly with your aspergers.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdh94m", "created": 1399649742.0, "author_flair_text": null, "created_utc": 1399620942.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdh4nc", "gilded": 0, "author": "AnonymousOutcast", "parent_id": "t1_chdh1ok", "approved_by": null, "body": "I have been to the district before I went to the school and they said they don't handle my problems and I have to go to the school and talk to them about it. I don't bother going anywhere near that place because I just remember and have flashbacks of all the emotional abuse they had on me. They put me into special ed because they didn't want to deal with my problems when I was there and I was diagnosed with aspergers at the school. An example of what they did was in history, this was a special ed class as well. The teacher knew that I had aspergers and that I had a tough time with socializing and I spaced out and I couldn't answer him and I was waiting for him to say something but I guess he was doing the same and he said that I creep him out and that my future boss will get creeped out and I felt so bad about myself and my self worth was lowered.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been to the district before I went to the school and they said they don&amp;#39;t handle my problems and I have to go to the school and talk to them about it. I don&amp;#39;t bother going anywhere near that place because I just remember and have flashbacks of all the emotional abuse they had on me. They put me into special ed because they didn&amp;#39;t want to deal with my problems when I was there and I was diagnosed with aspergers at the school. An example of what they did was in history, this was a special ed class as well. The teacher knew that I had aspergers and that I had a tough time with socializing and I spaced out and I couldn&amp;#39;t answer him and I was waiting for him to say something but I guess he was doing the same and he said that I creep him out and that my future boss will get creeped out and I felt so bad about myself and my self worth was lowered.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdh4nc", "created": 1399649115.0, "author_flair_text": null, "created_utc": 1399620315.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdh1ok", "gilded": 0, "author": "splinteredruler", "parent_id": "t1_chdgwuj", "approved_by": null, "body": "I gotcha. Would you be able to speak to a school counsellor? This would be a no-cost option until/if you are able (or want) to start being able to pay for other services. Finding a job is extremely difficult at a young (or any, really) age. I myself am facing similar problems, and can't offer much advice beyond saying hand in as many resumes as you possibly can to give yourself more possibilities for employment.\n\nYour experiences of returning to school do sound very horrible. Did you try contacting them to ask for more information? Or the education district? I don't believe a school can expel you based on problems with mental health, and it would be worth bringing up to a higher position of authority if you feel as though this was the case.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I gotcha. Would you be able to speak to a school counsellor? This would be a no-cost option until/if you are able (or want) to start being able to pay for other services. Finding a job is extremely difficult at a young (or any, really) age. I myself am facing similar problems, and can&amp;#39;t offer much advice beyond saying hand in as many resumes as you possibly can to give yourself more possibilities for employment.&lt;/p&gt;\n\n&lt;p&gt;Your experiences of returning to school do sound very horrible. Did you try contacting them to ask for more information? Or the education district? I don&amp;#39;t believe a school can expel you based on problems with mental health, and it would be worth bringing up to a higher position of authority if you feel as though this was the case.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdh1ok", "created": 1399648717.0, "author_flair_text": null, "created_utc": 1399619917.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdgwuj", "gilded": 0, "author": "AnonymousOutcast", "parent_id": "t1_chdgtmn", "approved_by": null, "body": "Yes, when I mention mental health services I mean I barely afford a therapist now and I have to look for my first job but I really doubt anyone would consider me.\nAn example would be trying to find out why I got expelled from my school when I returned from the hospital and the assistant principal telling me that if I'm on school property anymore he will call the police and treat me like a criminal and when I was getting on the car I heard him call me a terrorist. I thought that that was a little too much effort to make me feel bad and I thought that that was over the top. I never was given a concrete reason so I concluded that I got expelled for suicidal thoughts. I thought that they really wanted me to end my life by how they were treating me and sometimes I wish I did.", "edited": 1399619561.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, when I mention mental health services I mean I barely afford a therapist now and I have to look for my first job but I really doubt anyone would consider me.\nAn example would be trying to find out why I got expelled from my school when I returned from the hospital and the assistant principal telling me that if I&amp;#39;m on school property anymore he will call the police and treat me like a criminal and when I was getting on the car I heard him call me a terrorist. I thought that that was a little too much effort to make me feel bad and I thought that that was over the top. I never was given a concrete reason so I concluded that I got expelled for suicidal thoughts. I thought that they really wanted me to end my life by how they were treating me and sometimes I wish I did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdgwuj", "created": 1399648094.0, "author_flair_text": null, "created_utc": 1399619294.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdgtmn", "gilded": 0, "author": "splinteredruler", "parent_id": "t3_2540cl", "approved_by": null, "body": "You say you are paying for mental health services, does this include a counsellor or therapist? They're job is to listen and they won't become sick of your problems. I am sorry to hear about your dog, it hurts when we lose a pet that means a lot to us, and can take a long time to get over.\n\nWhat do you mean you get condemned for things you do? Would you be able to provide some examples? Having good intent is an excellent way to go forward with things, though, even if the outcomes are less than positive.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say you are paying for mental health services, does this include a counsellor or therapist? They&amp;#39;re job is to listen and they won&amp;#39;t become sick of your problems. I am sorry to hear about your dog, it hurts when we lose a pet that means a lot to us, and can take a long time to get over.&lt;/p&gt;\n\n&lt;p&gt;What do you mean you get condemned for things you do? Would you be able to provide some examples? Having good intent is an excellent way to go forward with things, though, even if the outcomes are less than positive.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540cl", "score_hidden": false, "name": "t1_chdgtmn", "created": 1399647691.0, "author_flair_text": null, "created_utc": 1399618891.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]