[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m F/almost 21. No other underlying health problems.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gone from doc to doc. At first I was diagnosed with labyrinthitis, and recently my doc said I never had that because I didn&amp;#39;t experience true-room spinning vertigo.&lt;/p&gt;\n\n&lt;p&gt;Stupid me let my allergies untreated for too long and now I have inner ear damage. I can&amp;#39;t tell if I&amp;#39;m getting better or worse. I&amp;#39;ve had these terrible symptoms for 4 months now.&lt;/p&gt;\n\n&lt;p&gt;My world won&amp;#39;t stop rotating. I know it&amp;#39;s not. My brain is not getting that. It feels like there is a huge invisible globe and my room is inside it, and it feels like it&amp;#39;s veeery slowly rotating to the left, or right. Sometimes it rocks and and forth.&lt;/p&gt;\n\n&lt;p&gt;I had to drop out of college because of this. I can&amp;#39;t get a job. I can&amp;#39;t hang out with my friends like I used to. It&amp;#39;s putting a strain between my boyfriend and I.&lt;/p&gt;\n\n&lt;p&gt;Everything is normal (MRI, EKG, blood tests, etc.). Got a VNG done and I have 21% left unilateral weakness, which apparently it&amp;#39;s on the borderline of normal and of no clinical significance.&lt;/p&gt;\n\n&lt;p&gt;It sure as hell doesn&amp;#39;t feel like it. I got put on Prednisone in case there was an inflammation, and it only made my balance worse. I was doing so well with physical therapy.&lt;/p&gt;\n\n&lt;p&gt;How can people live like this? I know some people have dizziness for YEARS but... me? I&amp;#39;m not strong enough. I&amp;#39;m tired of feeling like my room is rotating to the left, or right. When I close my eyes it suddenly feels like I&amp;#39;m on a moving platform. Nothing I do makes it feel better. When I lie down to go to sleep I feel like I am still moving. i can&amp;#39;t go to stores, public places, restaurants without the stimulation triggering me even more.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t take this anymore. I miss the things I used to do. All my friends are busy with school so they can&amp;#39;t visit me much. I&amp;#39;m homebound and fucking depressed.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t take being dizzy one more day.&lt;/p&gt;\n\n&lt;p&gt;No meds has helped me. I&amp;#39;m broke now from the meds I&amp;#39;ve been trying.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm F/almost 21. No other underlying health problems.\n\nI've gone from doc to doc. At first I was diagnosed with labyrinthitis, and recently my doc said I never had that because I didn't experience true-room spinning vertigo.\n\nStupid me let my allergies untreated for too long and now I have inner ear damage. I can't tell if I'm getting better or worse. I've had these terrible symptoms for 4 months now.\n\nMy world won't stop rotating. I know it's not. My brain is not getting that. It feels like there is a huge invisible globe and my room is inside it, and it feels like it's veeery slowly rotating to the left, or right. Sometimes it rocks and and forth.\n\nI had to drop out of college because of this. I can't get a job. I can't hang out with my friends like I used to. It's putting a strain between my boyfriend and I.\n\nEverything is normal (MRI, EKG, blood tests, etc.). Got a VNG done and I have 21% left unilateral weakness, which apparently it's on the borderline of normal and of no clinical significance.\n\nIt sure as hell doesn't feel like it. I got put on Prednisone in case there was an inflammation, and it only made my balance worse. I was doing so well with physical therapy.\n\n\nHow can people live like this? I know some people have dizziness for YEARS but... me? I'm not strong enough. I'm tired of feeling like my room is rotating to the left, or right. When I close my eyes it suddenly feels like I'm on a moving platform. Nothing I do makes it feel better. When I lie down to go to sleep I feel like I am still moving. i can't go to stores, public places, restaurants without the stimulation triggering me even more.\n\n\nI can't take this anymore. I miss the things I used to do. All my friends are busy with school so they can't visit me much. I'm homebound and fucking depressed.\n\n\n\nI can't take being dizzy one more day.\n\nNo meds has helped me. I'm broke now from the meds I've been trying.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24e4ck", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway3913", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398886485.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24e4ck/247_vertigo_for_4_months_i_cant_take_it_anymore/", "name": "t3_24e4ck", "created": 1398914438.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24e4ck/247_vertigo_for_4_months_i_cant_take_it_anymore/", "author_flair_text": null, "title": "24/7 vertigo for 4 months. I can't take it anymore.", "created_utc": 1398885638.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch67yuo", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24e4ck", "approved_by": null, "body": "I'm so sorry you've got to go through that, and I know this is easy to say from someone who has never had to experience what you are going through, but just because no meds have helped you yet that doesn't mean that something won't come along soon that will. Having said that I can't imagine what it's like for you to have to deal with that every day, but I honestly don't think ending this is the right thing to do. It also sucks that your friends don't have the time to visit you when you are going through this hard time, having someone to talk to can really help you to deal with depression. So if you do want someone to talk about these things with I will do whatever I can.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you&amp;#39;ve got to go through that, and I know this is easy to say from someone who has never had to experience what you are going through, but just because no meds have helped you yet that doesn&amp;#39;t mean that something won&amp;#39;t come along soon that will. Having said that I can&amp;#39;t imagine what it&amp;#39;s like for you to have to deal with that every day, but I honestly don&amp;#39;t think ending this is the right thing to do. It also sucks that your friends don&amp;#39;t have the time to visit you when you are going through this hard time, having someone to talk to can really help you to deal with depression. So if you do want someone to talk about these things with I will do whatever I can.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4ck", "score_hidden": false, "name": "t1_ch67yuo", "created": 1398915094.0, "author_flair_text": null, "created_utc": 1398886294.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]