[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if it seems like I&amp;#39;m rambling, but i have so much going through my head right now.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just tired.  Every morning I wake up my whole body aches.  It physically hurts to wake up and get out of bed, but the aches subdue after an hour or so.  I can&amp;#39;t sleep for more than 2-3 hours at a time because of my shoulder sockets hurt like hell.  I&amp;#39;ve been to doctors that say &amp;quot;it&amp;#39;s the way i sleep&amp;quot; or &amp;quot;i need a better bed&amp;quot; but none of that has worked (changed beds twice.)  My job is very hectic, I work six days a week as a lead mechanic and shop manager, so money isn&amp;#39;t a problem - yet at the end of the week I end up broke.  Spending it on things to keep my mind off of me.  I live alone.  In an apartment that I should be getting an eviction notice pretty soon (actually surprised it hasn&amp;#39;t come already.)  Family wise it&amp;#39;s difficult.  My father is from a middle-eastern country (I was born in the US, as is my mother) so he feels that &amp;quot;it&amp;#39;s all just in my head,&amp;quot; and the little help my mother gives me, my father gets frustrated at her.  My brother is trying to help, but I can&amp;#39;t place this burden on him.  Schizophrenia, depression, as well as other psychological disorders run in my father&amp;#39;s side pretty rampant, so I can&amp;#39;t figure out why my father treats me like this.  I shut down, don&amp;#39;t answer phones, when someone shows up at my door I don&amp;#39;t answer, I NEVER turn on lights when I&amp;#39;m shut down.  I want no contact what so ever, I know that this just exasperates the problem, but I have no better way of coping right now.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been admitted (willfully) to a psych ward (6 days) and I did feel some-what better, but I complained about the drugs I was given (very zombie-like feeling) and that my sleeping habits/aches didn&amp;#39;t get better.  &amp;quot;Just give it time, it&amp;#39;ll go&amp;quot; was the best response I got and was given the green light to leave.  &lt;/p&gt;\n\n&lt;p&gt;I have used drugs.  My drug of choice for 10+ years was DXM, I daily use pot (4 years now, but haven&amp;#39;t used in 3 days.)  I haven&amp;#39;t used DXM in about 7 months now, but I know I plan on using again before I do the deed.  I have created something already to get the job done - just a twist of a valve and I&amp;#39;ll be asleep for ever.  I just don&amp;#39;t want my family/friends to find me first.  I want the owner/worker/someone of non-relations to me of the apartment building to find me first.&lt;/p&gt;\n\n&lt;p&gt;My ex hurt me pretty bad from her coke/xanax abuse.  I don&amp;#39;t trust anyone.  Growing up in a rough neighborhood I was a smart child - and just from jealousy of other students, I would get beat - badly.  I&amp;#39;ve lost teeth from the beatings I&amp;#39;d get because they where jealous, so I do have HUGE trust issues with everyone.&lt;/p&gt;\n\n&lt;p&gt;Another issue that I have is that I am two faced.  Man, when I&amp;#39;m at work/out with friends/etc... you&amp;#39;d never tell I&amp;#39;m depressed.  I hide it VERY well.  The owner of the shop I work as has been told of my condition, but he takes it with a grain of salt.  He seen the papers from the psych ward, and like my father (he was born in the US, his parents where from the Middle-East) he thinks that I need to get a girlfriend or &amp;#39;just get some pussy&amp;#39; and I&amp;#39;ll be better.&lt;/p&gt;\n\n&lt;p&gt;So, that&amp;#39;s only scratching the surface.  I plan on doing some laundry an cleaning up the place before it happens, so I&amp;#39;ll be around, if only for a little while longer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry if it seems like I'm rambling, but i have so much going through my head right now.\n\nI'm just tired.  Every morning I wake up my whole body aches.  It physically hurts to wake up and get out of bed, but the aches subdue after an hour or so.  I can't sleep for more than 2-3 hours at a time because of my shoulder sockets hurt like hell.  I've been to doctors that say \"it's the way i sleep\" or \"i need a better bed\" but none of that has worked (changed beds twice.)  My job is very hectic, I work six days a week as a lead mechanic and shop manager, so money isn't a problem - yet at the end of the week I end up broke.  Spending it on things to keep my mind off of me.  I live alone.  In an apartment that I should be getting an eviction notice pretty soon (actually surprised it hasn't come already.)  Family wise it's difficult.  My father is from a middle-eastern country (I was born in the US, as is my mother) so he feels that \"it's all just in my head,\" and the little help my mother gives me, my father gets frustrated at her.  My brother is trying to help, but I can't place this burden on him.  Schizophrenia, depression, as well as other psychological disorders run in my father's side pretty rampant, so I can't figure out why my father treats me like this.  I shut down, don't answer phones, when someone shows up at my door I don't answer, I NEVER turn on lights when I'm shut down.  I want no contact what so ever, I know that this just exasperates the problem, but I have no better way of coping right now.\n\nI've been admitted (willfully) to a psych ward (6 days) and I did feel some-what better, but I complained about the drugs I was given (very zombie-like feeling) and that my sleeping habits/aches didn't get better.  \"Just give it time, it'll go\" was the best response I got and was given the green light to leave.  \n\nI have used drugs.  My drug of choice for 10+ years was DXM, I daily use pot (4 years now, but haven't used in 3 days.)  I haven't used DXM in about 7 months now, but I know I plan on using again before I do the deed.  I have created something already to get the job done - just a twist of a valve and I'll be asleep for ever.  I just don't want my family/friends to find me first.  I want the owner/worker/someone of non-relations to me of the apartment building to find me first.\n\nMy ex hurt me pretty bad from her coke/xanax abuse.  I don't trust anyone.  Growing up in a rough neighborhood I was a smart child - and just from jealousy of other students, I would get beat - badly.  I've lost teeth from the beatings I'd get because they where jealous, so I do have HUGE trust issues with everyone.\n\nAnother issue that I have is that I am two faced.  Man, when I'm at work/out with friends/etc... you'd never tell I'm depressed.  I hide it VERY well.  The owner of the shop I work as has been told of my condition, but he takes it with a grain of salt.  He seen the papers from the psych ward, and like my father (he was born in the US, his parents where from the Middle-East) he thinks that I need to get a girlfriend or 'just get some pussy' and I'll be better.\n\nSo, that's only scratching the surface.  I plan on doing some laundry an cleaning up the place before it happens, so I'll be around, if only for a little while longer.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24vghb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sotired42985", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24vghb/29_and_im_just_so_exhausted_from_life/", "name": "t3_24vghb", "created": 1399421820.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24vghb/29_and_im_just_so_exhausted_from_life/", "author_flair_text": null, "title": "29 and I'm just so exhausted from life.", "created_utc": 1399393020.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]