[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not a man. I’m a monster. I’m waiting to attack. A part of me doesn’t want to but I don’t know if I can stop myself. I’m tense so, fucking tense. I wanna cut my fat off and rip off my arms. The pimples on my face need to be shoved into my skull. They hurt. I could be a monster, a killer. I dream of fire. I just want to break something of my own. I want to feel me knuckles shattered against something shatterable. I want to bend my fingers back and hear hem snap and crunch and break. I wanna turn my head till it snaps. WHAT THE FUCK AM I ?!?!?! I imagine a scenario where my skull gets crushed but not between something. I wanna want to hear something real break. I need to scream. I want to hurt someone, me. I can’t focus!!!!! Ever it seems. I think if my bones eroded to dust I’d be ok. I can’t do anything anymore. not a paper, not study, not think straight. its like there’s a tumor in my brain that won&amp;#39;t let me focus or comprehend while watching something. I&amp;#39;m FUCKING DYING. I WANT TO HURT ME. I’m so close to the end of the school year but I cant make it. Even if I ignore everything until its all over I’ll want to kill myself. I wanna stab myself in the gut for being so pathetic. I CANT DO ANYTHING. Stop moping, work. I cant. yes you can. work you bitch. Nooooooooo. you’re weak. I KNOW THAT. I want to so badly but I won’t. I wish I could say can’t but I can&amp;#39;t. DO SOMETHING WRITE WRITE WRITE! STOP THIS, STOP THIS! PLEASE HELP ME. I don’t want to be a failure. I’m nothing. fat lazy stupid small penis bitch unoriginal uncreative. don&amp;#39;t say that that’s all I think I really have. I worked for a few months there, really hard too. NO YOU DIDN’T. you started getting tired. started cutting corners. the work was long and fast. so tired, feet always hurt. waste money. I am the worst. what happened? I was doing so well. The wheels fell off the wagon. she was unreasonable. too much work how am I supposed to succeed? TRY HARDER! DO WORK SOONER! I won’t though, never will. I used to be something. no I didn&amp;#39;t, was always this way. now there’s no way out so I have to. can’t kill myself then there’s nothing. there has to be something. counseling medicine. none of that can help now. I need to get to a bright place. what if there is none? back hurts, bad posture. I could write 2500 words about this, me. you selfish fuck! FAKE? NO real unfortuately. I want help. I don&amp;#39;t wanna be in this cage anymore. not a cage, a mind. What if my dreams aren’t good? what I they suck? I wanna cry more but I’ve got nothing. I don’t wanna talk, I just wanna write. I couldn’t take the pain. I just want to hear the sounds to know I did it. to know justice, self justice had been served. I won&amp;#39;t do it though. I don&amp;#39;t think there’s any help coming. please help me. I don&amp;#39;t want to think anymore. none of it is good. please help. please help. God. I’m not a mistake, monster exist for a reason. I may not kill but I’m still a piece of shit. I cant stop thinking. that wont rather. this is tiny compared to everything else in the world. I don’t want to let go of these feelings go. where is my soul? I think its gone now&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I’m not a man. I’m a monster. I’m waiting to attack. A part of me doesn’t want to but I don’t know if I can stop myself. I’m tense so, fucking tense. I wanna cut my fat off and rip off my arms. The pimples on my face need to be shoved into my skull. They hurt. I could be a monster, a killer. I dream of fire. I just want to break something of my own. I want to feel me knuckles shattered against something shatterable. I want to bend my fingers back and hear hem snap and crunch and break. I wanna turn my head till it snaps. WHAT THE FUCK AM I ?!?!?! I imagine a scenario where my skull gets crushed but not between something. I wanna want to hear something real break. I need to scream. I want to hurt someone, me. I can’t focus!!!!! Ever it seems. I think if my bones eroded to dust I’d be ok. I can’t do anything anymore. not a paper, not study, not think straight. its like there’s a tumor in my brain that won't let me focus or comprehend while watching something. I'm FUCKING DYING. I WANT TO HURT ME. I’m so close to the end of the school year but I cant make it. Even if I ignore everything until its all over I’ll want to kill myself. I wanna stab myself in the gut for being so pathetic. I CANT DO ANYTHING. Stop moping, work. I cant. yes you can. work you bitch. Nooooooooo. you’re weak. I KNOW THAT. I want to so badly but I won’t. I wish I could say can’t but I can't. DO SOMETHING WRITE WRITE WRITE! STOP THIS, STOP THIS! PLEASE HELP ME. I don’t want to be a failure. I’m nothing. fat lazy stupid small penis bitch unoriginal uncreative. don't say that that’s all I think I really have. I worked for a few months there, really hard too. NO YOU DIDN’T. you started getting tired. started cutting corners. the work was long and fast. so tired, feet always hurt. waste money. I am the worst. what happened? I was doing so well. The wheels fell off the wagon. she was unreasonable. too much work how am I supposed to succeed? TRY HARDER! DO WORK SOONER! I won’t though, never will. I used to be something. no I didn't, was always this way. now there’s no way out so I have to. can’t kill myself then there’s nothing. there has to be something. counseling medicine. none of that can help now. I need to get to a bright place. what if there is none? back hurts, bad posture. I could write 2500 words about this, me. you selfish fuck! FAKE? NO real unfortuately. I want help. I don't wanna be in this cage anymore. not a cage, a mind. What if my dreams aren’t good? what I they suck? I wanna cry more but I’ve got nothing. I don’t wanna talk, I just wanna write. I couldn’t take the pain. I just want to hear the sounds to know I did it. to know justice, self justice had been served. I won't do it though. I don't think there’s any help coming. please help me. I don't want to think anymore. none of it is good. please help. please help. God. I’m not a mistake, monster exist for a reason. I may not kill but I’m still a piece of shit. I cant stop thinking. that wont rather. this is tiny compared to everything else in the world. I don’t want to let go of these feelings go. where is my soul? I think its gone now", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24uloh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stopthispleas", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24uloh/71_people_in_the_past_day_48_on_now_help/", "name": "t3_24uloh", "created": 1399394641.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24uloh/71_people_in_the_past_day_48_on_now_help/", "author_flair_text": null, "title": "71 people in the past day, 48 on now. Help", "created_utc": 1399365841.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaz7ud", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24uloh", "approved_by": null, "body": "Have you tried talking to someone about how you are feeling?\nIt is hard to get help but sometimes just talking to someone in real life can help loads.\nHope you have a great day! ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried talking to someone about how you are feeling?\nIt is hard to get help but sometimes just talking to someone in real life can help loads.\nHope you have a great day! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24uloh", "score_hidden": false, "name": "t1_chaz7ud", "created": 1399418290.0, "author_flair_text": null, "created_utc": 1399389490.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]