[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a senior in high school now and I hadn&amp;#39;t seen him since the end of 8th grade. While I have known people who have died (mostly older family members of natural causes) his death is something different. I am still struggling to accept the fact that this guy who was a great, funny, and smart human being is just gone. He will no longer be around and even though I have not spoken to him in some time I will never again be able to even consider talking to him. I just cant get over the fact that he is gone. How does one deal with such a thing. I&amp;#39;ll be attending his memorial/viewing but I dont think I can get over the fact that someone I used to talk to and break bread with is gone. Why is this? Why is that even though I didnt talk to him much I still want to know that he is there. But he wont be. Im sorry for the wall of text I just cant figure out what to say or what to ask for help. I just wish he was here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a senior in high school now and I hadn't seen him since the end of 8th grade. While I have known people who have died (mostly older family members of natural causes) his death is something different. I am still struggling to accept the fact that this guy who was a great, funny, and smart human being is just gone. He will no longer be around and even though I have not spoken to him in some time I will never again be able to even consider talking to him. I just cant get over the fact that he is gone. How does one deal with such a thing. I'll be attending his memorial/viewing but I dont think I can get over the fact that someone I used to talk to and break bread with is gone. Why is this? Why is that even though I didnt talk to him much I still want to know that he is there. But he wont be. Im sorry for the wall of text I just cant figure out what to say or what to ask for help. I just wish he was here.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24pvny", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SgtWaffles2424", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24pvny/a_friend_who_i_used_to_talk_to_fairly_often_in/", "name": "t3_24pvny", "created": 1399264284.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24pvny/a_friend_who_i_used_to_talk_to_fairly_often_in/", "author_flair_text": null, "title": "A friend who I used to talk to fairly often in middle school committed suicide last week.", "created_utc": 1399235484.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9njdm", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24pvny", "approved_by": null, "body": "Here's the thing about people who are severely depressed and suicidal: they get very good at hiding it.  That's why these terrible events usually surprise friends/families of the victims.  There was nothing you could do.  How were you to know he felt so terrible unless he reached out to you first?\n\nI'm sorry you're feeling so terrible about this, and I'm so sorry your friend chose the path he did.  All you can do now is learn from it. Hug your loved ones a little tighter. Smile whenever you can. Reach out to friends more. Drop people texts just to find out how they're doing.  ...It's the little gestures that mean the most in the end. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s the thing about people who are severely depressed and suicidal: they get very good at hiding it.  That&amp;#39;s why these terrible events usually surprise friends/families of the victims.  There was nothing you could do.  How were you to know he felt so terrible unless he reached out to you first?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re feeling so terrible about this, and I&amp;#39;m so sorry your friend chose the path he did.  All you can do now is learn from it. Hug your loved ones a little tighter. Smile whenever you can. Reach out to friends more. Drop people texts just to find out how they&amp;#39;re doing.  ...It&amp;#39;s the little gestures that mean the most in the end. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24pvny", "score_hidden": false, "name": "t1_ch9njdm", "created": 1399278333.0, "author_flair_text": null, "created_utc": 1399249533.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]