[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello there. &lt;/p&gt;\n\n&lt;p&gt;Before I say anything about myself I&amp;#39;d like to thank this subreddit. Being able to read about people who&amp;#39;s in the same position as I am, has helped me alot, reading the encouragements that were ment to others as if they were meant to me, actually ended up meaning a whole lot more to me then I thought.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a 19 y/o man and I&amp;#39;ve been depressed for 3 years and suicidal for a couple of months now. If you would&amp;#39;ve met me, you&amp;#39;d never think that was the case, I know what kind of roll Im playing out whenever I actually spend time with my friends or at &amp;quot;college&amp;quot; and its definitely not a depressed one. My social fears have grown stronger even tho I&amp;#39;ve done my best to get rid of them, I&amp;#39;m afraid of many social encounters but I&amp;#39;m great once I actually socialize with someone.&lt;/p&gt;\n\n&lt;p&gt;Lately I&amp;#39;ve noticed myself going into a downward spiral, I&amp;#39;m failing college, letting everyone close to me down. I know that everyone had expectations of  and I&amp;#39;ve let them down, I&amp;#39;ve let myself down on so many levels and I&amp;#39;m not even close to the person I want to be, that I used to be.&lt;/p&gt;\n\n&lt;p&gt;Who am I?&lt;/p&gt;\n\n&lt;p&gt;Do I matter?&lt;/p&gt;\n\n&lt;p&gt;Are questions I tend to ask myself alot yet never manage to answer them. I&amp;#39;ve decided on what will happen to me and therefore I&amp;#39;d like to thank this subreddit. I guess this isn&amp;#39;t a cry for help but more like lifting a weight of my shoulders, I&amp;#39;ve finally managed to write some of my thoughts down which I&amp;#39;ve never been able to before.&lt;/p&gt;\n\n&lt;p&gt;Even tho I&amp;#39;ve been a lurker for a longer period of time, I still want to thank this subreddit for existing. I want to thank it for helping me through these past months, but I couldnt ask for more. &lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n\n&lt;p&gt;(P.S Throwaway account)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello there. \n\nBefore I say anything about myself I'd like to thank this subreddit. Being able to read about people who's in the same position as I am, has helped me alot, reading the encouragements that were ment to others as if they were meant to me, actually ended up meaning a whole lot more to me then I thought.\n\n\nI'm a 19 y/o man and I've been depressed for 3 years and suicidal for a couple of months now. If you would've met me, you'd never think that was the case, I know what kind of roll Im playing out whenever I actually spend time with my friends or at \"college\" and its definitely not a depressed one. My social fears have grown stronger even tho I've done my best to get rid of them, I'm afraid of many social encounters but I'm great once I actually socialize with someone.\n\n\nLately I've noticed myself going into a downward spiral, I'm failing college, letting everyone close to me down. I know that everyone had expectations of  and I've let them down, I've let myself down on so many levels and I'm not even close to the person I want to be, that I used to be.\n\nWho am I?\n\n\nDo I matter?\n\n\nAre questions I tend to ask myself alot yet never manage to answer them. I've decided on what will happen to me and therefore I'd like to thank this subreddit. I guess this isn't a cry for help but more like lifting a weight of my shoulders, I've finally managed to write some of my thoughts down which I've never been able to before.\n\n\nEven tho I've been a lurker for a longer period of time, I still want to thank this subreddit for existing. I want to thank it for helping me through these past months, but I couldnt ask for more. \n\nThank you.\n\n(P.S Throwaway account)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25ep1c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25ep1c/a_weight_has_been_lifted_of_my_shoulders/", "name": "t3_25ep1c", "created": 1399970133.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25ep1c/a_weight_has_been_lifted_of_my_shoulders/", "author_flair_text": null, "title": "A weight has been lifted of my shoulders.", "created_utc": 1399941333.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]