[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure long posts are common here, so I will do my best to be concise: I was suicidal as a child, therapy for several years. Things escalated, sent off to a mental hospital, diagnosed with bipolar, drugged up with lithium and sent on my merry way. &lt;/p&gt;\n\n&lt;p&gt;Been off the meds for several years. I&amp;#39;ve had several intensely dark periods but no suicidal thoughts or anything, except for this last year. I find myself fending off thoughts/compulsions to commit suicide with greater and greater frequency. I don&amp;#39;t consider myself on the brink of doing anything, but I am running out of ways to deal with this. I&amp;#39;m having trouble interacting with people, I shut down around friends I&amp;#39;m close to, the ends of my rope are fraying. I can&amp;#39;t afford therapy right now, but I will pursue it when I can.&lt;/p&gt;\n\n&lt;p&gt;My question is this: is there any advice you can give me? If you dealt with these problems yourself, were you able to help yourself by changing the way you thought about things? How can I help myself? Thank you if you read this far.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm sure long posts are common here, so I will do my best to be concise: I was suicidal as a child, therapy for several years. Things escalated, sent off to a mental hospital, diagnosed with bipolar, drugged up with lithium and sent on my merry way. \n\nBeen off the meds for several years. I've had several intensely dark periods but no suicidal thoughts or anything, except for this last year. I find myself fending off thoughts/compulsions to commit suicide with greater and greater frequency. I don't consider myself on the brink of doing anything, but I am running out of ways to deal with this. I'm having trouble interacting with people, I shut down around friends I'm close to, the ends of my rope are fraying. I can't afford therapy right now, but I will pursue it when I can.\n\nMy question is this: is there any advice you can give me? If you dealt with these problems yourself, were you able to help yourself by changing the way you thought about things? How can I help myself? Thank you if you read this far.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ig35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Jazzematics", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ig35/advice_dealing_with_suicidal_compulsions_cant/", "name": "t3_24ig35", "created": 1399027976.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ig35/advice_dealing_with_suicidal_compulsions_cant/", "author_flair_text": null, "title": "[Advice] Dealing with suicidal compulsions, can't afford counseling. I need your advice. Please.", "created_utc": 1398999176.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7kzhy", "gilded": 0, "author": "Nimtike", "parent_id": "t1_ch7iwf6", "approved_by": null, "body": "Sometimes the best way to fight against sadness, anger, and distress is to not fight it at all. Feeling the emotions that wind inside of you is sometimes very helpful. \n\nYou know he line from Frozen \"conceal don't feel, don't let it show\"? Maybe showing yourself could be a first step. Something I've done in the past was to record myself talking about emotions and feelings and crying and everything in between. Watch (or just listen as the case may be) it back and just let yourself hear your own words. Maybe hearing them from someone else (sort of...) could help you understand it a little better.\n\nIf that doesn't work then you could always do what I do and distract yourself with advanced mathematics... *insert your eye roll here*", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes the best way to fight against sadness, anger, and distress is to not fight it at all. Feeling the emotions that wind inside of you is sometimes very helpful. &lt;/p&gt;\n\n&lt;p&gt;You know he line from Frozen &amp;quot;conceal don&amp;#39;t feel, don&amp;#39;t let it show&amp;quot;? Maybe showing yourself could be a first step. Something I&amp;#39;ve done in the past was to record myself talking about emotions and feelings and crying and everything in between. Watch (or just listen as the case may be) it back and just let yourself hear your own words. Maybe hearing them from someone else (sort of...) could help you understand it a little better.&lt;/p&gt;\n\n&lt;p&gt;If that doesn&amp;#39;t work then you could always do what I do and distract yourself with advanced mathematics... &lt;em&gt;insert your eye roll here&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ig35", "score_hidden": false, "name": "t1_ch7kzhy", "created": 1399044483.0, "author_flair_text": null, "created_utc": 1399015683.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7iwf6", "gilded": 0, "author": "Jazzematics", "parent_id": "t1_ch7glj3", "approved_by": null, "body": "I appreciate you replying to me. I don't think it was directly given to me by my parents, but I can't shake the attitude that if I need \"help\" that I am weak. That if I can't fix it myself, then that's my fault for not being strong or smart enough to do that. I think I know how you feel.\n\nThere were a few specific incidents, but nothing of major consequence. I've been irrationally depressive and prone to self loathing the past few days and I feel like I'm on a hairpin trigger, in spite of my attempts to fight it. Again, thanks for reading my post.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate you replying to me. I don&amp;#39;t think it was directly given to me by my parents, but I can&amp;#39;t shake the attitude that if I need &amp;quot;help&amp;quot; that I am weak. That if I can&amp;#39;t fix it myself, then that&amp;#39;s my fault for not being strong or smart enough to do that. I think I know how you feel.&lt;/p&gt;\n\n&lt;p&gt;There were a few specific incidents, but nothing of major consequence. I&amp;#39;ve been irrationally depressive and prone to self loathing the past few days and I feel like I&amp;#39;m on a hairpin trigger, in spite of my attempts to fight it. Again, thanks for reading my post.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ig35", "score_hidden": false, "name": "t1_ch7iwf6", "created": 1399036358.0, "author_flair_text": null, "created_utc": 1399007558.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7glj3", "gilded": 0, "author": "Nimtike", "parent_id": "t3_24ig35", "approved_by": null, "body": "Changing the way you think about things is difficult. I think the term is cognitive behavior therapy or something like that. The problem I find with depression is the almost comfort I feel when I feel awful. Maybe you haven't had to del with this but my parents are very passionate about the \"buck up\" mentality. Most of the time it doesn't work.\n\nIs there anything that sparked your sadness today that made you want to post here?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Changing the way you think about things is difficult. I think the term is cognitive behavior therapy or something like that. The problem I find with depression is the almost comfort I feel when I feel awful. Maybe you haven&amp;#39;t had to del with this but my parents are very passionate about the &amp;quot;buck up&amp;quot; mentality. Most of the time it doesn&amp;#39;t work.&lt;/p&gt;\n\n&lt;p&gt;Is there anything that sparked your sadness today that made you want to post here?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ig35", "score_hidden": false, "name": "t1_ch7glj3", "created": 1399030073.0, "author_flair_text": null, "created_utc": 1399001273.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]