[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was miserable a few months ago. Every day my brain told me to kill myself. Sometimes it &lt;em&gt;screamed&lt;/em&gt; at me to fucking do it.&lt;/p&gt;\n\n&lt;p&gt;But, for some stupid reason, I decided to try, once again, for the 100th time, to try to better myself. I started looking for a better job, I joined a gym, I started going out and making friends. For about a month, things were going well. Really well.&lt;/p&gt;\n\n&lt;p&gt;I was getting more hours at work so I was able to relax my job-hunt. I was having noticeable gains at the gym, I was starting to be proud of my body. I was meeting hotties and hooking up more than I ever had before.&lt;/p&gt;\n\n&lt;p&gt;... then the hours at work trickled away and away and away. The job hunt still hasn&amp;#39;t yielded anything. I can&amp;#39;t afford rent any more let alone groceries (I&amp;#39;m so fucking hungry). I spent the last four days bed-ridden and in the grips of fever-induced hallucinations (and as a result I missed my week&amp;#39;s worth of work hours). I had to quit the gym today because I can&amp;#39;t afford it. I&amp;#39;m going to have to cancel my phone soon.&lt;/p&gt;\n\n&lt;p&gt;I asked for advice on &lt;a href=\"/r/depression\"&gt;/r/depression&lt;/a&gt; and I was downvoted with no comments. I had a heart-related scare at the gym a few weeks back and I asked for advice on that on &lt;a href=\"/r/fitness\"&gt;/r/fitness&lt;/a&gt; and I was downvoted with no comments. I have no one I can talk to in real life.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t go to a doctor because there are no doctors near to where I live. I can&amp;#39;t afford to take the bus to one let alone a cab. Hospitals are not in walking distance.&lt;/p&gt;\n\n&lt;p&gt;I am &lt;strong&gt;stuck&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;So why do I keep trying and failing so hard at everything? What&amp;#39;s the point, honestly? Why is it that when others work hard/smart, they make gains and succeed and their lives get better - but my life always ends up worse than it was when I started? The lesson seems to be: Don&amp;#39;t try, just kill yourself.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m going to. I&amp;#39;m tired of trying and I literally have nothing left.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was miserable a few months ago. Every day my brain told me to kill myself. Sometimes it *screamed* at me to fucking do it.\n\nBut, for some stupid reason, I decided to try, once again, for the 100th time, to try to better myself. I started looking for a better job, I joined a gym, I started going out and making friends. For about a month, things were going well. Really well.\n\nI was getting more hours at work so I was able to relax my job-hunt. I was having noticeable gains at the gym, I was starting to be proud of my body. I was meeting hotties and hooking up more than I ever had before.\n\n... then the hours at work trickled away and away and away. The job hunt still hasn't yielded anything. I can't afford rent any more let alone groceries (I'm so fucking hungry). I spent the last four days bed-ridden and in the grips of fever-induced hallucinations (and as a result I missed my week's worth of work hours). I had to quit the gym today because I can't afford it. I'm going to have to cancel my phone soon.\n\nI asked for advice on /r/depression and I was downvoted with no comments. I had a heart-related scare at the gym a few weeks back and I asked for advice on that on /r/fitness and I was downvoted with no comments. I have no one I can talk to in real life.\n\nI can't go to a doctor because there are no doctors near to where I live. I can't afford to take the bus to one let alone a cab. Hospitals are not in walking distance.\n\nI am **stuck**.\n\nSo why do I keep trying and failing so hard at everything? What's the point, honestly? Why is it that when others work hard/smart, they make gains and succeed and their lives get better - but my life always ends up worse than it was when I started? The lesson seems to be: Don't try, just kill yourself.\n\nSo I'm going to. I'm tired of trying and I literally have nothing left.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24baln", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "monkey_sage", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24baln/all_the_progress_i_made_fuel_for_this_giant_slap/", "name": "t3_24baln", "created": 1398836655.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24baln/all_the_progress_i_made_fuel_for_this_giant_slap/", "author_flair_text": null, "title": "All the progress I made: Fuel for this giant slap in the face", "created_utc": 1398807855.0, "ups": 4, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5k0ca", "gilded": 0, "author": "themaccattack1983", "parent_id": "t1_ch5jl6n", "approved_by": null, "body": "I can't tell you any specific suggestions, as I don't know you individual situation, but if you read your own comment again, look at the way you are putting these barriers in your way. That's the depression talking, not the guy that made all of that progress. \n\nYou can still make amazing fitness progress without a gym - yes they boost your confidence and provide more motivation etc. but the key thing is you. If you really want to get in shape, you can do it anywhere, just as sucessfully. Check out P90X on youtube or the stuff on /r/fitness. If you can't afford a gym membership, then you don't give up on your goals, you adapt. If you really want it, you find a way.\n\nWhat I read from your comment, is you giving reasons to fail. Your job may be an issue, that I'm afraid I can offer little direct help with, but behind all of the self improvement issues you raise, the key is your mentality - your self image. The 'miracle' you're looking for won't happen in the way you want it to, it never does. There are always reasons and beginnings, after all you need to buy a scratch card to win one. \n\nThe hard work will be tough, it may feel worthless sometimes, but it is always worth doing, even if you don't make these goals right now. Expecting immediate results will never work, you have to be patient with yourself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t tell you any specific suggestions, as I don&amp;#39;t know you individual situation, but if you read your own comment again, look at the way you are putting these barriers in your way. That&amp;#39;s the depression talking, not the guy that made all of that progress. &lt;/p&gt;\n\n&lt;p&gt;You can still make amazing fitness progress without a gym - yes they boost your confidence and provide more motivation etc. but the key thing is you. If you really want to get in shape, you can do it anywhere, just as sucessfully. Check out P90X on youtube or the stuff on &lt;a href=\"/r/fitness\"&gt;/r/fitness&lt;/a&gt;. If you can&amp;#39;t afford a gym membership, then you don&amp;#39;t give up on your goals, you adapt. If you really want it, you find a way.&lt;/p&gt;\n\n&lt;p&gt;What I read from your comment, is you giving reasons to fail. Your job may be an issue, that I&amp;#39;m afraid I can offer little direct help with, but behind all of the self improvement issues you raise, the key is your mentality - your self image. The &amp;#39;miracle&amp;#39; you&amp;#39;re looking for won&amp;#39;t happen in the way you want it to, it never does. There are always reasons and beginnings, after all you need to buy a scratch card to win one. &lt;/p&gt;\n\n&lt;p&gt;The hard work will be tough, it may feel worthless sometimes, but it is always worth doing, even if you don&amp;#39;t make these goals right now. Expecting immediate results will never work, you have to be patient with yourself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5k0ca", "created": 1398822868.0, "author_flair_text": null, "created_utc": 1398819268.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5jl6n", "gilded": 0, "author": "monkey_sage", "parent_id": "t1_ch5hss1", "approved_by": null, "body": "The problem is that I can no longer work at one of the most important goals.\n\nThe gains I made while just doing bodyweight fitness at home in the course of a month were *nothing* compared to the gains I made at the gym in just a week. Now that I can see what a gym can do for me, anything else is just a waste of my time in my mind and I'll never go back to doing at-home fitness. The whole time I'll just feel like I'm a crazy person working hard to gain nothing.\n\nAll of this failure hinges on the fact that my job can't pay me enough to live on let alone give me a platform on which to seriously improve my life. And despite looking for something better, nothing has come up. There are jobs out there, yes, but they require me to have a car. I can't get a car without a good job, but I need a good job to get a car.\n\nSo unless something miraculous happens to break up this problematic Midgard Serpent, I'm going to be stuck in this until I either literally starve to death because I can't afford to feed myself or that miracle comes along solves a lynch-pin problem and, thus, freeing me to solve the others on my own.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is that I can no longer work at one of the most important goals.&lt;/p&gt;\n\n&lt;p&gt;The gains I made while just doing bodyweight fitness at home in the course of a month were &lt;em&gt;nothing&lt;/em&gt; compared to the gains I made at the gym in just a week. Now that I can see what a gym can do for me, anything else is just a waste of my time in my mind and I&amp;#39;ll never go back to doing at-home fitness. The whole time I&amp;#39;ll just feel like I&amp;#39;m a crazy person working hard to gain nothing.&lt;/p&gt;\n\n&lt;p&gt;All of this failure hinges on the fact that my job can&amp;#39;t pay me enough to live on let alone give me a platform on which to seriously improve my life. And despite looking for something better, nothing has come up. There are jobs out there, yes, but they require me to have a car. I can&amp;#39;t get a car without a good job, but I need a good job to get a car.&lt;/p&gt;\n\n&lt;p&gt;So unless something miraculous happens to break up this problematic Midgard Serpent, I&amp;#39;m going to be stuck in this until I either literally starve to death because I can&amp;#39;t afford to feed myself or that miracle comes along solves a lynch-pin problem and, thus, freeing me to solve the others on my own.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5jl6n", "created": 1398847208.0, "author_flair_text": null, "created_utc": 1398818408.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5hss1", "gilded": 0, "author": "themaccattack1983", "parent_id": "t1_ch5ha1k", "approved_by": null, "body": "\"I was really getting somewhere\"\n\nIt's great that you can see what you were achieving and you are proud of what you did. But you are not back in the gutter, you're moving forward. It may seem like you've gone backwards, but I see it like this: If you've ever played a video game and the end boss beat you, you'd try again and again. Each time you'd get faster and better at the rest of the level as you built up to the boss and leaned how to beat them. That's where you are, it may feel the same, but you're learning, you're getting better and faster each time and you can pick yourself up. If it happens again, you will get up twice as fast, you'll cope and rebuild. That's a corny example I know, but it's true in all aspects of life. \n\nYour efforts have been worth something, it was damn hard to start in the first place I bet, but you did it! Don't beat yourself up about this one slip, it happens. Just keep that rhythm, keep the other parts going. Do the push-ups, go jogging and remember how great you felt before. Strive for that change again.\n\nMy advice, would be to start sooner, just with a few push-ups. Don't dwell on it. Sitting and beating yourself up is like 100 push-ups for your depression, it'll get worse. Get out of it whilst you are able to recognise it for what it is. \n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I was really getting somewhere&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s great that you can see what you were achieving and you are proud of what you did. But you are not back in the gutter, you&amp;#39;re moving forward. It may seem like you&amp;#39;ve gone backwards, but I see it like this: If you&amp;#39;ve ever played a video game and the end boss beat you, you&amp;#39;d try again and again. Each time you&amp;#39;d get faster and better at the rest of the level as you built up to the boss and leaned how to beat them. That&amp;#39;s where you are, it may feel the same, but you&amp;#39;re learning, you&amp;#39;re getting better and faster each time and you can pick yourself up. If it happens again, you will get up twice as fast, you&amp;#39;ll cope and rebuild. That&amp;#39;s a corny example I know, but it&amp;#39;s true in all aspects of life. &lt;/p&gt;\n\n&lt;p&gt;Your efforts have been worth something, it was damn hard to start in the first place I bet, but you did it! Don&amp;#39;t beat yourself up about this one slip, it happens. Just keep that rhythm, keep the other parts going. Do the push-ups, go jogging and remember how great you felt before. Strive for that change again.&lt;/p&gt;\n\n&lt;p&gt;My advice, would be to start sooner, just with a few push-ups. Don&amp;#39;t dwell on it. Sitting and beating yourself up is like 100 push-ups for your depression, it&amp;#39;ll get worse. Get out of it whilst you are able to recognise it for what it is. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5hss1", "created": 1398843349.0, "author_flair_text": null, "created_utc": 1398814549.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5ha1k", "gilded": 0, "author": "monkey_sage", "parent_id": "t1_ch5gz7b", "approved_by": null, "body": "I had built a rhythm. I started out doing just 13 push-ups a day. After a few weeks I was doing over 100 a day. Then I joined the gym. I changed my eating habits. I was turning small victories into larger ones. Smaller goals were reached and they built on each other and became greater. I was really getting somewhere.\n\nAnd it's all just come apart and I don't feel like starting over. But you're right, this is a bump in the road. A looming, disappointing bump. I was feeling amazing that I was finally improving my life after a shitty year of suicidal thought dogging me. I thought I was finally going to get out of poverty, too.\n\n... and I'm right back in the gutter, as though none of my efforts meant anything at all. I suppose in a few days I'll be up to starting again. I hope I can find the motivation to do so.\n\nThank you for your kind words.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had built a rhythm. I started out doing just 13 push-ups a day. After a few weeks I was doing over 100 a day. Then I joined the gym. I changed my eating habits. I was turning small victories into larger ones. Smaller goals were reached and they built on each other and became greater. I was really getting somewhere.&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s all just come apart and I don&amp;#39;t feel like starting over. But you&amp;#39;re right, this is a bump in the road. A looming, disappointing bump. I was feeling amazing that I was finally improving my life after a shitty year of suicidal thought dogging me. I thought I was finally going to get out of poverty, too.&lt;/p&gt;\n\n&lt;p&gt;... and I&amp;#39;m right back in the gutter, as though none of my efforts meant anything at all. I suppose in a few days I&amp;#39;ll be up to starting again. I hope I can find the motivation to do so.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your kind words.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5ha1k", "created": 1398842242.0, "author_flair_text": null, "created_utc": 1398813442.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5gz7b", "gilded": 0, "author": "themaccattack1983", "parent_id": "t3_24baln", "approved_by": null, "body": "It sounds to me like you've hit the very first barrier of your new pathway. You've made the decision and you've tried. It's OK to be scared, angry, disheartened. It's OK to worry and question it all. If you go and read /r/fitness and /r/depression you will see people constantly hitting such barriers. They question their determination, their energy and their worth. But these communities exist to encourage others to keep going (and so I'm sorry that they have failed you this time), to get up the next day and forgive themselves for skipping that last day at the gym, for beating themselves up mentally. If I were you, I'd go a bit easier of yourself. We all set unreachable goals at such times in our life, personally I do it every night before I fall asleep - \"I'll do this tomorrow; I'll do that\" etc. But I rarely do. The important thing that I take from it, is to just achieve something from that list and take the small victory. That way I prevent myself from the spiral of misery and depression that comes from beating yourself up, because it only makes things worse. Don't try to conquer the world tomorrow, just be you. \n\nIt sounds like you're going through a tough time, which I'm sorry to hear, but please don't see it as something that you cannot conquer. Each of these days is just like that extra rep at the gym - you keep pushing one more, one more, one more! Each day is another rep, and each time you get better. You'll build a rhythm, something that you were well on your way towards - you can do it again. \n\nBut trust me, you're not failing, you're doing it. You're wanting to improve, to grow, to move forward. You have begun to get yourself into a good place, but it is really hard. I know I've littered this comment with cliches, so forgive me for that, but what I'm trying to say is that you are winning, you've just hit a bump in the road. It may not seem it, but you're building that state of mind that you want, you're weeding out the negativity. Keep going, cut yourself some slack every so often and realise that it won't change overnight, maybe not even in a month. It may even get worse first, but you will get there. Just remember what you've already achieved:\n\n\"I was getting more hours at work so I was able to relax my job-hunt. I was having noticeable gains at the gym, I was starting to be proud of my body. I was meeting hotties and hooking up more than I ever had before.\"\n\nGood luck my friend! Take care", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like you&amp;#39;ve hit the very first barrier of your new pathway. You&amp;#39;ve made the decision and you&amp;#39;ve tried. It&amp;#39;s OK to be scared, angry, disheartened. It&amp;#39;s OK to worry and question it all. If you go and read &lt;a href=\"/r/fitness\"&gt;/r/fitness&lt;/a&gt; and &lt;a href=\"/r/depression\"&gt;/r/depression&lt;/a&gt; you will see people constantly hitting such barriers. They question their determination, their energy and their worth. But these communities exist to encourage others to keep going (and so I&amp;#39;m sorry that they have failed you this time), to get up the next day and forgive themselves for skipping that last day at the gym, for beating themselves up mentally. If I were you, I&amp;#39;d go a bit easier of yourself. We all set unreachable goals at such times in our life, personally I do it every night before I fall asleep - &amp;quot;I&amp;#39;ll do this tomorrow; I&amp;#39;ll do that&amp;quot; etc. But I rarely do. The important thing that I take from it, is to just achieve something from that list and take the small victory. That way I prevent myself from the spiral of misery and depression that comes from beating yourself up, because it only makes things worse. Don&amp;#39;t try to conquer the world tomorrow, just be you. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re going through a tough time, which I&amp;#39;m sorry to hear, but please don&amp;#39;t see it as something that you cannot conquer. Each of these days is just like that extra rep at the gym - you keep pushing one more, one more, one more! Each day is another rep, and each time you get better. You&amp;#39;ll build a rhythm, something that you were well on your way towards - you can do it again. &lt;/p&gt;\n\n&lt;p&gt;But trust me, you&amp;#39;re not failing, you&amp;#39;re doing it. You&amp;#39;re wanting to improve, to grow, to move forward. You have begun to get yourself into a good place, but it is really hard. I know I&amp;#39;ve littered this comment with cliches, so forgive me for that, but what I&amp;#39;m trying to say is that you are winning, you&amp;#39;ve just hit a bump in the road. It may not seem it, but you&amp;#39;re building that state of mind that you want, you&amp;#39;re weeding out the negativity. Keep going, cut yourself some slack every so often and realise that it won&amp;#39;t change overnight, maybe not even in a month. It may even get worse first, but you will get there. Just remember what you&amp;#39;ve already achieved:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was getting more hours at work so I was able to relax my job-hunt. I was having noticeable gains at the gym, I was starting to be proud of my body. I was meeting hotties and hooking up more than I ever had before.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Good luck my friend! Take care&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5gz7b", "created": 1398841606.0, "author_flair_text": null, "created_utc": 1398812806.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5heoe", "gilded": 0, "author": "monkey_sage", "parent_id": "t1_ch5h1t8", "approved_by": null, "body": "&gt; I'm sure you had better times\n\nNot since I was about 11 years old, no. It's just been a constant struggle and I haven't really gotten anywhere. I'm tired.\n\n&gt; I hope you have some \"real\" people near you that are able to help you\n\nI don't.\n\nYou're right that success doesn't come from effort alone. There really is an element of luck involved. I can't really see it at play in my life (probably because of the way I feel). I guess the thing I need to do is just to be patient because these feelings won't last forever and then I can start all over again. I just kind of feel like an idiot starting over again from the beginning. Who has to keep trying to re-starting their life over and over again for 21 years? This can't be normal. I'm so tired of trying and failing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sure you had better times&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not since I was about 11 years old, no. It&amp;#39;s just been a constant struggle and I haven&amp;#39;t really gotten anywhere. I&amp;#39;m tired.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I hope you have some &amp;quot;real&amp;quot; people near you that are able to help you&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right that success doesn&amp;#39;t come from effort alone. There really is an element of luck involved. I can&amp;#39;t really see it at play in my life (probably because of the way I feel). I guess the thing I need to do is just to be patient because these feelings won&amp;#39;t last forever and then I can start all over again. I just kind of feel like an idiot starting over again from the beginning. Who has to keep trying to re-starting their life over and over again for 21 years? This can&amp;#39;t be normal. I&amp;#39;m so tired of trying and failing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5heoe", "created": 1398817312.0, "author_flair_text": null, "created_utc": 1398813712.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5h1t8", "gilded": 0, "author": "mindcrawlerx", "parent_id": "t3_24baln", "approved_by": null, "body": "I'm sorry for your current situation. In life we have to face so many problems. Some come and go, some seem to last forever. And it appears as though only few of them will be solved.\nBeing thrown out of the \"comfort zone\" and the refutation of our expectations about life is a frightening and unsettling experience.\nI'm sure you had better times...I suggest to think about the many coincidences that caused your life in this moment. What I'm trying to say is that effort does not automatically come along with success, there are so many random happenings which our being derives from. On the other hand we make so much achievements day by day without even really noticing it. With a bad mood in the morning it's already a performance to get out of bed early. It may not be enough for a living but I think it's very important to focus on these things to have something to start with. We never start by the performance of zero even if it feels so. And even if we fail in one term there really always is a possible (most likely unpleasing) reaction which will make us \"survive\" to the next day.\nI'm sure there will be more comfortable days in your future. Just look at people who are older than you and you will notice that most of those people - who are like you and me to average by the way - also succeeded at some point in life to be proud of.\nI think it's a good point to decide to make the best of the day one day at a time. You really just have to decide for one single day, which is ingenious thing.\nI can't give you more support through the internet (which is great for talking) so I hope you have some \"real\" people near you that are able to help you \"physically\" to get you through your time instead of just talk about it.\nYeah, life sucks very often, but please keep in mind that death is no solution. I know people suffering from depression for virtually their whole life but it is really worth facing it but we only notice when we leave a hard time behind us.\nBest regards from Germany (and sorry for my language style)!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry for your current situation. In life we have to face so many problems. Some come and go, some seem to last forever. And it appears as though only few of them will be solved.\nBeing thrown out of the &amp;quot;comfort zone&amp;quot; and the refutation of our expectations about life is a frightening and unsettling experience.\nI&amp;#39;m sure you had better times...I suggest to think about the many coincidences that caused your life in this moment. What I&amp;#39;m trying to say is that effort does not automatically come along with success, there are so many random happenings which our being derives from. On the other hand we make so much achievements day by day without even really noticing it. With a bad mood in the morning it&amp;#39;s already a performance to get out of bed early. It may not be enough for a living but I think it&amp;#39;s very important to focus on these things to have something to start with. We never start by the performance of zero even if it feels so. And even if we fail in one term there really always is a possible (most likely unpleasing) reaction which will make us &amp;quot;survive&amp;quot; to the next day.\nI&amp;#39;m sure there will be more comfortable days in your future. Just look at people who are older than you and you will notice that most of those people - who are like you and me to average by the way - also succeeded at some point in life to be proud of.\nI think it&amp;#39;s a good point to decide to make the best of the day one day at a time. You really just have to decide for one single day, which is ingenious thing.\nI can&amp;#39;t give you more support through the internet (which is great for talking) so I hope you have some &amp;quot;real&amp;quot; people near you that are able to help you &amp;quot;physically&amp;quot; to get you through your time instead of just talk about it.\nYeah, life sucks very often, but please keep in mind that death is no solution. I know people suffering from depression for virtually their whole life but it is really worth facing it but we only notice when we leave a hard time behind us.\nBest regards from Germany (and sorry for my language style)!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24baln", "score_hidden": false, "name": "t1_ch5h1t8", "created": 1398816561.0, "author_flair_text": null, "created_utc": 1398812961.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]