[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve felt suicidal for most of my life since I was about 11 years old. These past five months have been especially terrible, and this week especially. Today&amp;#39;s the day I want to die, but I don&amp;#39;t know if I &lt;em&gt;really&lt;/em&gt; want to die. I&amp;#39;m mostly just afraid of the pain of suicide. If there was a totally pain-free way to do it, I&amp;#39;d be all over that. But I&amp;#39;m seriously wondering about going through with something tonight.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a college student who lives at home with my parents. I&amp;#39;m currently seeing a therapist, who is helpful but not helpful enough to not make me want to be suicidal. I haven&amp;#39;t told her that I have suicidal thoughts.&lt;/p&gt;\n\n&lt;p&gt;What are my alternatives to actually committing suicide? I just really want an escape from my life and all the people in it, and I&amp;#39;ve wanted this for 8 or 9 years now. I want an escape from just having to live.&lt;/p&gt;\n\n&lt;p&gt;No one knows about my suicidal thoughts, no one even knows I&amp;#39;m depressed or anxious besides my therapist. My parents treat me like crap because they think I&amp;#39;m just being lazy and down all the time just for fun. They wouldn&amp;#39;t understand if I was depressed or anxious because they don&amp;#39;t believe in mental illness, and would just tell me to think positive.&lt;/p&gt;\n\n&lt;p&gt;Is there not anything else I can do? If I want to be hospitalized for a few days, would that be a good idea? How would I do that... would I just have to tell my therapist I&amp;#39;m feeling suicidal? Would it cost my parents a ton of money if I were to do that? I think they&amp;#39;d get mad at me both for the cost and for the fact that I was suicidal at all to begin with.&lt;/p&gt;\n\n&lt;p&gt;What do I do, r/suicidewatch? Help me. I can&amp;#39;t stand this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've felt suicidal for most of my life since I was about 11 years old. These past five months have been especially terrible, and this week especially. Today's the day I want to die, but I don't know if I *really* want to die. I'm mostly just afraid of the pain of suicide. If there was a totally pain-free way to do it, I'd be all over that. But I'm seriously wondering about going through with something tonight.\n\nI'm a college student who lives at home with my parents. I'm currently seeing a therapist, who is helpful but not helpful enough to not make me want to be suicidal. I haven't told her that I have suicidal thoughts.\n\nWhat are my alternatives to actually committing suicide? I just really want an escape from my life and all the people in it, and I've wanted this for 8 or 9 years now. I want an escape from just having to live.\n\nNo one knows about my suicidal thoughts, no one even knows I'm depressed or anxious besides my therapist. My parents treat me like crap because they think I'm just being lazy and down all the time just for fun. They wouldn't understand if I was depressed or anxious because they don't believe in mental illness, and would just tell me to think positive.\n\nIs there not anything else I can do? If I want to be hospitalized for a few days, would that be a good idea? How would I do that... would I just have to tell my therapist I'm feeling suicidal? Would it cost my parents a ton of money if I were to do that? I think they'd get mad at me both for the cost and for the fact that I was suicidal at all to begin with.\n\nWhat do I do, r/suicidewatch? Help me. I can't stand this.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zh6s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "swthrowaway120", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zh6s/alternatives/", "name": "t3_24zh6s", "created": 1399525906.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zh6s/alternatives/", "author_flair_text": null, "title": "Alternatives?", "created_utc": 1399497106.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc8l90", "gilded": 0, "author": "DrNordicus", "parent_id": "t1_chc857d", "approved_by": null, "body": "If you tell her that you don't think an email would be suitable, she would see to it that she would contact them through other means, although I imagine she would talk to them in person if at all possible. Therapists are trained to inform people of genuine conditions as well as treat them, after all they sometimes are directed to clients who themselves do not believe in depression!\n\nYou say that your dad gets enraged by \"things like this\", but from an outsider's point of view, I can't really imagine another situation quite like this. I really doubt that if they were told that you needed support they would throw you out. Parents just don't act like that in real life. They love you, and this definitely sounds like an instance of them not fully understanding depression. I have never been in the same situation as you as I was lucky enough to have parents who understood what I was going through without it needing to be explained to them, but once your parents do understand, they will be understanding.\n\nI hope what I've said here helps, but unfortunately, I live in the U.K. and it's really rather late for us. I will be around in my morning, but for now I need to head to sleep. Just remember that asking your therapist to talk to your parents is often an easier way to get them to understand.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you tell her that you don&amp;#39;t think an email would be suitable, she would see to it that she would contact them through other means, although I imagine she would talk to them in person if at all possible. Therapists are trained to inform people of genuine conditions as well as treat them, after all they sometimes are directed to clients who themselves do not believe in depression!&lt;/p&gt;\n\n&lt;p&gt;You say that your dad gets enraged by &amp;quot;things like this&amp;quot;, but from an outsider&amp;#39;s point of view, I can&amp;#39;t really imagine another situation quite like this. I really doubt that if they were told that you needed support they would throw you out. Parents just don&amp;#39;t act like that in real life. They love you, and this definitely sounds like an instance of them not fully understanding depression. I have never been in the same situation as you as I was lucky enough to have parents who understood what I was going through without it needing to be explained to them, but once your parents do understand, they will be understanding.&lt;/p&gt;\n\n&lt;p&gt;I hope what I&amp;#39;ve said here helps, but unfortunately, I live in the U.K. and it&amp;#39;s really rather late for us. I will be around in my morning, but for now I need to head to sleep. Just remember that asking your therapist to talk to your parents is often an easier way to get them to understand.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chc8l90", "created": 1399531630.0, "author_flair_text": null, "created_utc": 1399502830.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcj48f", "gilded": 0, "author": "Sashaa911", "parent_id": "t1_chcj15a", "approved_by": null, "body": "no (well depending but there is usually a copay), but it will cover a large chunk of it.  And even if you stay for a while, they have a limit of what you would have to pay out of pocket.  Most hospitals will work with you on payment too.  Used to work at one- they kinda expect that most their patients won't be able to pay because a lot of severely mentally ill are homeless- most people in the psych hospital don't have jobs.  That's why a lot of them get funds from the government.  You could also lie and say you have no insurance and try to get the medi-care thing but your therapist probably already is taking your insurance so you probably can't.  And even so, if it gets you on the track you need to be isn't a few hundred worth it?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no (well depending but there is usually a copay), but it will cover a large chunk of it.  And even if you stay for a while, they have a limit of what you would have to pay out of pocket.  Most hospitals will work with you on payment too.  Used to work at one- they kinda expect that most their patients won&amp;#39;t be able to pay because a lot of severely mentally ill are homeless- most people in the psych hospital don&amp;#39;t have jobs.  That&amp;#39;s why a lot of them get funds from the government.  You could also lie and say you have no insurance and try to get the medi-care thing but your therapist probably already is taking your insurance so you probably can&amp;#39;t.  And even so, if it gets you on the track you need to be isn&amp;#39;t a few hundred worth it?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chcj48f", "created": 1399557943.0, "author_flair_text": null, "created_utc": 1399529143.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcj15a", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_chciysf", "approved_by": null, "body": "I'm financially dependent on my parents and am on their insurance plan. I hate to sound stupid but I'm not really too sure how insurance works. Would insurance cover the hospitalization completely?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m financially dependent on my parents and am on their insurance plan. I hate to sound stupid but I&amp;#39;m not really too sure how insurance works. Would insurance cover the hospitalization completely?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chcj15a", "created": 1399557611.0, "author_flair_text": null, "created_utc": 1399528811.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chciysf", "gilded": 0, "author": "Sashaa911", "parent_id": "t1_chc857d", "approved_by": null, "body": "Also if you live in the US and you don't have income (and over 18) a lot of times they will do alternative payment, or do a short term Medi-care thing.  If you have insurance, and you tell your therapist you are suicidal, they cannot refuse to cover it as it is a medical emergency.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also if you live in the US and you don&amp;#39;t have income (and over 18) a lot of times they will do alternative payment, or do a short term Medi-care thing.  If you have insurance, and you tell your therapist you are suicidal, they cannot refuse to cover it as it is a medical emergency.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chciysf", "created": 1399557363.0, "author_flair_text": null, "created_utc": 1399528563.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chc857d", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_chc75hl", "approved_by": null, "body": "This reply was very helpful, thank you.\n\nI get what you're saying! How do you think my therapist would talk to my parents about it? Do you think she'd write an email? I'm really worried because my dad especially has the tendency to get enraged about things like this, and could end up kicking me out of the house. I have no money of my own, and can't get a job because of the very issue that is making me suicidal. I don't have friends or anyone else, either. I'd literally be on the streets.\n\nAnother thing is my mom is kind of depressed already so my family cares more about helping her out (even though they don't call it \"depression\"). She's going through an injury, so they think she has a legitimate reason to be feeling down, but if I told them I was just sad for no reason they wouldn't take it seriously and would tell me to suck it up or deal with getting kicked out of the house, because other people have worse problems and they think I don't have anything going wrong in my life.\n\nWhat do you think, considering this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This reply was very helpful, thank you.&lt;/p&gt;\n\n&lt;p&gt;I get what you&amp;#39;re saying! How do you think my therapist would talk to my parents about it? Do you think she&amp;#39;d write an email? I&amp;#39;m really worried because my dad especially has the tendency to get enraged about things like this, and could end up kicking me out of the house. I have no money of my own, and can&amp;#39;t get a job because of the very issue that is making me suicidal. I don&amp;#39;t have friends or anyone else, either. I&amp;#39;d literally be on the streets.&lt;/p&gt;\n\n&lt;p&gt;Another thing is my mom is kind of depressed already so my family cares more about helping her out (even though they don&amp;#39;t call it &amp;quot;depression&amp;quot;). She&amp;#39;s going through an injury, so they think she has a legitimate reason to be feeling down, but if I told them I was just sad for no reason they wouldn&amp;#39;t take it seriously and would tell me to suck it up or deal with getting kicked out of the house, because other people have worse problems and they think I don&amp;#39;t have anything going wrong in my life.&lt;/p&gt;\n\n&lt;p&gt;What do you think, considering this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chc857d", "created": 1399530650.0, "author_flair_text": null, "created_utc": 1399501850.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chc75hl", "gilded": 0, "author": "DrNordicus", "parent_id": "t3_24zh6s", "approved_by": null, "body": "I'm going to go out on a limb here and say, I don't think your parents would be angry at you for having suicidal thoughts. If they don't believe in mental illness, then the probably don't think you're capable of suicidal thoughts. I suggest you give your therapist the permission to talk to your parents about what's going on. There is a large disconnect between what people know, and what is actually the case with depression and anxiety, and the disconnect can be reduced by being talked to by a professional.\n\nSo yes, I am recommending that your therapist talks to your parents, because if they at least partially understand what's going on, then that will be at least 1 problem out of the way. It might not seem like much from this side of it happening, but trust me that it will help. I don't know how you could hospitalise yourself, but I would wait for your therapist to talk to your parents before doing anything.\n\nGood luck with everything, we're here.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to go out on a limb here and say, I don&amp;#39;t think your parents would be angry at you for having suicidal thoughts. If they don&amp;#39;t believe in mental illness, then the probably don&amp;#39;t think you&amp;#39;re capable of suicidal thoughts. I suggest you give your therapist the permission to talk to your parents about what&amp;#39;s going on. There is a large disconnect between what people know, and what is actually the case with depression and anxiety, and the disconnect can be reduced by being talked to by a professional.&lt;/p&gt;\n\n&lt;p&gt;So yes, I am recommending that your therapist talks to your parents, because if they at least partially understand what&amp;#39;s going on, then that will be at least 1 problem out of the way. It might not seem like much from this side of it happening, but trust me that it will help. I don&amp;#39;t know how you could hospitalise yourself, but I would wait for your therapist to talk to your parents before doing anything.&lt;/p&gt;\n\n&lt;p&gt;Good luck with everything, we&amp;#39;re here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zh6s", "score_hidden": false, "name": "t1_chc75hl", "created": 1399528489.0, "author_flair_text": null, "created_utc": 1399499689.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]