[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I started visiting &lt;a href=\"/r/suicidewatch\"&gt;/r/suicidewatch&lt;/a&gt; a good while after my own suicidal tendencies submerged themselves. I never needed the help of all of the good people here, nor do I think it would&amp;#39;ve helped me. However, I came here so that I might be able to provide a little bit of help. \nYet, I run upon a problem, whenever I see any of the threads. Because a lot of the questions ends up in a question along the lines of &amp;#39;Why is it unfair/selfish of me to take my own life, isn&amp;#39;t it my life?&amp;#39;, and that was a question I battled with myself. It&amp;#39;s a piece of logic I never could get around, and when I interact with people with these thoughts, either here or in my life, I don&amp;#39;t know what to tell them. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even tell them anything good from the point of view of someone who survived and was happy about it, because my own experience comes down to &amp;#39;well, my life is relatively not shit right now, but might become shit again later.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;Okay, this was a bit of a ramble, and I apologise if I shouldn&amp;#39;t have asked this here, but my question comes down to this: What can I possibly say, when I actually agree with people that they most definitely should not feel like they are betraying others for wanting to end what they (often rightly) perceive as misery?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I started visiting /r/suicidewatch a good while after my own suicidal tendencies submerged themselves. I never needed the help of all of the good people here, nor do I think it would've helped me. However, I came here so that I might be able to provide a little bit of help. \nYet, I run upon a problem, whenever I see any of the threads. Because a lot of the questions ends up in a question along the lines of 'Why is it unfair/selfish of me to take my own life, isn't it my life?', and that was a question I battled with myself. It's a piece of logic I never could get around, and when I interact with people with these thoughts, either here or in my life, I don't know what to tell them. \n\nI can't even tell them anything good from the point of view of someone who survived and was happy about it, because my own experience comes down to 'well, my life is relatively not shit right now, but might become shit again later.'\n\nOkay, this was a bit of a ramble, and I apologise if I shouldn't have asked this here, but my question comes down to this: What can I possibly say, when I actually agree with people that they most definitely should not feel like they are betraying others for wanting to end what they (often rightly) perceive as misery?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249u0d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "StrangeworldEU", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249u0d/an_honest_questions_to_others_out_there/", "name": "t3_249u0d", "created": 1398805092.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249u0d/an_honest_questions_to_others_out_there/", "author_flair_text": null, "title": "An honest questions to others out there.", "created_utc": 1398776292.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5fssx", "gilded": 0, "author": "esther_mouse", "parent_id": "t3_249u0d", "approved_by": null, "body": "You're operating on the assumption that \"suicide is selfish\" is an accepted response to suicidal people: it is not! It is never, ever a good response, and shouldn't ever be used. Guilt-tripping suicidal people usually makes things worse. People who try to use this to convince people not to kill themselves are usually just demonstrating their own ignorance; check out some of the resources in the sidebar of this subreddit or have a look at some mental health communities or some information pages on mental health (respectable ones - NHS, Samaritans, mind.org.uk, etc), and you'll find that people who have a good understanding of mental health difficulties are NOT the same people saying \"suicide is selfish\".\n\nIt's an ignorant viewpoint, it isn't an OK thing to say to someone (it's not allowed in this subreddit, in fact - it falls under the \"tough love is not allowed\" guideline, so do feel free to report comments saying \"suicide is selfish\" and let the mods sort it out if you want).\n\nBasically, the fact that you don't accept that this is a reasonable response is a good thing; it shows you can empathise with some of the people here regarding that, and sometimes that's a big help to people - it's a relief to know that other people are \"on your side\", sometimes. You don't have to think that suicide is a good option, but understanding the mentality behind it is really helpful if you want to connect to the suicidal person.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re operating on the assumption that &amp;quot;suicide is selfish&amp;quot; is an accepted response to suicidal people: it is not! It is never, ever a good response, and shouldn&amp;#39;t ever be used. Guilt-tripping suicidal people usually makes things worse. People who try to use this to convince people not to kill themselves are usually just demonstrating their own ignorance; check out some of the resources in the sidebar of this subreddit or have a look at some mental health communities or some information pages on mental health (respectable ones - NHS, Samaritans, mind.org.uk, etc), and you&amp;#39;ll find that people who have a good understanding of mental health difficulties are NOT the same people saying &amp;quot;suicide is selfish&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an ignorant viewpoint, it isn&amp;#39;t an OK thing to say to someone (it&amp;#39;s not allowed in this subreddit, in fact - it falls under the &amp;quot;tough love is not allowed&amp;quot; guideline, so do feel free to report comments saying &amp;quot;suicide is selfish&amp;quot; and let the mods sort it out if you want).&lt;/p&gt;\n\n&lt;p&gt;Basically, the fact that you don&amp;#39;t accept that this is a reasonable response is a good thing; it shows you can empathise with some of the people here regarding that, and sometimes that&amp;#39;s a big help to people - it&amp;#39;s a relief to know that other people are &amp;quot;on your side&amp;quot;, sometimes. You don&amp;#39;t have to think that suicide is a good option, but understanding the mentality behind it is really helpful if you want to connect to the suicidal person.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249u0d", "score_hidden": false, "name": "t1_ch5fssx", "created": 1398839114.0, "author_flair_text": null, "created_utc": 1398810314.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]