[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had been dealing with untreated anxiety since a I was a young boy.  My parents both wrote it off as nothing  because they didn&amp;#39;t know any better.  My junior year in college this anxiety led me to withdraw socially-- at which point I sought out professional help.  Eventually something clicked in my head and I no longer worried about things, instead I stopped seeing a point in anything.  The worst feelings ever took over.  Ever since I&amp;#39;ve been struggling with depression.  I&amp;#39;m on medication and go to therapy (though the few who know these things think it&amp;#39;s for anxiety).  My depression is a secret buried underneath smiles and workaholism.  I don&amp;#39;t want people to see me as having something they might view a weakness or just plainly wouldn&amp;#39;t understand.  In turn, I am alone.  In my mind, everyday is a struggle to find reason to keep moving, but somehow I do.  It&amp;#39;s like exercising a muscle that never gets any stronger.  It&amp;#39;s hard as hell and it&amp;#39;d feel so good to end it all, but I hang on for the people who care about me and they have no idea...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I had been dealing with untreated anxiety since a I was a young boy.  My parents both wrote it off as nothing  because they didn't know any better.  My junior year in college this anxiety led me to withdraw socially-- at which point I sought out professional help.  Eventually something clicked in my head and I no longer worried about things, instead I stopped seeing a point in anything.  The worst feelings ever took over.  Ever since I've been struggling with depression.  I'm on medication and go to therapy (though the few who know these things think it's for anxiety).  My depression is a secret buried underneath smiles and workaholism.  I don't want people to see me as having something they might view a weakness or just plainly wouldn't understand.  In turn, I am alone.  In my mind, everyday is a struggle to find reason to keep moving, but somehow I do.  It's like exercising a muscle that never gets any stronger.  It's hard as hell and it'd feel so good to end it all, but I hang on for the people who care about me and they have no idea...", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2502m4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "blipdipidy", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2502m4/an_unsung_hero/", "name": "t3_2502m4", "created": 1399539290.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2502m4/an_unsung_hero/", "author_flair_text": null, "title": "an unsung hero", "created_utc": 1399510490.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chccckc", "gilded": 0, "author": "Vietcrab", "parent_id": "t3_2502m4", "approved_by": null, "body": "Enough of this rings true to parts of my life and you might not believe me but coming out with it to my parents was one of the first steps on my slow road to some sort of recovery. It got to the point for me that I went to my local doctor out of desperation and not knowing what else to do. This actually helped with driving home to my parents that it was a serious problem and worked for me, hopefully that sounds like a possible course of action for you. Either way, I'm here if you want to chat about anything.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Enough of this rings true to parts of my life and you might not believe me but coming out with it to my parents was one of the first steps on my slow road to some sort of recovery. It got to the point for me that I went to my local doctor out of desperation and not knowing what else to do. This actually helped with driving home to my parents that it was a serious problem and worked for me, hopefully that sounds like a possible course of action for you. Either way, I&amp;#39;m here if you want to chat about anything.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2502m4", "score_hidden": false, "name": "t1_chccckc", "created": 1399540211.0, "author_flair_text": null, "created_utc": 1399511411.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chccftb", "gilded": 0, "author": "mwommack88", "parent_id": "t3_2502m4", "approved_by": null, "body": "Maybe you should tell them how you feel . I recently opened up to my brother because I was in a very similar situation. I was honestly afraid of how he would react, because I've never told anyone how I really felt. He was very understanding and has become one of the most supportive people in my life. Just saying, maybe you should tell them. Everyone wants to be important to someone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you should tell them how you feel . I recently opened up to my brother because I was in a very similar situation. I was honestly afraid of how he would react, because I&amp;#39;ve never told anyone how I really felt. He was very understanding and has become one of the most supportive people in my life. Just saying, maybe you should tell them. Everyone wants to be important to someone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2502m4", "score_hidden": false, "name": "t1_chccftb", "created": 1399540415.0, "author_flair_text": null, "created_utc": 1399511615.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcpbyf", "gilded": 0, "author": "blipdipidy", "parent_id": "t1_chchdec", "approved_by": null, "body": "Yeah, I thought so too... but beerhighfive guy just isn't sustainable.   I drank a lot in high-school and college.  Fortunately, I'm well above average intelligence and could maintain such a lifestyle without completely screwing up my life.  I did however, confront and acknowledge having a substance abuse problem more than once and went through pretty drastic steps to correct myself (which I do not regret).  However, I can't seem to shake a dependency...  now I smoke weed to get fucked up and while I don't have the physical repercussions (hangover, etc) I still find it taking its toll.\n\nI think you are right about being around people, though.  I wish I had put more time into building friendships and relationships as well as sustaining them.  I just didn't think it was a worthwhile investment at the time.   You'll find once you get out of school and working a job it's a lot harder to meet new people and make new friends-- for so many reasons.\n\nI'd encourage you to stay away from drinking and other drugs as long as you can.  In my experience, they've always seemed like a short-term fix but really complicate things in the long-run.  Your brain is still developing a whole bunch and you don't want it to develop around these substances, trust me.   You'll thank me in 10 years.\n\nAnyways, thanks for your post.  There are certainly parallels in our lives.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I thought so too... but beerhighfive guy just isn&amp;#39;t sustainable.   I drank a lot in high-school and college.  Fortunately, I&amp;#39;m well above average intelligence and could maintain such a lifestyle without completely screwing up my life.  I did however, confront and acknowledge having a substance abuse problem more than once and went through pretty drastic steps to correct myself (which I do not regret).  However, I can&amp;#39;t seem to shake a dependency...  now I smoke weed to get fucked up and while I don&amp;#39;t have the physical repercussions (hangover, etc) I still find it taking its toll.&lt;/p&gt;\n\n&lt;p&gt;I think you are right about being around people, though.  I wish I had put more time into building friendships and relationships as well as sustaining them.  I just didn&amp;#39;t think it was a worthwhile investment at the time.   You&amp;#39;ll find once you get out of school and working a job it&amp;#39;s a lot harder to meet new people and make new friends-- for so many reasons.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d encourage you to stay away from drinking and other drugs as long as you can.  In my experience, they&amp;#39;ve always seemed like a short-term fix but really complicate things in the long-run.  Your brain is still developing a whole bunch and you don&amp;#39;t want it to develop around these substances, trust me.   You&amp;#39;ll thank me in 10 years.&lt;/p&gt;\n\n&lt;p&gt;Anyways, thanks for your post.  There are certainly parallels in our lives.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2502m4", "score_hidden": false, "name": "t1_chcpbyf", "created": 1399586586.0, "author_flair_text": null, "created_utc": 1399557786.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chchdec", "gilded": 0, "author": "MattColt", "parent_id": "t3_2502m4", "approved_by": null, "body": "I'm a sophomore in high school right now and I think I might be you from the past. I have high anxiety, but I go to therapy every Monday and all my parents want to talk about is arguments instead of how I keep rubbing my hands together and I only got eight hours of sleep last week. Another thing I can identify with is you not telling anyone about the depression, I don't think that is a bad thing if you are talking with a therapist, but when you are feeling down, just try be with someone. Pretending to be happy even though I want to die while i'm sending funny pictures to a friend on facebook actually helps me. Once and a while you just need to step back and realize that this is not you, you like to say things and drink beer and high five people. You aren't the guy laying on his bed and thinking about all those things you could have done better, that's your depression. That guy is your enemy, beerhighfiveguy is your friend. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a sophomore in high school right now and I think I might be you from the past. I have high anxiety, but I go to therapy every Monday and all my parents want to talk about is arguments instead of how I keep rubbing my hands together and I only got eight hours of sleep last week. Another thing I can identify with is you not telling anyone about the depression, I don&amp;#39;t think that is a bad thing if you are talking with a therapist, but when you are feeling down, just try be with someone. Pretending to be happy even though I want to die while i&amp;#39;m sending funny pictures to a friend on facebook actually helps me. Once and a while you just need to step back and realize that this is not you, you like to say things and drink beer and high five people. You aren&amp;#39;t the guy laying on his bed and thinking about all those things you could have done better, that&amp;#39;s your depression. That guy is your enemy, beerhighfiveguy is your friend. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2502m4", "score_hidden": false, "name": "t1_chchdec", "created": 1399552201.0, "author_flair_text": null, "created_utc": 1399523401.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]