[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been seeing this girl for four months. She&amp;#39;s helped me through so much shit in my life. I recently lost my apartment to a room mate who wasnt paying rent and got us evicted. She also wrote off my vehicle. Forcing me to move home. I started drinking heavily and abusing oxys. She helped me get my life back on track, loving me unconditionally and always being there. She recently became distant as my younger brother was coming back in town for a week. He works on the road 75% of the year. I knew my girlfriend talked to him and I assumed it was friendly as she is close with my family. When she backed away when he came home I knew something was up. He told me she had been sending him nude photos, I confronted her and she told me my brother was telling her to wait for him to come home, and leave me because I&amp;#39;m a failure etc. Her and I spoke and she assured me that while she did have feelings for my brother she loved me. The next day he left his iPhone out and I read some messages from her sent that day saying she fell for him the moment she saw him, wished she was there to cuddle and kiss him. I confronted her and she just said we weren&amp;#39;t together and she can&amp;#39;t help how she feels and I&amp;#39;ve been so horrible and I&amp;#39;m a failure and etc. I told my brother I want nothing to do with him. I miss her. I miss her so much. But she got me thinking. I am a failure. I&amp;#39;ve fucked everything up I&amp;#39;ve ever tried. I just can&amp;#39;t do this anymore. Betrayed by the woman I thought loved me and my own brother. I just want out. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been seeing this girl for four months. She's helped me through so much shit in my life. I recently lost my apartment to a room mate who wasnt paying rent and got us evicted. She also wrote off my vehicle. Forcing me to move home. I started drinking heavily and abusing oxys. She helped me get my life back on track, loving me unconditionally and always being there. She recently became distant as my younger brother was coming back in town for a week. He works on the road 75% of the year. I knew my girlfriend talked to him and I assumed it was friendly as she is close with my family. When she backed away when he came home I knew something was up. He told me she had been sending him nude photos, I confronted her and she told me my brother was telling her to wait for him to come home, and leave me because I'm a failure etc. Her and I spoke and she assured me that while she did have feelings for my brother she loved me. The next day he left his iPhone out and I read some messages from her sent that day saying she fell for him the moment she saw him, wished she was there to cuddle and kiss him. I confronted her and she just said we weren't together and she can't help how she feels and I've been so horrible and I'm a failure and etc. I told my brother I want nothing to do with him. I miss her. I miss her so much. But she got me thinking. I am a failure. I've fucked everything up I've ever tried. I just can't do this anymore. Betrayed by the woman I thought loved me and my own brother. I just want out. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "247rlt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Dayman880", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/247rlt/apparently_im_an_alcoholic_failure_so_my/", "name": "t3_247rlt", "created": 1398745225.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/247rlt/apparently_im_an_alcoholic_failure_so_my/", "author_flair_text": null, "title": "Apparently I'm an alcoholic failure so my girlfriend started up a secret relationship with my brother. I'm just done", "created_utc": 1398716425.0, "ups": 2, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4gtjh", "gilded": 0, "author": "the0riginalposter", "parent_id": "t3_247rlt", "approved_by": null, "body": "You need to get away from those people now.  They will never help you only abuse you and you will be back here months from now.  Other people do not dictate that you are a failure, only you perceive yourself this way.  Everyone fucks up in their lives.  No one who cares about you would do what she did.  Tomorrow is a new day.  Make something of it - YOU WILL FEEL BETTER.  I promise you.  It will be tough.  Addiction and depression are a tough thing.  But I believe in you.  You will fuck up again.  Its now how you fuck up, but how you bring yourself back together.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to get away from those people now.  They will never help you only abuse you and you will be back here months from now.  Other people do not dictate that you are a failure, only you perceive yourself this way.  Everyone fucks up in their lives.  No one who cares about you would do what she did.  Tomorrow is a new day.  Make something of it - YOU WILL FEEL BETTER.  I promise you.  It will be tough.  Addiction and depression are a tough thing.  But I believe in you.  You will fuck up again.  Its now how you fuck up, but how you bring yourself back together.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rlt", "score_hidden": false, "name": "t1_ch4gtjh", "created": 1398724073.0, "author_flair_text": null, "created_utc": 1398720473.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4gvus", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t3_247rlt", "approved_by": null, "body": "I can't promise you that things will get better in the immediate future. But I can promise that things will change constantly and one day they will change for the better.\n\n You started off saying that she helped you through so much, that means there are people out there who are able to help and who do care even if your brother and her aren't good in the long run, they were people who helped you once and made you feel as though things could get better. \n\nI don't think you're a failure and that you've fucked everything up. You will probably disagree but my thinking on it is that you had close relationships with people, you can ask for help and you did which means you aim to get better and make things better for yourself. That's not what failures do. \n\nThese feelings are temporary. They might come very frequently but I do know that they only last for a limited period of time and if you can get through them things will get better.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t promise you that things will get better in the immediate future. But I can promise that things will change constantly and one day they will change for the better.&lt;/p&gt;\n\n&lt;p&gt;You started off saying that she helped you through so much, that means there are people out there who are able to help and who do care even if your brother and her aren&amp;#39;t good in the long run, they were people who helped you once and made you feel as though things could get better. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you&amp;#39;re a failure and that you&amp;#39;ve fucked everything up. You will probably disagree but my thinking on it is that you had close relationships with people, you can ask for help and you did which means you aim to get better and make things better for yourself. That&amp;#39;s not what failures do. &lt;/p&gt;\n\n&lt;p&gt;These feelings are temporary. They might come very frequently but I do know that they only last for a limited period of time and if you can get through them things will get better.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rlt", "score_hidden": false, "name": "t1_ch4gvus", "created": 1398724206.0, "author_flair_text": null, "created_utc": 1398720606.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chevkx7", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t1_ch596r7", "approved_by": null, "body": "I hope you're feeling a bit better. How are things now?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you&amp;#39;re feeling a bit better. How are things now?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rlt", "score_hidden": false, "name": "t1_chevkx7", "created": 1399802802.0, "author_flair_text": null, "created_utc": 1399774002.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch596r7", "gilded": 0, "author": "Dayman880", "parent_id": "t3_247rlt", "approved_by": null, "body": "Today is a new day. Thank you. Your responses really mean a lot", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Today is a new day. Thank you. Your responses really mean a lot&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rlt", "score_hidden": false, "name": "t1_ch596r7", "created": 1398800972.0, "author_flair_text": null, "created_utc": 1398797372.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]