[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a quick backstory, I&amp;#39;m a depressed, anxious, high-functioning, 32-year-old alcoholic, virgin who will shortly be out of a job and without any prospects for the future. I think at this point if I didn&amp;#39;t have a dog that was relying on me to keep feeding it, I would&amp;#39;ve already killed myself.&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s not like this is a new thing either. Suicidal depression has led to such great accomplishments in the past as dropping out of two universities, being unemployed and basically homeless for nearly a year, having only one friend who is gradually phasing me out of her life, and whose friendship circumstances came about as some weird, semi-emotional affair from her husband. To top it all off, I can&amp;#39;t talk to anyone about it in case I decide suicide is the answer, because they would try to stop it.&lt;/p&gt;\n\n&lt;p&gt;At what point is enough enough? I&amp;#39;ve tried treatment in the past that didn&amp;#39;t take. I&amp;#39;ve tried to fake it and engage in activities like writing that I think I would be happy spending my life doing, but I can never get further than a few paragraphs. I honestly don&amp;#39;t even think I know what passion, drive, or enjoyment feels like anymore. I just see a never-ending cycle of jobs I don&amp;#39;t like doing peppered with instances where -- for months at a time -- I have to rely on family I don&amp;#39;t like to take care of me and basically say, &amp;quot;This again?&amp;quot; If this is life, then I don&amp;#39;t want any part of it. I&amp;#39;ve tried to look at it in a Nietzschian way, like now you&amp;#39;re free to do anything you want... but I don&amp;#39;t want to do anything apparently.&lt;/p&gt;\n\n&lt;p&gt;I know that the adage is that suicide is inherently selfish, and I know that people around me would hurt if I did it, but the other side of that coin is that I&amp;#39;m expected to live like this for the rest of my life because people are entitled to my existence? I have to live out this shitty life, whose only respite is getting home to get blackout drunk by myself, because one friend and a handful of family would feel bad about themselves after the fact? People who if holidays didn&amp;#39;t exist, would never speak to me and I don&amp;#39;t believe genuinely care about me?&lt;/p&gt;\n\n&lt;p&gt;Anyways, I&amp;#39;m not sure where I was going with this post. Maybe I just needed to vent, so thanks for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a quick backstory, I'm a depressed, anxious, high-functioning, 32-year-old alcoholic, virgin who will shortly be out of a job and without any prospects for the future. I think at this point if I didn't have a dog that was relying on me to keep feeding it, I would've already killed myself.\n\nAnd it's not like this is a new thing either. Suicidal depression has led to such great accomplishments in the past as dropping out of two universities, being unemployed and basically homeless for nearly a year, having only one friend who is gradually phasing me out of her life, and whose friendship circumstances came about as some weird, semi-emotional affair from her husband. To top it all off, I can't talk to anyone about it in case I decide suicide is the answer, because they would try to stop it.\n\nAt what point is enough enough? I've tried treatment in the past that didn't take. I've tried to fake it and engage in activities like writing that I think I would be happy spending my life doing, but I can never get further than a few paragraphs. I honestly don't even think I know what passion, drive, or enjoyment feels like anymore. I just see a never-ending cycle of jobs I don't like doing peppered with instances where -- for months at a time -- I have to rely on family I don't like to take care of me and basically say, \"This again?\" If this is life, then I don't want any part of it. I've tried to look at it in a Nietzschian way, like now you're free to do anything you want... but I don't want to do anything apparently.\n\nI know that the adage is that suicide is inherently selfish, and I know that people around me would hurt if I did it, but the other side of that coin is that I'm expected to live like this for the rest of my life because people are entitled to my existence? I have to live out this shitty life, whose only respite is getting home to get blackout drunk by myself, because one friend and a handful of family would feel bad about themselves after the fact? People who if holidays didn't exist, would never speak to me and I don't believe genuinely care about me?\n\nAnyways, I'm not sure where I was going with this post. Maybe I just needed to vent, so thanks for reading.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "258cyd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/258cyd/at_what_point_is_enough_enough/", "name": "t3_258cyd", "created": 1399783191.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/258cyd/at_what_point_is_enough_enough/", "author_flair_text": null, "title": "At what point is enough enough?", "created_utc": 1399754391.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf3hf4", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t1_chew4r3", "approved_by": null, "body": "It's okay, you're not coming off as combative or dismissive etc. I think we both know that I can only offer so much help and that I don't know entirely what to say. But I do care and if there's anything I could do to help, I'd be willing to try. If you want to talk to me I'd be willing to listen and give advice if I had any. \n\nCan I ask why you're about to lose your job?\n ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s okay, you&amp;#39;re not coming off as combative or dismissive etc. I think we both know that I can only offer so much help and that I don&amp;#39;t know entirely what to say. But I do care and if there&amp;#39;s anything I could do to help, I&amp;#39;d be willing to try. If you want to talk to me I&amp;#39;d be willing to listen and give advice if I had any. &lt;/p&gt;\n\n&lt;p&gt;Can I ask why you&amp;#39;re about to lose your job?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_258cyd", "score_hidden": false, "name": "t1_chf3hf4", "created": 1399835240.0, "author_flair_text": null, "created_utc": 1399806440.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chew4r3", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chev7ms", "approved_by": null, "body": "The thing is that I'm old enough now that my brain isn't flooded with teenage or even early twenties hormone craziness, and over half my life has been this way at this point. I've figured out up until now how to just deal with it, but the effort expended on living this lie for other people's benefit just isn't worth it anymore. I'm not sure if the situation would be any different were I not shortly to be jobless, but that certainly doesn't help the timeline or the possibility that I would be able to afford treatment and staying alive at the same time.\n\nMost people I assume have good days and bad days. I just have days and bad days. My whole brain is calibrated wrongly, and nothing I've tried has worked. Drinking myself silly at night and being hungover all day at work is the best I've managed to find, since it gives my brain something concrete to deal with other than a constant song stuck in my head of \"You should kill yourself.\" I think at this point, some people are just born incurable. Innocent children contract inoperable cancers, and it's tragic. Some people contract incurable depression, and they're seen as selfish assholes.\n\nI'm not trying to come off as overly combative or anything, as I appreciate the response. It's just that as I said in the original post, I'm not sure why I posted originally. Validation? Help? Just someone to talk to? It's not that I haven't had nights where I just sit and cry for hours, but right now I'm coming at this issue from gross emptiness and what I can only assume is rational, utilitarian thought. My life up until now has pretty much been shit, and if the future is another forty years of this, count me out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is that I&amp;#39;m old enough now that my brain isn&amp;#39;t flooded with teenage or even early twenties hormone craziness, and over half my life has been this way at this point. I&amp;#39;ve figured out up until now how to just deal with it, but the effort expended on living this lie for other people&amp;#39;s benefit just isn&amp;#39;t worth it anymore. I&amp;#39;m not sure if the situation would be any different were I not shortly to be jobless, but that certainly doesn&amp;#39;t help the timeline or the possibility that I would be able to afford treatment and staying alive at the same time.&lt;/p&gt;\n\n&lt;p&gt;Most people I assume have good days and bad days. I just have days and bad days. My whole brain is calibrated wrongly, and nothing I&amp;#39;ve tried has worked. Drinking myself silly at night and being hungover all day at work is the best I&amp;#39;ve managed to find, since it gives my brain something concrete to deal with other than a constant song stuck in my head of &amp;quot;You should kill yourself.&amp;quot; I think at this point, some people are just born incurable. Innocent children contract inoperable cancers, and it&amp;#39;s tragic. Some people contract incurable depression, and they&amp;#39;re seen as selfish assholes.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to come off as overly combative or anything, as I appreciate the response. It&amp;#39;s just that as I said in the original post, I&amp;#39;m not sure why I posted originally. Validation? Help? Just someone to talk to? It&amp;#39;s not that I haven&amp;#39;t had nights where I just sit and cry for hours, but right now I&amp;#39;m coming at this issue from gross emptiness and what I can only assume is rational, utilitarian thought. My life up until now has pretty much been shit, and if the future is another forty years of this, count me out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_258cyd", "score_hidden": false, "name": "t1_chew4r3", "created": 1399804283.0, "author_flair_text": null, "created_utc": 1399775483.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chev7ms", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t3_258cyd", "approved_by": null, "body": "I'm sorry that things are really hard for you right now and I wish I could do more to help you out. I don't know your whole story so I can't promise you anything about your circumstances changing of their own accord. But I do know that you can help yourself out of this and that you are entirely capable of getting your life on track and going the way you want it to. \n\nI know you said that you've tried getting treatment or helping yourself out of this situation and it hasn't worked and now you feel as though there is no point in keeping at it. However, that's because you're depressed and it's making you feel that way and reinforcing every negative thing you feel about yourself. It's probably gotten to the point where it doesn't feel like a feeling that comes over you sometimes, it's more of a state of mind and it might feel like no one understands that feeling or just how bad it can actually be. It's difficult to explain to people how meaningless your life can feel all the time when you are depressed. But I can promise you that you can change it, it's not easy and it's not something that happens in one smooth go. It's usually a two steps forwards, one step back process and it's often disheartening. But things will get better. \n\nI don't know if you want to talk further about it or if you just wanted to vent but you can always PM me if you want to talk about how your feeling. I won't judge you etc. I know you might not care about your life and it might not matter to you, but it matters to me, a lot. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry that things are really hard for you right now and I wish I could do more to help you out. I don&amp;#39;t know your whole story so I can&amp;#39;t promise you anything about your circumstances changing of their own accord. But I do know that you can help yourself out of this and that you are entirely capable of getting your life on track and going the way you want it to. &lt;/p&gt;\n\n&lt;p&gt;I know you said that you&amp;#39;ve tried getting treatment or helping yourself out of this situation and it hasn&amp;#39;t worked and now you feel as though there is no point in keeping at it. However, that&amp;#39;s because you&amp;#39;re depressed and it&amp;#39;s making you feel that way and reinforcing every negative thing you feel about yourself. It&amp;#39;s probably gotten to the point where it doesn&amp;#39;t feel like a feeling that comes over you sometimes, it&amp;#39;s more of a state of mind and it might feel like no one understands that feeling or just how bad it can actually be. It&amp;#39;s difficult to explain to people how meaningless your life can feel all the time when you are depressed. But I can promise you that you can change it, it&amp;#39;s not easy and it&amp;#39;s not something that happens in one smooth go. It&amp;#39;s usually a two steps forwards, one step back process and it&amp;#39;s often disheartening. But things will get better. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if you want to talk further about it or if you just wanted to vent but you can always PM me if you want to talk about how your feeling. I won&amp;#39;t judge you etc. I know you might not care about your life and it might not matter to you, but it matters to me, a lot. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_258cyd", "score_hidden": false, "name": "t1_chev7ms", "created": 1399801820.0, "author_flair_text": null, "created_utc": 1399773020.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]