[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if this post is kinda jumbled, I&amp;#39;m just really tired right now and I&amp;#39;m going to be writing what comes to my mind. I&amp;#39;ve been clinically depressed since I was 11 (I&amp;#39;m 17 now) and I&amp;#39;ve had bouts of suicidal thoughts that simply won&amp;#39;t go away for years. I told myself last year that I would wait until I was 25 before killing myself, and if I was still unhappy at that age, I would die, but I really don&amp;#39;t think I can wait much longer. Almost every moment of my existence is filled with misery and I really don&amp;#39;t think I can take it. I&amp;#39;ve tried SSRI&amp;#39;s and other treatments, including exercise and self-medication, and none of it has helped at all. I&amp;#39;ve at least been able to identify some triggers for my suicidal urges, which right now is school.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m about to graduate and I&amp;#39;m failing two classes and very close to getting my college admission rescinded. I often find myself procrastinating until the very last minute, continuously worrying and worrying and putting off all my assignments, and eventually turning them in late or not turning them in at all. Additionally, I really dread going to college because I honestly hate working on school homework or assignments, and I can&amp;#39;t find even one career path or major I remotely like. Almost all work is dreadful for me, which makes me feel like I&amp;#39;m just not meant for society. I&amp;#39;ve really tried finding hobbies or things that I like doing, but I&amp;#39;ve simply not been able to.&lt;/p&gt;\n\n&lt;p&gt;I find myself unable to concentrate or feel motivated about doing anything. Although I&amp;#39;ve been prescribed ADD meds too, even they don&amp;#39;t work anymore and even with a tolerance break, all they do is give me a burst of energy. Nothing works for me and I&amp;#39;m just miserable.&lt;/p&gt;\n\n&lt;p&gt;The only time I feel happy is when I&amp;#39;m high and partying or dancing with friends at raves. I know this isn&amp;#39;t a sustainable lifestyle, so I honestly think suicide&amp;#39;s my only option since I&amp;#39;m just not suited for this world. I have loads of self-esteem and personal issues that I&amp;#39;m not really going to go into, but I really don&amp;#39;t think I can wait until 25 and be miserable for 8 more years before I die.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m planning on either locally buying (if I can find it) or ordering heroin online and overdosing as soon as I can. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry if this post is kinda jumbled, I'm just really tired right now and I'm going to be writing what comes to my mind. I've been clinically depressed since I was 11 (I'm 17 now) and I've had bouts of suicidal thoughts that simply won't go away for years. I told myself last year that I would wait until I was 25 before killing myself, and if I was still unhappy at that age, I would die, but I really don't think I can wait much longer. Almost every moment of my existence is filled with misery and I really don't think I can take it. I've tried SSRI's and other treatments, including exercise and self-medication, and none of it has helped at all. I've at least been able to identify some triggers for my suicidal urges, which right now is school.\n\nI'm about to graduate and I'm failing two classes and very close to getting my college admission rescinded. I often find myself procrastinating until the very last minute, continuously worrying and worrying and putting off all my assignments, and eventually turning them in late or not turning them in at all. Additionally, I really dread going to college because I honestly hate working on school homework or assignments, and I can't find even one career path or major I remotely like. Almost all work is dreadful for me, which makes me feel like I'm just not meant for society. I've really tried finding hobbies or things that I like doing, but I've simply not been able to.\n\nI find myself unable to concentrate or feel motivated about doing anything. Although I've been prescribed ADD meds too, even they don't work anymore and even with a tolerance break, all they do is give me a burst of energy. Nothing works for me and I'm just miserable.\n\nThe only time I feel happy is when I'm high and partying or dancing with friends at raves. I know this isn't a sustainable lifestyle, so I honestly think suicide's my only option since I'm just not suited for this world. I have loads of self-esteem and personal issues that I'm not really going to go into, but I really don't think I can wait until 25 and be miserable for 8 more years before I die.\n\nI'm planning on either locally buying (if I can find it) or ordering heroin online and overdosing as soon as I can. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248jef", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawaysuicidal10", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248jef/been_feeling_suicidal_and_depressed_for_awhile/", "name": "t3_248jef", "created": 1398761834.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248jef/been_feeling_suicidal_and_depressed_for_awhile/", "author_flair_text": null, "title": "Been feeling suicidal and depressed for awhile now and I just want to end it all", "created_utc": 1398733034.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4qk0e", "gilded": 0, "author": "nowthatsenough", "parent_id": "t3_248jef", "approved_by": null, "body": "Hey man, I'm 17 too, also hate school and love drugs (but who doesn't feel that way?) I can tell you are smart already by the way that you type. Your wording shows it. You want to know something? There are careers out the ass that you can obtain without going to college. Real Estate being one of them, which is what I plan on doing. Good money, cheap nice house, not being in debt? Sign me the fuck up! Like video games? Apply for a job as an IT guy for Xbox or Playstation! Like PC better? Not a problem, do the same thing but for valve or ubisoft or SOMETHING! \n\nI tried to kill myself in 6th grade. Failed, but it happens. got busted trying to hang myself. Being depressed at a young age sucks fucking dick, but you want to know something? You don't need an amazing career or anything to be alive. Some people may disagree, but if it keeps you alive, claim unemployment checks and welfare and get free housing and food stamps and just sort out your shit while the government takes care of you. You deserve it, since the government should be doing more to help people like you and I anyway. Then, once you feel a bit better and you are tired of snorting coke off of your neighbors tits then maybe you can go to college online or go to community college. People have been in your position before, and the only reason I am not telling you you are fucked is because I saw those people on the front page of reddit, saying how easy it was once they made the jump into being independent. \n\nAnd if all of that doesn't sound possible, talk to your teachers. Spill the beans. Tell them how you are too depressed to do the work, and that you would do it if you could. I am failing 5 classes right now, and am doing almost no work and my grades are coming up, because teachers have seen what Im going through, and since you and i are both smart enough to do well on tests and shit, you can PASS. Please, don't do it yet. Not until you try a few more things. I am here if you need guidance on anything. I am practicing what I am preaching here. We are in an almost identical situation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I&amp;#39;m 17 too, also hate school and love drugs (but who doesn&amp;#39;t feel that way?) I can tell you are smart already by the way that you type. Your wording shows it. You want to know something? There are careers out the ass that you can obtain without going to college. Real Estate being one of them, which is what I plan on doing. Good money, cheap nice house, not being in debt? Sign me the fuck up! Like video games? Apply for a job as an IT guy for Xbox or Playstation! Like PC better? Not a problem, do the same thing but for valve or ubisoft or SOMETHING! &lt;/p&gt;\n\n&lt;p&gt;I tried to kill myself in 6th grade. Failed, but it happens. got busted trying to hang myself. Being depressed at a young age sucks fucking dick, but you want to know something? You don&amp;#39;t need an amazing career or anything to be alive. Some people may disagree, but if it keeps you alive, claim unemployment checks and welfare and get free housing and food stamps and just sort out your shit while the government takes care of you. You deserve it, since the government should be doing more to help people like you and I anyway. Then, once you feel a bit better and you are tired of snorting coke off of your neighbors tits then maybe you can go to college online or go to community college. People have been in your position before, and the only reason I am not telling you you are fucked is because I saw those people on the front page of reddit, saying how easy it was once they made the jump into being independent. &lt;/p&gt;\n\n&lt;p&gt;And if all of that doesn&amp;#39;t sound possible, talk to your teachers. Spill the beans. Tell them how you are too depressed to do the work, and that you would do it if you could. I am failing 5 classes right now, and am doing almost no work and my grades are coming up, because teachers have seen what Im going through, and since you and i are both smart enough to do well on tests and shit, you can PASS. Please, don&amp;#39;t do it yet. Not until you try a few more things. I am here if you need guidance on anything. I am practicing what I am preaching here. We are in an almost identical situation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248jef", "score_hidden": false, "name": "t1_ch4qk0e", "created": 1398744178.0, "author_flair_text": null, "created_utc": 1398740578.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4oi93", "gilded": 0, "author": "ohmercyme27", "parent_id": "t3_248jef", "approved_by": null, "body": "Aahh. I know this is cliche, but after high school everything changes. I can't guarantee everything will be roses, but please buckle down, graduate, and get to your college. I have a few friends who killed themselves so young, and having grown up i always wonder where theywould be now. Theres just so much opportunity! I truly hope you decide not to. You are so young with so much going for you. Just wait and see :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aahh. I know this is cliche, but after high school everything changes. I can&amp;#39;t guarantee everything will be roses, but please buckle down, graduate, and get to your college. I have a few friends who killed themselves so young, and having grown up i always wonder where theywould be now. Theres just so much opportunity! I truly hope you decide not to. You are so young with so much going for you. Just wait and see :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248jef", "score_hidden": false, "name": "t1_ch4oi93", "created": 1398765310.0, "author_flair_text": null, "created_utc": 1398736510.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4ydfb", "gilded": 0, "author": "trilok1111", "parent_id": "t3_248jef", "approved_by": null, "body": "Hey!\n\nEveryone's saying it'll be ok... I'll tell you a little secret, most chances are that at the end of the bumpy road it will indeed be ok... until then, it's a hell of a bumpy road.\n\nIf things are so bad you are really about to commit suicide, why not try something just a bit less.. well... permanent? Why don't you drop out of school? Don't go to college! Don't work! Take a bag and travel your country alone for 6 months! Be F-R-E-E from any obligations! Don't owe no one nothing! And let me tell you a little secret - the world WILL wait for you. In 2-3 years you can study again to graduate and fix your life then. It's such a better solution then committing suicide. \n\nSo a moment before you write yourself off, give yourself one last opportunity. Try learning a very competitive &amp; addictive hobby: poker, backgammon, something to get your mind into a different place.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey!&lt;/p&gt;\n\n&lt;p&gt;Everyone&amp;#39;s saying it&amp;#39;ll be ok... I&amp;#39;ll tell you a little secret, most chances are that at the end of the bumpy road it will indeed be ok... until then, it&amp;#39;s a hell of a bumpy road.&lt;/p&gt;\n\n&lt;p&gt;If things are so bad you are really about to commit suicide, why not try something just a bit less.. well... permanent? Why don&amp;#39;t you drop out of school? Don&amp;#39;t go to college! Don&amp;#39;t work! Take a bag and travel your country alone for 6 months! Be F-R-E-E from any obligations! Don&amp;#39;t owe no one nothing! And let me tell you a little secret - the world WILL wait for you. In 2-3 years you can study again to graduate and fix your life then. It&amp;#39;s such a better solution then committing suicide. &lt;/p&gt;\n\n&lt;p&gt;So a moment before you write yourself off, give yourself one last opportunity. Try learning a very competitive &amp;amp; addictive hobby: poker, backgammon, something to get your mind into a different place.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248jef", "score_hidden": false, "name": "t1_ch4ydfb", "created": 1398774926.0, "author_flair_text": null, "created_utc": 1398771326.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]