[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So here i am, on a for everybody else perfect Friday nigth, Just sitting here by my self doing nothing but feeling weak and puny, You see i&amp;#39;ve been invited this very nigth for a party with my friends but being the weak Little human that i am, i feel like there&amp;#39;s no point in such a triffleing thing like a party, It&amp;#39;s this feeling i have with everything i do (which not much to begin with), no matter how seemingly important the matter may seem for someone. Take for instance school a lot of People argue that It is important somehow (i&amp;#39;m currently doing the equivelant of CGE-A) They make up some non-important reason like You need To have a job to be able To support yourself, which is undoubtably true in the context of society but less true in the context of life outside of society. do i really need a job if i would not confine myself to society ? \ni have done something so terrible stupid that if it were to be posted Online i would be forced To resign from Life in society yet there&amp;#39;s soceity everywhere. (This act i have commited, i did with full consent, and i fully understood the possible aftermath. Even though i knew It would be detrimental i did so anyway)&lt;/p&gt;\n\n&lt;p&gt;aside from this i have stopped caring for pretty much everything. I sincerely do not care what happens to me. I feel like i migth aswell stop exsisting already. It would be the quickest to way to live my life.&lt;/p&gt;\n\n&lt;p&gt;i apologise for any grammar/spelling mistakes made in this post, please note that i&amp;#39;m not a native English speaker and i that wrote this on my cellphone with no dictionary installed, That could aid me with spelling and such&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So here i am, on a for everybody else perfect Friday nigth, Just sitting here by my self doing nothing but feeling weak and puny, You see i've been invited this very nigth for a party with my friends but being the weak Little human that i am, i feel like there's no point in such a triffleing thing like a party, It's this feeling i have with everything i do (which not much to begin with), no matter how seemingly important the matter may seem for someone. Take for instance school a lot of People argue that It is important somehow (i'm currently doing the equivelant of CGE-A) They make up some non-important reason like You need To have a job to be able To support yourself, which is undoubtably true in the context of society but less true in the context of life outside of society. do i really need a job if i would not confine myself to society ? \ni have done something so terrible stupid that if it were to be posted Online i would be forced To resign from Life in society yet there's soceity everywhere. (This act i have commited, i did with full consent, and i fully understood the possible aftermath. Even though i knew It would be detrimental i did so anyway)\n\naside from this i have stopped caring for pretty much everything. I sincerely do not care what happens to me. I feel like i migth aswell stop exsisting already. It would be the quickest to way to live my life.\n\ni apologise for any grammar/spelling mistakes made in this post, please note that i'm not a native English speaker and i that wrote this on my cellphone with no dictionary installed, That could aid me with spelling and such", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23ziff", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ucanbepanda", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23ziff/being_alive_feels_useless/", "name": "t3_23ziff", "created": 1398491564.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23ziff/being_alive_feels_useless/", "author_flair_text": null, "title": "Being alive feels useless", "created_utc": 1398462764.0, "ups": 4, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch23iz2", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23ziff", "approved_by": null, "body": "First thing, preferring not to go to a party is no bad thing, a lot of people would prefer to be alone at times and that's okay. In terms of you feeling disconnected from society I understand that, it's hard sometimes to feel like you're doing as well as other people when you've got your own problems to deal with. If you feel like talking to someone about this feel free to send me a private message thing, I'm always happy to listen and I'll do my best to help where I can. Also just so you know, your English seems pretty good to me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First thing, preferring not to go to a party is no bad thing, a lot of people would prefer to be alone at times and that&amp;#39;s okay. In terms of you feeling disconnected from society I understand that, it&amp;#39;s hard sometimes to feel like you&amp;#39;re doing as well as other people when you&amp;#39;ve got your own problems to deal with. If you feel like talking to someone about this feel free to send me a private message thing, I&amp;#39;m always happy to listen and I&amp;#39;ll do my best to help where I can. Also just so you know, your English seems pretty good to me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ziff", "score_hidden": false, "name": "t1_ch23iz2", "created": 1398466804.0, "author_flair_text": null, "created_utc": 1398463204.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ep5k", "gilded": 0, "author": "LightAbsol", "parent_id": "t3_23ziff", "approved_by": null, "body": "I agree that partying is a total waste of time, you can be doing such better things with your time, like reading, writing, learning how to do new things, practicing a skill, a hobby...You're not alone on that one! We definitely want to talk to you and know more about your situation. PS. You speak English much more fluently than a LOT of native English speakers that I've met on the internet.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that partying is a total waste of time, you can be doing such better things with your time, like reading, writing, learning how to do new things, practicing a skill, a hobby...You&amp;#39;re not alone on that one! We definitely want to talk to you and know more about your situation. PS. You speak English much more fluently than a LOT of native English speakers that I&amp;#39;ve met on the internet.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ziff", "score_hidden": false, "name": "t1_ch2ep5k", "created": 1398496476.0, "author_flair_text": null, "created_utc": 1398492876.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]