[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work at a large investment firm as a sales consultant and make great money. I&amp;#39;m dating a beautiful girl. I have my own place and am practically debt free. &lt;/p&gt;\n\n&lt;p&gt;I have been trained to skillfully uncover emotions and use them against people as a sales tactic. My girlfriend is fucking boring. My expensive car makes me feel like a douche bag or show off.&lt;/p&gt;\n\n&lt;p&gt;At work I am who my supervisors want me to be, at home I am the man my friends and family think I should be.&lt;/p&gt;\n\n&lt;p&gt;I have no idea what I feel only the way I think others should feel. I have been thinking more and more about ending my life. I&amp;#39;ve always had thoughts but now I day dream about it to escape reality, the thought of it comforts me and is the place I get away to like someone would think of a dream vacation. I think of the feeling of loading the round into my rilfe, the satisfaction the lever action will bring me. I think of that moment I get the guts to pull the trigger and hear the hammer slam down and ignite the primer. I wonder if everything will go black or if I&amp;#39;ll maintain conscienceless for a brief moment. Then I&amp;#39;m back to reality the life I don&amp;#39;t enjoy, the purposeless existence I fulfill of getting up and going to work every day to a job I hate to look forward to each weekend in which I lay in bed all day dreading Monday to come so the cycle can start over.&lt;/p&gt;\n\n&lt;p&gt;Suicide is now the only thing I have feelings for it comforts me the cool dark feeling of the release from this cycle. It becomes more and more attractive every time I think about it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work at a large investment firm as a sales consultant and make great money. I'm dating a beautiful girl. I have my own place and am practically debt free. \n\nI have been trained to skillfully uncover emotions and use them against people as a sales tactic. My girlfriend is fucking boring. My expensive car makes me feel like a douche bag or show off.\n\nAt work I am who my supervisors want me to be, at home I am the man my friends and family think I should be.\n\n I have no idea what I feel only the way I think others should feel. I have been thinking more and more about ending my life. I've always had thoughts but now I day dream about it to escape reality, the thought of it comforts me and is the place I get away to like someone would think of a dream vacation. I think of the feeling of loading the round into my rilfe, the satisfaction the lever action will bring me. I think of that moment I get the guts to pull the trigger and hear the hammer slam down and ignite the primer. I wonder if everything will go black or if I'll maintain conscienceless for a brief moment. Then I'm back to reality the life I don't enjoy, the purposeless existence I fulfill of getting up and going to work every day to a job I hate to look forward to each weekend in which I lay in bed all day dreading Monday to come so the cycle can start over.\n\nSuicide is now the only thing I have feelings for it comforts me the cool dark feeling of the release from this cycle. It becomes more and more attractive every time I think about it", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c754", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Audition89", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c754/bored_and_disconnected/", "name": "t3_24c754", "created": 1398856910.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c754/bored_and_disconnected/", "author_flair_text": null, "title": "Bored and Disconnected", "created_utc": 1398828110.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5onuz", "gilded": 0, "author": "RabidKity", "parent_id": "t3_24c754", "approved_by": null, "body": "I recently had gone through the same feelings of dispair for some of the same reasons you do.   It's hard when you feel like you have to conform to other's expectations.   Change your cycle, find those things that make you smile, try those things that you have always wanted to try.  Take that first step.  I have been in your shoes and I was chained to my fears that in the end, were of my own creation.    Be who you want to be.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recently had gone through the same feelings of dispair for some of the same reasons you do.   It&amp;#39;s hard when you feel like you have to conform to other&amp;#39;s expectations.   Change your cycle, find those things that make you smile, try those things that you have always wanted to try.  Take that first step.  I have been in your shoes and I was chained to my fears that in the end, were of my own creation.    Be who you want to be.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c754", "score_hidden": false, "name": "t1_ch5onuz", "created": 1398832548.0, "author_flair_text": null, "created_utc": 1398828948.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5p366", "gilded": 0, "author": "thoverlord", "parent_id": "t3_24c754", "approved_by": null, "body": "Many its time to pick up some hobbies. They can let you focus and tap ur deeper thoughts. You can look for urself and be you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many its time to pick up some hobbies. They can let you focus and tap ur deeper thoughts. You can look for urself and be you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c754", "score_hidden": false, "name": "t1_ch5p366", "created": 1398833482.0, "author_flair_text": null, "created_utc": 1398829882.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]