[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;so, another post oozing of self pity. like so many others out there, my gf broke up with me. i think what makes this break up particularly bad is that i loved her, and still do, but as described in &amp;quot;the system&amp;quot;, her interest level in me dropped to absolute zero. she is not the first person to throw me away, and wont be the last. my dad threw me away, other girls have thrown me away, and i&amp;#39;m sure future girls will throw me away. i get that i&amp;#39;m pos, which is probably the worst part-she will move on and i wont; she will find someone who loves her and she loves back and i will be once again, tossed to the garbage pile to rot in my world of darkness, sadness, and self hate. not sure how i should deal with the pain, either kill myself or go back to coke. both options are appealing. honestly, i don&amp;#39;t care that much if ppl read this, i just need to talk, to expel my feelings. i know she is already over me, and i am just stuck missing the good parts of our relationship. anyways, feel free to leave me a comment, a troll, anything you want. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "so, another post oozing of self pity. like so many others out there, my gf broke up with me. i think what makes this break up particularly bad is that i loved her, and still do, but as described in \"the system\", her interest level in me dropped to absolute zero. she is not the first person to throw me away, and wont be the last. my dad threw me away, other girls have thrown me away, and i'm sure future girls will throw me away. i get that i'm pos, which is probably the worst part-she will move on and i wont; she will find someone who loves her and she loves back and i will be once again, tossed to the garbage pile to rot in my world of darkness, sadness, and self hate. not sure how i should deal with the pain, either kill myself or go back to coke. both options are appealing. honestly, i don't care that much if ppl read this, i just need to talk, to expel my feelings. i know she is already over me, and i am just stuck missing the good parts of our relationship. anyways, feel free to leave me a comment, a troll, anything you want. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25d4ro", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "MericanAssClown", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25d4ro/broken_empty_thrown_away_worthless/", "name": "t3_25d4ro", "created": 1399936839.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25d4ro/broken_empty_thrown_away_worthless/", "author_flair_text": null, "title": "broken, empty, thrown away, worthless", "created_utc": 1399908039.0, "ups": 8, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg6eqc", "gilded": 0, "author": "trulooloo", "parent_id": "t1_chg3q2v", "approved_by": null, "body": "Do you enjoy music?\n\nMusic wa sthe greatest therapy for me. I've always been one to refuse to let myself feel things. I always bottle up my emotions, regardless of what they are, and refused to express them. Music has always been a release for me. Music allows me to *feel*.\n\nWhenever I felt like shit, I'd block out everything else, and make sure I was absolutely alone (noise canceling headphones, in the dark, etc.). Then I'd just sit and listen to anything and everything. If I felt depressed and wanted to be angry at the world, I would listen to the music that would make me feel that way. Then I'd get to purge my stupid emotions. I'd listen to songs that made me sad, songs that made me happy, and even songs where I could relate to the subject matter. The point is, allowing myself to feel these emotions in the comfort of my own, small, musical universe allowed vomit out all the BS. Sometimes vomiting makes you feel so much better. Find a release and let it all go. From there your mind just might be clear enough to obtain some glimmer of hope for the future.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you enjoy music?&lt;/p&gt;\n\n&lt;p&gt;Music wa sthe greatest therapy for me. I&amp;#39;ve always been one to refuse to let myself feel things. I always bottle up my emotions, regardless of what they are, and refused to express them. Music has always been a release for me. Music allows me to &lt;em&gt;feel&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Whenever I felt like shit, I&amp;#39;d block out everything else, and make sure I was absolutely alone (noise canceling headphones, in the dark, etc.). Then I&amp;#39;d just sit and listen to anything and everything. If I felt depressed and wanted to be angry at the world, I would listen to the music that would make me feel that way. Then I&amp;#39;d get to purge my stupid emotions. I&amp;#39;d listen to songs that made me sad, songs that made me happy, and even songs where I could relate to the subject matter. The point is, allowing myself to feel these emotions in the comfort of my own, small, musical universe allowed vomit out all the BS. Sometimes vomiting makes you feel so much better. Find a release and let it all go. From there your mind just might be clear enough to obtain some glimmer of hope for the future.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25d4ro", "score_hidden": false, "name": "t1_chg6eqc", "created": 1399951359.0, "author_flair_text": null, "created_utc": 1399922559.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chg3q2v", "gilded": 0, "author": "MericanAssClown", "parent_id": "t1_chg1nt0", "approved_by": null, "body": "i guess  i dont, to be fair. \ni just have no hope", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i guess  i dont, to be fair. \ni just have no hope&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25d4ro", "score_hidden": false, "name": "t1_chg3q2v", "created": 1399945786.0, "author_flair_text": null, "created_utc": 1399916986.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chg1nt0", "gilded": 0, "author": "trulooloo", "parent_id": "t1_chg0cyz", "approved_by": null, "body": "How do you know that you'll never be anyone's treasure?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you know that you&amp;#39;ll never be anyone&amp;#39;s treasure?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25d4ro", "score_hidden": false, "name": "t1_chg1nt0", "created": 1399941494.0, "author_flair_text": null, "created_utc": 1399912694.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chg0cyz", "gilded": 0, "author": "MericanAssClown", "parent_id": "t1_chfzxpf", "approved_by": null, "body": "i guess what you said is true, another man's (or woman's) trash is another one's treasure. i guess what gets me down is that i know i will never be anyone's treasure. i think i have always known that but it was just a hard truth to eventually swallow. now that i have accepted the truth, i just don't to live. i want this pain to end. \nhere's to always being trash! lol", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i guess what you said is true, another man&amp;#39;s (or woman&amp;#39;s) trash is another one&amp;#39;s treasure. i guess what gets me down is that i know i will never be anyone&amp;#39;s treasure. i think i have always known that but it was just a hard truth to eventually swallow. now that i have accepted the truth, i just don&amp;#39;t to live. i want this pain to end. \nhere&amp;#39;s to always being trash! lol&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25d4ro", "score_hidden": false, "name": "t1_chg0cyz", "created": 1399938702.0, "author_flair_text": null, "created_utc": 1399909902.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "chfzxpf", "gilded": 0, "author": "trulooloo", "parent_id": "t3_25d4ro", "approved_by": null, "body": "I know that this is easier said than done, but sometimes, time really is the best medicine. I definitely didn't think so when my father left. I also didn't think so when my mother couldn't care for me as a single mother anymore and I had to be adopted by a surrogate family.\n\nLife wasn't easy then, and it's not easy now. I've been thrown away by others, but 'one man's garbage is another man's treasure' (so they say). I guess I'm not very good at providing great advice or positive messages, but I wanted to share my experience with you. I was left and rejected by many, but I am truly grateful for the select few who truly love me. There are so many different people in this world, there must be some hope for love :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that this is easier said than done, but sometimes, time really is the best medicine. I definitely didn&amp;#39;t think so when my father left. I also didn&amp;#39;t think so when my mother couldn&amp;#39;t care for me as a single mother anymore and I had to be adopted by a surrogate family.&lt;/p&gt;\n\n&lt;p&gt;Life wasn&amp;#39;t easy then, and it&amp;#39;s not easy now. I&amp;#39;ve been thrown away by others, but &amp;#39;one man&amp;#39;s garbage is another man&amp;#39;s treasure&amp;#39; (so they say). I guess I&amp;#39;m not very good at providing great advice or positive messages, but I wanted to share my experience with you. I was left and rejected by many, but I am truly grateful for the select few who truly love me. There are so many different people in this world, there must be some hope for love :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25d4ro", "score_hidden": false, "name": "t1_chfzxpf", "created": 1399937753.0, "author_flair_text": null, "created_utc": 1399908953.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]