[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m female, younger 20&amp;#39;s, just moved to a new city after failing in my hometown. I have depression, a.d.d. and anxiety - generalized and perhaps social phobias. I think I may have anger issues.&lt;/p&gt;\n\n&lt;p&gt;When I&amp;#39;ve been suicidal recently I question why even try to be happy. Or what is happiness? I feel I haven&amp;#39;t felt it for so long, or felt a consistent feeling of satisfaction or happiness that I have forgotten what its like. Trying to be happy or stay happy is way too much effort and its always fleeting. I hate it. I. Hate. Happiness. &lt;/p&gt;\n\n&lt;p&gt;I dont get it, I dont want to play everyone&amp;#39;s game of trying to be happy. I believe its over-rated. Just like the whole &amp;quot;Do what you love and you&amp;#39;ll never work a day in your life&amp;quot; Which I just see as incredibly over-rated and pressured onto people so much I cant even stand it.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s so much shit going on in the world that really doesn&amp;#39;t mean anything. Any one person&amp;#39;s happiness doesnt mean anything in the grand scheme of things. Why even try? Why do I have to change myself and live when I can just die instead?&lt;/p&gt;\n\n&lt;p&gt;At times I want to seek help, but am angry at having to listen to someone tell me how to live my life. I nearly get so mad I want to punch them. I just want the pain to end. I don&amp;#39;t care anymore. I just don&amp;#39;t. I&amp;#39;m just trying to find a good way to end it all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm female, younger 20's, just moved to a new city after failing in my hometown. I have depression, a.d.d. and anxiety - generalized and perhaps social phobias. I think I may have anger issues.\n\nWhen I've been suicidal recently I question why even try to be happy. Or what is happiness? I feel I haven't felt it for so long, or felt a consistent feeling of satisfaction or happiness that I have forgotten what its like. Trying to be happy or stay happy is way too much effort and its always fleeting. I hate it. I. Hate. Happiness. \n\nI dont get it, I dont want to play everyone's game of trying to be happy. I believe its over-rated. Just like the whole \"Do what you love and you'll never work a day in your life\" Which I just see as incredibly over-rated and pressured onto people so much I cant even stand it.\n\n There's so much shit going on in the world that really doesn't mean anything. Any one person's happiness doesnt mean anything in the grand scheme of things. Why even try? Why do I have to change myself and live when I can just die instead?\n\nAt times I want to seek help, but am angry at having to listen to someone tell me how to live my life. I nearly get so mad I want to punch them. I just want the pain to end. I don't care anymore. I just don't. I'm just trying to find a good way to end it all.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24kzwj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "blackfpaw", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24kzwj/cannot_get_over_why_i_have_to_be_happy_or_live/", "name": "t3_24kzwj", "created": 1399102155.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24kzwj/cannot_get_over_why_i_have_to_be_happy_or_live/", "author_flair_text": null, "title": "Cannot get over why I have to be happy or live happily. Suicidal and angry rant", "created_utc": 1399073355.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch86zrq", "gilded": 0, "author": "Nozphexezora", "parent_id": "t1_ch862v7", "approved_by": null, "body": "&gt;I hate having to force myself into situation in which I know I should be happy or have fun in or just feel ok with and being disappointed when I cant feel what others are feeling e.g. happiness. I hate being disappointed with myself cuz I cannot feel the way others are feeling or should be feeling if they were attending x or y event that causes the average person some sort of joy.\n\nHey, we all got different interests and hobbies. You don't have to go out and enjoy something somebody else enjoys. What hobbies do you have?\n\n&gt;Does that last paragraph make sense? I'm sorry I'm well, just in tears..\n\nDon't worry, it makes sense.\n\nIt sounds like you hold a lot of resentment on other people. Why, because you think they're happy? Believe it or not, but everybody struggles. Everybody has their bad moments. Resentment is an ugly feeling. It only harbours hatred and isolation.\n", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I hate having to force myself into situation in which I know I should be happy or have fun in or just feel ok with and being disappointed when I cant feel what others are feeling e.g. happiness. I hate being disappointed with myself cuz I cannot feel the way others are feeling or should be feeling if they were attending x or y event that causes the average person some sort of joy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hey, we all got different interests and hobbies. You don&amp;#39;t have to go out and enjoy something somebody else enjoys. What hobbies do you have?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Does that last paragraph make sense? I&amp;#39;m sorry I&amp;#39;m well, just in tears..&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t worry, it makes sense.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you hold a lot of resentment on other people. Why, because you think they&amp;#39;re happy? Believe it or not, but everybody struggles. Everybody has their bad moments. Resentment is an ugly feeling. It only harbours hatred and isolation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kzwj", "score_hidden": false, "name": "t1_ch86zrq", "created": 1399107351.0, "author_flair_text": null, "created_utc": 1399078551.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch862v7", "gilded": 0, "author": "blackfpaw", "parent_id": "t1_ch85kvr", "approved_by": null, "body": "I hate the pursuit of it. I feel like I'm only really \"happy\" or feel like truly at ease under such very large set of specific circumstances. And since I've moved and just become more paranoid around other people. Those times in which I can feel at ease or happy are becoming smaller and smaller and more and more infrequent. \n\nI hate having to force myself into situation in which I know I should be happy or have fun in or just feel ok with and being disappointed when I cant feel what others are feeling e.g. happiness. I hate being disappointed with myself cuz I cannot feel the way others are feeling or should be feeling if they were attending x or y event that causes the average person some sort of joy.\n\n\nDoes that last paragraph make sense? I'm sorry I'm well, just in tears..\n\n\nAnd how do I view what happiness is or should be? Well, I'd say being content, not worried, relaxed, open, joyful, playful, laughing. I feel like my world just is so deprived from that. I hate knowing that other people experience such feelings and I don't. I nearly hate feeling happiness at all anymore because I know its all going to end and when it does I'm stuck alone again. Facing my problems, wishing I'd die.", "edited": 1399076452.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate the pursuit of it. I feel like I&amp;#39;m only really &amp;quot;happy&amp;quot; or feel like truly at ease under such very large set of specific circumstances. And since I&amp;#39;ve moved and just become more paranoid around other people. Those times in which I can feel at ease or happy are becoming smaller and smaller and more and more infrequent. &lt;/p&gt;\n\n&lt;p&gt;I hate having to force myself into situation in which I know I should be happy or have fun in or just feel ok with and being disappointed when I cant feel what others are feeling e.g. happiness. I hate being disappointed with myself cuz I cannot feel the way others are feeling or should be feeling if they were attending x or y event that causes the average person some sort of joy.&lt;/p&gt;\n\n&lt;p&gt;Does that last paragraph make sense? I&amp;#39;m sorry I&amp;#39;m well, just in tears..&lt;/p&gt;\n\n&lt;p&gt;And how do I view what happiness is or should be? Well, I&amp;#39;d say being content, not worried, relaxed, open, joyful, playful, laughing. I feel like my world just is so deprived from that. I hate knowing that other people experience such feelings and I don&amp;#39;t. I nearly hate feeling happiness at all anymore because I know its all going to end and when it does I&amp;#39;m stuck alone again. Facing my problems, wishing I&amp;#39;d die.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kzwj", "score_hidden": false, "name": "t1_ch862v7", "created": 1399104856.0, "author_flair_text": null, "created_utc": 1399076056.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch85kvr", "gilded": 0, "author": "Nozphexezora", "parent_id": "t3_24kzwj", "approved_by": null, "body": "&gt; Or what is happiness?\n\nTell me what you think happiness is - what you think it feels like. There are lots of types of happiness. Not all of them are fleeting.\n\n&gt;I hate it. I. Hate. Happiness.\n\nAre you sure you hate happiness, or just your pursuit of it? I find it hard to believe anybody could hate happiness. Maybe as a concept, but the feeling is universally great.\n\n&gt;I dont get it, I dont want to play everyone's game of trying to be happy. I believe its over-rated. Just like the whole \"Do what you love and you'll never work a day in your life\" Which I just see as incredibly over-rated and pressured onto people so much I cant even stand it.\n\nI definitely understand where you're coming from. A lot of people have the simple \"I think the value of Life is about being happy!\" philosophy. I don't think the value of Life is as simple as that. Happiness, laughter or whatever is great for your health, but it's not the be all and end all. I think knowledge and education is more important, personally - sometimes it doesn't help to have knowledge, it doesn't always make us happy. It often makes us depressed. But you can be an idiot and still be happy. And what's more valuable, a happy life or a life with a wealth of knowledge and experience?\n\n&gt;There's so much shit going on in the world that really doesn't mean anything. Any one person's happiness doesnt mean anything in the grand scheme of things. Why even try? Why do I have to change myself and live when I can just die instead?\n\nDying doesn't solve anything. And we can't change a lot of things - so what? So what if humanity is a needle in a haystack compared to the rest of the Universe?! Instead of thinking we're insignificant in comparison to the rest of the world, what about the thought that the world around us is significant?\n\n&gt;At times I want to seek help, but am angry at having to listen to someone tell me how to live my life. I nearly get so mad I want to punch them.\n\nI know what you mean, but some people are just providing suggestions on a way of Life. If somebody suggests something to help you manage your depression or anger, it's still up to you to decide whether or not you want to follow through with the suggestion. Nobody's forcing you to live the same life, and walk down the same road as them. Besides, a lot of other people have experience in Life that they can pass down so that others don't make the same mistakes.\n\n&gt; I just want the pain to end. I don't care anymore. I just don't. I'm just trying to find a good way to end it all.\n\nHow about ending it by working on a legitimate recovery from your depression? That's where other people's suggestions come in: they *can* help. Why do the same thing over and over when it's clearly not working?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Or what is happiness?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tell me what you think happiness is - what you think it feels like. There are lots of types of happiness. Not all of them are fleeting.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I hate it. I. Hate. Happiness.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you sure you hate happiness, or just your pursuit of it? I find it hard to believe anybody could hate happiness. Maybe as a concept, but the feeling is universally great.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I dont get it, I dont want to play everyone&amp;#39;s game of trying to be happy. I believe its over-rated. Just like the whole &amp;quot;Do what you love and you&amp;#39;ll never work a day in your life&amp;quot; Which I just see as incredibly over-rated and pressured onto people so much I cant even stand it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I definitely understand where you&amp;#39;re coming from. A lot of people have the simple &amp;quot;I think the value of Life is about being happy!&amp;quot; philosophy. I don&amp;#39;t think the value of Life is as simple as that. Happiness, laughter or whatever is great for your health, but it&amp;#39;s not the be all and end all. I think knowledge and education is more important, personally - sometimes it doesn&amp;#39;t help to have knowledge, it doesn&amp;#39;t always make us happy. It often makes us depressed. But you can be an idiot and still be happy. And what&amp;#39;s more valuable, a happy life or a life with a wealth of knowledge and experience?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s so much shit going on in the world that really doesn&amp;#39;t mean anything. Any one person&amp;#39;s happiness doesnt mean anything in the grand scheme of things. Why even try? Why do I have to change myself and live when I can just die instead?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dying doesn&amp;#39;t solve anything. And we can&amp;#39;t change a lot of things - so what? So what if humanity is a needle in a haystack compared to the rest of the Universe?! Instead of thinking we&amp;#39;re insignificant in comparison to the rest of the world, what about the thought that the world around us is significant?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At times I want to seek help, but am angry at having to listen to someone tell me how to live my life. I nearly get so mad I want to punch them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know what you mean, but some people are just providing suggestions on a way of Life. If somebody suggests something to help you manage your depression or anger, it&amp;#39;s still up to you to decide whether or not you want to follow through with the suggestion. Nobody&amp;#39;s forcing you to live the same life, and walk down the same road as them. Besides, a lot of other people have experience in Life that they can pass down so that others don&amp;#39;t make the same mistakes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I just want the pain to end. I don&amp;#39;t care anymore. I just don&amp;#39;t. I&amp;#39;m just trying to find a good way to end it all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How about ending it by working on a legitimate recovery from your depression? That&amp;#39;s where other people&amp;#39;s suggestions come in: they &lt;em&gt;can&lt;/em&gt; help. Why do the same thing over and over when it&amp;#39;s clearly not working?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kzwj", "score_hidden": false, "name": "t1_ch85kvr", "created": 1399078324.0, "author_flair_text": null, "created_utc": 1399074724.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]