[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel worse for complaining but I can&amp;#39;t seem to stop myself. Every day I read the news and see people in far worse parts of the world in much more dire straits. They&amp;#39;re alone, living among plague and warfare, amongst governments intent on their extermination, while my life hasn&amp;#39;t been that bad. I grew up with an emotionally and physically abusive father, true, and I&amp;#39;ve had to deal with worsening physical illness and disability, as well as anxiety issues, but you know what&amp;#39;s got me?&lt;/p&gt;\n\n&lt;p&gt;Pain.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t handle the fact that we aren&amp;#39;t able to stop it when we&amp;#39;re in pain. That might seem kind of odd, but I have worsening RA issues, so I&amp;#39;m constantly in pain. Not a day has gone by for the last six years that I didn&amp;#39;t hurt. Can&amp;#39;t get a decent night&amp;#39;s sleep, god help me if I drink since that just makes it worse, and all the doctors worry about is whether or not I&amp;#39;m going to become an addict, not if I&amp;#39;m actually able to manage the pain. They know I&amp;#39;m suicidal. They know. I&amp;#39;ve told them. I&amp;#39;ve been committed twice. I see a psychologist and a psychiatrist regularly, but there&amp;#39;s not much you can do to fix your head when it&amp;#39;s your body that&amp;#39;s broken. &lt;/p&gt;\n\n&lt;p&gt;So why am I posting here? Well, they took down the optingout sub where I might&amp;#39;ve gotten more genuine responses for one thing. The other is fear. As bad as things are, they can always get worse. And that I think is what&amp;#39;s to blame for the human condition. We fear that anything we do is going to worsen things, and so we do nothing, sitting and suffering as the world and ourselves go to hell through neglect and abuse. Funny thing is, once you&amp;#39;re in pain, all you can do is fear that it&amp;#39;s not going to stop, ever; and you are scarily aware of how much it can get worse. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m sitting here in agony, crying my eyes out, wanting to die but terrified that by some cosmic joke there really will be a hell, and I know that since I&amp;#39;m not even thirty I&amp;#39;ve got a long, long wait to die of natural causes. I&amp;#39;ll likely find the courage to do myself in one of these days. I don&amp;#39;t know whether or not I&amp;#39;m looking forward to it. The idea that the pain might stop makes my mouth water. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I feel worse for complaining but I can't seem to stop myself. Every day I read the news and see people in far worse parts of the world in much more dire straits. They're alone, living among plague and warfare, amongst governments intent on their extermination, while my life hasn't been that bad. I grew up with an emotionally and physically abusive father, true, and I've had to deal with worsening physical illness and disability, as well as anxiety issues, but you know what's got me?\n\nPain.\n\nI can't handle the fact that we aren't able to stop it when we're in pain. That might seem kind of odd, but I have worsening RA issues, so I'm constantly in pain. Not a day has gone by for the last six years that I didn't hurt. Can't get a decent night's sleep, god help me if I drink since that just makes it worse, and all the doctors worry about is whether or not I'm going to become an addict, not if I'm actually able to manage the pain. They know I'm suicidal. They know. I've told them. I've been committed twice. I see a psychologist and a psychiatrist regularly, but there's not much you can do to fix your head when it's your body that's broken. \n\nSo why am I posting here? Well, they took down the optingout sub where I might've gotten more genuine responses for one thing. The other is fear. As bad as things are, they can always get worse. And that I think is what's to blame for the human condition. We fear that anything we do is going to worsen things, and so we do nothing, sitting and suffering as the world and ourselves go to hell through neglect and abuse. Funny thing is, once you're in pain, all you can do is fear that it's not going to stop, ever; and you are scarily aware of how much it can get worse. \n\nSo I'm sitting here in agony, crying my eyes out, wanting to die but terrified that by some cosmic joke there really will be a hell, and I know that since I'm not even thirty I've got a long, long wait to die of natural causes. I'll likely find the courage to do myself in one of these days. I don't know whether or not I'm looking forward to it. The idea that the pain might stop makes my mouth water. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24143h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ThroAway2ThrowHarder", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24143h/cant_handle_it_even_though_people_have_it_much/", "name": "t3_24143h", "created": 1398550027.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24143h/cant_handle_it_even_though_people_have_it_much/", "author_flair_text": null, "title": "Can't handle it, even though people have it much worse off.", "created_utc": 1398521227.0, "ups": 6, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2rt8e", "gilded": 0, "author": "ThroAway2ThrowHarder", "parent_id": "t1_ch2q0nu", "approved_by": null, "body": "PM me and we can talk. Whenever you like. It's easier to speak to someone who's also hurting, I've found, compared to a therapist. Funnily enough, I was a therapist back when I could work. So we might get a bit of both worlds. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PM me and we can talk. Whenever you like. It&amp;#39;s easier to speak to someone who&amp;#39;s also hurting, I&amp;#39;ve found, compared to a therapist. Funnily enough, I was a therapist back when I could work. So we might get a bit of both worlds. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2rt8e", "created": 1398546642.0, "author_flair_text": null, "created_utc": 1398543042.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2q0nu", "gilded": 0, "author": "axiousandalone", "parent_id": "t3_24143h", "approved_by": null, "body": "As fucked up as it is that I posted on here too. I agree with your sentiments. I can't handle this either. I don't think I can handle this. But I honestly reading your post wrenched my heart. I feel for you. I feel. I'm trying not to think of my situation. And if you wanna talk we should talk. That sounds all kinds of fucked up. Two suicidal people talking. I swear my intentions are pure. I still like helping people even tho I think I'm going to off myself in a few. \n*offers hug* ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As fucked up as it is that I posted on here too. I agree with your sentiments. I can&amp;#39;t handle this either. I don&amp;#39;t think I can handle this. But I honestly reading your post wrenched my heart. I feel for you. I feel. I&amp;#39;m trying not to think of my situation. And if you wanna talk we should talk. That sounds all kinds of fucked up. Two suicidal people talking. I swear my intentions are pure. I still like helping people even tho I think I&amp;#39;m going to off myself in a few. \n&lt;em&gt;offers hug&lt;/em&gt; &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2q0nu", "created": 1398542015.0, "author_flair_text": null, "created_utc": 1398538415.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2rfqw", "gilded": 0, "author": "ThroAway2ThrowHarder", "parent_id": "t1_ch2mrxv", "approved_by": null, "body": "Thank you for taking the time to respond. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to respond. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2rfqw", "created": 1398545680.0, "author_flair_text": null, "created_utc": 1398542080.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2mrxv", "gilded": 0, "author": "HP_Housecat", "parent_id": "t3_24143h", "approved_by": null, "body": "Suffering is suffering. The causes of suffering might be comparable, a person can judge what is \"worse.\" (Although I personally think the result is what matters, not the cause.) The suffering itself though, the reaction to those causes, is incomparable, in my opinion. Two people could have a broken leg and react to it very differently. Suffering from your circumstances or experiences isn't a flaw. You didn't ask to feel this way in reaction to your life. You made no choice that brought you to this point.\n\nI also often think about how things truly can become worse. Very often I see life as a downward slope, a steady entropy. I try to live for the stops on the way, the occasional rises. While my life isn't dominated by pain, it is absolutely dominated by fear and what I consider to be its variations. Anger and guilt and humiliation. Even though it may be the central theme to my life, I don't consider that to be all of me. You're not just your pain and fear, as encompassing as they are.\n\nI also apologize if these words seem empty or unhelpful. I truly do hope you find some kind of relief.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Suffering is suffering. The causes of suffering might be comparable, a person can judge what is &amp;quot;worse.&amp;quot; (Although I personally think the result is what matters, not the cause.) The suffering itself though, the reaction to those causes, is incomparable, in my opinion. Two people could have a broken leg and react to it very differently. Suffering from your circumstances or experiences isn&amp;#39;t a flaw. You didn&amp;#39;t ask to feel this way in reaction to your life. You made no choice that brought you to this point.&lt;/p&gt;\n\n&lt;p&gt;I also often think about how things truly can become worse. Very often I see life as a downward slope, a steady entropy. I try to live for the stops on the way, the occasional rises. While my life isn&amp;#39;t dominated by pain, it is absolutely dominated by fear and what I consider to be its variations. Anger and guilt and humiliation. Even though it may be the central theme to my life, I don&amp;#39;t consider that to be all of me. You&amp;#39;re not just your pain and fear, as encompassing as they are.&lt;/p&gt;\n\n&lt;p&gt;I also apologize if these words seem empty or unhelpful. I truly do hope you find some kind of relief.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2mrxv", "created": 1398558833.0, "author_flair_text": null, "created_utc": 1398530033.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2rcki", "gilded": 0, "author": "ThroAway2ThrowHarder", "parent_id": "t1_ch2lta9", "approved_by": null, "body": "Sympathy, commiseration, sharing stories, even people choosing to vent rage: these things I can handle and half-expected. But baseless platitudes, crocodile tears, and logical fallacies just make me see red. They are a disservice to the people on this sub that actually help others, and insult both our intelligences. \n\nEdit: And, out of curiousity, I went to your chatline website and logged on. Good God, it's a wonder that more people in crisis aren't driven over the edge than are saved. The woman to whom I spoke did nothing but patronize me, serve up heaping helpings of the same platitudes you have, and when she brought religion into the conversation she became so offended that I didn't share the same beliefs as she that she cut the line, all while truly believing to the core of her misguided little soul that she was somehow helping. Some people can't be fixed. They're better off dead. Sometimes they need to speak to someone who can see things objectively instead of having an agenda shoved down their throats, and to be told to live in increasing pain until I'm lucky enough to die of natural causes because it fits your worldview and beliefs is the height of cruelty. ", "edited": 1398550602.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sympathy, commiseration, sharing stories, even people choosing to vent rage: these things I can handle and half-expected. But baseless platitudes, crocodile tears, and logical fallacies just make me see red. They are a disservice to the people on this sub that actually help others, and insult both our intelligences. &lt;/p&gt;\n\n&lt;p&gt;Edit: And, out of curiousity, I went to your chatline website and logged on. Good God, it&amp;#39;s a wonder that more people in crisis aren&amp;#39;t driven over the edge than are saved. The woman to whom I spoke did nothing but patronize me, serve up heaping helpings of the same platitudes you have, and when she brought religion into the conversation she became so offended that I didn&amp;#39;t share the same beliefs as she that she cut the line, all while truly believing to the core of her misguided little soul that she was somehow helping. Some people can&amp;#39;t be fixed. They&amp;#39;re better off dead. Sometimes they need to speak to someone who can see things objectively instead of having an agenda shoved down their throats, and to be told to live in increasing pain until I&amp;#39;m lucky enough to die of natural causes because it fits your worldview and beliefs is the height of cruelty. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2rcki", "created": 1398545443.0, "author_flair_text": null, "created_utc": 1398541843.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2lta9", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24143h", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24143h", "score_hidden": false, "name": "t1_ch2lta9", "created": 1398530958.0, "author_flair_text": null, "created_utc": 1398527358.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]