[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just wanted to get this off my chest. Didn&amp;#39;t really know where to post.&lt;/p&gt;\n\n&lt;p&gt;Last Oct my first daughter (8 years old) died in a car accident. She was out with a friend and was killed instantly in a bad accident on the freeway. Husband and I really struggled to come to terms with our grief, I was angry and blamed myself and pushed him away a lot, but we had grief counselling and pushed through.&lt;/p&gt;\n\n&lt;p&gt;Last week my second daughter (5 years old) became drastically ill very suddenly. She has been in the hospital hooked up to an IV drip for the past week and barely conscious. They have found a mass and severe swelling on the brain and have induced a coma whilst trying to reduce the swelling. She is having exploratory surgery on Monday morning if the swelling doesn&amp;#39;t go down enough for clearer scans, but due to the location and extremity we&amp;#39;ve been told that it&amp;#39;s not looking good.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know which is worse, the sudden loss of a child and not being able to say goodbye, or watching one waste away and feeling so helpless and to lose all hope in life being good.&lt;/p&gt;\n\n&lt;p&gt;My husband and mother are trying to be positive but I just can&amp;#39;t. When I&amp;#39;m not at the hospital watching her waste away in front of me I&amp;#39;m at home alone crying, reading story after story of dying children on the internet whilst trying to research.&lt;/p&gt;\n\n&lt;p&gt;My husband has thrown himself into his work, he doesn&amp;#39;t want to talk about it, he just keeps saying she&amp;#39;ll be fine, she has the best doctors, nothings going to happen, I&amp;#39;m being silly, stop worrying - none of those things help me and he can&amp;#39;t stand being in the house with me when I&amp;#39;m crying so he&amp;#39;s been going to work every day, going to the hospital at visiting hours, then going back to work overtime at an empty office until midnight. He gets angry at me because I&amp;#39;m not being positive but I can&amp;#39;t help but prepare myself for the worst.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think my marriage will survive the loss of both our girls and I don&amp;#39;t know if I can take this pain. I don&amp;#39;t know if I want to live in a world where I&amp;#39;ve lost everything that I loved so I&amp;#39;ve made myself the promise that if I lose my little girl, I will bow out. I know it is selfish, I know my husband will struggle, and it will hurt my mother, but I think ultimately they will both understand that I just cannot live with this pain. Making this decision and getting it written down makes it more real to me and makes my current grief easier to bear, because I know that if it becomes unbearable, I have a plan to follow through.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how any human is strong enough to bear the weight of such grief and keep going, but I&amp;#39;m not.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just wanted to get this off my chest. Didn't really know where to post.\n\n\nLast Oct my first daughter (8 years old) died in a car accident. She was out with a friend and was killed instantly in a bad accident on the freeway. Husband and I really struggled to come to terms with our grief, I was angry and blamed myself and pushed him away a lot, but we had grief counselling and pushed through.\n\n\nLast week my second daughter (5 years old) became drastically ill very suddenly. She has been in the hospital hooked up to an IV drip for the past week and barely conscious. They have found a mass and severe swelling on the brain and have induced a coma whilst trying to reduce the swelling. She is having exploratory surgery on Monday morning if the swelling doesn't go down enough for clearer scans, but due to the location and extremity we've been told that it's not looking good.\n\n\nI don't know which is worse, the sudden loss of a child and not being able to say goodbye, or watching one waste away and feeling so helpless and to lose all hope in life being good.\n\n\nMy husband and mother are trying to be positive but I just can't. When I'm not at the hospital watching her waste away in front of me I'm at home alone crying, reading story after story of dying children on the internet whilst trying to research.\n\n\nMy husband has thrown himself into his work, he doesn't want to talk about it, he just keeps saying she'll be fine, she has the best doctors, nothings going to happen, I'm being silly, stop worrying - none of those things help me and he can't stand being in the house with me when I'm crying so he's been going to work every day, going to the hospital at visiting hours, then going back to work overtime at an empty office until midnight. He gets angry at me because I'm not being positive but I can't help but prepare myself for the worst.\n\n\nI don't think my marriage will survive the loss of both our girls and I don't know if I can take this pain. I don't know if I want to live in a world where I've lost everything that I loved so I've made myself the promise that if I lose my little girl, I will bow out. I know it is selfish, I know my husband will struggle, and it will hurt my mother, but I think ultimately they will both understand that I just cannot live with this pain. Making this decision and getting it written down makes it more real to me and makes my current grief easier to bear, because I know that if it becomes unbearable, I have a plan to follow through.\n\n\nI don't know how any human is strong enough to bear the weight of such grief and keep going, but I'm not.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24m9sn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "12398123", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24m9sn/cant_cope_with_this_grief/", "name": "t3_24m9sn", "created": 1399151120.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24m9sn/cant_cope_with_this_grief/", "author_flair_text": null, "title": "Can't cope with this grief.", "created_utc": 1399122320.0, "ups": 9, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8izhx", "gilded": 0, "author": "jrrhea", "parent_id": "t3_24m9sn", "approved_by": null, "body": "I am so sorry to hear about the loss of your first child and and your second daughter's current medical crisis.  My thoughts are with you.\n\nYou need to reach out for help from people who understand what you're going through, what you have been through.  People who've gone through it themselves and survived.  At least take that step before doing anything else.  \n\nhttp://www.lossofachild.org/resourcesforparents.htm\n\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry to hear about the loss of your first child and and your second daughter&amp;#39;s current medical crisis.  My thoughts are with you.&lt;/p&gt;\n\n&lt;p&gt;You need to reach out for help from people who understand what you&amp;#39;re going through, what you have been through.  People who&amp;#39;ve gone through it themselves and survived.  At least take that step before doing anything else.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.lossofachild.org/resourcesforparents.htm\"&gt;http://www.lossofachild.org/resourcesforparents.htm&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24m9sn", "score_hidden": false, "name": "t1_ch8izhx", "created": 1399156938.0, "author_flair_text": null, "created_utc": 1399128138.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8hji7", "gilded": 0, "author": "loserforlife", "parent_id": "t3_24m9sn", "approved_by": null, "body": "Thank you for sharing your story.  You are a very strong person, I have not experienced this type of grief before, and I want to commend you on your honesty and candidness. \n\nI would like to help.  Please tell me how I can help.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing your story.  You are a very strong person, I have not experienced this type of grief before, and I want to commend you on your honesty and candidness. &lt;/p&gt;\n\n&lt;p&gt;I would like to help.  Please tell me how I can help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24m9sn", "score_hidden": false, "name": "t1_ch8hji7", "created": 1399151574.0, "author_flair_text": null, "created_utc": 1399122774.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8htun", "gilded": 0, "author": "Moonfarmer", "parent_id": "t3_24m9sn", "approved_by": null, "body": "Hey, I can relate to your situation, 2 years ago my sister was involved in an accident as well, she was 19. Although she survived it, the operation she had to go through included brain surgery etc.\n\n  Like you, when I was alone at home it hit me real hard, constantly worrying that my phone would ring suddenly just for me to hear some bad news... I had no will to carry on as well, and visited my sister as soon as the hospital allowed me to do so.\n\n  Now I wouldnt ask you to not kill yourself. Most people who tell you that do not understand what it is really like to lose someone you really love. When they are gone, a part of you is gone as well.\n\nDuring my time, I found that talking to God helped. Now I am not asking you to believe in God, but i do believe that talking to him can help alleviate some stress, and also lessen the blame on yourself.\n\nHaving said that, i have to salute you. You are a stronger person than I am and I know it. But have hope please, dont off yourself before your daughter recovers at least :) okay? \n\nI will pray for you, please keep in touch!\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I can relate to your situation, 2 years ago my sister was involved in an accident as well, she was 19. Although she survived it, the operation she had to go through included brain surgery etc.&lt;/p&gt;\n\n&lt;p&gt;Like you, when I was alone at home it hit me real hard, constantly worrying that my phone would ring suddenly just for me to hear some bad news... I had no will to carry on as well, and visited my sister as soon as the hospital allowed me to do so.&lt;/p&gt;\n\n&lt;p&gt;Now I wouldnt ask you to not kill yourself. Most people who tell you that do not understand what it is really like to lose someone you really love. When they are gone, a part of you is gone as well.&lt;/p&gt;\n\n&lt;p&gt;During my time, I found that talking to God helped. Now I am not asking you to believe in God, but i do believe that talking to him can help alleviate some stress, and also lessen the blame on yourself.&lt;/p&gt;\n\n&lt;p&gt;Having said that, i have to salute you. You are a stronger person than I am and I know it. But have hope please, dont off yourself before your daughter recovers at least :) okay? &lt;/p&gt;\n\n&lt;p&gt;I will pray for you, please keep in touch!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24m9sn", "score_hidden": false, "name": "t1_ch8htun", "created": 1399152824.0, "author_flair_text": null, "created_utc": 1399124024.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8j7nl", "gilded": 0, "author": "VesperWae", "parent_id": "t3_24m9sn", "approved_by": null, "body": "Your story really makes me sad, i'm so very sorry that you're going through all of this. I'm not telling you that I know what you're going through because I simply don't. But I can imagine that you're feeling powerless, angry and incredibly miserable. You're a strong person, because you're still here. I understand this grief is too much for you and you can't handle this. You don't know what to do anymore. Is there someone (a therapist) who you can visit? Someone who can help you and tell you how to handle this misery? My thoughts are with you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story really makes me sad, i&amp;#39;m so very sorry that you&amp;#39;re going through all of this. I&amp;#39;m not telling you that I know what you&amp;#39;re going through because I simply don&amp;#39;t. But I can imagine that you&amp;#39;re feeling powerless, angry and incredibly miserable. You&amp;#39;re a strong person, because you&amp;#39;re still here. I understand this grief is too much for you and you can&amp;#39;t handle this. You don&amp;#39;t know what to do anymore. Is there someone (a therapist) who you can visit? Someone who can help you and tell you how to handle this misery? My thoughts are with you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24m9sn", "score_hidden": false, "name": "t1_ch8j7nl", "created": 1399157627.0, "author_flair_text": null, "created_utc": 1399128827.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]