[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been dealing with depression and anxiety for as long as I can remember. been on Paxil Prozac and now effexor. Various suicide attempts through out the years but many within this month. sleeping pill overdose 2 weeks ago, just slept it off dealt with the pain. A week later I completely break down dont know what to do so I go to the ER. Get sent to a psych ward for a week. Get home friday and everything seems ok but quickly I just spiral back down usually smoking weed helps but it cant even help me now. so I decide to chug some zzzquill, sleep through the day, wake up just completely in sorrow that I&amp;#39;ve failed again so I get more get some alcohol and down more just sleep hoping that I wont wake up, but here I am waking up again the only thoughts are suicide wishing i was 21 and could just go buy a gun and end it to finally be rid of this pain to not have to push myself for an hour to just get out of bed. i havent worked in weeks and if i dont go in tomorrow Im going to lose it (just a part time min wage job) but its just going to lead me to attempt again and again until I finally get it right&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been dealing with depression and anxiety for as long as I can remember. been on Paxil Prozac and now effexor. Various suicide attempts through out the years but many within this month. sleeping pill overdose 2 weeks ago, just slept it off dealt with the pain. A week later I completely break down dont know what to do so I go to the ER. Get sent to a psych ward for a week. Get home friday and everything seems ok but quickly I just spiral back down usually smoking weed helps but it cant even help me now. so I decide to chug some zzzquill, sleep through the day, wake up just completely in sorrow that I've failed again so I get more get some alcohol and down more just sleep hoping that I wont wake up, but here I am waking up again the only thoughts are suicide wishing i was 21 and could just go buy a gun and end it to finally be rid of this pain to not have to push myself for an hour to just get out of bed. i havent worked in weeks and if i dont go in tomorrow Im going to lose it (just a part time min wage job) but its just going to lead me to attempt again and again until I finally get it right", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252jbx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BruceDShark", "media": null, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252jbx/cant_function_im_going_to_lose_my_job/", "name": "t3_252jbx", "created": 1399609016.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252jbx/cant_function_im_going_to_lose_my_job/", "author_flair_text": null, "title": "cant function Im going to lose my job", "created_utc": 1399580216.0, "ups": 19, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd338q", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_252jbx", "approved_by": null, "body": "Hi. I'm so sorry you're having such a rough go of it - it sounds like hell. Have you tried talking to someone? Whether a professional or a close friend/family member, if you can find someone you trust and be very honest with them about your situation, it can work wonders. Sometimes you just have so much rage, sadness and confusion pent up inside of you, it's hard to even articulate how awful you feel and why. Start small - focus on one issue you are having and try to get to the root of it. Why exactly do you feel that way? Is there some trigger or outside factor that is causing it, or is it totally unknown and internal? Why are you turning to other depressants/escapes to not feel what you are feeling? Even starting here - continuing to talk to us (or even PM me if you want to talk more privately) - is a good place to begin. We're here for you - just reach out and I'm sure someone will catch you.\n\nTake good care.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I&amp;#39;m so sorry you&amp;#39;re having such a rough go of it - it sounds like hell. Have you tried talking to someone? Whether a professional or a close friend/family member, if you can find someone you trust and be very honest with them about your situation, it can work wonders. Sometimes you just have so much rage, sadness and confusion pent up inside of you, it&amp;#39;s hard to even articulate how awful you feel and why. Start small - focus on one issue you are having and try to get to the root of it. Why exactly do you feel that way? Is there some trigger or outside factor that is causing it, or is it totally unknown and internal? Why are you turning to other depressants/escapes to not feel what you are feeling? Even starting here - continuing to talk to us (or even PM me if you want to talk more privately) - is a good place to begin. We&amp;#39;re here for you - just reach out and I&amp;#39;m sure someone will catch you.&lt;/p&gt;\n\n&lt;p&gt;Take good care.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252jbx", "score_hidden": false, "name": "t1_chd338q", "created": 1399614593.0, "author_flair_text": null, "created_utc": 1399585793.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdaiun", "gilded": 0, "author": "oddlyoutofplace", "parent_id": "t3_252jbx", "approved_by": null, "body": "Ive had 12 jobs in 10 years..  I am on anti depressants as well.. I can never seem to find my place, but you realize after a while it's not about that. It doesn't get a lot easier, but it does get more manageable. Message me, love to talk anytime. get real bad, call... real real bad..... have 2 extra bedrooms.. Ive had a 22 in my mouth more then a few times.. can tell you that no job is worth it.. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ive had 12 jobs in 10 years..  I am on anti depressants as well.. I can never seem to find my place, but you realize after a while it&amp;#39;s not about that. It doesn&amp;#39;t get a lot easier, but it does get more manageable. Message me, love to talk anytime. get real bad, call... real real bad..... have 2 extra bedrooms.. Ive had a 22 in my mouth more then a few times.. can tell you that no job is worth it.. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252jbx", "score_hidden": false, "name": "t1_chdaiun", "created": 1399630114.0, "author_flair_text": null, "created_utc": 1399601314.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]