[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been fighting a medical condition for a long time (will be 10 years in June), and it&amp;#39;s finally worn me down to the point where objectively, I don&amp;#39;t see the point in continuing my life. The condition, fibromyalgia, has taken almost everything from me. When I was first diagnosed, I fought back and lived life as normal as I could. I finished school, went to the gym, moved across the country and got a job. But every year, the pain has gotten worse. Physical pain. It hurts to type this that&amp;#39;s how much it fucking sucks. I know I&amp;#39;m depressed, too. Obviously. Over the past few months, I&amp;#39;ve alienated the last of my friends. I just go home and try to sleep, but I can&amp;#39;t sleep unless I take sleeping pills, and my hands and feet hurt so much in the middle of the night that I seriously consider taking the whole bottle of pills and washing it down with a fifth of bourbon. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried counseling and psychiatry over a dozen times- many times for a year or longer. Nobody has been able to help me, and sometimes they even admit that they can&amp;#39;t, and refer me to medical doctors that also cannot help. &lt;/p&gt;\n\n&lt;p&gt;I feel I will lose my job any day now. I haven&amp;#39;t been a productive employee in weeks. I have disability benefits, but I cannot find the courage to admit to my boss that I need to use them. Up to 6 months in paid medical leave and a lifetime of 50% salary if I can prove I&amp;#39;m medically disabled. But what is the point of that? So I can spend the whole day staring at the wall, wishing I healthy and able to contribute to the world?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just in this catatonic state where all I do is stare. I cannot function anymore as a human. It took me 50 minutes to put on one sock this morning, for fuck&amp;#39;s sake. &lt;/p&gt;\n\n&lt;p&gt;Thanks for listening. Everyone who wades through all this depressing shit is a saint, in my book.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been fighting a medical condition for a long time (will be 10 years in June), and it's finally worn me down to the point where objectively, I don't see the point in continuing my life. The condition, fibromyalgia, has taken almost everything from me. When I was first diagnosed, I fought back and lived life as normal as I could. I finished school, went to the gym, moved across the country and got a job. But every year, the pain has gotten worse. Physical pain. It hurts to type this that's how much it fucking sucks. I know I'm depressed, too. Obviously. Over the past few months, I've alienated the last of my friends. I just go home and try to sleep, but I can't sleep unless I take sleeping pills, and my hands and feet hurt so much in the middle of the night that I seriously consider taking the whole bottle of pills and washing it down with a fifth of bourbon. \n\nI've tried counseling and psychiatry over a dozen times- many times for a year or longer. Nobody has been able to help me, and sometimes they even admit that they can't, and refer me to medical doctors that also cannot help. \n\nI feel I will lose my job any day now. I haven't been a productive employee in weeks. I have disability benefits, but I cannot find the courage to admit to my boss that I need to use them. Up to 6 months in paid medical leave and a lifetime of 50% salary if I can prove I'm medically disabled. But what is the point of that? So I can spend the whole day staring at the wall, wishing I healthy and able to contribute to the world?\n\nI'm just in this catatonic state where all I do is stare. I cannot function anymore as a human. It took me 50 minutes to put on one sock this morning, for fuck's sake. \n\nThanks for listening. Everyone who wades through all this depressing shit is a saint, in my book.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23sp4x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "fibroaway", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23sp4x/cant_go_on_like_this_but_too_weakscared_to_pull/", "name": "t3_23sp4x", "created": 1398313017.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23sp4x/cant_go_on_like_this_but_too_weakscared_to_pull/", "author_flair_text": null, "title": "Can't go on like this but too weak/scared to pull the trigger", "created_utc": 1398284217.0, "ups": 11, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch078t9", "gilded": 0, "author": "SleeplessSurvivor", "parent_id": "t3_23sp4x", "approved_by": null, "body": "Hey.  I'm really sorry to hear your feel so bad.  I suffer from chronic pain as well.  I don't know if you'd like to talk here or in private.  I know certain things can be touchy so, feel free to leave me a PM and we can talk there instead.  I know it's hard to admit to needing help physically. I'm 19 but, most days, I feel closer to 80. I hate asking for any sort of help though.  You should talk to your boss, in my opinion.  It makes my pain worse when I work all day, perhaps it would offer you even a little relief to get those disability benefits so you can work on feeling better.  It's definitely not an easy battle and it's even harder without support. I can be your friend though, your shoulder to lean on.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey.  I&amp;#39;m really sorry to hear your feel so bad.  I suffer from chronic pain as well.  I don&amp;#39;t know if you&amp;#39;d like to talk here or in private.  I know certain things can be touchy so, feel free to leave me a PM and we can talk there instead.  I know it&amp;#39;s hard to admit to needing help physically. I&amp;#39;m 19 but, most days, I feel closer to 80. I hate asking for any sort of help though.  You should talk to your boss, in my opinion.  It makes my pain worse when I work all day, perhaps it would offer you even a little relief to get those disability benefits so you can work on feeling better.  It&amp;#39;s definitely not an easy battle and it&amp;#39;s even harder without support. I can be your friend though, your shoulder to lean on.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch078t9", "created": 1398288364.0, "author_flair_text": null, "created_utc": 1398284764.0, "distinguished": null, "num_reports": null, "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0iv0n", "gilded": 0, "author": "sarsbran", "parent_id": "t3_23sp4x", "approved_by": null, "body": "Hey.  Fellow chronic pain sufferer here--lupus.  It sucks.  Here to talk if you need someone!  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey.  Fellow chronic pain sufferer here--lupus.  It sucks.  Here to talk if you need someone!  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch0iv0n", "created": 1398337870.0, "author_flair_text": null, "created_utc": 1398309070.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0cj6o", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_23sp4x", "approved_by": null, "body": "Hi, I want to reiterate what Sleepless said below - I can't even begin to imagine how much pain you must be in. If you did find yourself too weak to work, and do go on disability, there are still a lot of amazing things you could do that would cause you a lot less torment. You could help out with volunteer organizations or other such opportunities. Many of these orgs have very low-stress, low-physical positions that could probably be done from your own home (coordinator, outreach, etc.) It would be a wonderful way to keep contributing and feeling like a functional human being. \n\nAs for the physical pain, is there nothing the doctors can do? Like pain meds or something?\n\nThe emotional/psychological struggle is something I'm much more familiar with. I suffered from Anorexia Nervosa for many, many years, and did counseling almost the entire time. There were times when I thought it was total BS and wasn't getting me anywhere. But I kept at it, and have noticed a drastic, albeit very gradual, improvement in every aspect of my life. \n\nI hope this message reaches you in good spirits, please let us know if there's anything we can do for you! Stay strong and remember that you are ALWAYS worth living, no matter how difficult it is to see it (trust me...I know)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I want to reiterate what Sleepless said below - I can&amp;#39;t even begin to imagine how much pain you must be in. If you did find yourself too weak to work, and do go on disability, there are still a lot of amazing things you could do that would cause you a lot less torment. You could help out with volunteer organizations or other such opportunities. Many of these orgs have very low-stress, low-physical positions that could probably be done from your own home (coordinator, outreach, etc.) It would be a wonderful way to keep contributing and feeling like a functional human being. &lt;/p&gt;\n\n&lt;p&gt;As for the physical pain, is there nothing the doctors can do? Like pain meds or something?&lt;/p&gt;\n\n&lt;p&gt;The emotional/psychological struggle is something I&amp;#39;m much more familiar with. I suffered from Anorexia Nervosa for many, many years, and did counseling almost the entire time. There were times when I thought it was total BS and wasn&amp;#39;t getting me anywhere. But I kept at it, and have noticed a drastic, albeit very gradual, improvement in every aspect of my life. &lt;/p&gt;\n\n&lt;p&gt;I hope this message reaches you in good spirits, please let us know if there&amp;#39;s anything we can do for you! Stay strong and remember that you are ALWAYS worth living, no matter how difficult it is to see it (trust me...I know)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch0cj6o", "created": 1398324454.0, "author_flair_text": null, "created_utc": 1398295654.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0jvtl", "gilded": 0, "author": "Birdofswag", "parent_id": "t3_23sp4x", "approved_by": null, "body": "This is my first reddit post and landed here randomly and I must say I'm in the same boat. I suffer from fibromyalgia as well and it's really hard when people tell you the usual exercise more, eat better, do this do that. None of it works! What's keeps me going is finding ways that I can help people. I know it sounds corny volunteering and stuff but it helps me stay mentally together knowing I'm not living a horrible existence. I've tried taking my life before and there must be a reason I'm still here so the search is what keeps me going. Today I literally could not get out of bed the pain was too much but I still tried to go out and do something even for a few minutes so I didn't dwell on the fact that I was in bed in absolute agony for 99% of it. Like I said I'm new to reddit but I just thought I'd tell you you're not alone and I hope that helped even a tiny bit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is my first reddit post and landed here randomly and I must say I&amp;#39;m in the same boat. I suffer from fibromyalgia as well and it&amp;#39;s really hard when people tell you the usual exercise more, eat better, do this do that. None of it works! What&amp;#39;s keeps me going is finding ways that I can help people. I know it sounds corny volunteering and stuff but it helps me stay mentally together knowing I&amp;#39;m not living a horrible existence. I&amp;#39;ve tried taking my life before and there must be a reason I&amp;#39;m still here so the search is what keeps me going. Today I literally could not get out of bed the pain was too much but I still tried to go out and do something even for a few minutes so I didn&amp;#39;t dwell on the fact that I was in bed in absolute agony for 99% of it. Like I said I&amp;#39;m new to reddit but I just thought I&amp;#39;d tell you you&amp;#39;re not alone and I hope that helped even a tiny bit.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch0jvtl", "created": 1398315013.0, "author_flair_text": null, "created_utc": 1398311413.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0qy1q", "gilded": 0, "author": "DrTeaHC", "parent_id": "t3_23sp4x", "approved_by": null, "body": "May I ask what state you live in. If it is a medical marijuana state you may want to try that for your pain. I've heard that it can be helpful to people with your condition and getting off prescription pills might make you feel a bit better upstairs. I don't know the severity of your condition but the right strain could fight the pain you experience and combat the depressing thoughts. You should definitely talk to your boss and get your benefits if you're entitled to them. Just because you're not working doesn't mean you have to just stare at the wall. I'm sure you could find something to bring some light into your life.\nhttp://www.theweedblog.com/which-medical-marijuana-strains-are-the-best-for-fibromyalgia/\nnot sure if this helps but its something to think about.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May I ask what state you live in. If it is a medical marijuana state you may want to try that for your pain. I&amp;#39;ve heard that it can be helpful to people with your condition and getting off prescription pills might make you feel a bit better upstairs. I don&amp;#39;t know the severity of your condition but the right strain could fight the pain you experience and combat the depressing thoughts. You should definitely talk to your boss and get your benefits if you&amp;#39;re entitled to them. Just because you&amp;#39;re not working doesn&amp;#39;t mean you have to just stare at the wall. I&amp;#39;m sure you could find something to bring some light into your life.\n&lt;a href=\"http://www.theweedblog.com/which-medical-marijuana-strains-are-the-best-for-fibromyalgia/\"&gt;http://www.theweedblog.com/which-medical-marijuana-strains-are-the-best-for-fibromyalgia/&lt;/a&gt;\nnot sure if this helps but its something to think about.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch0qy1q", "created": 1398345820.0, "author_flair_text": null, "created_utc": 1398342220.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0so13", "gilded": 0, "author": "Throwaway4secretshit", "parent_id": "t3_23sp4x", "approved_by": null, "body": "Do the thing for your disability benefits.  Fuck what your boss thinks; you paid for that shit, it's there for a reason. \n\nAlso, bosses can be good people too. Tell him you're going thru some shit. It's his job to understand and act accordingly.  \n\nSo take the disability pay, sit around and do nothing for a while.  Play games. Smoke weed.  Something. When ur tired of do nothing then try doing something that matters or makes money like writing or web design.  Or just keep being a lazy fucker and enjoy not having to get up in the morning for work ever again.  \n\nAs far as the pain goes, I also suffer from chronic pain. I got sick of the docs telling me I can't have strong pain killers and found my own ways of dealing with it. Check out /r/kratom I haven't had an rx for pain for 2 yrs now cuz that shit helps.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do the thing for your disability benefits.  Fuck what your boss thinks; you paid for that shit, it&amp;#39;s there for a reason. &lt;/p&gt;\n\n&lt;p&gt;Also, bosses can be good people too. Tell him you&amp;#39;re going thru some shit. It&amp;#39;s his job to understand and act accordingly.  &lt;/p&gt;\n\n&lt;p&gt;So take the disability pay, sit around and do nothing for a while.  Play games. Smoke weed.  Something. When ur tired of do nothing then try doing something that matters or makes money like writing or web design.  Or just keep being a lazy fucker and enjoy not having to get up in the morning for work ever again.  &lt;/p&gt;\n\n&lt;p&gt;As far as the pain goes, I also suffer from chronic pain. I got sick of the docs telling me I can&amp;#39;t have strong pain killers and found my own ways of dealing with it. Check out &lt;a href=\"/r/kratom\"&gt;/r/kratom&lt;/a&gt; I haven&amp;#39;t had an rx for pain for 2 yrs now cuz that shit helps.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23sp4x", "score_hidden": false, "name": "t1_ch0so13", "created": 1398351267.0, "author_flair_text": null, "created_utc": 1398347667.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]