[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve come to the conclusion that I don&amp;#39;t want to live with myself. I don&amp;#39;t think it&amp;#39;s fair that people can leave me, cut themselves away from me, but I am stuck with me. The only thing stopping me is an obligation to the people that used to be a part of my life. Those people that refuse to help all the way up until I attempt it, then they&amp;#39;ll come running to &amp;quot;save me&amp;quot;, to force me to continue living with myself. &lt;/p&gt;\n\n&lt;p&gt;My girlfriend of 7 years left out of the blue recently. My friends have all gone over the years. They all have paired up with a partner and disappeared, getting on with life. What little family I do have are distant and disappearing. &lt;/p&gt;\n\n&lt;p&gt;The problem I have is that I have &amp;quot;good attributes&amp;quot;. I&amp;#39;m a good musician, very well travelled, articulate, not bad looking, funny, blah blah. I tell myself I am these things to give myself a bit of a boost, to lift myself out of a hole and I know that all the good things I say are true. Problem is that despite all of these &amp;quot;good&amp;quot; things about me, everyone always leaves me. She couldn&amp;#39;t love me. She knew me better than anyone in the world and if she couldn&amp;#39;t love me how can I? Why can she leave me and I am stuck with me? Why am I alone again for another night in a row? Why can&amp;#39;t I leave myself, cut myself, like everyone else does so much? If I get another girlfriend how long before she leaves me? Doesn&amp;#39;t matter when because she &lt;em&gt;will&lt;/em&gt; leave, just like everyone else does.&lt;/p&gt;\n\n&lt;p&gt;My counsellor tells me I have to learn to live for myself, I just can&amp;#39;t see why I should do that. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've come to the conclusion that I don't want to live with myself. I don't think it's fair that people can leave me, cut themselves away from me, but I am stuck with me. The only thing stopping me is an obligation to the people that used to be a part of my life. Those people that refuse to help all the way up until I attempt it, then they'll come running to \"save me\", to force me to continue living with myself. \n\nMy girlfriend of 7 years left out of the blue recently. My friends have all gone over the years. They all have paired up with a partner and disappeared, getting on with life. What little family I do have are distant and disappearing. \n\nThe problem I have is that I have \"good attributes\". I'm a good musician, very well travelled, articulate, not bad looking, funny, blah blah. I tell myself I am these things to give myself a bit of a boost, to lift myself out of a hole and I know that all the good things I say are true. Problem is that despite all of these \"good\" things about me, everyone always leaves me. She couldn't love me. She knew me better than anyone in the world and if she couldn't love me how can I? Why can she leave me and I am stuck with me? Why am I alone again for another night in a row? Why can't I leave myself, cut myself, like everyone else does so much? If I get another girlfriend how long before she leaves me? Doesn't matter when because she *will* leave, just like everyone else does.\n\nMy counsellor tells me I have to learn to live for myself, I just can't see why I should do that. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zlzm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stephaine", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zlzm/cant_think_of_a_reason_not_to_do_it/", "name": "t3_23zlzm", "created": 1398493955.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zlzm/cant_think_of_a_reason_not_to_do_it/", "author_flair_text": null, "title": "Can't think of a reason not to do it.", "created_utc": 1398465155.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]