[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 27 and need help. So I dropped out of school at 21 when my mom died (bc I&amp;#39;m a piece of shit and drinking was more important than my future). I left school with a great GPA in physics. Well, I was working for a while and got bored so I decided to go back to school. I enrolled in a B.S. electrical engineering program, got accepted. For 2 years I did great with a 3.8 breezing through with a full time job. Well, my girl of 8 years left me and I flunked a semester, (again, drinking with a sprinkling of trees). I quit, with 2 semesters to  go. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to now, I work as an electronics repair specialist in my own shop. I loathe work as its the same drollery every damned day but I am over 35,000$ in debt with nothing to show...and if I close shop, I&amp;#39;ll starve. I am relatively fit and not hideous, but I have 0 confidence with women. I think this is bc I was with my ex through some formative social years... The last girl I brought home it got soft right in the moment and I havent talked to her since due to embarrassment.  I have no support network as my friends are terrible and everyone in my family is preoccupied with their lives. My roommate is a cool guy but he is a juggalo and his intellectual pursuits include naming 10 strains of pot and drinking faygo. My friend  is ok...we jam out on guitar, but he only plays dead music and has the worst temper. He is basically a child and I cannot talk to him about ANYTHING emotional.&lt;/p&gt;\n\n&lt;p&gt;So, yeah, I&amp;#39;m at a breaking point. I think a lot of it stems from me putting all my eggs in one basket. My ex was my support network and my best friend, not too mention we lived together, were engaged, etc. We&amp;#39;ve been done for 1.5 yrs. but she calls me everytime she is drinking. We are still &amp;quot;friends&amp;quot;... I guess. I don&amp;#39;t know anymore. I&amp;#39;ve struggled with depression all my life as I grew up in a really shifty household (drug dealers, crack, meth, stabbings, you name it, I&amp;#39;ve seen it). My mom OD&amp;#39;D. I&amp;#39;ve managed to stay away from all that stuff but I do smoke weed and drink heavily. I feel like a zombie and nothing helps me. It&amp;#39;s hard to feel anything anymore. I can&amp;#39;t see a clinic bc I don&amp;#39;t have the money. I ultimately want to finish school but it seems like a far away pipe dream now. I&amp;#39;m aimless and I think of suicide daily. I don&amp;#39;t see much of a future and don&amp;#39;t want to be a burden to anyone. I don&amp;#39;t outwardly show any of this, in fact this would be a surprise to anyone but my ex. Please, has anyone out there ever gone through any of this? How can I have hope in this world? Why should I even try with so much debt and no real future? I feel like I&amp;#39;m at the end and I&amp;#39;m ok with it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 27 and need help. So I dropped out of school at 21 when my mom died (bc I'm a piece of shit and drinking was more important than my future). I left school with a great GPA in physics. Well, I was working for a while and got bored so I decided to go back to school. I enrolled in a B.S. electrical engineering program, got accepted. For 2 years I did great with a 3.8 breezing through with a full time job. Well, my girl of 8 years left me and I flunked a semester, (again, drinking with a sprinkling of trees). I quit, with 2 semesters to  go. \n\nFast forward to now, I work as an electronics repair specialist in my own shop. I loathe work as its the same drollery every damned day but I am over 35,000$ in debt with nothing to show...and if I close shop, I'll starve. I am relatively fit and not hideous, but I have 0 confidence with women. I think this is bc I was with my ex through some formative social years... The last girl I brought home it got soft right in the moment and I havent talked to her since due to embarrassment.  I have no support network as my friends are terrible and everyone in my family is preoccupied with their lives. My roommate is a cool guy but he is a juggalo and his intellectual pursuits include naming 10 strains of pot and drinking faygo. My friend  is ok...we jam out on guitar, but he only plays dead music and has the worst temper. He is basically a child and I cannot talk to him about ANYTHING emotional.\n\nSo, yeah, I'm at a breaking point. I think a lot of it stems from me putting all my eggs in one basket. My ex was my support network and my best friend, not too mention we lived together, were engaged, etc. We've been done for 1.5 yrs. but she calls me everytime she is drinking. We are still \"friends\"... I guess. I don't know anymore. I've struggled with depression all my life as I grew up in a really shifty household (drug dealers, crack, meth, stabbings, you name it, I've seen it). My mom OD'D. I've managed to stay away from all that stuff but I do smoke weed and drink heavily. I feel like a zombie and nothing helps me. It's hard to feel anything anymore. I can't see a clinic bc I don't have the money. I ultimately want to finish school but it seems like a far away pipe dream now. I'm aimless and I think of suicide daily. I don't see much of a future and don't want to be a burden to anyone. I don't outwardly show any of this, in fact this would be a surprise to anyone but my ex. Please, has anyone out there ever gone through any of this? How can I have hope in this world? Why should I even try with so much debt and no real future? I feel like I'm at the end and I'm ok with it", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259n0v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throneaway27", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259n0v/circling_the_drain/", "name": "t3_259n0v", "created": 1399822888.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259n0v/circling_the_drain/", "author_flair_text": null, "title": "Circling the drain.", "created_utc": 1399794088.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf25tf", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t3_259n0v", "approved_by": null, "body": "I'm not a proper mind to fully help you but I wanted to add one thing that maybe will help.\n\nThere are programs out there in college and universities that will accept your work experiences as course credits. This can help your graduate and earn your degree. I can't refer you to any specific schools, but the possibility does exist. You may find that a school may only require you to take a few more courses to complete your degree - something much more manageable than two more entire semesters. If this is a really pressing issue, and one that could potentially relieve a lot of stress, I would suggest you at least investigate the possibility.\n\nLike I said earlier, I'm not in the best frame of mind to be giving advice but I happened by chance to read yours and felt compelled to add that bit. Hope it helped a tiny bit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a proper mind to fully help you but I wanted to add one thing that maybe will help.&lt;/p&gt;\n\n&lt;p&gt;There are programs out there in college and universities that will accept your work experiences as course credits. This can help your graduate and earn your degree. I can&amp;#39;t refer you to any specific schools, but the possibility does exist. You may find that a school may only require you to take a few more courses to complete your degree - something much more manageable than two more entire semesters. If this is a really pressing issue, and one that could potentially relieve a lot of stress, I would suggest you at least investigate the possibility.&lt;/p&gt;\n\n&lt;p&gt;Like I said earlier, I&amp;#39;m not in the best frame of mind to be giving advice but I happened by chance to read yours and felt compelled to add that bit. Hope it helped a tiny bit.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259n0v", "score_hidden": false, "name": "t1_chf25tf", "created": 1399826076.0, "author_flair_text": null, "created_utc": 1399797276.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]