[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I don&amp;#39;t really know what to say, or even why I am writing this. I guess I am hoping that expressing it will help me deal? Who knows!&lt;/p&gt;\n\n&lt;p&gt;I am a 25 and have struggled with.....something, everything, for a long, long time. I have never felt mentally stable. I have had an undiagnosed eating disorder for 4 years now. It isn&amp;#39;t anorexia, or bulimia. It is EDNOS, which I guess could be described as somewhere in between. I am always either heavily restricting to around 300 calories a day, binge eating like there is no tomorrow or binge eating and purging. I am never NOT doing any of these things and it is so exhausting. I am exhausted. But I can&amp;#39;t stop, I have tried so hard but it has such a strong grasp on me. I am deathly afraid of going to treatment and losing control of myself, which is ridiculous given that I have barely any control in the first place. I feel so desperate.&lt;/p&gt;\n\n&lt;p&gt;I have social anxiety, so find it hard to make friends, and on the rare occasion I do make friends, I find keeping them damn near impossible because I only ever think about food, weight and exercise. Not fun topics, but that is my life. &lt;/p&gt;\n\n&lt;p&gt;Sometimes, more and more frequently I have been finding some peace. But this peace comes when I think about dying. Not so much killing myself, but just imagining not existing anymore, not having to feel this huge strain, this exhausting, all consuming strain. It is becoming that my eating disorder is no longer about looking good, it is now about the possibility of just disappearing ceasing to exist. It seems like such an easier option. &lt;/p&gt;\n\n&lt;p&gt;I am also in college studying law, but even that just seems so pointless now. I mean at the end of the day what is the point? The percentage of my life that I have spent happy is drastically less than the percentage I have spent hating every single moment. Why continue? I am physically attractive so I don&amp;#39;t have trouble finding boyfriends, but I get so bored, it all just seems so futile. I am coming to a terrifying realisation, but the most terrifying thing about it is how appealing and peaceful I find it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I don't really know what to say, or even why I am writing this. I guess I am hoping that expressing it will help me deal? Who knows!\n\nI am a 25 and have struggled with.....something, everything, for a long, long time. I have never felt mentally stable. I have had an undiagnosed eating disorder for 4 years now. It isn't anorexia, or bulimia. It is EDNOS, which I guess could be described as somewhere in between. I am always either heavily restricting to around 300 calories a day, binge eating like there is no tomorrow or binge eating and purging. I am never NOT doing any of these things and it is so exhausting. I am exhausted. But I can't stop, I have tried so hard but it has such a strong grasp on me. I am deathly afraid of going to treatment and losing control of myself, which is ridiculous given that I have barely any control in the first place. I feel so desperate.\n\n\nI have social anxiety, so find it hard to make friends, and on the rare occasion I do make friends, I find keeping them damn near impossible because I only ever think about food, weight and exercise. Not fun topics, but that is my life. \n\nSometimes, more and more frequently I have been finding some peace. But this peace comes when I think about dying. Not so much killing myself, but just imagining not existing anymore, not having to feel this huge strain, this exhausting, all consuming strain. It is becoming that my eating disorder is no longer about looking good, it is now about the possibility of just disappearing ceasing to exist. It seems like such an easier option. \n\nI am also in college studying law, but even that just seems so pointless now. I mean at the end of the day what is the point? The percentage of my life that I have spent happy is drastically less than the percentage I have spent hating every single moment. Why continue? I am physically attractive so I don't have trouble finding boyfriends, but I get so bored, it all just seems so futile. I am coming to a terrifying realisation, but the most terrifying thing about it is how appealing and peaceful I find it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ea1x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thrownaway5789", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ea1x/clinging_on_by_a_thread/", "name": "t3_24ea1x", "created": 1398917737.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ea1x/clinging_on_by_a_thread/", "author_flair_text": null, "title": "Clinging on by a thread...", "created_utc": 1398888937.0, "ups": 4, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6agfz", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24ea1x", "approved_by": null, "body": "I know what you mean with the first parts. I worry about my weight constantly, I hate feeling like I'm getting worse *every day* I know what it's like to have constant near panic invading your every thoughts.\n\nSomething that's helped me recently has been coloring with black crayon and listening to metal. (like the band Meshuggah) (just scribbling and writing.. it helps me.. a lot)\n\nI have also realized that the only form of exercise I actually enjoy is skateboarding. Seriously, it's a tremendous form of aerobic exercise, you sweat so quickly. I just find places at night where no one will be around and practice how to ollie. It's so intense and satisfying.\n\nIf I get into skatepark skating, I'll definitely wear protective gear (including a mouthguard) but I'm serious when I say that I don't think I enjoy any other form of movement enough to pursue it as a a form of exercise\n\nI also absolutely love to play music. I don't know how I could survive without these things.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean with the first parts. I worry about my weight constantly, I hate feeling like I&amp;#39;m getting worse &lt;em&gt;every day&lt;/em&gt; I know what it&amp;#39;s like to have constant near panic invading your every thoughts.&lt;/p&gt;\n\n&lt;p&gt;Something that&amp;#39;s helped me recently has been coloring with black crayon and listening to metal. (like the band Meshuggah) (just scribbling and writing.. it helps me.. a lot)&lt;/p&gt;\n\n&lt;p&gt;I have also realized that the only form of exercise I actually enjoy is skateboarding. Seriously, it&amp;#39;s a tremendous form of aerobic exercise, you sweat so quickly. I just find places at night where no one will be around and practice how to ollie. It&amp;#39;s so intense and satisfying.&lt;/p&gt;\n\n&lt;p&gt;If I get into skatepark skating, I&amp;#39;ll definitely wear protective gear (including a mouthguard) but I&amp;#39;m serious when I say that I don&amp;#39;t think I enjoy any other form of movement enough to pursue it as a a form of exercise&lt;/p&gt;\n\n&lt;p&gt;I also absolutely love to play music. I don&amp;#39;t know how I could survive without these things.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ea1x", "score_hidden": false, "name": "t1_ch6agfz", "created": 1398894774.0, "author_flair_text": null, "created_utc": 1398891174.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]