[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long story short: I&amp;#39;ve been struggling with depression and suicidal thoughts on and off since I was 13 (I&amp;#39;m a month shy of 20 now). As a freshman and now as a sophomore I had a few really bad run ins with alcohol that were utterly humiliating (I was the stereotypical drunk college girl, and the laughing stock of my class). Early this year after probably the worst alcohol run-in I&amp;#39;ve ever had I swore to myself that I would never publically humiliate myself like that again and for the most part have been very responsible with my drinking. This past weekend though I relapsed bad, and admitted to a whole party full of people my depression, self-hatred and suicidal thoughts. My grades are in the crapper and my depression and social anxiety has been getting worse this whole year and I feel like this was the straw that broke the camel&amp;#39;s back. I feel like a failure in every possible sense of the word and over the weekend I came close to committing myself to inpatient stay but decided not to because I can&amp;#39;t risk not being able to finish my final exams (I go to a very high performing school and last week got horrible marks in a class which sparked my spiral this weekend, and doing well in school is the one thing I feel confident in). I have an appointment with my therapist tomorrow but I&amp;#39;m terrified of telling her how bad things are getting because I&amp;#39;m scared shitless that she&amp;#39;ll commit me. I just want this all to stop, I&amp;#39;ve been hiding in my room and even going to the cafeteria for lunch yesterday almost gave me an anxiety attack. I can&amp;#39;t face everyone after how I acted Saturdday, I can&amp;#39;t face their judgment. I don&amp;#39;t even really know why I&amp;#39;m writing this. I&amp;#39;m not on medication but that&amp;#39;s mostly because I pretty much I lie to my therapist about how I&amp;#39;m feeling almost every session because I&amp;#39;m too scared of what the consequences will be but I feel like I&amp;#39;m at the end of my rope and I don&amp;#39;t know if I should get assessed for medication because I feel like that&amp;#39;d be a step I can&amp;#39;t come back from. I don&amp;#39;t know why I&amp;#39;m writing all this...the last time I told someone I was suicidal (my ex boyfriend) he basically told me to stop being a drama queen, and ever since then I&amp;#39;ve kept things bottled up so I guess I just wanted to talk about it even if I never get the courage to tell anyone irl. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Long story short: I've been struggling with depression and suicidal thoughts on and off since I was 13 (I'm a month shy of 20 now). As a freshman and now as a sophomore I had a few really bad run ins with alcohol that were utterly humiliating (I was the stereotypical drunk college girl, and the laughing stock of my class). Early this year after probably the worst alcohol run-in I've ever had I swore to myself that I would never publically humiliate myself like that again and for the most part have been very responsible with my drinking. This past weekend though I relapsed bad, and admitted to a whole party full of people my depression, self-hatred and suicidal thoughts. My grades are in the crapper and my depression and social anxiety has been getting worse this whole year and I feel like this was the straw that broke the camel's back. I feel like a failure in every possible sense of the word and over the weekend I came close to committing myself to inpatient stay but decided not to because I can't risk not being able to finish my final exams (I go to a very high performing school and last week got horrible marks in a class which sparked my spiral this weekend, and doing well in school is the one thing I feel confident in). I have an appointment with my therapist tomorrow but I'm terrified of telling her how bad things are getting because I'm scared shitless that she'll commit me. I just want this all to stop, I've been hiding in my room and even going to the cafeteria for lunch yesterday almost gave me an anxiety attack. I can't face everyone after how I acted Saturdday, I can't face their judgment. I don't even really know why I'm writing this. I'm not on medication but that's mostly because I pretty much I lie to my therapist about how I'm feeling almost every session because I'm too scared of what the consequences will be but I feel like I'm at the end of my rope and I don't know if I should get assessed for medication because I feel like that'd be a step I can't come back from. I don't know why I'm writing all this...the last time I told someone I was suicidal (my ex boyfriend) he basically told me to stop being a drama queen, and ever since then I've kept things bottled up so I guess I just wanted to talk about it even if I never get the courage to tell anyone irl. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c01b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "erimantile", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c01b/college_alcohol_anxiety_and_depression_help/", "name": "t3_24c01b", "created": 1398852257.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c01b/college_alcohol_anxiety_and_depression_help/", "author_flair_text": null, "title": "College, alcohol, anxiety and depression. Help.", "created_utc": 1398823457.0, "ups": 8, "num_comments": 19, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5o8yf", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch5nzzl", "approved_by": null, "body": "and you realize that a lot of this may be because of finals and the stress that comes with that ordeal, and 2-3 weeks from now things will probably look much different, especially if you spend that time excising and eating right, 2 big things in dealing with depression.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and you realize that a lot of this may be because of finals and the stress that comes with that ordeal, and 2-3 weeks from now things will probably look much different, especially if you spend that time excising and eating right, 2 big things in dealing with depression.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5o8yf", "created": 1398856820.0, "author_flair_text": null, "created_utc": 1398828020.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5nzzl", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch5nlhh", "approved_by": null, "body": "Hey that sounds pretty good actually, getting out and doing something different is what I do to pull my self out of the black pit. Maybe you can try to focus on your grandmother some, try to make it a nice as you can for her, reading to her, or getting her to tell you stories of her past. Maybe tomorrow you could talk to your therapist about doing some phone sessions with her during the summer, and maybe try telling her a little more than you usually do about how you are feeling, not everything if your not comfortable doing that but try conveying the fact that things might be getting a little worse than they were.  Dealing with family is almost always difficult but if they really care about you there shouldn't be to much flak about you finding someone to see, if they say something maybe point out that your are taking steps to deal with your problems in a mature and acceptable manner, which you are doing by the way, kudos on that!!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey that sounds pretty good actually, getting out and doing something different is what I do to pull my self out of the black pit. Maybe you can try to focus on your grandmother some, try to make it a nice as you can for her, reading to her, or getting her to tell you stories of her past. Maybe tomorrow you could talk to your therapist about doing some phone sessions with her during the summer, and maybe try telling her a little more than you usually do about how you are feeling, not everything if your not comfortable doing that but try conveying the fact that things might be getting a little worse than they were.  Dealing with family is almost always difficult but if they really care about you there shouldn&amp;#39;t be to much flak about you finding someone to see, if they say something maybe point out that your are taking steps to deal with your problems in a mature and acceptable manner, which you are doing by the way, kudos on that!!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5nzzl", "created": 1398856263.0, "author_flair_text": null, "created_utc": 1398827463.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5nlhh", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5narm", "approved_by": null, "body": "I only have a week and a few days left in the semester before I go home. Home will be nice because I decided not to work or take an internship this summer, because I wanted to focus on getting my mental and physical health on track. But also it will be really stressful--my grandmother (my mother's mother) is extremely ill and will probably not live to the end of the summer at this rate. I love my family but living with them for long periods of time tends to exacerbate my anxiety and depression. My mother has pretty bad anxiety but doesn't believe that depression and anxiety are real things, and doesn't belive that you should get medication for it (she refuses to take hers most of the time) and is very much of the philosphy that you should just \"pray it out\". My family doesn't know that I've been having severe depression and anxiety (I've gotten pretty good at hiding it) and that I've been going to therapy. I also need to figure out how to find a therapist over the summer. I am close with my family and love them a lot but I am just too afraid to tell them how I've been feeling because I can just see them either acting like I'm overracting or getting too involved. Also I've been doing a lot of TLC lately, going on walks, getting nice coffee and treating myself to brunch and usually it helps, but nowadays it doesn't do anything for me. In fact it just makes me more anxious sometimes and makes me want to go back to my room. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only have a week and a few days left in the semester before I go home. Home will be nice because I decided not to work or take an internship this summer, because I wanted to focus on getting my mental and physical health on track. But also it will be really stressful--my grandmother (my mother&amp;#39;s mother) is extremely ill and will probably not live to the end of the summer at this rate. I love my family but living with them for long periods of time tends to exacerbate my anxiety and depression. My mother has pretty bad anxiety but doesn&amp;#39;t believe that depression and anxiety are real things, and doesn&amp;#39;t belive that you should get medication for it (she refuses to take hers most of the time) and is very much of the philosphy that you should just &amp;quot;pray it out&amp;quot;. My family doesn&amp;#39;t know that I&amp;#39;ve been having severe depression and anxiety (I&amp;#39;ve gotten pretty good at hiding it) and that I&amp;#39;ve been going to therapy. I also need to figure out how to find a therapist over the summer. I am close with my family and love them a lot but I am just too afraid to tell them how I&amp;#39;ve been feeling because I can just see them either acting like I&amp;#39;m overracting or getting too involved. Also I&amp;#39;ve been doing a lot of TLC lately, going on walks, getting nice coffee and treating myself to brunch and usually it helps, but nowadays it doesn&amp;#39;t do anything for me. In fact it just makes me more anxious sometimes and makes me want to go back to my room. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5nlhh", "created": 1398855403.0, "author_flair_text": null, "created_utc": 1398826603.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5oju0", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch5oc26", "approved_by": null, "body": "truth is we all tend to be wrapped up in our own little world, kinda human nature to not pay to much attention to other people, they probably dismissed a lot of it as alcohol induced just focus on your school work and let the rest go for now", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;truth is we all tend to be wrapped up in our own little world, kinda human nature to not pay to much attention to other people, they probably dismissed a lot of it as alcohol induced just focus on your school work and let the rest go for now&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5oju0", "created": 1398857500.0, "author_flair_text": null, "created_utc": 1398828700.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5oc26", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5o2i6", "approved_by": null, "body": "yeah, i just want everything to blow over over the summer break. i've been trying not to act too stressed out by it. teh next day we all got brunch and I acted really happy and non-stressed out by it, so hopefully they won't be able to see through it. no-one was acting too weird around me though which was nice. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, i just want everything to blow over over the summer break. i&amp;#39;ve been trying not to act too stressed out by it. teh next day we all got brunch and I acted really happy and non-stressed out by it, so hopefully they won&amp;#39;t be able to see through it. no-one was acting too weird around me though which was nice. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5oc26", "created": 1398857013.0, "author_flair_text": null, "created_utc": 1398828213.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch5o2i6", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch5ns60", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5o2i6", "created": 1398856420.0, "author_flair_text": null, "created_utc": 1398827620.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5ns60", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5npme", "approved_by": null, "body": "I'm just tired of having the reputation as that drunk girl. I understand that it won't be a big deal 5 years from now, but that doesn't stop it hurting right now. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just tired of having the reputation as that drunk girl. I understand that it won&amp;#39;t be a big deal 5 years from now, but that doesn&amp;#39;t stop it hurting right now. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5ns60", "created": 1398855793.0, "author_flair_text": null, "created_utc": 1398826993.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5npme", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch5narm", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5npme", "created": 1398855645.0, "author_flair_text": null, "created_utc": 1398826845.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5narm", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch5n5ud", "approved_by": null, "body": "That is understandable, and it is kinda of human nature to frame things from our past experiences. So how much left in this semester of school?  finish finals this week? When you do will you be able to do something to have some change for a little while, couple weeks off too maybe go some where you always wanted, or just maybe somewhere  quiet to decompress for awhile?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is understandable, and it is kinda of human nature to frame things from our past experiences. So how much left in this semester of school?  finish finals this week? When you do will you be able to do something to have some change for a little while, couple weeks off too maybe go some where you always wanted, or just maybe somewhere  quiet to decompress for awhile?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5narm", "created": 1398854778.0, "author_flair_text": null, "created_utc": 1398825978.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5n5ud", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5n1k1", "approved_by": null, "body": "I've only been speaking with her for a year, maybe once or twice a month. She's been great, but I also know that my school (she's a therapist from my university) can be a little trigger happy in sending people to inpatient because of liability concerns. This therapist has never overreacted but I've had therapists in the past minimize how I was feeling and I'm just kind of too tired to try and convice someone that what I'm feeling is real you know? And I know that I shouldn't lump  her in with the others but it's just been so often that no-one believes me or completely overreacts that I just feel like I can't trust anyone but myself. I don't know how to bring it up with her either. We were supposed to meet next week but I called the office and said that I can't wait that long so they scheduled me to go in tomorrow, so she knows that something is up but not what. I have no idea how to tell her :(. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only been speaking with her for a year, maybe once or twice a month. She&amp;#39;s been great, but I also know that my school (she&amp;#39;s a therapist from my university) can be a little trigger happy in sending people to inpatient because of liability concerns. This therapist has never overreacted but I&amp;#39;ve had therapists in the past minimize how I was feeling and I&amp;#39;m just kind of too tired to try and convice someone that what I&amp;#39;m feeling is real you know? And I know that I shouldn&amp;#39;t lump  her in with the others but it&amp;#39;s just been so often that no-one believes me or completely overreacts that I just feel like I can&amp;#39;t trust anyone but myself. I don&amp;#39;t know how to bring it up with her either. We were supposed to meet next week but I called the office and said that I can&amp;#39;t wait that long so they scheduled me to go in tomorrow, so she knows that something is up but not what. I have no idea how to tell her :(. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5n5ud", "created": 1398854494.0, "author_flair_text": null, "created_utc": 1398825694.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5n1k1", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch5mxdi", "approved_by": null, "body": "I can understand the feeling, I have been dealing with depression for a long time, it can be a really difficult thing because it's hard to function in that fog. Has your therapist overreacted in the past? How long have you been talking with her?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand the feeling, I have been dealing with depression for a long time, it can be a really difficult thing because it&amp;#39;s hard to function in that fog. Has your therapist overreacted in the past? How long have you been talking with her?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5n1k1", "created": 1398854250.0, "author_flair_text": null, "created_utc": 1398825450.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5p7ye", "gilded": 0, "author": "lookintomyballs", "parent_id": "t1_ch5p22t", "approved_by": null, "body": "You can. Just stand up for yourself and your right to mental health. No one will do it for you. You will get through this. It's just a bump in the road.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can. Just stand up for yourself and your right to mental health. No one will do it for you. You will get through this. It&amp;#39;s just a bump in the road.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5p7ye", "created": 1398858985.0, "author_flair_text": null, "created_utc": 1398830185.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5p22t", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5obmz", "approved_by": null, "body": "thank you so much. Both for your pm and your post. I can really relate to what you said--it's basically how I've been feeling. I just hope that I can be this open tomorrow with my thereapist and with my family. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you so much. Both for your pm and your post. I can really relate to what you said--it&amp;#39;s basically how I&amp;#39;ve been feeling. I just hope that I can be this open tomorrow with my thereapist and with my family. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5p22t", "created": 1398858616.0, "author_flair_text": null, "created_utc": 1398829816.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5obmz", "gilded": 0, "author": "lookintomyballs", "parent_id": "t1_ch5mxdi", "approved_by": null, "body": "Sent you a pm but saw this post after... this is a bit of a supplement to my message. \n\nI went through a 4-6 month phase where I felt like I was living in a bubble, completely disconnected from the outside world (can't remember the exact amount of time... it felt like a day and a decade, all at once). Almost as if I was  floating above the rest of society and they didn't exist. I was in my own head, in a complete fog, every second of every day. It was horrible. I questioned my faith (which has changed considerably since), questioned \"the point of it all\"... I considered taking my own life, but couldn't because I felt like I was \"waiting for something\". I just didn't know what, and felt no end in sight. \n\nI didn't know who I was or who I was supposed to be, couldn't see past the next several hours, much less the next year or so. One night I got so upset and panicked and hopelessly depressed, I threw myself into the bathtub and put my head under the faucet, in a feigned attempt to end my life. I tried to breathe in the water but couldn't commit to hurting myself and ended up sobbing uncontrollably, completely disgusted with myself. \n\nI went to see a therapist, and it helped to talk to someone, but didn't really improve anything. She told me I was in a \"transitionary period\". I got on some meds and was able to think much clearer. It helped me find the strength to make myself better and do something to evoke change. Sometimes words are not enough. Psych meds are really a modern miracle. If you truly need them, you need not be resistant. They can help.\n\nYou are NOT a coward. You are just a little lost right now. It is hard to take responsibility for your failures. The cool thing is that as soon as you do, you take pride in the work you put in to improving your condition. Sometimes the best thing to do is to keep yourself busy and put yourself to work! It takes the mind off the more difficult-to-handle subjects and focuses your energy on constructive things. It'll get better!! You have already taken the first step -- you are reaching out instead of keeping it bottled up inside. Relationships are a positive thing, and supportive relationships will give you the strength you need to carry on. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sent you a pm but saw this post after... this is a bit of a supplement to my message. &lt;/p&gt;\n\n&lt;p&gt;I went through a 4-6 month phase where I felt like I was living in a bubble, completely disconnected from the outside world (can&amp;#39;t remember the exact amount of time... it felt like a day and a decade, all at once). Almost as if I was  floating above the rest of society and they didn&amp;#39;t exist. I was in my own head, in a complete fog, every second of every day. It was horrible. I questioned my faith (which has changed considerably since), questioned &amp;quot;the point of it all&amp;quot;... I considered taking my own life, but couldn&amp;#39;t because I felt like I was &amp;quot;waiting for something&amp;quot;. I just didn&amp;#39;t know what, and felt no end in sight. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t know who I was or who I was supposed to be, couldn&amp;#39;t see past the next several hours, much less the next year or so. One night I got so upset and panicked and hopelessly depressed, I threw myself into the bathtub and put my head under the faucet, in a feigned attempt to end my life. I tried to breathe in the water but couldn&amp;#39;t commit to hurting myself and ended up sobbing uncontrollably, completely disgusted with myself. &lt;/p&gt;\n\n&lt;p&gt;I went to see a therapist, and it helped to talk to someone, but didn&amp;#39;t really improve anything. She told me I was in a &amp;quot;transitionary period&amp;quot;. I got on some meds and was able to think much clearer. It helped me find the strength to make myself better and do something to evoke change. Sometimes words are not enough. Psych meds are really a modern miracle. If you truly need them, you need not be resistant. They can help.&lt;/p&gt;\n\n&lt;p&gt;You are NOT a coward. You are just a little lost right now. It is hard to take responsibility for your failures. The cool thing is that as soon as you do, you take pride in the work you put in to improving your condition. Sometimes the best thing to do is to keep yourself busy and put yourself to work! It takes the mind off the more difficult-to-handle subjects and focuses your energy on constructive things. It&amp;#39;ll get better!! You have already taken the first step -- you are reaching out instead of keeping it bottled up inside. Relationships are a positive thing, and supportive relationships will give you the strength you need to carry on. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5obmz", "created": 1398831788.0, "author_flair_text": null, "created_utc": 1398828188.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5mxdi", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5mlle", "approved_by": null, "body": "Well, I really don't think that'd be the case considering the group of people that was there and my relationship with them. And even if it is the case, that doesn't really change how shitty I'm feeling. I like my therapist, she's a really great listener, but I'm just scared of her over-reacting. Everytime I've told anyone they either overreact or tell me I'm being overly dramatic and minimize how I'm feeling. Idk...there's no real solution to this. I just feel like I'm drowning with no way out. It's like there's the thick and heavy fog and it's hard to talk, walk, or process anything. I'm just tired of feeling like  this. I don't want to die, and I'm know I won't kill myself, but I'm too much of a coward to face my own shame and take responsibility for all of my failures. ", "edited": 1398825487.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I really don&amp;#39;t think that&amp;#39;d be the case considering the group of people that was there and my relationship with them. And even if it is the case, that doesn&amp;#39;t really change how shitty I&amp;#39;m feeling. I like my therapist, she&amp;#39;s a really great listener, but I&amp;#39;m just scared of her over-reacting. Everytime I&amp;#39;ve told anyone they either overreact or tell me I&amp;#39;m being overly dramatic and minimize how I&amp;#39;m feeling. Idk...there&amp;#39;s no real solution to this. I just feel like I&amp;#39;m drowning with no way out. It&amp;#39;s like there&amp;#39;s the thick and heavy fog and it&amp;#39;s hard to talk, walk, or process anything. I&amp;#39;m just tired of feeling like  this. I don&amp;#39;t want to die, and I&amp;#39;m know I won&amp;#39;t kill myself, but I&amp;#39;m too much of a coward to face my own shame and take responsibility for all of my failures. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5mxdi", "created": 1398854020.0, "author_flair_text": null, "created_utc": 1398825220.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5mlle", "gilded": 0, "author": "shallpass2u", "parent_id": "t3_24c01b", "approved_by": null, "body": "Talking about it can help, tends to lead us to exam things a little more, as for what happened Sat. or in the past as a whole, I wouldn't obsess about it to much, chances are half the people there have felt the same way at some time, just don't have the courage to admit it, and next weekend someone else will do something to make them forget all about it if they haven't already. Regarding your therapist relationship do you not really trust him/her? Anyway would be happy to talk with you if you would like, no judgement, just a sympathetic ear.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talking about it can help, tends to lead us to exam things a little more, as for what happened Sat. or in the past as a whole, I wouldn&amp;#39;t obsess about it to much, chances are half the people there have felt the same way at some time, just don&amp;#39;t have the courage to admit it, and next weekend someone else will do something to make them forget all about it if they haven&amp;#39;t already. Regarding your therapist relationship do you not really trust him/her? Anyway would be happy to talk with you if you would like, no judgement, just a sympathetic ear.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5mlle", "created": 1398853363.0, "author_flair_text": null, "created_utc": 1398824563.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5o8vr", "gilded": 0, "author": "erimantile", "parent_id": "t1_ch5nyk8", "approved_by": null, "body": "Yeah, I know. He was very emotionally manipulative and used to say lots of verbal put downs, but it's hard for me to think badly of him because in the end I feel like was right. In my mind I know that he was all kinds of bad for me, he did not love me, and he did not respect me, but it's so hard to forget what someone you care(d?) about says about you. I have a vague plan but I don't think I could carry out with it. Thinking about what it would do to my parents kills me inside and is the main reason why I'm going in tomorrow even though I'm so nervous. I don't want kill myself, I know that now. I just want to get better. My parents are very supportive of me and I know they love me a lot, but I just don't know if I could bear with their reactions. I can't see them cry and I know they're stressed out with so many things (work, my grandmother, family problems, etc) that I don't want this to stress them out even more. I'm also just afraid that they won't trust me anymore; I couldn't bear it if they look at me differently or treat me like glass you know?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I know. He was very emotionally manipulative and used to say lots of verbal put downs, but it&amp;#39;s hard for me to think badly of him because in the end I feel like was right. In my mind I know that he was all kinds of bad for me, he did not love me, and he did not respect me, but it&amp;#39;s so hard to forget what someone you care(d?) about says about you. I have a vague plan but I don&amp;#39;t think I could carry out with it. Thinking about what it would do to my parents kills me inside and is the main reason why I&amp;#39;m going in tomorrow even though I&amp;#39;m so nervous. I don&amp;#39;t want kill myself, I know that now. I just want to get better. My parents are very supportive of me and I know they love me a lot, but I just don&amp;#39;t know if I could bear with their reactions. I can&amp;#39;t see them cry and I know they&amp;#39;re stressed out with so many things (work, my grandmother, family problems, etc) that I don&amp;#39;t want this to stress them out even more. I&amp;#39;m also just afraid that they won&amp;#39;t trust me anymore; I couldn&amp;#39;t bear it if they look at me differently or treat me like glass you know?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5o8vr", "created": 1398831615.0, "author_flair_text": null, "created_utc": 1398828015.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5nyk8", "gilded": 0, "author": "Melanie133", "parent_id": "t3_24c01b", "approved_by": null, "body": "Any boyfriend who said that to you is a jerk and does not respect you. Dismiss anything he said. I understand that you would be afraid to tell your therapist certain information and she is supposed to take any threat you admit to very seriously. If you are honest that is the only way to get the help you need. If you discuss how you have considered BUT do not have a plan than she will not commit you. She will ask if you have a plan. Do you??? I am a mom, and I lost my son to suicide almost 3 years ago..and it devastated me. I would do anything to have been able to prevent it. Are your parents supportive?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any boyfriend who said that to you is a jerk and does not respect you. Dismiss anything he said. I understand that you would be afraid to tell your therapist certain information and she is supposed to take any threat you admit to very seriously. If you are honest that is the only way to get the help you need. If you discuss how you have considered BUT do not have a plan than she will not commit you. She will ask if you have a plan. Do you??? I am a mom, and I lost my son to suicide almost 3 years ago..and it devastated me. I would do anything to have been able to prevent it. Are your parents supportive?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5nyk8", "created": 1398830975.0, "author_flair_text": null, "created_utc": 1398827375.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5pwwp", "gilded": 0, "author": "Mara__Jade", "parent_id": "t3_24c01b", "approved_by": null, "body": "If you were at a party, is it possible that they other people were also drunk or impaired and might not remember what you said?\n\nBy the way, I totally agree with one of the other posters: a lot of people feel the same way you do, and even if they remember it, they might have felt exactly the same way.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you were at a party, is it possible that they other people were also drunk or impaired and might not remember what you said?&lt;/p&gt;\n\n&lt;p&gt;By the way, I totally agree with one of the other posters: a lot of people feel the same way you do, and even if they remember it, they might have felt exactly the same way.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch5pwwp", "created": 1398860604.0, "author_flair_text": null, "created_utc": 1398831804.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6o7sk", "gilded": 0, "author": "erimantile", "parent_id": "t3_24c01b", "approved_by": null, "body": "Just to follow up with everyone, I was honest with my therapist and our conversation turned out much better than I expected :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to follow up with everyone, I was honest with my therapist and our conversation turned out much better than I expected :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c01b", "score_hidden": false, "name": "t1_ch6o7sk", "created": 1398926111.0, "author_flair_text": null, "created_utc": 1398922511.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]