[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, this is my first post here.. I just really was looking for some comfort or any advice, maybe someone who can relate to my situation? I&amp;#39;m becoming more and more fearful my suicidal thoughts are going to get to me and I&amp;#39;m going to do something i regret.&lt;/p&gt;\n\n&lt;p&gt;Let me explain. Im a 16 year old girl with divorced parents. Nov 2012 my Mom as diagnosed with breast cancer. The whole school year of 12-13 i had done nothing. I went to a christian private school and had been there all my life, but my depression had finally caused me to stop doing anything for school. I didnt do any work, failed quizes and tests, and still managed to get by- but just barely. I didnt realise at the time but i was also experiencing bullying, but not the common type. The type where your left out of everything, people talk behind your back and you somehow know, and you get teased and asked questions by random people about personal things you wouldnt like them to know.&lt;/p&gt;\n\n&lt;p&gt;Anyways, by Feb 2013 i was expelled from school, and they had the nerve to do it while i was in the hospital for being suicidal and my mom was also in the hospital for having a double mastectomy for her breast cancer. My mom couldnt care for me anymore, so my father (whom i had no relationship with for all my life and i hadnt spent time with in years) took me to live with him and go to public schooling. Everything got amazing for me then. I had a clean slate and was accepted by my friends at school- in fact they were my reason for getting up in the morning. i got good grades, got active in after school things and exercised, ate right... everything was amazing, despite the fact my dad was a physically, verbally, and sexually abusive alcoholic who had different girls over every night and ignored any requests i made for them to be quiet. He constantly called me names, would touch me when i was out of my room and he was drunk, and would beat me if i- for example- didnt do the dishes when i had never done them because he did them, but he thought i shouldve done them before he got off work anyway. I spent the whole year with him until Feb 2014 when i broke down, told a friend about my abuse and they reported it at school. My dad found out childrens services was going to be coming and took his anger out on his girlfriend and i called the cops, but when they got here my dad and his girlfriend framed me and acted like they were just arguing. The next day i didnt go to school and my dad kicked me out, and here i am- back at my moms. &lt;/p&gt;\n\n&lt;p&gt;I forgot to mention i recently had a sweet 16 with more than 50 of my friends there, and now almost every one of there faces is just a memory... ive lost all my friends which were my motivation to get out of bed, and im not getting out of bed anymore.. im recovering from horrible abuse i experienced with my dad (and yes i have met with childrens services and they are working on a case. i dont know what to expect.) Im doing online school and im locked inside all day with no sunlight or exercise. I&amp;#39;m having trauma flashbacks and nightmares (I have PTSD), and im overwhelmed with my now once again failing grades, new living situation and new routine i need to develop, and new household.&lt;/p&gt;\n\n&lt;p&gt;And im coping by cutting, popping pills, and writing suicide notes. But thats not all, i do have good nights where i cope by drawing or talking to someone, but the last good night was 2 weeks ago. Im going to counseling but i skipped last week and instead had an episode where i was clutching pills in my hands and waiting for morning...&lt;/p&gt;\n\n&lt;p&gt;I feel hopeless, like my future is destoryed cuz im most likely not passing this year and that will be 2/4 of my high school years ruined and i have no friends left. I feel like nothing can be done to save me and i should just embrace my upcoming suicide and be happy while im here... &lt;/p&gt;\n\n&lt;p&gt;Can anyone save me? because im on my last thread of rope.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, this is my first post here.. I just really was looking for some comfort or any advice, maybe someone who can relate to my situation? I'm becoming more and more fearful my suicidal thoughts are going to get to me and I'm going to do something i regret.\n\nLet me explain. Im a 16 year old girl with divorced parents. Nov 2012 my Mom as diagnosed with breast cancer. The whole school year of 12-13 i had done nothing. I went to a christian private school and had been there all my life, but my depression had finally caused me to stop doing anything for school. I didnt do any work, failed quizes and tests, and still managed to get by- but just barely. I didnt realise at the time but i was also experiencing bullying, but not the common type. The type where your left out of everything, people talk behind your back and you somehow know, and you get teased and asked questions by random people about personal things you wouldnt like them to know.\n\nAnyways, by Feb 2013 i was expelled from school, and they had the nerve to do it while i was in the hospital for being suicidal and my mom was also in the hospital for having a double mastectomy for her breast cancer. My mom couldnt care for me anymore, so my father (whom i had no relationship with for all my life and i hadnt spent time with in years) took me to live with him and go to public schooling. Everything got amazing for me then. I had a clean slate and was accepted by my friends at school- in fact they were my reason for getting up in the morning. i got good grades, got active in after school things and exercised, ate right... everything was amazing, despite the fact my dad was a physically, verbally, and sexually abusive alcoholic who had different girls over every night and ignored any requests i made for them to be quiet. He constantly called me names, would touch me when i was out of my room and he was drunk, and would beat me if i- for example- didnt do the dishes when i had never done them because he did them, but he thought i shouldve done them before he got off work anyway. I spent the whole year with him until Feb 2014 when i broke down, told a friend about my abuse and they reported it at school. My dad found out childrens services was going to be coming and took his anger out on his girlfriend and i called the cops, but when they got here my dad and his girlfriend framed me and acted like they were just arguing. The next day i didnt go to school and my dad kicked me out, and here i am- back at my moms. \n\nI forgot to mention i recently had a sweet 16 with more than 50 of my friends there, and now almost every one of there faces is just a memory... ive lost all my friends which were my motivation to get out of bed, and im not getting out of bed anymore.. im recovering from horrible abuse i experienced with my dad (and yes i have met with childrens services and they are working on a case. i dont know what to expect.) Im doing online school and im locked inside all day with no sunlight or exercise. I'm having trauma flashbacks and nightmares (I have PTSD), and im overwhelmed with my now once again failing grades, new living situation and new routine i need to develop, and new household.\n\nAnd im coping by cutting, popping pills, and writing suicide notes. But thats not all, i do have good nights where i cope by drawing or talking to someone, but the last good night was 2 weeks ago. Im going to counseling but i skipped last week and instead had an episode where i was clutching pills in my hands and waiting for morning...\n\nI feel hopeless, like my future is destoryed cuz im most likely not passing this year and that will be 2/4 of my high school years ruined and i have no friends left. I feel like nothing can be done to save me and i should just embrace my upcoming suicide and be happy while im here... \n\nCan anyone save me? because im on my last thread of rope.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2461bg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "zlexidash15", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2461bg/constantly_suicidal_and_have_no_hope_left_in_me/", "name": "t3_2461bg", "created": 1398694633.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2461bg/constantly_suicidal_and_have_no_hope_left_in_me/", "author_flair_text": null, "title": "Constantly suicidal and have no hope left in me.", "created_utc": 1398665833.0, "ups": 8, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3ytmz", "gilded": 0, "author": "Blue_Spirit_", "parent_id": "t3_2461bg", "approved_by": null, "body": "Hey. I can't really relate to everything you've gone through. And I'm sorry you've had to endure so much pain. I went through a dark depression some years ago. when I was around your age actually. I moved to a new country so my parents could be together and I was bad mouthed and shunned by everyone in my school. I was there for two years and for the first 75% I had no friends. And it was just so dark and hopeless for me. I hated everyone around me but no one as much as myself. So I know what that feeling of loneliness is like. I had birthdays and weekends all alone and with people actively not being with me. Now I can't relate to the cancer, but I know what it's like to have your mother weak and in and out of hospitals. It's rough. And I'll be glad to talk to you about any of that. I can't save you. Only you can do that. But I'll be there if you need someone to help you take the steps if you stumble. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey. I can&amp;#39;t really relate to everything you&amp;#39;ve gone through. And I&amp;#39;m sorry you&amp;#39;ve had to endure so much pain. I went through a dark depression some years ago. when I was around your age actually. I moved to a new country so my parents could be together and I was bad mouthed and shunned by everyone in my school. I was there for two years and for the first 75% I had no friends. And it was just so dark and hopeless for me. I hated everyone around me but no one as much as myself. So I know what that feeling of loneliness is like. I had birthdays and weekends all alone and with people actively not being with me. Now I can&amp;#39;t relate to the cancer, but I know what it&amp;#39;s like to have your mother weak and in and out of hospitals. It&amp;#39;s rough. And I&amp;#39;ll be glad to talk to you about any of that. I can&amp;#39;t save you. Only you can do that. But I&amp;#39;ll be there if you need someone to help you take the steps if you stumble. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2461bg", "score_hidden": false, "name": "t1_ch3ytmz", "created": 1398671677.0, "author_flair_text": null, "created_utc": 1398668077.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4r8rw", "gilded": 0, "author": "nowthatsenough", "parent_id": "t3_2461bg", "approved_by": null, "body": "Hey there! Let me start by saying that you are my new friend. point blank period end of discussion. Wanna know something else? I LOVE YOU AND I KNOW YOU CAN GET THROUGH THIS. You have the ability to do something a lot of other people can't. You can relate to people who have gone through what you have. Why is that a good thing and why should you care, you ask? To that I say, stop reading over my shoulder, I haven't even posted this yet!. I also say that you should care, because people like you help more people than anyone else, especially as adults. Do you know why that is? That is because people like you who are strong enough (and i know you are, since you made it through the worst part) end up becoming social workers and therapists. Do you want to make your dad the winner here by offing yourself? Hell no! Do you want to help people out of the same situation you have had to go through? Well, that's up to you isn't it? You can spend your adult life stopping the people like your dad and helping people *just like you* live happy and healthy lives. Your future isn't destroyed girl, your future is calling for you. Don't let the machine get it. You answer that call and you scream into the phone that YOU ARE STRONGER THAN ANYTHING THE WORLD CAN THROW AT YOU. \n\nHere is what I want you to do. You said you are on your last thread of rope? Well I want you to floss your teeth with it and smile at the world because right now, YOU ARE WINNING. The race is still going though, so now is the time to buckle down and you *sprint* to that finish line. You said you are half way done with school? That is the hardest part of the race, because you just started. The middle of the race is when those who are the strongest and bravest start getting ahead. I'm cheering you on, and will be for the rest of the race. You can do it zlexidash15! YOU CAN DO IT!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there! Let me start by saying that you are my new friend. point blank period end of discussion. Wanna know something else? I LOVE YOU AND I KNOW YOU CAN GET THROUGH THIS. You have the ability to do something a lot of other people can&amp;#39;t. You can relate to people who have gone through what you have. Why is that a good thing and why should you care, you ask? To that I say, stop reading over my shoulder, I haven&amp;#39;t even posted this yet!. I also say that you should care, because people like you help more people than anyone else, especially as adults. Do you know why that is? That is because people like you who are strong enough (and i know you are, since you made it through the worst part) end up becoming social workers and therapists. Do you want to make your dad the winner here by offing yourself? Hell no! Do you want to help people out of the same situation you have had to go through? Well, that&amp;#39;s up to you isn&amp;#39;t it? You can spend your adult life stopping the people like your dad and helping people &lt;em&gt;just like you&lt;/em&gt; live happy and healthy lives. Your future isn&amp;#39;t destroyed girl, your future is calling for you. Don&amp;#39;t let the machine get it. You answer that call and you scream into the phone that YOU ARE STRONGER THAN ANYTHING THE WORLD CAN THROW AT YOU. &lt;/p&gt;\n\n&lt;p&gt;Here is what I want you to do. You said you are on your last thread of rope? Well I want you to floss your teeth with it and smile at the world because right now, YOU ARE WINNING. The race is still going though, so now is the time to buckle down and you &lt;em&gt;sprint&lt;/em&gt; to that finish line. You said you are half way done with school? That is the hardest part of the race, because you just started. The middle of the race is when those who are the strongest and bravest start getting ahead. I&amp;#39;m cheering you on, and will be for the rest of the race. You can do it zlexidash15! YOU CAN DO IT!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2461bg", "score_hidden": false, "name": "t1_ch4r8rw", "created": 1398770819.0, "author_flair_text": null, "created_utc": 1398742019.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]