[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi there! I hope you&amp;#39;re all doing a lot better than me, given I&amp;#39;m posting here.&lt;/p&gt;\n\n&lt;p&gt;I am not feeling very well, and could stand to have some advice, if anyone cares to listen to my verbosity.&lt;/p&gt;\n\n&lt;p&gt;I have allegedly untreated schizophrenia, and am, at times, excruciatingly paranoid. Worse yet, I&amp;#39;m extremely lonely, and my already diminished capacity is besieged by more problems. Medically, I take NADH regularly (all that&amp;#39;s holding me together), Blue Lotus if I get severely ill, and have built a crude ozone catalyst (for some reason ozone screws me in the head).&lt;/p&gt;\n\n&lt;p&gt;I was living with a close friend, and doing fairly well, but stricken with guilt over my father, who is very sick and similarly lonely. I love both of them dearly, and want to be in both places at once. I&amp;#39;m serving a role as finanical help (ironically) as well as a house maid; with my friend, I serve as company and finanical aid, but am considerably less miserable.&lt;/p&gt;\n\n&lt;p&gt;Worse still, these two people are about all I have in my life; I&amp;#39;m a twenty-three year old without a damn driver&amp;#39;s license, no job, no love life. Just social security--and I&amp;#39;m constantly scared of losing it, as I&amp;#39;ve refused &amp;quot;treatment&amp;quot; for two years. And I&amp;#39;m so nerve-wrecked, even posting here is an ordeal.&lt;/p&gt;\n\n&lt;p&gt;And yet somehow, my life gets worse. The other day I had a vision of heaven; it was myself, some eight years ago, a time when I was happy. I felt happy, just sitting back and listening to music like I used to do. Talking and playing video games with friends, as a child. It was the first time I was happy in many years--I have long-standing anhedonia, so this is quite unlike me. Moreover, my memory is so fried, it&amp;#39;s odd that I could even remember it all.&lt;/p&gt;\n\n&lt;p&gt;The vision was symbolic of the fact that heaven, to me, is in the past. It&amp;#39;s me and my family being well, the mistakes of my past undone. I&amp;#39;m with all those that I lost contact with years and years ago, and still in good relations. It is something I can never, ever have again. This tormented me. It was as though I had a moment of clarity only to remind me how bad it really was.&lt;/p&gt;\n\n&lt;p&gt;Even more torementing, I couldn&amp;#39;t stop seeing myself going to Perth, Australia, and jumping off a building there again no doubt as symbolism. I can&amp;#39;t stop seeing it in my mind. Had I never been sick, I would never have been so close to the few I have now, and yet, very close to a man I knew in Perth, Australlia. My best friend, of the time, that I had lost contact with. If I could just go back, and be well, I would be so very, very happy.&lt;/p&gt;\n\n&lt;p&gt;As I had looked these people up, I would have been happy to still know them, but they grew to become far greater men than I, and clearly never needed any help from me. My current friends, on the other hand, do. Yet, at the same time, I could have stood to have my old friend&amp;#39;s help. I wonder what would have become of us.&lt;/p&gt;\n\n&lt;p&gt;I wonder if this is divine guidance; if this is God giving me a second chance to go and make ammends for my failures whilst forcing me to choose between my love of him and my love of old and health.&lt;/p&gt;\n\n&lt;p&gt;I ask, thus, if I&amp;#39;m an idiot, that these visions are meaningless. I ask if perhaps I&amp;#39;ve had a miracle. I ask if I should be with my friend, or if I should be with my father. I cannot save one without damning the other. I ask if I should just move on and find other people. I ask if I should jump, and pray I not screw it up a second time. I ask if I&amp;#39;m actually in a lotus eater trap of what would have been and none of this is even real until I jump or do not jump.&lt;/p&gt;\n\n&lt;p&gt;Any input would be greatly appreciated. I don&amp;#39;t actually want to die, too much work to be done for me to kick the bucket yet. I just don&amp;#39;t want to suffer and live in vain. I just want to go back so very, very badly and remediate my failures. And I wonder if this would allow me.&lt;/p&gt;\n\n&lt;p&gt;P.S. I am extremely terrified of EMTs, doctors, police. Please do not collude with my paranoia. If I am a fool, tell me I&amp;#39;m a fool, and I&amp;#39;ll just move on. I just don&amp;#39;t know what to do anymore, don&amp;#39;t trust myself, and mean to simply do as you all (being sane) tell me to.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi there! I hope you're all doing a lot better than me, given I'm posting here.\n\nI am not feeling very well, and could stand to have some advice, if anyone cares to listen to my verbosity.\n\nI have allegedly untreated schizophrenia, and am, at times, excruciatingly paranoid. Worse yet, I'm extremely lonely, and my already diminished capacity is besieged by more problems. Medically, I take NADH regularly (all that's holding me together), Blue Lotus if I get severely ill, and have built a crude ozone catalyst (for some reason ozone screws me in the head).\n\nI was living with a close friend, and doing fairly well, but stricken with guilt over my father, who is very sick and similarly lonely. I love both of them dearly, and want to be in both places at once. I'm serving a role as finanical help (ironically) as well as a house maid; with my friend, I serve as company and finanical aid, but am considerably less miserable.\n\nWorse still, these two people are about all I have in my life; I'm a twenty-three year old without a damn driver's license, no job, no love life. Just social security--and I'm constantly scared of losing it, as I've refused \"treatment\" for two years. And I'm so nerve-wrecked, even posting here is an ordeal.\n\nAnd yet somehow, my life gets worse. The other day I had a vision of heaven; it was myself, some eight years ago, a time when I was happy. I felt happy, just sitting back and listening to music like I used to do. Talking and playing video games with friends, as a child. It was the first time I was happy in many years--I have long-standing anhedonia, so this is quite unlike me. Moreover, my memory is so fried, it's odd that I could even remember it all.\n\nThe vision was symbolic of the fact that heaven, to me, is in the past. It's me and my family being well, the mistakes of my past undone. I'm with all those that I lost contact with years and years ago, and still in good relations. It is something I can never, ever have again. This tormented me. It was as though I had a moment of clarity only to remind me how bad it really was.\n\nEven more torementing, I couldn't stop seeing myself going to Perth, Australia, and jumping off a building there again no doubt as symbolism. I can't stop seeing it in my mind. Had I never been sick, I would never have been so close to the few I have now, and yet, very close to a man I knew in Perth, Australlia. My best friend, of the time, that I had lost contact with. If I could just go back, and be well, I would be so very, very happy.\n\nAs I had looked these people up, I would have been happy to still know them, but they grew to become far greater men than I, and clearly never needed any help from me. My current friends, on the other hand, do. Yet, at the same time, I could have stood to have my old friend's help. I wonder what would have become of us.\n\nI wonder if this is divine guidance; if this is God giving me a second chance to go and make ammends for my failures whilst forcing me to choose between my love of him and my love of old and health.\n\nI ask, thus, if I'm an idiot, that these visions are meaningless. I ask if perhaps I've had a miracle. I ask if I should be with my friend, or if I should be with my father. I cannot save one without damning the other. I ask if I should just move on and find other people. I ask if I should jump, and pray I not screw it up a second time. I ask if I'm actually in a lotus eater trap of what would have been and none of this is even real until I jump or do not jump.\n\nAny input would be greatly appreciated. I don't actually want to die, too much work to be done for me to kick the bucket yet. I just don't want to suffer and live in vain. I just want to go back so very, very badly and remediate my failures. And I wonder if this would allow me.\n\nP.S. I am extremely terrified of EMTs, doctors, police. Please do not collude with my paranoia. If I am a fool, tell me I'm a fool, and I'll just move on. I just don't know what to do anymore, don't trust myself, and mean to simply do as you all (being sane) tell me to.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23uosk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "foomanshew", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23uosk/curious_if_ive_lost_my_mind/", "name": "t3_23uosk", "created": 1398369506.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23uosk/curious_if_ive_lost_my_mind/", "author_flair_text": null, "title": "Curious if I've lost my mind", "created_utc": 1398340706.0, "ups": 7, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0skyt", "gilded": 0, "author": "foomanshew", "parent_id": "t1_ch0qmio", "approved_by": null, "body": "Music. Sleep. Talking to people that don't make me more paranoid.\nI had to lay down a while after posting to collect myself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Music. Sleep. Talking to people that don&amp;#39;t make me more paranoid.\nI had to lay down a while after posting to collect myself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch0skyt", "created": 1398351048.0, "author_flair_text": null, "created_utc": 1398347448.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0qmio", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23uosk", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch0qmio", "created": 1398344494.0, "author_flair_text": null, "created_utc": 1398340894.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch11z2r", "gilded": 0, "author": "foomanshew", "parent_id": "t3_23uosk", "approved_by": null, "body": "Thanks for talking to me today, guys, I don't get out much but my head is swimming and I need to lay down.\n\nMaybe I should never have quit Seroquel. I can't handle much of shit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for talking to me today, guys, I don&amp;#39;t get out much but my head is swimming and I need to lay down.&lt;/p&gt;\n\n&lt;p&gt;Maybe I should never have quit Seroquel. I can&amp;#39;t handle much of shit.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch11z2r", "created": 1398370401.0, "author_flair_text": null, "created_utc": 1398366801.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1p67c", "gilded": 0, "author": "foomanshew", "parent_id": "t3_23uosk", "approved_by": null, "body": "I called the national suicide hotline and heard to take care of myself first for the third time (once in person, once here, and once on the hotline).\n\nThird times the charm, heh. I guess I'm not in any position to help anyone right now until I stop being so screwed up myself. Blind leading the blind.\n\nSo normal people wouldn't have done this. They would have stayed where they were happy until their own problems were resolved. This isn't my fault.\n\nI was a fool to return and should just bail if I get too sick. Gotcha. I'll see if my friend wants me to go ahead and come back.\n\nBut am I crazy fool?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I called the national suicide hotline and heard to take care of myself first for the third time (once in person, once here, and once on the hotline).&lt;/p&gt;\n\n&lt;p&gt;Third times the charm, heh. I guess I&amp;#39;m not in any position to help anyone right now until I stop being so screwed up myself. Blind leading the blind.&lt;/p&gt;\n\n&lt;p&gt;So normal people wouldn&amp;#39;t have done this. They would have stayed where they were happy until their own problems were resolved. This isn&amp;#39;t my fault.&lt;/p&gt;\n\n&lt;p&gt;I was a fool to return and should just bail if I get too sick. Gotcha. I&amp;#39;ll see if my friend wants me to go ahead and come back.&lt;/p&gt;\n\n&lt;p&gt;But am I crazy fool?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch1p67c", "created": 1398436642.0, "author_flair_text": null, "created_utc": 1398433042.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0votb", "gilded": 0, "author": "kylestephens54", "parent_id": "t1_ch0v4v7", "approved_by": null, "body": "It's okay to feel the way you feel. It's a hard predicament to be in and it doesn't make you a bad person for being juxtaposed between two people you really care about. \n\nI would talk to your friend you're living with now and see what they think about it. Maybe you could live with your father for a couple months or something and spend time with him and so on and help him out until he gets better and then move back with your friend. \n\nAlso don't think about this in \"normal people\" terms. From my experiences thus far in life, there is. I such thing as a normal person. Everyone has their battles they're fighting and handles them in different ways. That doesn't make you weird. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s okay to feel the way you feel. It&amp;#39;s a hard predicament to be in and it doesn&amp;#39;t make you a bad person for being juxtaposed between two people you really care about. &lt;/p&gt;\n\n&lt;p&gt;I would talk to your friend you&amp;#39;re living with now and see what they think about it. Maybe you could live with your father for a couple months or something and spend time with him and so on and help him out until he gets better and then move back with your friend. &lt;/p&gt;\n\n&lt;p&gt;Also don&amp;#39;t think about this in &amp;quot;normal people&amp;quot; terms. From my experiences thus far in life, there is. I such thing as a normal person. Everyone has their battles they&amp;#39;re fighting and handles them in different ways. That doesn&amp;#39;t make you weird. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch0votb", "created": 1398358013.0, "author_flair_text": null, "created_utc": 1398354413.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0v4v7", "gilded": 0, "author": "foomanshew", "parent_id": "t1_ch0u82x", "approved_by": null, "body": "True, that. I admitted to him that if I get too much more screwed up I have to leave and hopefully come up with something in time. The distance between us means I can't simply bounce back and forth (some two thousand miles). It's not worth risking my life over.\n\nHe's old, and had worked the third shift the time I was growing up. Now that his health is gone and I'm grown... he's realized he hardly knows his own son. I'm on his bucket list, basically, and it's extremely sad. And I'm risking losing the only other person I really have in my life doing this.\n\nI've got a constant tug of war at my heart and where I was barely hanging on before, right now, I'm about to snap. I swear, I can almost hear the Devil laughing at me. The time I have left to spend with him is poisoned by me, myself, being so screwed up I can hardly get out to do anything.\n\nThe situation is a little screwed and I just keep thinking, if only I could go back a few years, dear God, how different it would have been.\n\nIt hurts so much, I wonder if there's something horribly wrong with me. Like, that I shouldn't care, or that I should have known more people. Or if I really have finally suffered enough to attract God's mercy, or if this is me finally snapping under the stress.\n\nI can't imagine normal people live like this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, that. I admitted to him that if I get too much more screwed up I have to leave and hopefully come up with something in time. The distance between us means I can&amp;#39;t simply bounce back and forth (some two thousand miles). It&amp;#39;s not worth risking my life over.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s old, and had worked the third shift the time I was growing up. Now that his health is gone and I&amp;#39;m grown... he&amp;#39;s realized he hardly knows his own son. I&amp;#39;m on his bucket list, basically, and it&amp;#39;s extremely sad. And I&amp;#39;m risking losing the only other person I really have in my life doing this.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a constant tug of war at my heart and where I was barely hanging on before, right now, I&amp;#39;m about to snap. I swear, I can almost hear the Devil laughing at me. The time I have left to spend with him is poisoned by me, myself, being so screwed up I can hardly get out to do anything.&lt;/p&gt;\n\n&lt;p&gt;The situation is a little screwed and I just keep thinking, if only I could go back a few years, dear God, how different it would have been.&lt;/p&gt;\n\n&lt;p&gt;It hurts so much, I wonder if there&amp;#39;s something horribly wrong with me. Like, that I shouldn&amp;#39;t care, or that I should have known more people. Or if I really have finally suffered enough to attract God&amp;#39;s mercy, or if this is me finally snapping under the stress.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t imagine normal people live like this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch0v4v7", "created": 1398382055.0, "author_flair_text": null, "created_utc": 1398353255.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0u82x", "gilded": 0, "author": "kylestephens54", "parent_id": "t3_23uosk", "approved_by": null, "body": "Is there no way you could split time between your friend and your father? Perhaps traveling to see your father once or twice a week and helping him with small tasks? You have to remember that you are his child and that he can only expect you to do so much. If you have problems of your own, it's ok to focus on them first. Like the old cliche goes, you can't help others until you've helped yourself first. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there no way you could split time between your friend and your father? Perhaps traveling to see your father once or twice a week and helping him with small tasks? You have to remember that you are his child and that he can only expect you to do so much. If you have problems of your own, it&amp;#39;s ok to focus on them first. Like the old cliche goes, you can&amp;#39;t help others until you&amp;#39;ve helped yourself first. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uosk", "score_hidden": false, "name": "t1_ch0u82x", "created": 1398380144.0, "author_flair_text": null, "created_utc": 1398351344.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]