[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve spent the past two and half years since coming home from Iraq struggling with thoughts of ending my own life. It wasn&amp;#39;t anything combat related that has me feeling this way. Most of my wounds came from loneliness and my life crumbling half the world away. I sold my firearms after a bad night alone. I have a loving and supportive family and should be more grateful. For that I&amp;#39;m ashamed for not being appreciative. I&amp;#39;ve found myself (at my civilian job) spending a lot time thinking about taking my own life. I&amp;#39;m the stereotypical person who only wants to alleviate my suffering. No matter how I shift or move to change my perspective I slip back. I am unsure if it was an epiphany or will become a self fulfilling prophecy but driving home one day I realized at some point tomorrow or five maybe ten years from now I at some point will end my own life. I am clinging to hope but I&amp;#39;m writing this because I may very well be near the end. I can&amp;#39;t create any momentum (and have tried a number of things). I&amp;#39;ve passed my time by thinking out just what I want my letter to friends and family to say to put them all at ease. Pathetic as it sounds I adopted two cats after I sold my weapons at the end of 2011. They are probably the only things keeping me going. I know I need help. But I don&amp;#39;t know if I want it at this point or if I can bring myself to seek it. I know it&amp;#39;s wrong to fantasize about suicide. But it&amp;#39;s the only thought that brings me joy some times. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've spent the past two and half years since coming home from Iraq struggling with thoughts of ending my own life. It wasn't anything combat related that has me feeling this way. Most of my wounds came from loneliness and my life crumbling half the world away. I sold my firearms after a bad night alone. I have a loving and supportive family and should be more grateful. For that I'm ashamed for not being appreciative. I've found myself (at my civilian job) spending a lot time thinking about taking my own life. I'm the stereotypical person who only wants to alleviate my suffering. No matter how I shift or move to change my perspective I slip back. I am unsure if it was an epiphany or will become a self fulfilling prophecy but driving home one day I realized at some point tomorrow or five maybe ten years from now I at some point will end my own life. I am clinging to hope but I'm writing this because I may very well be near the end. I can't create any momentum (and have tried a number of things). I've passed my time by thinking out just what I want my letter to friends and family to say to put them all at ease. Pathetic as it sounds I adopted two cats after I sold my weapons at the end of 2011. They are probably the only things keeping me going. I know I need help. But I don't know if I want it at this point or if I can bring myself to seek it. I know it's wrong to fantasize about suicide. But it's the only thought that brings me joy some times. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248ey0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Tugwater", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248ey0/daily_struggle/", "name": "t3_248ey0", "created": 1398759079.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248ey0/daily_struggle/", "author_flair_text": null, "title": "Daily Struggle", "created_utc": 1398730279.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch59sg9", "gilded": 0, "author": "Tugwater", "parent_id": "t1_ch4omx8", "approved_by": null, "body": "Thank you for your reply. My little furballs are a big thing that help me keep on keepin' on. I know they need me and love me. I know it's not the right answer but I don't want to tell my family. I know my mom worries enough about me. I'm not giving up yet I just had to share somewhere that I have these thoughts. I hope you have a wonderful day. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply. My little furballs are a big thing that help me keep on keepin&amp;#39; on. I know they need me and love me. I know it&amp;#39;s not the right answer but I don&amp;#39;t want to tell my family. I know my mom worries enough about me. I&amp;#39;m not giving up yet I just had to share somewhere that I have these thoughts. I hope you have a wonderful day. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248ey0", "score_hidden": false, "name": "t1_ch59sg9", "created": 1398802135.0, "author_flair_text": null, "created_utc": 1398798535.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4omx8", "gilded": 0, "author": "ohmercyme27", "parent_id": "t3_248ey0", "approved_by": null, "body": "First i want to say thanks for your service. I appreciate all you hard-working guys and gals do over there. Lean on your family at this time of need, i'm sure they'd be glad to help you. Nothing worse than losing a loved one to suicide. And hey, you have 2 cats so that is awesome! I love mine! I also have 2 :) they rely on their people, so dont leave them! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First i want to say thanks for your service. I appreciate all you hard-working guys and gals do over there. Lean on your family at this time of need, i&amp;#39;m sure they&amp;#39;d be glad to help you. Nothing worse than losing a loved one to suicide. And hey, you have 2 cats so that is awesome! I love mine! I also have 2 :) they rely on their people, so dont leave them! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248ey0", "score_hidden": false, "name": "t1_ch4omx8", "created": 1398740367.0, "author_flair_text": null, "created_utc": 1398736767.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]