[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just posting here because I&amp;#39;m hoping that writing out my thoughts will actually help somewhat.  Obviously this is a throwaway account.&lt;/p&gt;\n\n&lt;p&gt;I was in my second year of college with (who i thought was) a great girlfriend, a good group of friends, and good grades.  I got arrested right before Christmas for a felony crime and I&amp;#39;m currently out on bail. After that happened, I got expelled from school, my girlfriend left me (Doesn&amp;#39;t even talk to me anymore) and none of my friends from school talk to me anymore either. I&amp;#39;ve been working with my father making about $13/hour since March and living at home.  I thought that I was going to be able to get PTI since I don&amp;#39;t have any priors but I&amp;#39;m going to be indicted very soon, and my lawyer said that I&amp;#39;m most likely going to be a convicted felon.  &lt;/p&gt;\n\n&lt;p&gt;I hate my life now, and all I want to do is go back to the way things were, and I hate that that will never happen.  I miss my friends, I miss my ex, and I had practically begged her to at least stick with me as my friend since I&amp;#39;m going through such a difficult time, and I was given a bunch of empty promises.  I feel as though I don&amp;#39;t have anything to look forward to in the future as a felon, and every day is filled with stress.  I don&amp;#39;t find happiness or joy in anything anymore, and I&amp;#39;m severely depressed. I haven&amp;#39;t told anyone because I know my family needs me to be okay. Most of the time I just think about how much I wished that I were dead so that I could escape this constant pain.  I don&amp;#39;t see a point to life anymore, and I wouldn&amp;#39;t even be able to join the military as a felon so that I could die in an honorable way.  I keep thinking of different ways to kill myself, and I think that sometime this summer I&amp;#39;ll actually go through with it.  I don&amp;#39;t have anything to live for anyway, and I would way rather feel nothing than feel this kind of pain.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm just posting here because I'm hoping that writing out my thoughts will actually help somewhat.  Obviously this is a throwaway account.\n\nI was in my second year of college with (who i thought was) a great girlfriend, a good group of friends, and good grades.  I got arrested right before Christmas for a felony crime and I'm currently out on bail. After that happened, I got expelled from school, my girlfriend left me (Doesn't even talk to me anymore) and none of my friends from school talk to me anymore either. I've been working with my father making about $13/hour since March and living at home.  I thought that I was going to be able to get PTI since I don't have any priors but I'm going to be indicted very soon, and my lawyer said that I'm most likely going to be a convicted felon.  \n\nI hate my life now, and all I want to do is go back to the way things were, and I hate that that will never happen.  I miss my friends, I miss my ex, and I had practically begged her to at least stick with me as my friend since I'm going through such a difficult time, and I was given a bunch of empty promises.  I feel as though I don't have anything to look forward to in the future as a felon, and every day is filled with stress.  I don't find happiness or joy in anything anymore, and I'm severely depressed. I haven't told anyone because I know my family needs me to be okay. Most of the time I just think about how much I wished that I were dead so that I could escape this constant pain.  I don't see a point to life anymore, and I wouldn't even be able to join the military as a felon so that I could die in an honorable way.  I keep thinking of different ways to kill myself, and I think that sometime this summer I'll actually go through with it.  I don't have anything to live for anyway, and I would way rather feel nothing than feel this kind of pain.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241urx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "PotatoSids", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241urx/death_seems_like_the_only_option_m19/", "name": "t3_241urx", "created": 1398570212.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241urx/death_seems_like_the_only_option_m19/", "author_flair_text": null, "title": "Death seems like the only option [M19]", "created_utc": 1398541412.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch31aqk", "gilded": 0, "author": "sofar1776", "parent_id": "t3_241urx", "approved_by": null, "body": "I am sorry for what happened. I have no idea what happened before Christmas, but you already have a lawyer and that is more help than I can give you there. However, if you did something wrong you face the consequences. A lot of people who have bad things in their background went on to be successful. Look at famous people like Tim Allen or Robert Downey Jr. They had bad things in their history and they are big famous actors. Or there is the chance to help younger people avoid whatever pitfall you fell into by becoming a speaker. There are still ways you would be able to contribute to the world even if you were a convicted felon who had served his sentence. Please think about it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry for what happened. I have no idea what happened before Christmas, but you already have a lawyer and that is more help than I can give you there. However, if you did something wrong you face the consequences. A lot of people who have bad things in their background went on to be successful. Look at famous people like Tim Allen or Robert Downey Jr. They had bad things in their history and they are big famous actors. Or there is the chance to help younger people avoid whatever pitfall you fell into by becoming a speaker. There are still ways you would be able to contribute to the world even if you were a convicted felon who had served his sentence. Please think about it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241urx", "score_hidden": false, "name": "t1_ch31aqk", "created": 1398571717.0, "author_flair_text": null, "created_utc": 1398568117.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]