[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is literally the first time I&amp;#39;ve ever written on Reddit and the first time I&amp;#39;m ever going to put into words the way I&amp;#39;ve been feeling. \nI don&amp;#39;t know if this is actually the right subreddit because I don&amp;#39;t know how actually suicidal I am.\nI was deployed in Operation Iraqi Freedom and an very proud of the work I did in support of my nation. I do not feel guilty at all for the things I had to do. I do however feel, that since I came back I have not been the same person. I feel confused all the time. I&amp;#39;ve been very depressed, anxious and angry. I have drank more than most of you have spilt and have been abusing every drug I can get ahold of. I&amp;#39;ve tried once, with 29x the dose of sleeping pills, but somehow made it through.\nI&amp;#39;ve since gotten out of the military after a few run-ins with the law, albeit honorably, and have gotten disability from Veterans Administration. \nI would say the past week or so has been extraordinarily difficult. I don&amp;#39;t know why exactly, but I don&amp;#39;t think I&amp;#39;ve been any lower than what I&amp;#39;m feeling right now.\nI am not going to go into detail about the things that happened to me and I&amp;#39;m not that great at writing these poetic stories I&amp;#39;ve read on here. \nWhat I will say is this: I know I&amp;#39;m struggling with alcohol and opiates, I have for some time now... I know I have PTSD and I&amp;#39;m not handling it the way I should be. I just don&amp;#39;t know where to go. The VA is a joke, and I&amp;#39;m in a place I don&amp;#39;t belong where I know no one. I feel alone and its miserable. \nI just recently had a son, the greatest feeling I think I&amp;#39;ve ever had. I created a life and now I want to erase mine. \nI know its selfish, because I know he needs a father and I know I can be a great one, but I feel I would be better off if I were gone now, rather than later.\nThe feeling of impending injury or death is a terrible thing to have to deal with. It&amp;#39;s something I can&amp;#39;t put into words, but I know something will happen to me, and I would rather be the one to do it.&lt;/p&gt;\n\n&lt;p&gt;Please just give me your honest opinion. If there are any grunts (11b) reading this please give me something uplifting because I got nobody right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is literally the first time I've ever written on Reddit and the first time I'm ever going to put into words the way I've been feeling. \nI don't know if this is actually the right subreddit because I don't know how actually suicidal I am.\nI was deployed in Operation Iraqi Freedom and an very proud of the work I did in support of my nation. I do not feel guilty at all for the things I had to do. I do however feel, that since I came back I have not been the same person. I feel confused all the time. I've been very depressed, anxious and angry. I have drank more than most of you have spilt and have been abusing every drug I can get ahold of. I've tried once, with 29x the dose of sleeping pills, but somehow made it through.\nI've since gotten out of the military after a few run-ins with the law, albeit honorably, and have gotten disability from Veterans Administration. \nI would say the past week or so has been extraordinarily difficult. I don't know why exactly, but I don't think I've been any lower than what I'm feeling right now.\nI am not going to go into detail about the things that happened to me and I'm not that great at writing these poetic stories I've read on here. \nWhat I will say is this: I know I'm struggling with alcohol and opiates, I have for some time now... I know I have PTSD and I'm not handling it the way I should be. I just don't know where to go. The VA is a joke, and I'm in a place I don't belong where I know no one. I feel alone and its miserable. \nI just recently had a son, the greatest feeling I think I've ever had. I created a life and now I want to erase mine. \nI know its selfish, because I know he needs a father and I know I can be a great one, but I feel I would be better off if I were gone now, rather than later.\nThe feeling of impending injury or death is a terrible thing to have to deal with. It's something I can't put into words, but I know something will happen to me, and I would rather be the one to do it.\n\nPlease just give me your honest opinion. If there are any grunts (11b) reading this please give me something uplifting because I got nobody right now.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249fei", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "joshs89", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249fei/depressed_vet/", "name": "t3_249fei", "created": 1398787285.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249fei/depressed_vet/", "author_flair_text": null, "title": "Depressed Vet", "created_utc": 1398758485.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4xj0f", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_249fei", "approved_by": null, "body": "What things have you found the most confusing?  Thanks for your service; you're certainly a much braver man than I.  To be honest, I can't claim to know what you've been through, but I can say that you're almost certainly not the only veteran facing that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What things have you found the most confusing?  Thanks for your service; you&amp;#39;re certainly a much braver man than I.  To be honest, I can&amp;#39;t claim to know what you&amp;#39;ve been through, but I can say that you&amp;#39;re almost certainly not the only veteran facing that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249fei", "score_hidden": false, "name": "t1_ch4xj0f", "created": 1398795395.0, "author_flair_text": null, "created_utc": 1398766595.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch58wgq", "gilded": 0, "author": "GeneralSmooth", "parent_id": "t3_249fei", "approved_by": null, "body": "Pm me. I will give you my # you can call me. I am an AD member who suffered from depression and anxiety and sought treatment. I am 100% better now. You do have options for treatment. Use them.\n\nEdit: website with resources. http://www.restorewarriors.org/professional-help/where-can-i-find-help.aspx ", "edited": 1398797112.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pm me. I will give you my # you can call me. I am an AD member who suffered from depression and anxiety and sought treatment. I am 100% better now. You do have options for treatment. Use them.&lt;/p&gt;\n\n&lt;p&gt;Edit: website with resources. &lt;a href=\"http://www.restorewarriors.org/professional-help/where-can-i-find-help.aspx\"&gt;http://www.restorewarriors.org/professional-help/where-can-i-find-help.aspx&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249fei", "score_hidden": false, "name": "t1_ch58wgq", "created": 1398800416.0, "author_flair_text": null, "created_utc": 1398796816.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}]