[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everything seems to get more and more messed up. I just can&amp;#39;t bring myself to be motivated to do anything. Sometimes I feel so sad I just don&amp;#39;t know how to cope with my sadness and stress. I just want to be happy and free, I don&amp;#39;t want to be chained to anything that brings me down for the rest of my life. I&amp;#39;ve got these IB exams coming up in less than 9 days, how on Earth am I supposed to survive? I&amp;#39;ve scored severely low on my predicted grades, I feel that I don&amp;#39;t think I&amp;#39;ll ever be enough. My life feels like a never ending war, a roller coaster, a hard strive to endure. It seems as almost that everyone goes on and lives their own happy life, and there I am struggling to keep up.&lt;/p&gt;\n\n&lt;p&gt;My life is a fucking train wreck.&lt;/p&gt;\n\n&lt;p&gt;My family is broke. Period. My dad is the breadwinner of the family, I&amp;#39;ve heard that his business isn&amp;#39;t going well. The other day at around 4-5ish AM he was on the phone with some banker. He sounded pissed, he sounded frustrated - then suddenly he started crying while he was talking to the guy on the phone.\nI know my parents really love their 3 children. But there is a fine line between loving them and spoiling the shit out of them. I have a little brother, age 7, he&amp;#39;s the most spoiled little kid I&amp;#39;ve known for his age. My parents buy him everything he asks for and goes out on to theme parks and arcade playgrounds with him. We&amp;#39;re fucking broke, and my parents buys him literally everything he asks for. He can&amp;#39;t even eat right - my dad lets him eat whatever the fuck he wants. He&amp;#39;s got dietary issues, still they don&amp;#39;t give a shit. Even when the kid is fucking sick, they&amp;#39;ll let him eat junk food. And when it comes to taking his medicine, he refuses to take it. He refuses to do any of his homework and prefers to watch youtube videos on the tablet. And he has learnt a couple cuss words - and he get&amp;#39;s away with using them on me. Sometimes, I think technology is one of the reasons why our family is fucked up. When they parented my older sis and I, they were strict as FUCK. When it comes to him, &amp;quot;Oh he&amp;#39;s just a kid.&amp;quot; &amp;quot;Oh he&amp;#39;s just a baby.&amp;quot; NO THIS LITTLE KID YOU&amp;quot;VE RAISED IS FUCKING 7 YEARS OLD. HE&amp;quot;S SPOILED ROTTEN. OPEN YOUR DAMN EYES. Our home looks like a dump. This little boy&amp;#39;s toys takes up over a quarter of the space in the fucking living room. Ok, enough about the kid.&lt;/p&gt;\n\n&lt;p&gt;Hear me out. My mom doesn&amp;#39;t do anything at home. She just watches K-drama on her phone all day and night. But I&amp;#39;m happy to know she&amp;#39;s recently got a job. My mom has high blood pressure and is severely unfit. My mom keeps saying she wants to lose weight, but she isn&amp;#39;t willing to commit. She eats instant ramen and junk every day, does no exercise, takes frequent naps and moves very little around the house. I really don&amp;#39;t know what to say. My mom still buys snacks every day from local grocery stores. I really don&amp;#39;t know what the heck am I supposed to say.&lt;/p&gt;\n\n&lt;p&gt;My dad. He loves us very &amp;quot;dearly&amp;quot;. But nevertheless, he&amp;#39;s really lazy. He wakes up really late and goes to bed really late. It&amp;#39;s a horrible lifestyle. He&amp;#39;s always either up watching telly, in bed asleep or outside doing god knows what. We&amp;#39;re fucking broke, and my dad is still willing to force me to take piano lessons. Those lessons are expensive. We don&amp;#39;t have a piano at home thanks to the &amp;quot;lovely&amp;quot; kid mentioned, therefore I have to find time and money to practice outside of home. (If I don&amp;#39;t practice my coach get&amp;#39;s pissed.) My dad loves to use every little thing I&amp;#39;ve done wrong against me. Even my past relationship. He loves using cuss words at (my sis, mom and I), calls us bitch, shit etc. Sometimes he dehumanizes us by calling us animals. And he believes that we are all bad influences on his son. I get treated by him as if I&amp;#39;m a kid. I want personal space, I want to move out as soon as possible.\nMy parents don&amp;#39;t get along with each other anymore. I wish I could just go back to the times before we had anything bad happen to us. Before my brother was born.&lt;/p&gt;\n\n&lt;p&gt;My sis studies at university - a very prestigious university in my country. We live a relatively short distance from it so she stays at home. My sis has her own bank account, apparently my Dad has been asking her for her money every week (around $900 US dollars per week). I don&amp;#39;t think she has her own income.. She was planning to save up to go on vacation with me. But now, it seems rather pointless.&lt;/p&gt;\n\n&lt;p&gt;I just really don&amp;#39;t know what to do anymore - sometimes I feel suicidal, sometimes I want to live. Sometimes, I picture myself being hanged in a classroom at school or jumping off the rooftop of the school. I know I have people that care, but sometimes I feel that the bad does that outweigh the good by far amount. I&amp;#39;ve had a history of cutting myself, and sometimes it seems rather like it&amp;#39;s the best solution to just not live anymore. As much as I love some people I know, I think that I&amp;#39;m just better off being non existent.&lt;/p&gt;\n\n&lt;p&gt;I know I should&amp;#39;ve been revising.&lt;/p&gt;\n\n&lt;p&gt;(*Edit Minor adjustments and formatting)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Everything seems to get more and more messed up. I just can't bring myself to be motivated to do anything. Sometimes I feel so sad I just don't know how to cope with my sadness and stress. I just want to be happy and free, I don't want to be chained to anything that brings me down for the rest of my life. I've got these IB exams coming up in less than 9 days, how on Earth am I supposed to survive? I've scored severely low on my predicted grades, I feel that I don't think I'll ever be enough. My life feels like a never ending war, a roller coaster, a hard strive to endure. It seems as almost that everyone goes on and lives their own happy life, and there I am struggling to keep up.\n\nMy life is a fucking train wreck.\n\nMy family is broke. Period. My dad is the breadwinner of the family, I've heard that his business isn't going well. The other day at around 4-5ish AM he was on the phone with some banker. He sounded pissed, he sounded frustrated - then suddenly he started crying while he was talking to the guy on the phone.\nI know my parents really love their 3 children. But there is a fine line between loving them and spoiling the shit out of them. I have a little brother, age 7, he's the most spoiled little kid I've known for his age. My parents buy him everything he asks for and goes out on to theme parks and arcade playgrounds with him. We're fucking broke, and my parents buys him literally everything he asks for. He can't even eat right - my dad lets him eat whatever the fuck he wants. He's got dietary issues, still they don't give a shit. Even when the kid is fucking sick, they'll let him eat junk food. And when it comes to taking his medicine, he refuses to take it. He refuses to do any of his homework and prefers to watch youtube videos on the tablet. And he has learnt a couple cuss words - and he get's away with using them on me. Sometimes, I think technology is one of the reasons why our family is fucked up. When they parented my older sis and I, they were strict as FUCK. When it comes to him, \"Oh he's just a kid.\" \"Oh he's just a baby.\" NO THIS LITTLE KID YOU\"VE RAISED IS FUCKING 7 YEARS OLD. HE\"S SPOILED ROTTEN. OPEN YOUR DAMN EYES. Our home looks like a dump. This little boy's toys takes up over a quarter of the space in the fucking living room. Ok, enough about the kid.\n\nHear me out. My mom doesn't do anything at home. She just watches K-drama on her phone all day and night. But I'm happy to know she's recently got a job. My mom has high blood pressure and is severely unfit. My mom keeps saying she wants to lose weight, but she isn't willing to commit. She eats instant ramen and junk every day, does no exercise, takes frequent naps and moves very little around the house. I really don't know what to say. My mom still buys snacks every day from local grocery stores. I really don't know what the heck am I supposed to say.\n\nMy dad. He loves us very \"dearly\". But nevertheless, he's really lazy. He wakes up really late and goes to bed really late. It's a horrible lifestyle. He's always either up watching telly, in bed asleep or outside doing god knows what. We're fucking broke, and my dad is still willing to force me to take piano lessons. Those lessons are expensive. We don't have a piano at home thanks to the \"lovely\" kid mentioned, therefore I have to find time and money to practice outside of home. (If I don't practice my coach get's pissed.) My dad loves to use every little thing I've done wrong against me. Even my past relationship. He loves using cuss words at (my sis, mom and I), calls us bitch, shit etc. Sometimes he dehumanizes us by calling us animals. And he believes that we are all bad influences on his son. I get treated by him as if I'm a kid. I want personal space, I want to move out as soon as possible.\nMy parents don't get along with each other anymore. I wish I could just go back to the times before we had anything bad happen to us. Before my brother was born.\n\nMy sis studies at university - a very prestigious university in my country. We live a relatively short distance from it so she stays at home. My sis has her own bank account, apparently my Dad has been asking her for her money every week (around $900 US dollars per week). I don't think she has her own income.. She was planning to save up to go on vacation with me. But now, it seems rather pointless.\n\nI just really don't know what to do anymore - sometimes I feel suicidal, sometimes I want to live. Sometimes, I picture myself being hanged in a classroom at school or jumping off the rooftop of the school. I know I have people that care, but sometimes I feel that the bad does that outweigh the good by far amount. I've had a history of cutting myself, and sometimes it seems rather like it's the best solution to just not live anymore. As much as I love some people I know, I think that I'm just better off being non existent.\n\nI know I should've been revising.\n\n(*Edit Minor adjustments and formatting)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23y9py", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "HaTzeKiu", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23y9py/depressed_teen_hi_im_back_again/", "name": "t3_23y9py", "created": 1398463545.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23y9py/depressed_teen_hi_im_back_again/", "author_flair_text": null, "title": "Depressed teen - Hi I'm back again.", "created_utc": 1398434745.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch24ali", "gilded": 0, "author": "jlgchilipepper", "parent_id": "t3_23y9py", "approved_by": null, "body": "You have to get out of the house in every way possible. Just sleep, shower and eat there. Go to the gym when things get rough at home and use any hobby you have to get past your insecurities. It does sound bad I agree. However, your sister got out of the predicament and so can you. She has an ivy league education...who the fuck cares?  Don't compare yourself to her be your own man and keep your head up.  Easier said then done I know (trust me). In order for you to grow as a person you have to get out of your comfort zone.  Never go to the source of discomfort for comfort. Based on what your saying you're parents aren't completely \"reliable\" in the parenting department. I don't know anything about that test but its just a test there are people who do terribly on SATS and still go to decent schools. You need to reach out to your sister when you are feeling like this. It may be awkward but she might like you reaching out, you never know. Stay strong my friend. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to get out of the house in every way possible. Just sleep, shower and eat there. Go to the gym when things get rough at home and use any hobby you have to get past your insecurities. It does sound bad I agree. However, your sister got out of the predicament and so can you. She has an ivy league education...who the fuck cares?  Don&amp;#39;t compare yourself to her be your own man and keep your head up.  Easier said then done I know (trust me). In order for you to grow as a person you have to get out of your comfort zone.  Never go to the source of discomfort for comfort. Based on what your saying you&amp;#39;re parents aren&amp;#39;t completely &amp;quot;reliable&amp;quot; in the parenting department. I don&amp;#39;t know anything about that test but its just a test there are people who do terribly on SATS and still go to decent schools. You need to reach out to your sister when you are feeling like this. It may be awkward but she might like you reaching out, you never know. Stay strong my friend. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23y9py", "score_hidden": false, "name": "t1_ch24ali", "created": 1398468625.0, "author_flair_text": null, "created_utc": 1398465025.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]