[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m only posting here because I lack the knowledge of other subreddits. &lt;/p&gt;\n\n&lt;p&gt;I truly hate life. I hate the world that we live in, people are shit. It&amp;#39;s disgusting. So many things are so fucked up, skewed and ultimately out of our control because humans are incompetent fucks. We are our own worst nightmare. There is more to this however I feel I lack the intelligence and vocabulary to truly describe that humans do not deserve life, here, in this place. We should be exterminated.&lt;/p&gt;\n\n&lt;p&gt;On top of this, my individual life is shit. I hardly make enough money to feed myself. Over the years my situation gets worse and worse, physically and mentally. I have somehow blown any opportunity of anything I have ever wanted, and any chance for success. I&amp;#39;ve watched/watching my life go by and of course I can&amp;#39;t stop time. I still go to work every day, put on a believable fake smile. No one is the wiser that I prayed not to wake up that day, most days. &lt;/p&gt;\n\n&lt;p&gt;The first time I &amp;quot;attempted&amp;quot; suicide, was on a  subconscious level. I didn&amp;#39;t even know I did it(took about 10 ambien). Thinking back I had a sense of relief as I went to bed only have taken one. I have no memory of taking more. So trying to end my life on a subconscious level, what the fuck does that say? Usually it&amp;#39;s the other way around with that part of your brain preventing suicide. &lt;/p&gt;\n\n&lt;p&gt;I feel I have (or should have) died at that point, and since I&amp;#39;ve been living in a personal hell. Only way I can describe it. A very intense never ending uncontrollable mind fuck. &lt;/p&gt;\n\n&lt;p&gt;The same reasons I would see myself wanting to live are the same reasons I&amp;#39;m content with death. I&amp;#39;ve experienced love, physical endurance, accomplishment in a variety of hobbies. I don&amp;#39;t see any reason for me to say &amp;quot;I&amp;#39;m not done yet&amp;quot; so realistically I am waiting for the inevitable.. Death. It&amp;#39;s going to happen one way or another. I&amp;#39;m limping along in a world that knocks me down in ways that are beyond my control. &lt;/p&gt;\n\n&lt;p&gt;I DONT want to commit suicide. I try to convince my body to naturally &amp;quot;shut down&amp;quot; as I lay to sleep. Or hope for some strange rare disease to cause me to pass in my sleep. When I imagine this being the case, I have a sense if relief, I am actually happy. &lt;/p&gt;\n\n&lt;p&gt;I feel I think logically about all this. I see a world that I don&amp;#39;t want to be apart of. \nEven the best of the best in this world see when odds are against them and abort. There IS no answer. There is NO point. &lt;/p&gt;\n\n&lt;p&gt;I want to end this without commuting suicide, even if it takes learning how to let my brain tell my body to shut down, it&amp;#39;s going to happen sooner or later, one way or another. There is nothing keeping me here willingly.   &lt;/p&gt;\n\n&lt;p&gt;EDIT: I&amp;#39;m actually getting to the point of suicide again. I&amp;#39;m sick of life, it&amp;#39;s a pointless bullshit existence.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm only posting here because I lack the knowledge of other subreddits. \n\nI truly hate life. I hate the world that we live in, people are shit. It's disgusting. So many things are so fucked up, skewed and ultimately out of our control because humans are incompetent fucks. We are our own worst nightmare. There is more to this however I feel I lack the intelligence and vocabulary to truly describe that humans do not deserve life, here, in this place. We should be exterminated.\n\nOn top of this, my individual life is shit. I hardly make enough money to feed myself. Over the years my situation gets worse and worse, physically and mentally. I have somehow blown any opportunity of anything I have ever wanted, and any chance for success. I've watched/watching my life go by and of course I can't stop time. I still go to work every day, put on a believable fake smile. No one is the wiser that I prayed not to wake up that day, most days. \n \nThe first time I \"attempted\" suicide, was on a  subconscious level. I didn't even know I did it(took about 10 ambien). Thinking back I had a sense of relief as I went to bed only have taken one. I have no memory of taking more. So trying to end my life on a subconscious level, what the fuck does that say? Usually it's the other way around with that part of your brain preventing suicide. \n\nI feel I have (or should have) died at that point, and since I've been living in a personal hell. Only way I can describe it. A very intense never ending uncontrollable mind fuck. \n\nThe same reasons I would see myself wanting to live are the same reasons I'm content with death. I've experienced love, physical endurance, accomplishment in a variety of hobbies. I don't see any reason for me to say \"I'm not done yet\" so realistically I am waiting for the inevitable.. Death. It's going to happen one way or another. I'm limping along in a world that knocks me down in ways that are beyond my control. \n\nI DONT want to commit suicide. I try to convince my body to naturally \"shut down\" as I lay to sleep. Or hope for some strange rare disease to cause me to pass in my sleep. When I imagine this being the case, I have a sense if relief, I am actually happy. \n\nI feel I think logically about all this. I see a world that I don't want to be apart of. \nEven the best of the best in this world see when odds are against them and abort. There IS no answer. There is NO point. \n\nI want to end this without commuting suicide, even if it takes learning how to let my brain tell my body to shut down, it's going to happen sooner or later, one way or another. There is nothing keeping me here willingly.   \n\nEDIT: I'm actually getting to the point of suicide again. I'm sick of life, it's a pointless bullshit existence.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2519td", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Psychopsilocybin87", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399729748.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2519td/descriptive_title/", "name": "t3_2519td", "created": 1399579721.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2519td/descriptive_title/", "author_flair_text": null, "title": "Descriptive title", "created_utc": 1399550921.0, "ups": 5, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcqxqm", "gilded": 0, "author": "OIP", "parent_id": "t3_2519td", "approved_by": null, "body": "&gt; I see a world that I don't want to be apart of. Even the best of the best in this world see when odds are against them and abort. There IS no answer. There is NO point.\n\nyou could check out 'the oustider' by albert camus if you haven't already. there's different kinds of 'no point'.  some actually pretty reassuring..\n\nit's definitely relieving to think about not having to live any more.  i mean, life and the world is full of a whole bunch of things, and particularly individual lives have a lot of pain in them.  but there's lots of amazing things too, i don't know if you can claim there is *nothing* good or worth living for in the world even if it feels like it.  i'm not saying that feeling isn't convincing, because it is, but you can peek around it sometimes.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I see a world that I don&amp;#39;t want to be apart of. Even the best of the best in this world see when odds are against them and abort. There IS no answer. There is NO point.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;you could check out &amp;#39;the oustider&amp;#39; by albert camus if you haven&amp;#39;t already. there&amp;#39;s different kinds of &amp;#39;no point&amp;#39;.  some actually pretty reassuring..&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s definitely relieving to think about not having to live any more.  i mean, life and the world is full of a whole bunch of things, and particularly individual lives have a lot of pain in them.  but there&amp;#39;s lots of amazing things too, i don&amp;#39;t know if you can claim there is &lt;em&gt;nothing&lt;/em&gt; good or worth living for in the world even if it feels like it.  i&amp;#39;m not saying that feeling isn&amp;#39;t convincing, because it is, but you can peek around it sometimes.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2519td", "score_hidden": false, "name": "t1_chcqxqm", "created": 1399590313.0, "author_flair_text": null, "created_utc": 1399561513.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]