[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know why I&amp;#39;m doing this, because I&amp;#39;ve always been skeptical as to how much other people really can help.&lt;/p&gt;\n\n&lt;p&gt;The thing is, all my life has been a wreck, with classic issues like parents divorcing, various illnesses (eczema, allergies, scoliosis, asthma, and other stuff I can&amp;#39;t even remember), social awkwardness (having a very noticeable skin disease doesn&amp;#39;t help much), and what not... For as long as I can remember, I have never wanted to live, it&amp;#39;s just an endless torment, I&amp;#39;ve seen psychiatrists, psychologists, other doctors and all they can really do is give me pills to suppress emotions, which work to some extent, but don&amp;#39;t really do the trick in the long run. There has only been 1 time in my life where I (thought I) was happy. Yes, I am talking about love. Having had no love life whatsoever had left me desperate, so basically whoever was interested, I almost immediately reciprocated.&lt;/p&gt;\n\n&lt;p&gt;But wait.. I&amp;#39;m getting caught up here, I might wanna work a little more chronologically..&lt;/p&gt;\n\n&lt;p&gt;First things first, I&amp;#39;m a 20-year-old European guy, with an 18-year-old brother and until I was 10, only my illnesses were the problem. Then, my parents left each other, and we were stuck with lawsuits and other divorce crap, and we would get pulled outta school every now and then go to court (yes, at that age), but when I was 13, I basically ran away from my dad and never looked back, but the problems didn&amp;#39;t stop because he was putting so much pressure on my mother (financially and emotionally), and it has never been easy. My mother was irritable because of it, and when I started hitting puberty, it never went well. We knew each other&amp;#39;s problems but just knowing about isn&amp;#39;t enough, we just couldn&amp;#39;t help each other. &lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t mean to me or anything, I always loved her and always will, but I moved out when I was 17 because it just went horribly. On my 18th birthday, my grandfather died of cancer, and he was the one who &amp;quot;saved&amp;quot; me from my father (he picked me up in the middle of nowhere when I ran away). I then went to live with my grandmother, so that she wouldn&amp;#39;t be alone, but after about a year I couldn&amp;#39;t stand it anymore, she had 0 respect for privacy, a severe drinking problem (the kind where she became very agressive) and it had already traumatized me a million times in my past, the fact that she smokes like a chimney, dogs, and it&amp;#39;s in a small town next to a forest, so not only personal problems, but also health.&lt;/p&gt;\n\n&lt;p&gt;I then moved away, both for those reasons and I moved to a big city so I could study there as well. It was a little ways so I kinda lost all my friends by doing that, I sometimes meet up with 1 of them and sometimes I take the train to my hometown but I cannot always so I am usually just all alone. In my first year of college, I made some friends, whom I would do my projects with and talk to in school, but never really hung out with. Also in  that year, I met a girl, and she was younger than me, and I didn&amp;#39;t really think about it, but she turned very seductive, so desperate me was quickly sold but after already 3 months, it was more than obvious she was a slut who didn&amp;#39;t actually care about me, but I had already put too much trust in her and loved her too much so, obviously, I fell pretty deep. I was already depressed years before that, but that made it way worse. Against her will, I became friends with her friends, but when she dropped me, all I was left with was her twin sister and her best friend. &lt;/p&gt;\n\n&lt;p&gt;The twins already had some stuff going on personally so she tried to become my best friend and she succeeded, she was there when I needed her, and also quickly became like my own sister, but when her sis had a new boyfriend who wouldn&amp;#39;t even talk to her, she dropped me like a brick, which left me with only their best friend. And she is the best, after more than a year, we are still best friends, and even though we argue all the time (because she too lives a little ways and is younger so...) but in the end, we&amp;#39;re always there. &lt;/p&gt;\n\n&lt;p&gt;Last night, she was also talking about just giving up because we were always fighting, and we&amp;#39;re both too stubborn to give in, and that&amp;#39;s when I hit a new low. I had always thought about suicide, and had &amp;quot;tried&amp;quot; twice in the past (once failed, once didn&amp;#39;t go through) so I found all the pills I had in my house (way more than enough due to all illnesses and they were some strong pill) and took them all using almost 2 bottles of vodka. She suddenly started calling, texting, and leaving voicemail like a maniac because she started worrying, and after I heard her sobbing and crying on the voicemail, I couldn&amp;#39;t bear to hear her like that, and I threw up as much as I could, and drank a ton of water to try to get as much of that garbage outta me as possible, but and I don&amp;#39;t know how, and it took all night, but in the morning, I was still pretty groggy, but I managed... She was the sole I quit. &lt;/p&gt;\n\n&lt;p&gt;But I love her too much, and unfortunately, no longer only platonic, which had also caused a lot of troubles, because I had told her.&lt;/p&gt;\n\n&lt;p&gt;I was hesitant to tell her at first, because about 4 years ago, I had told someone else that I liked her, and even though we knew each other for 16 years, and were pretty good friends, we never spoke again.&lt;/p&gt;\n\n&lt;p&gt;Oh, more about college.. I lost my friends from college because I didn&amp;#39;t pass the year, and I had to take my freshman courses again, without the social ones that I passed, so I was left with accounting and financial planning and those other supersocial courses where you instantly make a ton of friends.. I stopped going to school and barely leave the house. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what else I can type for now, but if there are questions I will answer almost anything (no identification stuff or ages (no worries everything was legal)).&lt;/p&gt;\n\n&lt;p&gt;If there are people that have read through all this crap, thank you, you&amp;#39;re awesome. I have no clue how people can help very much, but I know that I cannot help myself without external help, so I&amp;#39;m ready to be proven wrong.. I have gotten a lot of professional help, but those are mainly pills.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I noticed how I mainly talk about the girls, which, since last year, have kind of taken over my life so that&amp;#39;s a pretty big part of it, and currently one of the bigger reasons for the depression.&lt;/p&gt;\n\n&lt;p&gt;Medically, I also have epilepsy at night, I sleep like shit (wake up 33 times/hour (tested in sleep lab), might have ADHD and autism, have had 2 psychotic episodes and have an irrational anxiety disorder.&lt;/p&gt;\n\n&lt;p&gt;My family is one completely broken by fighting over money, and my father has made sure to turn my mother&amp;#39;s family against her as well. We barely had any money during my growing up (and she still doesn&amp;#39;t) but she&amp;#39;s remarried right now so things are starting to go better for her. She knows I&amp;#39;m depressed, but she doesn&amp;#39;t know jack about my attempts, or even about the girls. My brother and I never got along, and even though that goes a lot better nowadays, we don&amp;#39;t have a bond where I can open up to him. He has a new girlfriend every 2 weeks and a lot of friends so I&amp;#39;m always jealous. &lt;/p&gt;\n\n&lt;p&gt;EDIT2: changed &amp;quot;Don&amp;#39;t believe people can help&amp;quot; to &amp;quot;Don&amp;#39;t know how they can help&amp;quot; because I do believe they can, but I have no idea how.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone,\n\nI don't know why I'm doing this, because I've always been skeptical as to how much other people really can help.\n\nThe thing is, all my life has been a wreck, with classic issues like parents divorcing, various illnesses (eczema, allergies, scoliosis, asthma, and other stuff I can't even remember), social awkwardness (having a very noticeable skin disease doesn't help much), and what not... For as long as I can remember, I have never wanted to live, it's just an endless torment, I've seen psychiatrists, psychologists, other doctors and all they can really do is give me pills to suppress emotions, which work to some extent, but don't really do the trick in the long run. There has only been 1 time in my life where I (thought I) was happy. Yes, I am talking about love. Having had no love life whatsoever had left me desperate, so basically whoever was interested, I almost immediately reciprocated.\n\nBut wait.. I'm getting caught up here, I might wanna work a little more chronologically..\n\nFirst things first, I'm a 20-year-old European guy, with an 18-year-old brother and until I was 10, only my illnesses were the problem. Then, my parents left each other, and we were stuck with lawsuits and other divorce crap, and we would get pulled outta school every now and then go to court (yes, at that age), but when I was 13, I basically ran away from my dad and never looked back, but the problems didn't stop because he was putting so much pressure on my mother (financially and emotionally), and it has never been easy. My mother was irritable because of it, and when I started hitting puberty, it never went well. We knew each other's problems but just knowing about isn't enough, we just couldn't help each other. \n\nShe wasn't mean to me or anything, I always loved her and always will, but I moved out when I was 17 because it just went horribly. On my 18th birthday, my grandfather died of cancer, and he was the one who \"saved\" me from my father (he picked me up in the middle of nowhere when I ran away). I then went to live with my grandmother, so that she wouldn't be alone, but after about a year I couldn't stand it anymore, she had 0 respect for privacy, a severe drinking problem (the kind where she became very agressive) and it had already traumatized me a million times in my past, the fact that she smokes like a chimney, dogs, and it's in a small town next to a forest, so not only personal problems, but also health.\n\n\nI then moved away, both for those reasons and I moved to a big city so I could study there as well. It was a little ways so I kinda lost all my friends by doing that, I sometimes meet up with 1 of them and sometimes I take the train to my hometown but I cannot always so I am usually just all alone. In my first year of college, I made some friends, whom I would do my projects with and talk to in school, but never really hung out with. Also in  that year, I met a girl, and she was younger than me, and I didn't really think about it, but she turned very seductive, so desperate me was quickly sold but after already 3 months, it was more than obvious she was a slut who didn't actually care about me, but I had already put too much trust in her and loved her too much so, obviously, I fell pretty deep. I was already depressed years before that, but that made it way worse. Against her will, I became friends with her friends, but when she dropped me, all I was left with was her twin sister and her best friend. \n\nThe twins already had some stuff going on personally so she tried to become my best friend and she succeeded, she was there when I needed her, and also quickly became like my own sister, but when her sis had a new boyfriend who wouldn't even talk to her, she dropped me like a brick, which left me with only their best friend. And she is the best, after more than a year, we are still best friends, and even though we argue all the time (because she too lives a little ways and is younger so...) but in the end, we're always there. \n\nLast night, she was also talking about just giving up because we were always fighting, and we're both too stubborn to give in, and that's when I hit a new low. I had always thought about suicide, and had \"tried\" twice in the past (once failed, once didn't go through) so I found all the pills I had in my house (way more than enough due to all illnesses and they were some strong pill) and took them all using almost 2 bottles of vodka. She suddenly started calling, texting, and leaving voicemail like a maniac because she started worrying, and after I heard her sobbing and crying on the voicemail, I couldn't bear to hear her like that, and I threw up as much as I could, and drank a ton of water to try to get as much of that garbage outta me as possible, but and I don't know how, and it took all night, but in the morning, I was still pretty groggy, but I managed... She was the sole I quit. \n\nBut I love her too much, and unfortunately, no longer only platonic, which had also caused a lot of troubles, because I had told her.\n\nI was hesitant to tell her at first, because about 4 years ago, I had told someone else that I liked her, and even though we knew each other for 16 years, and were pretty good friends, we never spoke again.\n\nOh, more about college.. I lost my friends from college because I didn't pass the year, and I had to take my freshman courses again, without the social ones that I passed, so I was left with accounting and financial planning and those other supersocial courses where you instantly make a ton of friends.. I stopped going to school and barely leave the house. \n\nI don't know what else I can type for now, but if there are questions I will answer almost anything (no identification stuff or ages (no worries everything was legal)).\n\nIf there are people that have read through all this crap, thank you, you're awesome. I have no clue how people can help very much, but I know that I cannot help myself without external help, so I'm ready to be proven wrong.. I have gotten a lot of professional help, but those are mainly pills.\n\nEDIT: I noticed how I mainly talk about the girls, which, since last year, have kind of taken over my life so that's a pretty big part of it, and currently one of the bigger reasons for the depression.\n\nMedically, I also have epilepsy at night, I sleep like shit (wake up 33 times/hour (tested in sleep lab), might have ADHD and autism, have had 2 psychotic episodes and have an irrational anxiety disorder.\n\nMy family is one completely broken by fighting over money, and my father has made sure to turn my mother's family against her as well. We barely had any money during my growing up (and she still doesn't) but she's remarried right now so things are starting to go better for her. She knows I'm depressed, but she doesn't know jack about my attempts, or even about the girls. My brother and I never got along, and even though that goes a lot better nowadays, we don't have a bond where I can open up to him. He has a new girlfriend every 2 weeks and a lot of friends so I'm always jealous. \n\nEDIT2: changed \"Don't believe people can help\" to \"Don't know how they can help\" because I do believe they can, but I have no idea how.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248giw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thatsitimout", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398791301.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248giw/didnt_go_through_last_night_but_maybe_next_time/", "name": "t3_248giw", "created": 1398760082.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248giw/didnt_go_through_last_night_but_maybe_next_time/", "author_flair_text": null, "title": "Didn't go through last night, but maybe next time...", "created_utc": 1398731282.0, "ups": 2, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9xhmt", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_ch96owd", "approved_by": null, "body": "Honestly, I think that's a pretty good reason not to kill yourself.  Sorry if I've asked this already, but if you could do anything with your life, what would it be?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I think that&amp;#39;s a pretty good reason not to kill yourself.  Sorry if I&amp;#39;ve asked this already, but if you could do anything with your life, what would it be?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch9xhmt", "created": 1399309546.0, "author_flair_text": null, "created_utc": 1399280746.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch96owd", "gilded": 0, "author": "thatsitimout", "parent_id": "t1_ch94wnt", "approved_by": null, "body": "yeah she does, and that's why I haven't done it yet, but she is the only who cares about it so :/", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah she does, and that&amp;#39;s why I haven&amp;#39;t done it yet, but she is the only who cares about it so :/&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch96owd", "created": 1399233521.0, "author_flair_text": null, "created_utc": 1399204721.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch94wnt", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_ch8mgq1", "approved_by": null, "body": "That's a lot!  If your mother spent all that on your various health problems, she certainly cares about you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a lot!  If your mother spent all that on your various health problems, she certainly cares about you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch94wnt", "created": 1399221440.0, "author_flair_text": null, "created_utc": 1399192640.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8mgq1", "gilded": 0, "author": "thatsitimout", "parent_id": "t1_ch8eark", "approved_by": null, "body": "Well it's been so much that i've seriously forgotten a few but psychosis, signs of autism, severe depression, allergies to way too many things (peanuts, milk, chocolate, pets, trees, pollen, ...), eczema, asthma, a dent in my spine (of which I can't remember the name), 4 years with a peptic ulcer that they didn't detect.. and some other stuff I can't immediately recall\n\nI also used to be sick a lot when I was younger so I'd find myself in the hospital pretty often.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it&amp;#39;s been so much that i&amp;#39;ve seriously forgotten a few but psychosis, signs of autism, severe depression, allergies to way too many things (peanuts, milk, chocolate, pets, trees, pollen, ...), eczema, asthma, a dent in my spine (of which I can&amp;#39;t remember the name), 4 years with a peptic ulcer that they didn&amp;#39;t detect.. and some other stuff I can&amp;#39;t immediately recall&lt;/p&gt;\n\n&lt;p&gt;I also used to be sick a lot when I was younger so I&amp;#39;d find myself in the hospital pretty often.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch8mgq1", "created": 1399166466.0, "author_flair_text": null, "created_utc": 1399137666.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8eark", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_ch568vi", "approved_by": null, "body": "What sort of health problems have you had?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What sort of health problems have you had?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch8eark", "created": 1399105521.0, "author_flair_text": null, "created_utc": 1399101921.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch568vi", "gilded": 0, "author": "thatsitimout", "parent_id": "t1_ch4xd1h", "approved_by": null, "body": "Well currently the only thing that is keeping me sane is my best friend, who started calling like a maniac even though she was a part of the reason I tried it... and for the rest, another reason why I'm still here is because my mother has always invested a lot of money into my health which gives me the guilty feeling when I think about that :/\n\nAnd yeah, you're probably right but it was a bit weird to see every post (including newer ones) getting all kinds of responses and not a single one here", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well currently the only thing that is keeping me sane is my best friend, who started calling like a maniac even though she was a part of the reason I tried it... and for the rest, another reason why I&amp;#39;m still here is because my mother has always invested a lot of money into my health which gives me the guilty feeling when I think about that :/&lt;/p&gt;\n\n&lt;p&gt;And yeah, you&amp;#39;re probably right but it was a bit weird to see every post (including newer ones) getting all kinds of responses and not a single one here&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch568vi", "created": 1398820293.0, "author_flair_text": null, "created_utc": 1398791493.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4xd1h", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_248giw", "approved_by": null, "body": "Wow, it seems like you have a lot going on.  Is there anything going on in your life that you're happy with?\n\n\nAlso, the lack of responses isn't because we don't care.  You just posted at a time of day when not many people are going to see it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, it seems like you have a lot going on.  Is there anything going on in your life that you&amp;#39;re happy with?&lt;/p&gt;\n\n&lt;p&gt;Also, the lack of responses isn&amp;#39;t because we don&amp;#39;t care.  You just posted at a time of day when not many people are going to see it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248giw", "score_hidden": false, "name": "t1_ch4xd1h", "created": 1398794348.0, "author_flair_text": null, "created_utc": 1398765548.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]