[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now I feel stupid and useless.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not the son my parents wanted me to be.&lt;/p&gt;\n\n&lt;p&gt;If God killed me everything would be easier.&lt;/p&gt;\n\n&lt;p&gt;I want to not-be, not exist.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Now I feel stupid and useless.\n\nI'm not the son my parents wanted me to be.\n\nIf God killed me everything would be easier.\n\nI want to not-be, not exist.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23yq54", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "LetMeFlyAway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23yq54/didnt_get_into_college_wanted/", "name": "t3_23yq54", "created": 1398473865.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23yq54/didnt_get_into_college_wanted/", "author_flair_text": null, "title": "Didn't get into college wanted", "created_utc": 1398445065.0, "ups": 2, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1vs3l", "gilded": 0, "author": "tempdontworry", "parent_id": "t3_23yq54", "approved_by": null, "body": "Hey, I know that feeling really well.  I didn't get into my first choice college.  Or my second.  Or third.  You get the picture.  This wasn't that long ago, and it baffled me.  I was the capable kid who everyone said could go anywhere, and I got a string of faceless, impersonal rejections.  It crushed everything I thought was important about me, and I didn't see a point in sticking around.  For me the worst thing was the tone: \"We have to reject many applicants who would succeed here, and we know you'll do well wherever you end up.\"  Motherfucker, that's not an explanation.\n\nWhen it hits, that feeling is awful.  I'm sorry.  It's a fucked up system with huge expectations and random chance driving choices between perfectly qualified candidates, and all I can say is that it's not you.  It's a mean, unpredictable system.  That said, I hope your parents won't genuinely be upset - I thought mine would be, and they turned out not to mind at all.  It's possible they will be though - if they are, know that they'll come around.  People aren't always as strong or understanding as they should be, but eventually they'll realize that it doesn't change a damn thing about you.\n\nThat said, I'm at school now.  I thought my parents and everyone else would be embarrassed for me.  I thought it would fuck up my future.  As it turns out, about 2 people judged me for the outcome, and they turned out to be assholes.  I'm getting a good education, I'm (reasonably) happy, and with each thing I learn and do the name on my school is mattering less.\n\nIt's one of the little secrets that no one will tell you because they're worried it'll make you less dedicated: college doesn't matter anywhere near as much as it looks like, especially undergrad.  The biggest advantage of the \"best\" colleges is a rubber stamp saying that you're clever, or strong, or maybe just rich or a good way to round out some graph.  The actual education?  Not that different.  Just having these expectations on you tells me that you're a capable person, however this turned out.  Someone dedicated enough to care about getting into a good college is someone who can make it wherever they end up (in or out of college).  Jobs give you an interview and judge you on what you can do, not on some silly damn essay and unknowable rubrics.  You can go anywhere, get what you need, and impress the world with what you do, not what name you did it under.\n\nPlease feel free to go into more about your situation if you want to share, and please know that there are a lot of us out there.  College acceptance reflects on the people doing the judging far more than it does on your value, and no matter what they say you're the same person you were before, and you can accomplish just as much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I know that feeling really well.  I didn&amp;#39;t get into my first choice college.  Or my second.  Or third.  You get the picture.  This wasn&amp;#39;t that long ago, and it baffled me.  I was the capable kid who everyone said could go anywhere, and I got a string of faceless, impersonal rejections.  It crushed everything I thought was important about me, and I didn&amp;#39;t see a point in sticking around.  For me the worst thing was the tone: &amp;quot;We have to reject many applicants who would succeed here, and we know you&amp;#39;ll do well wherever you end up.&amp;quot;  Motherfucker, that&amp;#39;s not an explanation.&lt;/p&gt;\n\n&lt;p&gt;When it hits, that feeling is awful.  I&amp;#39;m sorry.  It&amp;#39;s a fucked up system with huge expectations and random chance driving choices between perfectly qualified candidates, and all I can say is that it&amp;#39;s not you.  It&amp;#39;s a mean, unpredictable system.  That said, I hope your parents won&amp;#39;t genuinely be upset - I thought mine would be, and they turned out not to mind at all.  It&amp;#39;s possible they will be though - if they are, know that they&amp;#39;ll come around.  People aren&amp;#39;t always as strong or understanding as they should be, but eventually they&amp;#39;ll realize that it doesn&amp;#39;t change a damn thing about you.&lt;/p&gt;\n\n&lt;p&gt;That said, I&amp;#39;m at school now.  I thought my parents and everyone else would be embarrassed for me.  I thought it would fuck up my future.  As it turns out, about 2 people judged me for the outcome, and they turned out to be assholes.  I&amp;#39;m getting a good education, I&amp;#39;m (reasonably) happy, and with each thing I learn and do the name on my school is mattering less.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s one of the little secrets that no one will tell you because they&amp;#39;re worried it&amp;#39;ll make you less dedicated: college doesn&amp;#39;t matter anywhere near as much as it looks like, especially undergrad.  The biggest advantage of the &amp;quot;best&amp;quot; colleges is a rubber stamp saying that you&amp;#39;re clever, or strong, or maybe just rich or a good way to round out some graph.  The actual education?  Not that different.  Just having these expectations on you tells me that you&amp;#39;re a capable person, however this turned out.  Someone dedicated enough to care about getting into a good college is someone who can make it wherever they end up (in or out of college).  Jobs give you an interview and judge you on what you can do, not on some silly damn essay and unknowable rubrics.  You can go anywhere, get what you need, and impress the world with what you do, not what name you did it under.&lt;/p&gt;\n\n&lt;p&gt;Please feel free to go into more about your situation if you want to share, and please know that there are a lot of us out there.  College acceptance reflects on the people doing the judging far more than it does on your value, and no matter what they say you&amp;#39;re the same person you were before, and you can accomplish just as much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23yq54", "score_hidden": false, "name": "t1_ch1vs3l", "created": 1398450687.0, "author_flair_text": null, "created_utc": 1398447087.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1x38y", "gilded": 0, "author": "cokacolaman", "parent_id": "t3_23yq54", "approved_by": null, "body": "Many people die at 25 and they aren't burried until 75. These are just one of the many crossroads in life. I've felt your pain, but you have many many more years to live. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many people die at 25 and they aren&amp;#39;t burried until 75. These are just one of the many crossroads in life. I&amp;#39;ve felt your pain, but you have many many more years to live. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23yq54", "score_hidden": false, "name": "t1_ch1x38y", "created": 1398478469.0, "author_flair_text": null, "created_utc": 1398449669.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1vayl", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23yq54", "approved_by": null, "body": "I know you didn't get into the college of your dreams, but you're far from stupid and useless because of that.  Yes, the chapter you hoped to start by going to your dream school won't be written, but another one, at another college, is just beginning to be written for you.  I encourage you to look at the other schools you applied to and find things about them to get excited about--a great music scene, a cool gym, great teachers, a small class size--just because you didn't get into this school doesn't mean that you're a disappointment to your parents or that your life is over.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you didn&amp;#39;t get into the college of your dreams, but you&amp;#39;re far from stupid and useless because of that.  Yes, the chapter you hoped to start by going to your dream school won&amp;#39;t be written, but another one, at another college, is just beginning to be written for you.  I encourage you to look at the other schools you applied to and find things about them to get excited about--a great music scene, a cool gym, great teachers, a small class size--just because you didn&amp;#39;t get into this school doesn&amp;#39;t mean that you&amp;#39;re a disappointment to your parents or that your life is over.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23yq54", "score_hidden": false, "name": "t1_ch1vayl", "created": 1398449770.0, "author_flair_text": null, "created_utc": 1398446170.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1vibl", "gilded": 0, "author": "dnedad585", "parent_id": "t3_23yq54", "approved_by": null, "body": "The same thing happened to me.  I ended up going to school at a differnt school with a friend of mine from HS.  We ended up becoming life-long best friends, I had a GREAT time at school, met my future wife and my college years are the one part of my life that I actually appreciate now.\n\nSometimes things work out for a reason.  \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same thing happened to me.  I ended up going to school at a differnt school with a friend of mine from HS.  We ended up becoming life-long best friends, I had a GREAT time at school, met my future wife and my college years are the one part of my life that I actually appreciate now.&lt;/p&gt;\n\n&lt;p&gt;Sometimes things work out for a reason.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23yq54", "score_hidden": false, "name": "t1_ch1vibl", "created": 1398450164.0, "author_flair_text": null, "created_utc": 1398446564.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]