[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am massively suicidal and have been for the last year, watching this injury heal. (It&amp;#39;s on my face; I was on prednisone. I did not anticipate this happening, or how--literally--psychotic I felt, running through the streets crying. There&amp;#39;s still no excuse--I don&amp;#39;t feel like I was in my own brain and I am horrified at what I did, but also the state of mind I was in. I feel like God is punishing me with my own stupidity and brain now.)&lt;/p&gt;\n\n&lt;p&gt;I am more isolated and ashamed of myself and I wear the crazy on my face; more than that, I&amp;#39;ve harmed myself in ways I specifically PLANNED, when I was in my right mind, to avoid.  &lt;/p&gt;\n\n&lt;p&gt;This would have been a starting over; I know it&amp;#39;s small, but I&amp;#39;ve fucking hated how I look for a long time, but especially in the last five years--I  just wanted to get my shit together, deal with old scars, and take care of the walnut-sized cysts that have come back. &lt;/p&gt;\n\n&lt;p&gt;I am on antidepressants, but I&amp;#39;ve hurt my family so much and myself just being a fucking imbecile and wasting second, third, fourth, fifth chances. I can&amp;#39;t sleep at night, waste all day, and isolate from friends.&lt;/p&gt;\n\n&lt;p&gt;When I&amp;#39;m with them, what I think about is killing myself. &lt;/p&gt;\n\n&lt;p&gt;What makes this worse is that I fell in love with someone. Even if he doesn&amp;#39;t return my feelings--I wanted to start actually living like I wouldn&amp;#39;t be alone until I was dead. &lt;/p&gt;\n\n&lt;p&gt;And I failed. I did everything wrong, I am a fucking 27 year old going on 14 living purely for family and at their kindness. &lt;/p&gt;\n\n&lt;p&gt;I wanted so badly--prayed, hoped--I could escape the suicidal-without-having-plans-for-suicide-and-go-forward mindset, start living like there was a future, and I don&amp;#39;t know why or what horrible thing I did that I keep tricking myself into humiliation and things that make me unable to live in my own brain. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry; I had to put this here. I haven&amp;#39;t told my psychiatrist, my family is sick of me, and I have seriously fucked up my body. &lt;/p&gt;\n\n&lt;p&gt;I just want this to end. I keep coming back to a place where I fuck up--kicked out of grad school, spooling in another one, and now ugly, disfigured and frightened of how treating this problem will impact my life in the future, having botched a surgery. I wanted to work; I wanted to be someone that could bear being around friends, going to lunches, being &amp;quot;normal&amp;quot;, and finally being someone that could entertain the possibility of being close to someone. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a fucking monster and ever since I was diagnosed with depression, it keeps leading me to horrible moments of self-harm, numbness, and--for the past four years--rage that terrify me once the fire passes and I wonder what possessed me, where the rage cam from, and why I couldn&amp;#39;t have fucking punched a pillow, screamed, cried, done anything else to settle the choking frenzy. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am massively suicidal and have been for the last year, watching this injury heal. (It's on my face; I was on prednisone. I did not anticipate this happening, or how--literally--psychotic I felt, running through the streets crying. There's still no excuse--I don't feel like I was in my own brain and I am horrified at what I did, but also the state of mind I was in. I feel like God is punishing me with my own stupidity and brain now.)\n\nI am more isolated and ashamed of myself and I wear the crazy on my face; more than that, I've harmed myself in ways I specifically PLANNED, when I was in my right mind, to avoid.  \n\nThis would have been a starting over; I know it's small, but I've fucking hated how I look for a long time, but especially in the last five years--I  just wanted to get my shit together, deal with old scars, and take care of the walnut-sized cysts that have come back. \n\nI am on antidepressants, but I've hurt my family so much and myself just being a fucking imbecile and wasting second, third, fourth, fifth chances. I can't sleep at night, waste all day, and isolate from friends.\n\nWhen I'm with them, what I think about is killing myself. \n\nWhat makes this worse is that I fell in love with someone. Even if he doesn't return my feelings--I wanted to start actually living like I wouldn't be alone until I was dead. \n\nAnd I failed. I did everything wrong, I am a fucking 27 year old going on 14 living purely for family and at their kindness. \n\nI wanted so badly--prayed, hoped--I could escape the suicidal-without-having-plans-for-suicide-and-go-forward mindset, start living like there was a future, and I don't know why or what horrible thing I did that I keep tricking myself into humiliation and things that make me unable to live in my own brain. \n\nI'm sorry; I had to put this here. I haven't told my psychiatrist, my family is sick of me, and I have seriously fucked up my body. \n\nI just want this to end. I keep coming back to a place where I fuck up--kicked out of grad school, spooling in another one, and now ugly, disfigured and frightened of how treating this problem will impact my life in the future, having botched a surgery. I wanted to work; I wanted to be someone that could bear being around friends, going to lunches, being \"normal\", and finally being someone that could entertain the possibility of being close to someone. \n\nI'm a fucking monster and ever since I was diagnosed with depression, it keeps leading me to horrible moments of self-harm, numbness, and--for the past four years--rage that terrify me once the fire passes and I wonder what possessed me, where the rage cam from, and why I couldn't have fucking punched a pillow, screamed, cried, done anything else to settle the choking frenzy. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "253lja", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iredditi", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399614335.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/253lja/disfigured_myself_in_a_fit_of_psychosis_brought/", "name": "t3_253lja", "created": 1399634273.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/253lja/disfigured_myself_in_a_fit_of_psychosis_brought/", "author_flair_text": null, "title": "disfigured myself in a fit of psychosis; brought my worst nightmare on myself", "created_utc": 1399605473.0, "ups": 7, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdj7hy", "gilded": 0, "author": "scumbagputin", "parent_id": "t3_253lja", "approved_by": null, "body": "I'm not sure if i can help you...but i had a 27 year old friend with bi-polar and pcos who committed suicide, so this is especially heavy to read. I don't really know what to say, but...if you wana talk, please, talk to me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if i can help you...but i had a 27 year old friend with bi-polar and pcos who committed suicide, so this is especially heavy to read. I don&amp;#39;t really know what to say, but...if you wana talk, please, talk to me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdj7hy", "created": 1399661576.0, "author_flair_text": null, "created_utc": 1399632776.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdinmx", "gilded": 0, "author": "iredditi", "parent_id": "t1_chdijmz", "approved_by": null, "body": "Yes. But I took a drug nobody warned me would make me feel how I did. I've stopped. It doesn't matter; the damage is done. \nI realize you probably help people here by asking them what they want as if their future is retrievable--I asked myself what you did over and over to try to go forward. All the progress, all the being \"okay\" and thinking, I can get to \"normal\" or even \"okay\" from here--after two months, four months, six months, of \"okay\", I'd undo undid it all in a half hour. Or two months. Or three months. Over and over with a moment of denial,being out of it because I'm so tired or zombified (due to meds meds, being anxious, angry, who knows?),  or rage. I am climbing up a mountain with each failure on my back.\n\nI keep setting goals and destroying them, carried through by flashes of fire or denial I tell myself must be learned to push through--push myself to see friends. Push myself into a job interview that makes me want to die and goes nowhere, even though I smell and try to sell myself without apology. Push myself to stay in school for a program I shouldn't be in in the first place. My own brain is very against me and depression/anxiety, my own relationship with certain meds, or just being a stupid, out-of-it person naturally grew and changed in ways I just didn't prepare myself for to protect myself. \n\nI got a blood test recently and found out my resting cortisol and testosterone was very high, after a panic attack, so I know it's not in my head, but I'm already on antidepressants and have tried meds for PCOS that compromised my skin in other ways (made it purple, bruised) and caused severe muscle aches. \n\nI feel hopeless, helpless and worthless. And ugly. I wanted to finally, finally deal with the things that make me want to isolate. Instead I got a fucking nightmare. ", "edited": 1399629912.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. But I took a drug nobody warned me would make me feel how I did. I&amp;#39;ve stopped. It doesn&amp;#39;t matter; the damage is done. \nI realize you probably help people here by asking them what they want as if their future is retrievable--I asked myself what you did over and over to try to go forward. All the progress, all the being &amp;quot;okay&amp;quot; and thinking, I can get to &amp;quot;normal&amp;quot; or even &amp;quot;okay&amp;quot; from here--after two months, four months, six months, of &amp;quot;okay&amp;quot;, I&amp;#39;d undo undid it all in a half hour. Or two months. Or three months. Over and over with a moment of denial,being out of it because I&amp;#39;m so tired or zombified (due to meds meds, being anxious, angry, who knows?),  or rage. I am climbing up a mountain with each failure on my back.&lt;/p&gt;\n\n&lt;p&gt;I keep setting goals and destroying them, carried through by flashes of fire or denial I tell myself must be learned to push through--push myself to see friends. Push myself into a job interview that makes me want to die and goes nowhere, even though I smell and try to sell myself without apology. Push myself to stay in school for a program I shouldn&amp;#39;t be in in the first place. My own brain is very against me and depression/anxiety, my own relationship with certain meds, or just being a stupid, out-of-it person naturally grew and changed in ways I just didn&amp;#39;t prepare myself for to protect myself. &lt;/p&gt;\n\n&lt;p&gt;I got a blood test recently and found out my resting cortisol and testosterone was very high, after a panic attack, so I know it&amp;#39;s not in my head, but I&amp;#39;m already on antidepressants and have tried meds for PCOS that compromised my skin in other ways (made it purple, bruised) and caused severe muscle aches. &lt;/p&gt;\n\n&lt;p&gt;I feel hopeless, helpless and worthless. And ugly. I wanted to finally, finally deal with the things that make me want to isolate. Instead I got a fucking nightmare. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdinmx", "created": 1399658288.0, "author_flair_text": null, "created_utc": 1399629488.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdijmz", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_253lja", "approved_by": null, "body": "Is there anything that you think set you on this path in the first place?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there anything that you think set you on this path in the first place?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdijmz", "created": 1399657553.0, "author_flair_text": null, "created_utc": 1399628753.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdnu9g", "gilded": 0, "author": "darkupondark", "parent_id": "t3_253lja", "approved_by": null, "body": "I just want to say that you're not wrong for feeling what you feel, you're not a monster, you've had far far far more to deal with than many other people, and that means that what you're feeling is not wrong at all.... It's completely unfair. It's not right that you have to face such horrible circumstances or consequences... Feeling like we look good is important for everyone, incredibly important..\n\nI know what it's like to really hate yourself, I don't think you are a monster, no matter what you have thought or felt, I think you are someone who is living with intense pressure, and I can understand why you feel the way you feel.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to say that you&amp;#39;re not wrong for feeling what you feel, you&amp;#39;re not a monster, you&amp;#39;ve had far far far more to deal with than many other people, and that means that what you&amp;#39;re feeling is not wrong at all.... It&amp;#39;s completely unfair. It&amp;#39;s not right that you have to face such horrible circumstances or consequences... Feeling like we look good is important for everyone, incredibly important..&lt;/p&gt;\n\n&lt;p&gt;I know what it&amp;#39;s like to really hate yourself, I don&amp;#39;t think you are a monster, no matter what you have thought or felt, I think you are someone who is living with intense pressure, and I can understand why you feel the way you feel.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdnu9g", "created": 1399676236.0, "author_flair_text": null, "created_utc": 1399647436.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheemcn", "gilded": 0, "author": "radeeli", "parent_id": "t1_che1ap5", "approved_by": null, "body": "EVERYONE does something \"stupid\" or \"insane\" at least once in their lives. It doesn't matter how it wasn't \"normal\" for you, we all have our moments of vulnerability and outrageousness when we're under stressful situations.  And maybe the psych can help: he possibly can help you cope with what has happened to you and feeling \"disgusted\". If you can only afford a half hour, are there any free mental health services around? Group therapy? Or if you need to go into an institution, you should. \n\nI can sort of relate to the 12 months thing. I've been sick for over 12 months and no one knows what's wrong with me. I say the same thing to myself, \"I've wasted 12 months, I want my life back.\" Yet you can't turn back time. The only thing keeping me going is hope that maybe I will get better. And that these 12 months have made me stronger. I know that is complete, utter BS in most people's eyes but it helps me. \n\nDo you know the novelist Hubert Selby Jr? He never graduated high school, had a collapsed lung and was bedridden for YEARS, yet he was still able to write \"Requiem for a Dream\" and \"Last Exit to Brooklyn\". In my opinion, you're a great writer. Have you ever thought about writing a novel? Or taking up writing?\n\nYou still have family right? Can they support you? Can you tell them that you need more treatment? I think once a month is too little. You NEED to talk to someone about this. And are you on antidepressants and antianxiety? Anxiety can help with sleeping too. And sorry, I'm still a little confused about the injury. May I ask what type it is? Is it a slash on your face?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EVERYONE does something &amp;quot;stupid&amp;quot; or &amp;quot;insane&amp;quot; at least once in their lives. It doesn&amp;#39;t matter how it wasn&amp;#39;t &amp;quot;normal&amp;quot; for you, we all have our moments of vulnerability and outrageousness when we&amp;#39;re under stressful situations.  And maybe the psych can help: he possibly can help you cope with what has happened to you and feeling &amp;quot;disgusted&amp;quot;. If you can only afford a half hour, are there any free mental health services around? Group therapy? Or if you need to go into an institution, you should. &lt;/p&gt;\n\n&lt;p&gt;I can sort of relate to the 12 months thing. I&amp;#39;ve been sick for over 12 months and no one knows what&amp;#39;s wrong with me. I say the same thing to myself, &amp;quot;I&amp;#39;ve wasted 12 months, I want my life back.&amp;quot; Yet you can&amp;#39;t turn back time. The only thing keeping me going is hope that maybe I will get better. And that these 12 months have made me stronger. I know that is complete, utter BS in most people&amp;#39;s eyes but it helps me. &lt;/p&gt;\n\n&lt;p&gt;Do you know the novelist Hubert Selby Jr? He never graduated high school, had a collapsed lung and was bedridden for YEARS, yet he was still able to write &amp;quot;Requiem for a Dream&amp;quot; and &amp;quot;Last Exit to Brooklyn&amp;quot;. In my opinion, you&amp;#39;re a great writer. Have you ever thought about writing a novel? Or taking up writing?&lt;/p&gt;\n\n&lt;p&gt;You still have family right? Can they support you? Can you tell them that you need more treatment? I think once a month is too little. You NEED to talk to someone about this. And are you on antidepressants and antianxiety? Anxiety can help with sleeping too. And sorry, I&amp;#39;m still a little confused about the injury. May I ask what type it is? Is it a slash on your face?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_cheemcn", "created": 1399756593.0, "author_flair_text": null, "created_utc": 1399727793.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "che1ap5", "gilded": 0, "author": "iredditi", "parent_id": "t1_chdxk6r", "approved_by": null, "body": "He's both a psychiatrist and a therapist but I can only afford half an hour with him once a month; that's usually more than enough. \n\nIt was the worst because I went into the surgery without really having information based on anyone but my surgeon, who is a shitty doctor but good at what he does. I also was nervous about it and what might go wrong, and everything was going to be okay till I flipped the fuck out and ensured this became a disaster.\n\nThat and the prednisone, which I stopped taking a year ago. It doesn't matter. The damage was done. \n\nI'm honestly too ashamed to tell my psych; there's nothing he can do. What I did was so fucking stupid and insane...that isn't how I am, under normal circumstances. I'm managed. I manage depression. I shut down, I withdraw--but I don't rage. \n\nThis time I did, thanks to a drug I was susceptible to. Looking in the mirror now, realizing nothing has gotten better for four months--I marvel at my idiocy and self-destruction. This is a problem I wanted to correct for a long time. It would have been a gift to finally not feel disgusting about myself. \n\nI need the last 12 months of my life back. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s both a psychiatrist and a therapist but I can only afford half an hour with him once a month; that&amp;#39;s usually more than enough. &lt;/p&gt;\n\n&lt;p&gt;It was the worst because I went into the surgery without really having information based on anyone but my surgeon, who is a shitty doctor but good at what he does. I also was nervous about it and what might go wrong, and everything was going to be okay till I flipped the fuck out and ensured this became a disaster.&lt;/p&gt;\n\n&lt;p&gt;That and the prednisone, which I stopped taking a year ago. It doesn&amp;#39;t matter. The damage was done. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m honestly too ashamed to tell my psych; there&amp;#39;s nothing he can do. What I did was so fucking stupid and insane...that isn&amp;#39;t how I am, under normal circumstances. I&amp;#39;m managed. I manage depression. I shut down, I withdraw--but I don&amp;#39;t rage. &lt;/p&gt;\n\n&lt;p&gt;This time I did, thanks to a drug I was susceptible to. Looking in the mirror now, realizing nothing has gotten better for four months--I marvel at my idiocy and self-destruction. This is a problem I wanted to correct for a long time. It would have been a gift to finally not feel disgusting about myself. &lt;/p&gt;\n\n&lt;p&gt;I need the last 12 months of my life back. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_che1ap5", "created": 1399705314.0, "author_flair_text": null, "created_utc": 1399676514.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdxk6r", "gilded": 0, "author": "radeeli", "parent_id": "t1_chdwpqx", "approved_by": null, "body": "Was healing the worst experience because of the prednisone? Why were you on the prednisone in the first place? Do you have a therapist or just a psychiatrist?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was healing the worst experience because of the prednisone? Why were you on the prednisone in the first place? Do you have a therapist or just a psychiatrist?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdxk6r", "created": 1399696517.0, "author_flair_text": null, "created_utc": 1399667717.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdwpqx", "gilded": 0, "author": "iredditi", "parent_id": "t1_chdivq2", "approved_by": null, "body": "The \"second chance\" was a surgery. Part of the problem is that the injury was so severe I'm not sure it'll heal or if the natural tissue formation over time is permanent. I've waited 8 months and it's changed some, but the skin where I pinched/pulled without even being cognizant of it, seemingly is discolored and distended every day, like a red water balloon.\n\nThe second chance was this procedure and planning ahead to make the \"normal\" waiting time\" bearable. \n\nThe window of time within which I did the damage was ten minutes of obsessive thinking and rage. When I stopped prednisone... those clouds dissipated and the weeks before the injury (same obsessive thinking) were put in stark relief.\n\nThe last year as brought torturous inability to control my emotions and it leads to shit like this--perverse, stupid, self-destructive shit I don't actually want. It comes in flashes in impotence. It would be childish if I weren't an adult.\n\nNow--between numb, lonely misery and frenzied terror, there are flashes of angry that extend the former. I can't get ahead. The big mistakes eat the other stuff, eat energy, lead to new hormonal conditions to medicate. Worlds of hurt and years of my life are eaten by acts of idiocy that are perpetuated in little windows of not paying attention or not putting a brakes on impulses I didn't used to experience, even at my worst. \n\nit's plenty fucking easy to cry now; the operating surgeon doesn't care and in hindsight I regret going to him. I regret all of this. \n\nBut what makes me regret it most is that I had planned ahead to get control of one or things and take that relief to keep going, or try. Actually get out and start building a life. \n\nI don't want to go through surgery again--the healing was one of the worst experiences of my life--and I don't want to pay for more treatment. I'm fucked, it seems no matter what I do. \n\nIt would have been so simple for this to have turned out all right.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &amp;quot;second chance&amp;quot; was a surgery. Part of the problem is that the injury was so severe I&amp;#39;m not sure it&amp;#39;ll heal or if the natural tissue formation over time is permanent. I&amp;#39;ve waited 8 months and it&amp;#39;s changed some, but the skin where I pinched/pulled without even being cognizant of it, seemingly is discolored and distended every day, like a red water balloon.&lt;/p&gt;\n\n&lt;p&gt;The second chance was this procedure and planning ahead to make the &amp;quot;normal&amp;quot; waiting time&amp;quot; bearable. &lt;/p&gt;\n\n&lt;p&gt;The window of time within which I did the damage was ten minutes of obsessive thinking and rage. When I stopped prednisone... those clouds dissipated and the weeks before the injury (same obsessive thinking) were put in stark relief.&lt;/p&gt;\n\n&lt;p&gt;The last year as brought torturous inability to control my emotions and it leads to shit like this--perverse, stupid, self-destructive shit I don&amp;#39;t actually want. It comes in flashes in impotence. It would be childish if I weren&amp;#39;t an adult.&lt;/p&gt;\n\n&lt;p&gt;Now--between numb, lonely misery and frenzied terror, there are flashes of angry that extend the former. I can&amp;#39;t get ahead. The big mistakes eat the other stuff, eat energy, lead to new hormonal conditions to medicate. Worlds of hurt and years of my life are eaten by acts of idiocy that are perpetuated in little windows of not paying attention or not putting a brakes on impulses I didn&amp;#39;t used to experience, even at my worst. &lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s plenty fucking easy to cry now; the operating surgeon doesn&amp;#39;t care and in hindsight I regret going to him. I regret all of this. &lt;/p&gt;\n\n&lt;p&gt;But what makes me regret it most is that I had planned ahead to get control of one or things and take that relief to keep going, or try. Actually get out and start building a life. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to go through surgery again--the healing was one of the worst experiences of my life--and I don&amp;#39;t want to pay for more treatment. I&amp;#39;m fucked, it seems no matter what I do. &lt;/p&gt;\n\n&lt;p&gt;It would have been so simple for this to have turned out all right.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdwpqx", "created": 1399694695.0, "author_flair_text": null, "created_utc": 1399665895.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdivq2", "gilded": 0, "author": "sardonic_clam", "parent_id": "t3_253lja", "approved_by": null, "body": "Hi how have you wasted second chances? Im not entirely sure how you have injured your face, is it something that can heal given time? I know personal appearance is important, but how significant of an injury is it to other people who know you? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi how have you wasted second chances? Im not entirely sure how you have injured your face, is it something that can heal given time? I know personal appearance is important, but how significant of an injury is it to other people who know you? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253lja", "score_hidden": false, "name": "t1_chdivq2", "created": 1399659698.0, "author_flair_text": null, "created_utc": 1399630898.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]