[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The truth is, I&amp;#39;ve thought about dying every day of my life. I&amp;#39;ve been too much of a coward before now, but all I&amp;#39;ve heard from my boyfriend lately is that I&amp;#39;m not worth it. I&amp;#39;m not with his time or the stress. He&amp;#39;s right though, I&amp;#39;m not worth it, I&amp;#39;ve always known that. I don&amp;#39;t want to die, but I can&amp;#39;t handle life anymore.. It&amp;#39;s not just the arguments..I just feel worthless and like a failure. The fights haven&amp;#39;t helped with this. I feel like I&amp;#39;m being really selfish.. I have a good life, I just don&amp;#39;t want it. Has anyone else felt like this? I just want this to end one way or another.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The truth is, I've thought about dying every day of my life. I've been too much of a coward before now, but all I've heard from my boyfriend lately is that I'm not worth it. I'm not with his time or the stress. He's right though, I'm not worth it, I've always known that. I don't want to die, but I can't handle life anymore.. It's not just the arguments..I just feel worthless and like a failure. The fights haven't helped with this. I feel like I'm being really selfish.. I have a good life, I just don't want it. Has anyone else felt like this? I just want this to end one way or another.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "251tpm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "msgrammarnazi", "media": null, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/251tpm/does_anyone_else_feel_like_this/", "name": "t3_251tpm", "created": 1399593893.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/251tpm/does_anyone_else_feel_like_this/", "author_flair_text": null, "title": "Does anyone else feel like this?", "created_utc": 1399565093.0, "ups": 10, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcvhfn", "gilded": 0, "author": "HP_Housecat", "parent_id": "t3_251tpm", "approved_by": null, "body": "I don't think I've thought about it every day of my entire life. I have for a good portion of it, however.\n\nYour boyfriend may be able to determine whether you are \"worth\" his time for himself but other people can never truly determine your worth. I know from my own experience that I'm not sure I can even determine my own worth. The word can mean so many different things to different people.\n\nI think being selfish has a terrible reputation. Looking out for ourselves gives us a good platform to stand on if we want to look out for others or even to just avoid hurting others. I don't think it even is selfish to want your pain to be over, I think that might just be inherent to being human beings. Of course you don't want to hurt.\n\nI haven't felt the exact same way you have but I know what it's like to have suicide be the \"one true solution\" in my head for everything. I also know what it's like to feel like a worthless, selfish, failure. Sometimes, however, I know those things aren't set in stone or at least that it might not matter if I am those things to other people. While I can't assign you your worth, my personal opinion is that you do have it. Everyone and everything is worth something.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think I&amp;#39;ve thought about it every day of my entire life. I have for a good portion of it, however.&lt;/p&gt;\n\n&lt;p&gt;Your boyfriend may be able to determine whether you are &amp;quot;worth&amp;quot; his time for himself but other people can never truly determine your worth. I know from my own experience that I&amp;#39;m not sure I can even determine my own worth. The word can mean so many different things to different people.&lt;/p&gt;\n\n&lt;p&gt;I think being selfish has a terrible reputation. Looking out for ourselves gives us a good platform to stand on if we want to look out for others or even to just avoid hurting others. I don&amp;#39;t think it even is selfish to want your pain to be over, I think that might just be inherent to being human beings. Of course you don&amp;#39;t want to hurt.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t felt the exact same way you have but I know what it&amp;#39;s like to have suicide be the &amp;quot;one true solution&amp;quot; in my head for everything. I also know what it&amp;#39;s like to feel like a worthless, selfish, failure. Sometimes, however, I know those things aren&amp;#39;t set in stone or at least that it might not matter if I am those things to other people. While I can&amp;#39;t assign you your worth, my personal opinion is that you do have it. Everyone and everything is worth something.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251tpm", "score_hidden": false, "name": "t1_chcvhfn", "created": 1399599592.0, "author_flair_text": null, "created_utc": 1399570792.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd2jy4", "gilded": 0, "author": "Si421", "parent_id": "t3_251tpm", "approved_by": null, "body": "Listen to me for a minute?\n\nYou do not exist to please someone else. You exist for your own sake. Do not judge your self-worth on what some guy thinks or says about you. Video about it: http://youtu.be/Wb6JPZ-wFmw\n\nYou're not worthless at all, and trust me, I know how you feel. As a life-long failure myself, I've been as long as I can go. I've felt like I wasn't worth the oxygen I've breathed. But take it from me, your true value as a person is how you change the lives of those around you for the better. How you help change the world helps to bring yourself a sense of fulfilment.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listen to me for a minute?&lt;/p&gt;\n\n&lt;p&gt;You do not exist to please someone else. You exist for your own sake. Do not judge your self-worth on what some guy thinks or says about you. Video about it: &lt;a href=\"http://youtu.be/Wb6JPZ-wFmw\"&gt;http://youtu.be/Wb6JPZ-wFmw&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not worthless at all, and trust me, I know how you feel. As a life-long failure myself, I&amp;#39;ve been as long as I can go. I&amp;#39;ve felt like I wasn&amp;#39;t worth the oxygen I&amp;#39;ve breathed. But take it from me, your true value as a person is how you change the lives of those around you for the better. How you help change the world helps to bring yourself a sense of fulfilment.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251tpm", "score_hidden": false, "name": "t1_chd2jy4", "created": 1399613466.0, "author_flair_text": null, "created_utc": 1399584666.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd5u6k", "gilded": 0, "author": "HorribleBlack", "parent_id": "t3_251tpm", "approved_by": null, "body": "strongly consider leaving him and moving on alone, and I can guarantee you that you'll see things differently- more positively- in 6 months. stay with him and he will only drag you down further. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;strongly consider leaving him and moving on alone, and I can guarantee you that you&amp;#39;ll see things differently- more positively- in 6 months. stay with him and he will only drag you down further. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251tpm", "score_hidden": false, "name": "t1_chd5u6k", "created": 1399620740.0, "author_flair_text": null, "created_utc": 1399591940.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]