[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So let me lay it out for you.  I&amp;#39;m 16, 17 in less than a month. My mom continues to bring up my GPA and transcript, telling me they&amp;#39;re not good enough to make it into any good colleges.  At the same time, I&amp;#39;m being fed that college is the only option after high school and that it is incredibly important that I go somewhere good by my teachers.  All I see ahead of me is failure after failure until finally I die of starvation from my chronic unemployment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So let me lay it out for you.  I'm 16, 17 in less than a month. My mom continues to bring up my GPA and transcript, telling me they're not good enough to make it into any good colleges.  At the same time, I'm being fed that college is the only option after high school and that it is incredibly important that I go somewhere good by my teachers.  All I see ahead of me is failure after failure until finally I die of starvation from my chronic unemployment.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wgn8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Zaphod_042", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wgn8/done_bashing_my_head_against_brick_walls/", "name": "t3_24wgn8", "created": 1399443028.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wgn8/done_bashing_my_head_against_brick_walls/", "author_flair_text": null, "title": "Done bashing my head against brick walls.", "created_utc": 1399414228.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbqger", "gilded": 0, "author": "throway8420", "parent_id": "t1_chbcbop", "approved_by": null, "body": "I agree with taufish's comments. My son's HS no longer offers Physics because according to the school administrators  they have never found a Physics teacher who enjoys teaching or teaches well to High Schoolers.", "edited": 1399470215.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with taufish&amp;#39;s comments. My son&amp;#39;s HS no longer offers Physics because according to the school administrators  they have never found a Physics teacher who enjoys teaching or teaches well to High Schoolers.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wgn8", "score_hidden": false, "name": "t1_chbqger", "created": 1399489979.0, "author_flair_text": null, "created_utc": 1399461179.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbcbop", "gilded": 0, "author": "taufish", "parent_id": "t1_chbbwz2", "approved_by": null, "body": "Would you say that music is a bigger interest even than astrophysics? That's important.\n\nDid you struggle with physics because of the material, or because of this growing anxiety and depression? If it was the material, I would encourage you to give physics another chance. I majored in Environmental Science in college, but not because of my intro course in high school. If I had made the decision based solely on that intro class, I wouldn't have majored in Environmental Studies. But in college I loved it. The teacher can make an enormous difference. \n\nAnd maybe physics truly isn't for you. It sounds like you have a strong creative side. Financial considerations are very real and not to be overlooked. At the same time, if you are made to be a composer, for example, don't try to talk yourself out of it. You first need to consider what you think (and you may not know for sure) will make you happiest. Then it will be time to think about majors. It's a rare college that locks you into a major, so you may not find out what major you want until you get there. I changed my major 6 times in college. 6. You will have a chance to find out what it is that really calls you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you say that music is a bigger interest even than astrophysics? That&amp;#39;s important.&lt;/p&gt;\n\n&lt;p&gt;Did you struggle with physics because of the material, or because of this growing anxiety and depression? If it was the material, I would encourage you to give physics another chance. I majored in Environmental Science in college, but not because of my intro course in high school. If I had made the decision based solely on that intro class, I wouldn&amp;#39;t have majored in Environmental Studies. But in college I loved it. The teacher can make an enormous difference. &lt;/p&gt;\n\n&lt;p&gt;And maybe physics truly isn&amp;#39;t for you. It sounds like you have a strong creative side. Financial considerations are very real and not to be overlooked. At the same time, if you are made to be a composer, for example, don&amp;#39;t try to talk yourself out of it. You first need to consider what you think (and you may not know for sure) will make you happiest. Then it will be time to think about majors. It&amp;#39;s a rare college that locks you into a major, so you may not find out what major you want until you get there. I changed my major 6 times in college. 6. You will have a chance to find out what it is that really calls you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wgn8", "score_hidden": false, "name": "t1_chbcbop", "created": 1399445392.0, "author_flair_text": null, "created_utc": 1399416592.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbbwz2", "gilded": 0, "author": "Zaphod_042", "parent_id": "t1_chbbrb4", "approved_by": null, "body": "Sure.  I'm 16 as stated.  I don't know what I want to do.  I suppose lack of a clear goal is definitely problem with my current state.  I've wanted to go into astronomy, really astrophysics.  So for a while I just said \"Physicist\".  Until physics became the worst grade I've ever had.  So I've thought about being a writer or a composer of modern classical music.  Music is my biggest interest but one that seems hard to profit off of.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure.  I&amp;#39;m 16 as stated.  I don&amp;#39;t know what I want to do.  I suppose lack of a clear goal is definitely problem with my current state.  I&amp;#39;ve wanted to go into astronomy, really astrophysics.  So for a while I just said &amp;quot;Physicist&amp;quot;.  Until physics became the worst grade I&amp;#39;ve ever had.  So I&amp;#39;ve thought about being a writer or a composer of modern classical music.  Music is my biggest interest but one that seems hard to profit off of.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wgn8", "score_hidden": false, "name": "t1_chbbwz2", "created": 1399444498.0, "author_flair_text": null, "created_utc": 1399415698.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbbrb4", "gilded": 0, "author": "taufish", "parent_id": "t3_24wgn8", "approved_by": null, "body": "Academic anxiety is incredibly toxic and very easy for others to dismiss.\n\nI can definitely empathize with the jump from academic anxiety to a fear of utter failure and starvation. For now, give yourself a moment to focus just on the immediate concern, instead of the coming years. Can you tell us a little bit more about yourself, such as your academic interests?   ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Academic anxiety is incredibly toxic and very easy for others to dismiss.&lt;/p&gt;\n\n&lt;p&gt;I can definitely empathize with the jump from academic anxiety to a fear of utter failure and starvation. For now, give yourself a moment to focus just on the immediate concern, instead of the coming years. Can you tell us a little bit more about yourself, such as your academic interests?   &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wgn8", "score_hidden": false, "name": "t1_chbbrb4", "created": 1399444148.0, "author_flair_text": null, "created_utc": 1399415348.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]