[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve suffered from depression for the past 5 years. But why? I&amp;#39;m young, I have plenty of money, I fit the standard idea of &amp;quot;beauty&amp;quot;, people always praise me and say how much they love me, I have a boyfriend, so why am I not happy?&lt;/p&gt;\n\n&lt;p&gt;The last person I opened up to about my depression called me selfish. &amp;quot;You have everything going for you, the last thing you should be is depressed&amp;quot;. But what do I have going for me other than my looks? Looks fade, so what do I REALLY have going for me? I don&amp;#39;t see any reason to keep going, when everything that I have revolves around something that won&amp;#39;t last forever. One day everything will come crashing down, so why prolong it? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Maybe you should talk to your boyfriend?&amp;quot;. Yeah, I&amp;#39;ve tried that. He doesn&amp;#39;t understand. We&amp;#39;ve been fighting constantly lately. Last night I cried until 2 in the morning after a fight. In the end, he says it was all my fault as I always &amp;quot;make things a bigger deal than they are&amp;quot;. No matter how much I try, I can&amp;#39;t keep relationships or make anyone happy, it seems. &lt;/p&gt;\n\n&lt;p&gt;I cry myself to sleep almost every night. I&amp;#39;ve been to plenty of therapist. Have tried everything. I think about death a lot. I can&amp;#39;t imagine any cons to dying soon. I&amp;#39;m just a selfish bitch with nothing going for her. Hopefully my end is soon.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've suffered from depression for the past 5 years. But why? I'm young, I have plenty of money, I fit the standard idea of \"beauty\", people always praise me and say how much they love me, I have a boyfriend, so why am I not happy?\n\nThe last person I opened up to about my depression called me selfish. \"You have everything going for you, the last thing you should be is depressed\". But what do I have going for me other than my looks? Looks fade, so what do I REALLY have going for me? I don't see any reason to keep going, when everything that I have revolves around something that won't last forever. One day everything will come crashing down, so why prolong it? \n\n\"Maybe you should talk to your boyfriend?\". Yeah, I've tried that. He doesn't understand. We've been fighting constantly lately. Last night I cried until 2 in the morning after a fight. In the end, he says it was all my fault as I always \"make things a bigger deal than they are\". No matter how much I try, I can't keep relationships or make anyone happy, it seems. \n\n\nI cry myself to sleep almost every night. I've been to plenty of therapist. Have tried everything. I think about death a lot. I can't imagine any cons to dying soon. I'm just a selfish bitch with nothing going for her. Hopefully my end is soon.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24stlc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SlothsAndSloths", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24stlc/dont_be_silly_youre_too_pretty_be_depressed/", "name": "t3_24stlc", "created": 1399347464.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24stlc/dont_be_silly_youre_too_pretty_be_depressed/", "author_flair_text": null, "title": "\"Don't be silly, you're too pretty be depressed!\"", "created_utc": 1399318664.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chablwm", "gilded": 0, "author": "Nimtike", "parent_id": "t3_24stlc", "approved_by": null, "body": "The person you opened up to is both naive and prejudiced. As a person with crippling depression, most of my friends and relatives see me as a pretty okay person - psychologically speaking.\n\nThe root of truly seeing depression in yourself is to look at the moments that you've spent truly alone. No distractions, no social interaction, just you and your own mind. Finding that center can either be horrifying or calming. \n\nAs for finding cons for dying soon, those are a difficult thing to find. In the case of depression, all the reasons for living have to be absolutely and irrevocably selfish reasons. If you choose to live for someone else's sake, then life will constantly be an uphill battle. If you find a way to have happiness through your own sense of self, that is the ultimate reason to live. (If you do this, tell me how...)\n\nWas it the argument last night that made you reach out for help here? Or has it been a culmination of more events that have happened recently?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The person you opened up to is both naive and prejudiced. As a person with crippling depression, most of my friends and relatives see me as a pretty okay person - psychologically speaking.&lt;/p&gt;\n\n&lt;p&gt;The root of truly seeing depression in yourself is to look at the moments that you&amp;#39;ve spent truly alone. No distractions, no social interaction, just you and your own mind. Finding that center can either be horrifying or calming. &lt;/p&gt;\n\n&lt;p&gt;As for finding cons for dying soon, those are a difficult thing to find. In the case of depression, all the reasons for living have to be absolutely and irrevocably selfish reasons. If you choose to live for someone else&amp;#39;s sake, then life will constantly be an uphill battle. If you find a way to have happiness through your own sense of self, that is the ultimate reason to live. (If you do this, tell me how...)&lt;/p&gt;\n\n&lt;p&gt;Was it the argument last night that made you reach out for help here? Or has it been a culmination of more events that have happened recently?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24stlc", "score_hidden": false, "name": "t1_chablwm", "created": 1399349010.0, "author_flair_text": null, "created_utc": 1399320210.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chakcah", "gilded": 0, "author": "arkindal", "parent_id": "t3_24stlc", "approved_by": null, "body": "&gt;what do I REALLY have going for me?\n\nI dunno, you tell us.\n\nIf you really think you have nothing then why don't you work to have it?\n\nWork your ass off so that you can learn something and maybe even share it with people.\n\nFor example I'm working really hard to become one day a karate sensei, it's my childhood dream and even tho I'm starting a bit late I'm sure I'm still gonna be good at it.\n\nIs there something that turns you on? And I don't mean it sexually, I mean turns you on like a light bulb.\n\nI wanted to die too before starting this, maybe you could find something like that too, it doesn't have to be martial arts, but stuff you learn doesn't usually fade, so that would be cool, wouldn't it?\n\nWorking hard on something usually gives a lot of satisfaction.\n\nHope this'll help you.\n\nEDIT: Oh, and you should question yourself about the people you opened yourself to, you deserve better friends and a better boyfriend.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;what do I REALLY have going for me?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I dunno, you tell us.&lt;/p&gt;\n\n&lt;p&gt;If you really think you have nothing then why don&amp;#39;t you work to have it?&lt;/p&gt;\n\n&lt;p&gt;Work your ass off so that you can learn something and maybe even share it with people.&lt;/p&gt;\n\n&lt;p&gt;For example I&amp;#39;m working really hard to become one day a karate sensei, it&amp;#39;s my childhood dream and even tho I&amp;#39;m starting a bit late I&amp;#39;m sure I&amp;#39;m still gonna be good at it.&lt;/p&gt;\n\n&lt;p&gt;Is there something that turns you on? And I don&amp;#39;t mean it sexually, I mean turns you on like a light bulb.&lt;/p&gt;\n\n&lt;p&gt;I wanted to die too before starting this, maybe you could find something like that too, it doesn&amp;#39;t have to be martial arts, but stuff you learn doesn&amp;#39;t usually fade, so that would be cool, wouldn&amp;#39;t it?&lt;/p&gt;\n\n&lt;p&gt;Working hard on something usually gives a lot of satisfaction.&lt;/p&gt;\n\n&lt;p&gt;Hope this&amp;#39;ll help you.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Oh, and you should question yourself about the people you opened yourself to, you deserve better friends and a better boyfriend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24stlc", "score_hidden": false, "name": "t1_chakcah", "created": 1399367249.0, "author_flair_text": null, "created_utc": 1399338449.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chagvcu", "gilded": 0, "author": "tamsom", "parent_id": "t3_24stlc", "approved_by": null, "body": "I can relate on this. Everything is relative. Just because somewhere else in this world has it \"worse\" than you do doesn't mean your feelings aren't valid. It's ok to be depressed whether you're pretty or rich or ugly or poor. Some emotionally vapid people may say that your beauty or any kind of wealth should completely make up for your loneliness, but think about that logic.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate on this. Everything is relative. Just because somewhere else in this world has it &amp;quot;worse&amp;quot; than you do doesn&amp;#39;t mean your feelings aren&amp;#39;t valid. It&amp;#39;s ok to be depressed whether you&amp;#39;re pretty or rich or ugly or poor. Some emotionally vapid people may say that your beauty or any kind of wealth should completely make up for your loneliness, but think about that logic.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24stlc", "score_hidden": false, "name": "t1_chagvcu", "created": 1399359555.0, "author_flair_text": null, "created_utc": 1399330755.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaj3vf", "gilded": 0, "author": "FragrantBleach", "parent_id": "t3_24stlc", "approved_by": null, "body": "Too many people equate depression with being sad.  Our brains are broken, much like a mental cancer.\n\nGods peed, kiddo.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too many people equate depression with being sad.  Our brains are broken, much like a mental cancer.&lt;/p&gt;\n\n&lt;p&gt;Gods peed, kiddo.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24stlc", "score_hidden": false, "name": "t1_chaj3vf", "created": 1399364498.0, "author_flair_text": null, "created_utc": 1399335698.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chagx55", "gilded": 0, "author": "gnovos", "parent_id": "t3_24stlc", "approved_by": null, "body": "Here's a weird thing... maybe it's your diet?  I've been reading a lot how the microbes in your belly have a huge impact on your mental well being.  ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s a weird thing... maybe it&amp;#39;s your diet?  I&amp;#39;ve been reading a lot how the microbes in your belly have a huge impact on your mental well being.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24stlc", "score_hidden": false, "name": "t1_chagx55", "created": 1399359667.0, "author_flair_text": null, "created_utc": 1399330867.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]