[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to break down my situation to you....\nI tried to commit suicide in college\nI went to a treatment center\nFell in love with a beautiful girl but left treatment and left her\nWent back to college \nFound out that my ex at the treatment center committed suicide\n5 months later I get into a fight with my friend who was also my boss at work and I attempt to kill myself. I took 70 sleeping pills and called my family and told them I loved them\nI went to the hospital and was in lock down for 2 weeks\nMy boss/best friend and my co-worker friend came to my support\nHowever, events have caused a rift in our relationship and I feel most of it has to do with my hospitalization\nI go on so many dates and I get responses back like &amp;quot;I can&amp;#39;t give you the time you need&amp;quot;\nI have so many memories of the girl I loved\nShe was the only girl to ever hold my hand when she could see how stressed I was\nShe admired me and I admired her\nI am having problems with this loneliness and I don&amp;#39;t want to beg for someone to be there for me\nI have my family but shit I need more...\nI went on the meetup groups but fuck they are awkward and lame \nI feel like a burden on society \nMy parents spend so much money on me but I just am a bad investment\nIf I kill myself I&amp;#39;ll see Alyssa again, I just know it\nI&amp;#39;m a triplet and I don&amp;#39;t want to hurt my sisters the same way Alyssa hurt me when she killed herself\nI don&amp;#39;t want to be on any more meds\nI want to not be lonely anymore\nI want to be happy\nI try to socialize as best I can with the outside world\nPeople often see me as a fearless guy but I am terrified of being lonely...absolutely terrified (sorry for the bad grammar I just don&amp;#39;t care about that right now)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm going to break down my situation to you....\nI tried to commit suicide in college\nI went to a treatment center\nFell in love with a beautiful girl but left treatment and left her\nWent back to college \nFound out that my ex at the treatment center committed suicide\n5 months later I get into a fight with my friend who was also my boss at work and I attempt to kill myself. I took 70 sleeping pills and called my family and told them I loved them\nI went to the hospital and was in lock down for 2 weeks\nMy boss/best friend and my co-worker friend came to my support\nHowever, events have caused a rift in our relationship and I feel most of it has to do with my hospitalization\nI go on so many dates and I get responses back like \"I can't give you the time you need\"\nI have so many memories of the girl I loved\nShe was the only girl to ever hold my hand when she could see how stressed I was\nShe admired me and I admired her\nI am having problems with this loneliness and I don't want to beg for someone to be there for me\nI have my family but shit I need more...\nI went on the meetup groups but fuck they are awkward and lame \nI feel like a burden on society \nMy parents spend so much money on me but I just am a bad investment\nIf I kill myself I'll see Alyssa again, I just know it\nI'm a triplet and I don't want to hurt my sisters the same way Alyssa hurt me when she killed herself\nI don't want to be on any more meds\nI want to not be lonely anymore\nI want to be happy\nI try to socialize as best I can with the outside world\nPeople often see me as a fearless guy but I am terrified of being lonely...absolutely terrified (sorry for the bad grammar I just don't care about that right now)\n\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xcoy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "jlgchilipepper", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xcoy/dont_feel_sorry_for_me_i_just_cant_be_lonely/", "name": "t3_23xcoy", "created": 1398428847.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xcoy/dont_feel_sorry_for_me_i_just_cant_be_lonely/", "author_flair_text": null, "title": "Don't feel sorry for me I just can't be lonely anymore", "created_utc": 1398400047.0, "ups": 9, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1k9ur", "gilded": 0, "author": "Caleus", "parent_id": "t3_23xcoy", "approved_by": null, "body": "well i don't have a big speech to make like the others who have responded so far, but if you need someone to talk to, to feel less lonely, i would be glad to do so. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well i don&amp;#39;t have a big speech to make like the others who have responded so far, but if you need someone to talk to, to feel less lonely, i would be glad to do so. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xcoy", "score_hidden": false, "name": "t1_ch1k9ur", "created": 1398413305.0, "author_flair_text": null, "created_utc": 1398409705.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1ixes", "gilded": 0, "author": "socrateshaditright", "parent_id": "t3_23xcoy", "approved_by": null, "body": "I don't know if I can be of much help, since the person I loved like you love Alyssa isn't dead, just gone, but I feel an affinity with you. I too have been hospitalized and have drifted apart from my friends due to it. That loneliness, it is so hard to handle. I am so very sorry that all of this has happened to you. Sometimes it is incredibly difficult to find the right people to surround yourself with that can make you happy, or at least empathize with your situation. I know that I may not be able to understand, but if you need someone to talk things through with, pm me. I am always available. \n\nI really hope that you find those around you or recognize those who care deeply for you. You aren't a bad investment, no human being is. Sometimes, we just struggle, and those who care show that they do by being friends or by giving support, as your parents have. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if I can be of much help, since the person I loved like you love Alyssa isn&amp;#39;t dead, just gone, but I feel an affinity with you. I too have been hospitalized and have drifted apart from my friends due to it. That loneliness, it is so hard to handle. I am so very sorry that all of this has happened to you. Sometimes it is incredibly difficult to find the right people to surround yourself with that can make you happy, or at least empathize with your situation. I know that I may not be able to understand, but if you need someone to talk things through with, pm me. I am always available. &lt;/p&gt;\n\n&lt;p&gt;I really hope that you find those around you or recognize those who care deeply for you. You aren&amp;#39;t a bad investment, no human being is. Sometimes, we just struggle, and those who care show that they do by being friends or by giving support, as your parents have. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xcoy", "score_hidden": false, "name": "t1_ch1ixes", "created": 1398408058.0, "author_flair_text": null, "created_utc": 1398404458.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2402a", "gilded": 0, "author": "jlgchilipepper", "parent_id": "t1_ch1ikdf", "approved_by": null, "body": "I think Alyssa is in a spiritual world of some sorts. I'm not very religious but I do believe that there is a life after death. Yeah she would be there in the afterlife if I lived out my life, but why should I wait. We broke up because I left treatment in Houston, TX and moved back to Baltimore. I spent about a year in Houston and realized I got all the help I needed (or at least thats what I though) and needed to go back to school and make progress with my life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Alyssa is in a spiritual world of some sorts. I&amp;#39;m not very religious but I do believe that there is a life after death. Yeah she would be there in the afterlife if I lived out my life, but why should I wait. We broke up because I left treatment in Houston, TX and moved back to Baltimore. I spent about a year in Houston and realized I got all the help I needed (or at least thats what I though) and needed to go back to school and make progress with my life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xcoy", "score_hidden": false, "name": "t1_ch2402a", "created": 1398467939.0, "author_flair_text": null, "created_utc": 1398464339.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1ikdf", "gilded": 0, "author": "Madame_de_Cunt", "parent_id": "t3_23xcoy", "approved_by": null, "body": "1) Everyone's scared of being lonely. Even my grandma, who's 83 now and has been a widow for 15 years and still misses my grampie. (But who is also a hearty old kickass bitch who trudges on anyway 'cause she really might as well finish the tour.) But since you're here, you know you have resources where people will gather around you. So, hi.\n\n2) I am on meds for depression. I don't want to be on them, either. I wouldn't take them for more than a month for ten years because I so badly didn't want to be on them. Being on meds is like admitting you're so broken you can't fix yourself, right? It means you're weak. \n\nExcept it actually doesn't. Some of us have shit wrong with our brains - shit that we can control about as much as we could control the weather. Shit just gets fucked up sometimes. But medication can sometimes sort it out. I know I fight and fight and fight against meds EVERY TIME. I tried like. 10 or 12 different meds. I finally found a pill that worked for me. Life is better. Actually, my life is shittier, to be honest. But I feel better able to deal with it so on the whole I feel better.\n\nYou really have to give them a shot and treat them like this is a physical problem (which it is) which can be helped by these meds (which they could be.) If they still don't work when you use them religiously and for a good long while (honestly, a month at least) you might notice a difference.\n\n3) Where do you think Alyssa is? I mean obviously you think you can go to be with her, so I am just wondering. If you believe she is in an afterlife, isn't she just as likely to be there if you wait and live out your life as she would be if you died now? And if that is eternal, this is just a very short time.\n\n4) Why did you guys break up? Just because of the distance?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) Everyone&amp;#39;s scared of being lonely. Even my grandma, who&amp;#39;s 83 now and has been a widow for 15 years and still misses my grampie. (But who is also a hearty old kickass bitch who trudges on anyway &amp;#39;cause she really might as well finish the tour.) But since you&amp;#39;re here, you know you have resources where people will gather around you. So, hi.&lt;/p&gt;\n\n&lt;p&gt;2) I am on meds for depression. I don&amp;#39;t want to be on them, either. I wouldn&amp;#39;t take them for more than a month for ten years because I so badly didn&amp;#39;t want to be on them. Being on meds is like admitting you&amp;#39;re so broken you can&amp;#39;t fix yourself, right? It means you&amp;#39;re weak. &lt;/p&gt;\n\n&lt;p&gt;Except it actually doesn&amp;#39;t. Some of us have shit wrong with our brains - shit that we can control about as much as we could control the weather. Shit just gets fucked up sometimes. But medication can sometimes sort it out. I know I fight and fight and fight against meds EVERY TIME. I tried like. 10 or 12 different meds. I finally found a pill that worked for me. Life is better. Actually, my life is shittier, to be honest. But I feel better able to deal with it so on the whole I feel better.&lt;/p&gt;\n\n&lt;p&gt;You really have to give them a shot and treat them like this is a physical problem (which it is) which can be helped by these meds (which they could be.) If they still don&amp;#39;t work when you use them religiously and for a good long while (honestly, a month at least) you might notice a difference.&lt;/p&gt;\n\n&lt;p&gt;3) Where do you think Alyssa is? I mean obviously you think you can go to be with her, so I am just wondering. If you believe she is in an afterlife, isn&amp;#39;t she just as likely to be there if you wait and live out your life as she would be if you died now? And if that is eternal, this is just a very short time.&lt;/p&gt;\n\n&lt;p&gt;4) Why did you guys break up? Just because of the distance?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xcoy", "score_hidden": false, "name": "t1_ch1ikdf", "created": 1398406945.0, "author_flair_text": null, "created_utc": 1398403345.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}]