[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just graduated from college. I&amp;#39;ve been looking for a job for eight months now. My lease is up in August and if I don&amp;#39;t find something by then, I have no idea what I&amp;#39;ll do. So I&amp;#39;ll probably kill myself. I&amp;#39;m actually hoping that I will do it earlier so I don&amp;#39;t have to keep being so stressed and scared about what will happen next. I have no future, so I don&amp;#39;t see the point in living anymore. I&amp;#39;ve now applied to probably around 1,000 jobs and even after lots of interviews with many different companies, I have always been rejected. I don&amp;#39;t understand why I am so much worse than every other person I graduated with, everyone else I know has a job.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see the point in keeping going if I always get rejected and if I end up unable to support myself or to find a place to live. I will probably kill myself this week. if not, in August.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just graduated from college. I've been looking for a job for eight months now. My lease is up in August and if I don't find something by then, I have no idea what I'll do. So I'll probably kill myself. I'm actually hoping that I will do it earlier so I don't have to keep being so stressed and scared about what will happen next. I have no future, so I don't see the point in living anymore. I've now applied to probably around 1,000 jobs and even after lots of interviews with many different companies, I have always been rejected. I don't understand why I am so much worse than every other person I graduated with, everyone else I know has a job.\n\nI don't see the point in keeping going if I always get rejected and if I end up unable to support myself or to find a place to live. I will probably kill myself this week. if not, in August.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2567lg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nnnmmmnnnmmm", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2567lg/dont_see_the_point_anymore/", "name": "t3_2567lg", "created": 1399709737.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2567lg/dont_see_the_point_anymore/", "author_flair_text": null, "title": "don't see the point anymore", "created_utc": 1399680937.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che3gyp", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_2567lg", "approved_by": null, "body": "Usually you don't get an interview unless they like your resume.\n\nI've known a lot of people who got out of college and wound up doing stuff they didn't plan to do.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Usually you don&amp;#39;t get an interview unless they like your resume.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve known a lot of people who got out of college and wound up doing stuff they didn&amp;#39;t plan to do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2567lg", "score_hidden": false, "name": "t1_che3gyp", "created": 1399710640.0, "author_flair_text": null, "created_utc": 1399681840.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che686g", "gilded": 0, "author": "throwaway8005882300", "parent_id": "t3_2567lg", "approved_by": null, "body": "My advice would be to take a short break from applying to jobs. Like 1-2 weeks off. Just do something fun. Hang with friends. Take a trip. Start something you've always wanted to. Take a deep breath. Then after your short break, come back to your job apps and be honest about yourself as to what you need improving on. Then apply, but apply strategically. Use contacts and apply for things that you are qualified for at the moment, not necessarily something you want to do forever. Also be open to internships and other side stuff. Just don't give up. Take a break, it helps so much and will make you feel better. I was in your boat not too long ago. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My advice would be to take a short break from applying to jobs. Like 1-2 weeks off. Just do something fun. Hang with friends. Take a trip. Start something you&amp;#39;ve always wanted to. Take a deep breath. Then after your short break, come back to your job apps and be honest about yourself as to what you need improving on. Then apply, but apply strategically. Use contacts and apply for things that you are qualified for at the moment, not necessarily something you want to do forever. Also be open to internships and other side stuff. Just don&amp;#39;t give up. Take a break, it helps so much and will make you feel better. I was in your boat not too long ago. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2567lg", "score_hidden": false, "name": "t1_che686g", "created": 1399717789.0, "author_flair_text": null, "created_utc": 1399688989.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]