[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/4Qt0Hy4\"&gt;http://imgur.com/4Qt0Hy4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is what has caused me to be such a bad person. This has what&amp;#39;s ruining my health. This is what has let me drift away from friends, from Family. This is what has taken my mind, body and soul. It&amp;#39;s called poppy seed tea. It sounds stupid, right? It is stupid. It&amp;#39;s left me broke, ruined my hopes, ruined the hopes of my Family, and it&amp;#39;s left me feeling Doomed. And those two drinks pictured are what brought me right back to a relapse just 2 days ago.&lt;/p&gt;\n\n&lt;p&gt;I have pawned almost everything I have for it in the past 2 or 3 years. I have stolen my Dad&amp;#39;s guitar, gardening tools, countless things, and I have siphoned fuel out of his cars. I have stolen my step-Mom&amp;#39;s pain medication, money and gold jewellery. I have stolen my Brother&amp;#39;s money and tricked him into giving me some &amp;quot;for fuel&amp;quot;.  I have stolen hundreds, if not thousands of dollars and possessions from my Mom. I have stolen money and pawned possessions from my step-Dad. I have shoplifted a sizeable amount from dozens of stores to get my drug of choice.&lt;/p&gt;\n\n&lt;p&gt;I have stood outside a supermarket trying to sell a child&amp;#39;s toy for $5.00 that my Dad bought as a present for my niece. &lt;/p&gt;\n\n&lt;p&gt;I have pawned 2 of my now-dead Grandfather&amp;#39;s WWII vintage binoculars for $30.00. One of them was worth at least $300. The last time I visited his grave I was sick from drug withdrawals thanks to this drug.&lt;/p&gt;\n\n&lt;p&gt;And in spite of all of that, all of this pain, heartache and more, I still want to use. After 39 days in sobriety I relapsed just about 48 hours ago. And I plan on using after I write this. So why do I use? There has to be a reason other than addiction. And that reason is depression. After 39 days of sobriety, the thrill and pain was lifted from me and I was left with depression. Again. And it&amp;#39;s the hardest hardship of my Life, because it brings me back to this drug over and over again in an attempt to kill my pain.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even have much to be depressed about. I had a nice childhood, all things considered. My teenage years were rough, but only because of social isolation and, well, being a teenager. I never killed someone in a car crash, though. I never saw a friend hung by the neck to a tree. I never saw my Dad hit my Mom. I never saw my Brother drink himself to his grave. I saw a nice, rich neighbourhood with happy kids riding their bikes and passing Grades. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m dying of thirst.&lt;/p&gt;\n\n&lt;p&gt;And this drink relieves me of my thirst for now, and as an addict &lt;em&gt;now&lt;/em&gt; is all that matters to me. I don&amp;#39;t care enough about the past to learn and quit, and I don&amp;#39;t care enough about the future to walk in a different path. Bob Dylan sang in &lt;em&gt;Mr. Tambourine Man&lt;/em&gt;, &amp;quot;Let me forget about Today until Tomorrow.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The addict&amp;#39;s motto.&lt;/p&gt;\n\n&lt;p&gt;But still I&amp;#39;m dying of thirst.&lt;/p&gt;\n\n&lt;p&gt;I want to &lt;em&gt;live&lt;/em&gt;. I want to be happy. I want to appreciate Life like somebody who doesn&amp;#39;t see it as some boiling pot we&amp;#39;re all trying to crawl out of. But since I feel I obviously can&amp;#39;t escape this constant cycle of nothing, I&amp;#39;ll dig. I&amp;#39;ll dig until I hit rock bottom. And then I&amp;#39;ll dig through the bedrock until I&amp;#39;m 6 feet under. Because I&amp;#39;m dying of thirst. Tired of running.&lt;/p&gt;\n\n&lt;p&gt;EDIT: No, I didn&amp;#39;t use tonight. I threw it out before I could drink it. And I&amp;#39;m not tired of running. I just needed to catch my breath.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi,\n\nhttp://imgur.com/4Qt0Hy4\n\nThis is what has caused me to be such a bad person. This has what's ruining my health. This is what has let me drift away from friends, from Family. This is what has taken my mind, body and soul. It's called poppy seed tea. It sounds stupid, right? It is stupid. It's left me broke, ruined my hopes, ruined the hopes of my Family, and it's left me feeling Doomed. And those two drinks pictured are what brought me right back to a relapse just 2 days ago.\n\nI have pawned almost everything I have for it in the past 2 or 3 years. I have stolen my Dad's guitar, gardening tools, countless things, and I have siphoned fuel out of his cars. I have stolen my step-Mom's pain medication, money and gold jewellery. I have stolen my Brother's money and tricked him into giving me some \"for fuel\".  I have stolen hundreds, if not thousands of dollars and possessions from my Mom. I have stolen money and pawned possessions from my step-Dad. I have shoplifted a sizeable amount from dozens of stores to get my drug of choice.\n\nI have stood outside a supermarket trying to sell a child's toy for $5.00 that my Dad bought as a present for my niece. \n\nI have pawned 2 of my now-dead Grandfather's WWII vintage binoculars for $30.00. One of them was worth at least $300. The last time I visited his grave I was sick from drug withdrawals thanks to this drug.\n\nAnd in spite of all of that, all of this pain, heartache and more, I still want to use. After 39 days in sobriety I relapsed just about 48 hours ago. And I plan on using after I write this. So why do I use? There has to be a reason other than addiction. And that reason is depression. After 39 days of sobriety, the thrill and pain was lifted from me and I was left with depression. Again. And it's the hardest hardship of my Life, because it brings me back to this drug over and over again in an attempt to kill my pain.\n\nI don't even have much to be depressed about. I had a nice childhood, all things considered. My teenage years were rough, but only because of social isolation and, well, being a teenager. I never killed someone in a car crash, though. I never saw a friend hung by the neck to a tree. I never saw my Dad hit my Mom. I never saw my Brother drink himself to his grave. I saw a nice, rich neighbourhood with happy kids riding their bikes and passing Grades. \n\nBut I'm dying of thirst.\n\nAnd this drink relieves me of my thirst for now, and as an addict *now* is all that matters to me. I don't care enough about the past to learn and quit, and I don't care enough about the future to walk in a different path. Bob Dylan sang in *Mr. Tambourine Man*, \"Let me forget about Today until Tomorrow.\"\n\nThe addict's motto.\n\nBut still I'm dying of thirst.\n\nI want to *live*. I want to be happy. I want to appreciate Life like somebody who doesn't see it as some boiling pot we're all trying to crawl out of. But since I feel I obviously can't escape this constant cycle of nothing, I'll dig. I'll dig until I hit rock bottom. And then I'll dig through the bedrock until I'm 6 feet under. Because I'm dying of thirst. Tired of running.\n\nEDIT: No, I didn't use tonight. I threw it out before I could drink it. And I'm not tired of running. I just needed to catch my breath.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24oppx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Nozphexezora", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399215458.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24oppx/dying_of_thirst/", "name": "t3_24oppx", "created": 1399229621.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24oppx/dying_of_thirst/", "author_flair_text": null, "title": "Dying of Thirst", "created_utc": 1399200821.0, "ups": 8, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch97tcj", "gilded": 0, "author": "Nozphexezora", "parent_id": "t1_ch97rx6", "approved_by": null, "body": "I'm not going back to a psych ward. I haven't taken the drug tonight yet. It's just sitting there. I don't really want to take it, but at the same time I don't want to throw it away.\n\nI'm not going to feel physical withdrawals. I've been through detox a few months ago, gone through that shit. It's just if I keep using I will experience it again.\n\nAnd I go to A.A., I've been working the steps and everything. I have support. I just don't know.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going back to a psych ward. I haven&amp;#39;t taken the drug tonight yet. It&amp;#39;s just sitting there. I don&amp;#39;t really want to take it, but at the same time I don&amp;#39;t want to throw it away.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to feel physical withdrawals. I&amp;#39;ve been through detox a few months ago, gone through that shit. It&amp;#39;s just if I keep using I will experience it again.&lt;/p&gt;\n\n&lt;p&gt;And I go to A.A., I&amp;#39;ve been working the steps and everything. I have support. I just don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oppx", "score_hidden": false, "name": "t1_ch97tcj", "created": 1399239160.0, "author_flair_text": null, "created_utc": 1399210360.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch97rx6", "gilded": 0, "author": "throwaway544353e", "parent_id": "t3_24oppx", "approved_by": null, "body": "It's both addiction and depression. You felt depressed and took this drug as a means of feeling better, which is fine. The problem is that, for whatever reason, your body is addicted to this drug. It might be beneficial to check yourself into a local psych ward and spend a few days there. They'll help you quit this drug (either by weaning you off or managing your withdrawal symptoms, I don't really know) and provide you with lots of healthcare providers to talk to. I would imagine that once you get your depression under control you won't have to turn to the drug again.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s both addiction and depression. You felt depressed and took this drug as a means of feeling better, which is fine. The problem is that, for whatever reason, your body is addicted to this drug. It might be beneficial to check yourself into a local psych ward and spend a few days there. They&amp;#39;ll help you quit this drug (either by weaning you off or managing your withdrawal symptoms, I don&amp;#39;t really know) and provide you with lots of healthcare providers to talk to. I would imagine that once you get your depression under control you won&amp;#39;t have to turn to the drug again.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oppx", "score_hidden": false, "name": "t1_ch97rx6", "created": 1399238986.0, "author_flair_text": null, "created_utc": 1399210186.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]