[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every single day I struggle and stumble and all I can think about is killing myself. My emotions are absolutely void; I feel like a robot. &lt;/p&gt;\n\n&lt;p&gt;I had the perfect job at the most amazing comoany in the world and walked away, for a shit job at a shit company that paid more and had a better title. I have severe regret about it every god damn day. Every fucking moment of every day.&lt;/p&gt;\n\n&lt;p&gt;My personality has been voided. I used to be an extremely social, flirtatious,  easy going guy. I had a lady I loved and I was everybody&amp;#39;s friend.  I now generally avoid people but when I&amp;#39;m around people I don&amp;#39;t know what to say anymore.... because all I think about is dying.&lt;/p&gt;\n\n&lt;p&gt;I had a million interests and now I can&amp;#39;t even begin to think about watching a movie, etc.... I loved so many bands, now I don&amp;#39;t even really listen to music.  It&amp;#39;s hard to describe just how badly I fucked up. Lost my lady, my first real love (on and off relationship, changing  lives, trust issues) lost my job (voluntarily--- I&amp;#39;m a fucking idiot for not making sure this new place was a culture fit!!!!) &lt;/p&gt;\n\n&lt;p&gt;My routine is wake up with a near-panic attack, shut my phone alarm off as many times as I can, maybe shower, maybe not, no breakfast,  rush to work, fucking dread walking in, send my mom dad and brother GTalk messages all day telling them how miserable I am, look at &lt;a href=\"/r/depression\"&gt;/r/depression&lt;/a&gt; and &lt;a href=\"/r/SW\"&gt;/r/SW&lt;/a&gt; all day on my phone passively wondering how great it would be to die.&lt;/p&gt;\n\n&lt;p&gt;It would break my mom&amp;#39;s heart and soul, and all the rest of my family I&amp;#39;m sure.&lt;/p&gt;\n\n&lt;p&gt;But I am living with too many regrets. So many places and music are now haunted by my once sweethearted lady. My career has ended up at this fucking shit job when I already had a great one. I&amp;#39;ll never know love like that again, and chances are I&amp;#39;ll never have a job like I had again. The burning regret of walking away from the perfect job for a horrible one. It seriously honestly burns.&lt;/p&gt;\n\n&lt;p&gt;The only way I can describe how I feel is that my brain has been scooped out and thrown away. Futhermore, I feel as if  I&amp;#39;ve been transported to some distant island where I know no one, not even myself. &lt;/p&gt;\n\n&lt;p&gt;I got prescribed Celexa but only took it for a few days before stopping.  I know I should take it again. I&amp;#39;m worried about SSRI side effects and so on. But I felt a little better on it.&lt;/p&gt;\n\n&lt;p&gt;I have an interview with another company tomorrow but I&amp;#39;m not sure how much it will help.&lt;/p&gt;\n\n&lt;p&gt;Sometimes I just want to sell all my shit and go somewhere far away and work some simple job and live a simple life. I have a few grand saved, maybe I could do that?&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even emphasize how rich my life was. I had sex all the time, romantic getaways,  fully paid lunches at expensive restaurants with my company, cycling with coworkers, drinking all the time, celebrating birthdays holidays weekends with my lady ...  Now it is dull, gray, and full of anxiety and regret. Night and day. Simply night and die.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love to die. I know my life won&amp;#39;t ever be the same as it was.&lt;/p&gt;\n\n&lt;p&gt;Please. What the hell do I do??????&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Every single day I struggle and stumble and all I can think about is killing myself. My emotions are absolutely void; I feel like a robot. \n\nI had the perfect job at the most amazing comoany in the world and walked away, for a shit job at a shit company that paid more and had a better title. I have severe regret about it every god damn day. Every fucking moment of every day.\n\n\nMy personality has been voided. I used to be an extremely social, flirtatious,  easy going guy. I had a lady I loved and I was everybody's friend.  I now generally avoid people but when I'm around people I don't know what to say anymore.... because all I think about is dying.\n\nI had a million interests and now I can't even begin to think about watching a movie, etc.... I loved so many bands, now I don't even really listen to music.  It's hard to describe just how badly I fucked up. Lost my lady, my first real love (on and off relationship, changing  lives, trust issues) lost my job (voluntarily--- I'm a fucking idiot for not making sure this new place was a culture fit!!!!) \n\n\nMy routine is wake up with a near-panic attack, shut my phone alarm off as many times as I can, maybe shower, maybe not, no breakfast,  rush to work, fucking dread walking in, send my mom dad and brother GTalk messages all day telling them how miserable I am, look at /r/depression and /r/SW all day on my phone passively wondering how great it would be to die.\n\nIt would break my mom's heart and soul, and all the rest of my family I'm sure.\n\nBut I am living with too many regrets. So many places and music are now haunted by my once sweethearted lady. My career has ended up at this fucking shit job when I already had a great one. I'll never know love like that again, and chances are I'll never have a job like I had again. The burning regret of walking away from the perfect job for a horrible one. It seriously honestly burns.\n\n\nThe only way I can describe how I feel is that my brain has been scooped out and thrown away. Futhermore, I feel as if  I've been transported to some distant island where I know no one, not even myself. \n\n\nI got prescribed Celexa but only took it for a few days before stopping.  I know I should take it again. I'm worried about SSRI side effects and so on. But I felt a little better on it.\n\nI have an interview with another company tomorrow but I'm not sure how much it will help.\n\n\nSometimes I just want to sell all my shit and go somewhere far away and work some simple job and live a simple life. I have a few grand saved, maybe I could do that?\n\n\nI can't even emphasize how rich my life was. I had sex all the time, romantic getaways,  fully paid lunches at expensive restaurants with my company, cycling with coworkers, drinking all the time, celebrating birthdays holidays weekends with my lady ...  Now it is dull, gray, and full of anxiety and regret. Night and day. Simply night and die.\n\n I'd love to die. I know my life won't ever be the same as it was.\n\n\nPlease. What the hell do I do??????", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24b1o4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cavingin25", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24b1o4/dying_sounds_wonderful/", "name": "t3_24b1o4", "created": 1398831560.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24b1o4/dying_sounds_wonderful/", "author_flair_text": null, "title": "Dying sounds wonderful", "created_utc": 1398802760.0, "ups": 2, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5dhc8", "gilded": 0, "author": "cavingin25", "parent_id": "t1_ch5cslz", "approved_by": null, "body": "No. It isn't.  I was a fool to leave. An absolute fool. I had some reasons but it was truly too preemptive", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. It isn&amp;#39;t.  I was a fool to leave. An absolute fool. I had some reasons but it was truly too preemptive&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b1o4", "score_hidden": false, "name": "t1_ch5dhc8", "created": 1398834376.0, "author_flair_text": null, "created_utc": 1398805576.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5cslz", "gilded": 0, "author": "throway8420", "parent_id": "t3_24b1o4", "approved_by": null, "body": "Would it be possible for you to get your old job back?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would it be possible for you to get your old job back?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b1o4", "score_hidden": false, "name": "t1_ch5cslz", "created": 1398833038.0, "author_flair_text": null, "created_utc": 1398804238.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]