[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My family is always having this &amp;quot;negative vibes&amp;quot;. I just noticed that they are not the same anymore. When I was young, we always bond and always happy. But now, I feel lke they are all far away from each other even if we are in just one house. It&amp;#39;s like they are falling apart and it&amp;#39;s hard to see them shout at each other and hear them exchange words.&lt;/p&gt;\n\n&lt;p&gt;I have an aunt. She is always shouting at my mother and grandmother because they always scold her, because she always do something wrong. They tell her in a cool manner but she shuts them up with shouting. They always shout. I hate this. &lt;/p&gt;\n\n&lt;p&gt;Just this afternoon, they went it again. I can&amp;#39;t hold back the pain anymore. I shouted at her to shut up. She fired up and went to throw all the things in her sight because she doesn&amp;#39;t like being disrespected. But ironically, she&amp;#39;s the one disrespecting my gradmother and mother.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if I could hold on to this pain longer. I just want this to be over. :(&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My family is always having this \"negative vibes\". I just noticed that they are not the same anymore. When I was young, we always bond and always happy. But now, I feel lke they are all far away from each other even if we are in just one house. It's like they are falling apart and it's hard to see them shout at each other and hear them exchange words.\n\nI have an aunt. She is always shouting at my mother and grandmother because they always scold her, because she always do something wrong. They tell her in a cool manner but she shuts them up with shouting. They always shout. I hate this. \n\nJust this afternoon, they went it again. I can't hold back the pain anymore. I shouted at her to shut up. She fired up and went to throw all the things in her sight because she doesn't like being disrespected. But ironically, she's the one disrespecting my gradmother and mother.\n\nI don't know if I could hold on to this pain longer. I just want this to be over. :(", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24uajl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "umightthinkimhappy", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24uajl/dysfunctional_family/", "name": "t3_24uajl", "created": 1399381844.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24uajl/dysfunctional_family/", "author_flair_text": null, "title": "Dysfunctional Family", "created_utc": 1399353044.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaxqzn", "gilded": 0, "author": "TryToFlyHigh", "parent_id": "t3_24uajl", "approved_by": null, "body": "I think your mother and grandmother know a lot more about this than they would showcase. \n\nTalk to them about your aunt, maybe your aunt is having a hard time. Maybe they take her shouting, because they know something is wrong. Enduring for the sake of your aunt, it's a very novel thing to do from your mother's perspective.\n\nReally, all you can do is talk. Understand why, to help you accept it; or maybe it will become a drive for you to change the situation. But maybe, you can't. Just talk about it, and see if you can do anything about it. This pain is not yours, but you share it. Let them know. Talk.\n\nThat's all the advice I have for you my typing friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your mother and grandmother know a lot more about this than they would showcase. &lt;/p&gt;\n\n&lt;p&gt;Talk to them about your aunt, maybe your aunt is having a hard time. Maybe they take her shouting, because they know something is wrong. Enduring for the sake of your aunt, it&amp;#39;s a very novel thing to do from your mother&amp;#39;s perspective.&lt;/p&gt;\n\n&lt;p&gt;Really, all you can do is talk. Understand why, to help you accept it; or maybe it will become a drive for you to change the situation. But maybe, you can&amp;#39;t. Just talk about it, and see if you can do anything about it. This pain is not yours, but you share it. Let them know. Talk.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all the advice I have for you my typing friend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24uajl", "score_hidden": false, "name": "t1_chaxqzn", "created": 1399414709.0, "author_flair_text": null, "created_utc": 1399385909.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]