[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t ever tell anyone the truth.  I can&amp;#39;t ever just say, &amp;quot;I really really want to die&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I have been on depression medication for about 9 months now and I realized that it hasn&amp;#39;t been working at all.  In the past 2 months, I have switched from sarafem, to zoloft, and now I&amp;#39;m on effexor.  I have done bi-monthly therapy for over a year and a half now.  I have participated in therapy and meditation groups.  All of this has proven to be costly, on top of the fact that I am a college student who has just withdrew from all my classes and who is racking up debt that I literally won&amp;#39;t be able to pay off until I&amp;#39;m 40.  I have made every attempt to explore ways to feel better, to find what motivates me to make me wake up in the morning, but the only effect is that it has made me positive that I no longer want to be alive.&lt;/p&gt;\n\n&lt;p&gt;My family is worried about me, but they don&amp;#39;t want me leaving school.  I&amp;#39;m the first one to have gone to college, and they see it as the only way I can make decent money.  I don&amp;#39;t care about making money, I have explored countless courses and subjects, but nothing ever interests me.  I have no goals except for killing myself, but of course I&amp;#39;m scared of letting other people down or possibly causing some chain reactions of suicide within my family.  I just feel that life isn&amp;#39;t something for me, not that I&amp;#39;m this tortured or misunderstood soul that just couldn&amp;#39;t take the pressure anymore.&lt;/p&gt;\n\n&lt;p&gt;I know that because I posted here is &amp;quot;a sign that I still want to be alive&amp;quot;.  But really, I&amp;#39;m just so sick of telling people that I am trying to figure out what I want to do with my life.  I want to tell the truth, and the truth is that I don&amp;#39;t want to be alive anymore.  I feel empty 24/7.  I&amp;#39;m not alone, and I&amp;#39;m not special.  I just want to let someone have this bed that I feel I&amp;#39;m wasting or this meal that is going towards some sort of lost cause when it could go to someone who is going to be someone important someday.&lt;/p&gt;\n\n&lt;p&gt;I hope this isn&amp;#39;t too hard to read or understand.  My mind is cloudy.  I hope you all are having a good day despite my bullshit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't ever tell anyone the truth.  I can't ever just say, \"I really really want to die\".\n\nI have been on depression medication for about 9 months now and I realized that it hasn't been working at all.  In the past 2 months, I have switched from sarafem, to zoloft, and now I'm on effexor.  I have done bi-monthly therapy for over a year and a half now.  I have participated in therapy and meditation groups.  All of this has proven to be costly, on top of the fact that I am a college student who has just withdrew from all my classes and who is racking up debt that I literally won't be able to pay off until I'm 40.  I have made every attempt to explore ways to feel better, to find what motivates me to make me wake up in the morning, but the only effect is that it has made me positive that I no longer want to be alive.\n\nMy family is worried about me, but they don't want me leaving school.  I'm the first one to have gone to college, and they see it as the only way I can make decent money.  I don't care about making money, I have explored countless courses and subjects, but nothing ever interests me.  I have no goals except for killing myself, but of course I'm scared of letting other people down or possibly causing some chain reactions of suicide within my family.  I just feel that life isn't something for me, not that I'm this tortured or misunderstood soul that just couldn't take the pressure anymore.\n\nI know that because I posted here is \"a sign that I still want to be alive\".  But really, I'm just so sick of telling people that I am trying to figure out what I want to do with my life.  I want to tell the truth, and the truth is that I don't want to be alive anymore.  I feel empty 24/7.  I'm not alone, and I'm not special.  I just want to let someone have this bed that I feel I'm wasting or this meal that is going towards some sort of lost cause when it could go to someone who is going to be someone important someday.\n\nI hope this isn't too hard to read or understand.  My mind is cloudy.  I hope you all are having a good day despite my bullshit.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24o89z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "japanada", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24o89z/everyone_keeps_asking_what_i_want_to_do_with_my/", "name": "t3_24o89z", "created": 1399206469.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24o89z/everyone_keeps_asking_what_i_want_to_do_with_my/", "author_flair_text": null, "title": "Everyone keeps asking what I want to do with my life", "created_utc": 1399177669.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch91ato", "gilded": 0, "author": "japanada", "parent_id": "t3_24o89z", "approved_by": null, "body": "I guess I should add that I only get out out of the house to make other people happy.  I never want to leave my room.  I rarely do anything that makes me happy because I cannot find anything that makes me happy besides watching pro wrestling and talking to friends.  Both of those are considered wastes of time so I avoid doing them at the fear of upsetting people.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I should add that I only get out out of the house to make other people happy.  I never want to leave my room.  I rarely do anything that makes me happy because I cannot find anything that makes me happy besides watching pro wrestling and talking to friends.  Both of those are considered wastes of time so I avoid doing them at the fear of upsetting people.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24o89z", "score_hidden": false, "name": "t1_ch91ato", "created": 1399206732.0, "author_flair_text": null, "created_utc": 1399177932.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9ix3n", "gilded": 0, "author": "YOUARE_GREAT", "parent_id": "t3_24o89z", "approved_by": null, "body": "A lot of people have said that finding a way to help others gives them purpose. If you, by the end of your life, can find a way to give other people more than they gave you, you benefited the world. Maybe you can't do that now, but I bet you can eventually if you keep trying to figure it out. Caring only about my own happiness is one of the things that pushed me toward depression, and helping out other people is one of the things that makes me feel good.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people have said that finding a way to help others gives them purpose. If you, by the end of your life, can find a way to give other people more than they gave you, you benefited the world. Maybe you can&amp;#39;t do that now, but I bet you can eventually if you keep trying to figure it out. Caring only about my own happiness is one of the things that pushed me toward depression, and helping out other people is one of the things that makes me feel good.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24o89z", "score_hidden": false, "name": "t1_ch9ix3n", "created": 1399267233.0, "author_flair_text": null, "created_utc": 1399238433.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9bfjk", "gilded": 0, "author": "japanada", "parent_id": "t1_ch9bd8v", "approved_by": null, "body": "No, but fun fact: I am 25% Japanese. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, but fun fact: I am 25% Japanese. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24o89z", "score_hidden": false, "name": "t1_ch9bfjk", "created": 1399250267.0, "author_flair_text": null, "created_utc": 1399221467.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9bd8v", "gilded": 0, "author": "ignorethename", "parent_id": "t3_24o89z", "approved_by": null, "body": "are you from Japan?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;are you from Japan?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24o89z", "score_hidden": false, "name": "t1_ch9bd8v", "created": 1399250103.0, "author_flair_text": null, "created_utc": 1399221303.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]