[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just wrote a post and it got deleted (because my computer dislikes me) and I feel that&amp;#39;s a pretty fucked up thing for my head right now.&lt;/p&gt;\n\n&lt;p&gt;I will summarize yet it&amp;#39;s not as, ah, poetically written.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fantastic at lying to everyone. Everyone in my life, friends, family, doctors think I&amp;#39;m managing well.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not. I have a huge group project due today which I lied to other members about doing work. I haven&amp;#39;t done what I said, and now it&amp;#39;s causing serious problems. I also failed a Spanish course last semester that I still need to admit to, basically college is killing me right now.&lt;/p&gt;\n\n&lt;p&gt;I set high goals for myself and when I don&amp;#39;t meet my expectations or others&amp;#39; perceived expectations I start to implode.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m numb. Thoughts of suicide don&amp;#39;t make me cry anymore. After years of this roller coaster, my mind is putting up a defensive wall to emotions. I&amp;#39;m in over my head. I&amp;#39;m done.&lt;/p&gt;\n\n&lt;p&gt;Suicide would be easy for me. After I&amp;#39;ve experience surviving all this time, crafting the perfect death was rather simple.&lt;/p&gt;\n\n&lt;p&gt;Logically, I recognize that I fit into the group of people who are suicidal only because they are under so much stress/pain. If my situation resolves itself, I&amp;#39;d go on living - I&amp;#39;m not intent on dying. I&amp;#39;m intent on avoiding all the chaos, stress, and emotion that&amp;#39;s about to ensue.&lt;/p&gt;\n\n&lt;p&gt;I spoke with my psychiatrist about a week ago, I lied to him as well. Telling him everything was going well. Obviously, it hasn&amp;#39;t been.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m stuck against a wall, death is closing in. I can&amp;#39;t see a way out of here except suicide.&lt;/p&gt;\n\n&lt;p&gt;Well, I think that&amp;#39;s it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just wrote a post and it got deleted (because my computer dislikes me) and I feel that's a pretty fucked up thing for my head right now.\n\nI will summarize yet it's not as, ah, poetically written.\n\nI'm fantastic at lying to everyone. Everyone in my life, friends, family, doctors think I'm managing well.\n\nI'm not. I have a huge group project due today which I lied to other members about doing work. I haven't done what I said, and now it's causing serious problems. I also failed a Spanish course last semester that I still need to admit to, basically college is killing me right now.\n\nI set high goals for myself and when I don't meet my expectations or others' perceived expectations I start to implode.\n\nI'm numb. Thoughts of suicide don't make me cry anymore. After years of this roller coaster, my mind is putting up a defensive wall to emotions. I'm in over my head. I'm done.\n\nSuicide would be easy for me. After I've experience surviving all this time, crafting the perfect death was rather simple.\n\nLogically, I recognize that I fit into the group of people who are suicidal only because they are under so much stress/pain. If my situation resolves itself, I'd go on living - I'm not intent on dying. I'm intent on avoiding all the chaos, stress, and emotion that's about to ensue.\n\nI spoke with my psychiatrist about a week ago, I lied to him as well. Telling him everything was going well. Obviously, it hasn't been.\n\nI'm stuck against a wall, death is closing in. I can't see a way out of here except suicide.\n\nWell, I think that's it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245wx1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "LaBexica", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245wx1/everyone_is_fooled/", "name": "t3_245wx1", "created": 1398690320.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245wx1/everyone_is_fooled/", "author_flair_text": null, "title": "Everyone is fooled", "created_utc": 1398661520.0, "ups": 8, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3x8zy", "gilded": 0, "author": "QuiteStupid", "parent_id": "t3_245wx1", "approved_by": null, "body": "bad things happen to good people, friend.  so lets address this.  first off, the lying.  it's not a good thing.  thoughts of suicide make you feel weak, they make you feel like less of a human, people begin to objectify you and treat you as something that can only be helped as opposed to being helpful, which often throws you back into those spurs.\n\nthere is this philosophy a lot of people i know use.  it is, \"if i expect nothing, i can never be disappointed.\" and they are completely correct.  if they don't want something out of life, then why would they be upset if they're not given a little something?  but i don't understand that.  life has so many great things.  life has beautiful people to have relationships with, stunning places to see, moonlights to bask in and share late night conversations, intense vidya games, whatever the hell you're looking for, it usually has.  but people with that logic never persevere to get it, as they just take whatever they can get because they're sick of getting beat down.\n\ni fucking hate that logic.  i shoot for the god damned stars.  i try to get 100% of what i want.  and when that fails, i remember that it takes the hottest fire to create the strongest steel.  i know that i'll have to trek through shit, take hit after hit, and understand that i won't reach my goals if i don't actively try and actively fail.\n\nwhere the fuck does that equate to you though, is the question, friend.  and the answer is pretty simple, it's that you've got to turn shit around.  i have no clue if you're capable.  you're fairly literate, you participate in writingprompts with some decent stuff, you seem pretty capable.  you have this group project, get started on it.  it's not too late to turn this shit around, retake that course, and get those goals.  if you need help venturing through the heat, i'm here if you want to shoot a pm.  just don't end it because the problems pile up.  sort through them, even if you've got to work hard, swallow your pride, any of that stuff, friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;bad things happen to good people, friend.  so lets address this.  first off, the lying.  it&amp;#39;s not a good thing.  thoughts of suicide make you feel weak, they make you feel like less of a human, people begin to objectify you and treat you as something that can only be helped as opposed to being helpful, which often throws you back into those spurs.&lt;/p&gt;\n\n&lt;p&gt;there is this philosophy a lot of people i know use.  it is, &amp;quot;if i expect nothing, i can never be disappointed.&amp;quot; and they are completely correct.  if they don&amp;#39;t want something out of life, then why would they be upset if they&amp;#39;re not given a little something?  but i don&amp;#39;t understand that.  life has so many great things.  life has beautiful people to have relationships with, stunning places to see, moonlights to bask in and share late night conversations, intense vidya games, whatever the hell you&amp;#39;re looking for, it usually has.  but people with that logic never persevere to get it, as they just take whatever they can get because they&amp;#39;re sick of getting beat down.&lt;/p&gt;\n\n&lt;p&gt;i fucking hate that logic.  i shoot for the god damned stars.  i try to get 100% of what i want.  and when that fails, i remember that it takes the hottest fire to create the strongest steel.  i know that i&amp;#39;ll have to trek through shit, take hit after hit, and understand that i won&amp;#39;t reach my goals if i don&amp;#39;t actively try and actively fail.&lt;/p&gt;\n\n&lt;p&gt;where the fuck does that equate to you though, is the question, friend.  and the answer is pretty simple, it&amp;#39;s that you&amp;#39;ve got to turn shit around.  i have no clue if you&amp;#39;re capable.  you&amp;#39;re fairly literate, you participate in writingprompts with some decent stuff, you seem pretty capable.  you have this group project, get started on it.  it&amp;#39;s not too late to turn this shit around, retake that course, and get those goals.  if you need help venturing through the heat, i&amp;#39;m here if you want to shoot a pm.  just don&amp;#39;t end it because the problems pile up.  sort through them, even if you&amp;#39;ve got to work hard, swallow your pride, any of that stuff, friend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx1", "score_hidden": false, "name": "t1_ch3x8zy", "created": 1398665839.0, "author_flair_text": null, "created_utc": 1398662239.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]