[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s finals time. So that means high stress for me. But high stress leads me to think about how much I hate myself. My current kick: irresponsibility. &lt;/p&gt;\n\n&lt;p&gt;I like to carry my head held high, almost in superiority, about how responsible I am. But I feel that is all a lie. I feel like a hypocrite and a half. I have two majors, a minor, and a research grant. Therefore, people think I am responsible. That I get assignments done on time, that I balance time correctly, and I can find time to stay fit, and socialize, while having all of these academic obligations. I let them believe that. But from my own perspective, it is all an illusion, that i conceal with an extensive vernacular and an aura of forced confidence. No one questions you when you are able to excrete a sense of intelligence. The worst part is I let them believe it, and even preach to them when provoked how balance is so easily attainable.&lt;/p&gt;\n\n&lt;p&gt;I tell people I go to the gym atleast 5 days a week. I really Only go about twice a week, and starve myself because I&amp;#39;m too depressed to go the other days&lt;/p&gt;\n\n&lt;p&gt;I tell people I go to the library (and classes) for about 8 hours a day (8am-4pm) and all this planned studying time frees up my schedule. I do go on campus for this time, and I get distracted with how much I hate myself to work ahead.&lt;/p&gt;\n\n&lt;p&gt;People think I have a fulfilling social life that fits right into my schedule, making life easy. I only go to see my friends when I&amp;#39;m about to break down from stress. I just happen to break down from stress alot.&lt;/p&gt;\n\n&lt;p&gt;This was all kinda spurred on because my roommate flipped shit at me for the apartment becoming such a mess. Logically, I feel there is enough blame to go around. But I still failed keeping an ordered home life. I was irresponsible with the basic duties around the apartment. I failed at them. Just like I fail at everything else.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's finals time. So that means high stress for me. But high stress leads me to think about how much I hate myself. My current kick: irresponsibility. \n\nI like to carry my head held high, almost in superiority, about how responsible I am. But I feel that is all a lie. I feel like a hypocrite and a half. I have two majors, a minor, and a research grant. Therefore, people think I am responsible. That I get assignments done on time, that I balance time correctly, and I can find time to stay fit, and socialize, while having all of these academic obligations. I let them believe that. But from my own perspective, it is all an illusion, that i conceal with an extensive vernacular and an aura of forced confidence. No one questions you when you are able to excrete a sense of intelligence. The worst part is I let them believe it, and even preach to them when provoked how balance is so easily attainable.\n\nI tell people I go to the gym atleast 5 days a week. I really Only go about twice a week, and starve myself because I'm too depressed to go the other days\n\nI tell people I go to the library (and classes) for about 8 hours a day (8am-4pm) and all this planned studying time frees up my schedule. I do go on campus for this time, and I get distracted with how much I hate myself to work ahead.\n\nPeople think I have a fulfilling social life that fits right into my schedule, making life easy. I only go to see my friends when I'm about to break down from stress. I just happen to break down from stress alot.\n\n\nThis was all kinda spurred on because my roommate flipped shit at me for the apartment becoming such a mess. Logically, I feel there is enough blame to go around. But I still failed keeping an ordered home life. I was irresponsible with the basic duties around the apartment. I failed at them. Just like I fail at everything else.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ptng", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Lolocaust1", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ptng/ever_feel_like_you_can_never_do_anything_right/", "name": "t3_24ptng", "created": 1399263003.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ptng/ever_feel_like_you_can_never_do_anything_right/", "author_flair_text": null, "title": "Ever feel like you can never do anything right? Sums up how I feel about my life really.", "created_utc": 1399234203.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9ip4z", "gilded": 0, "author": "Fuzzleton", "parent_id": "t3_24ptng", "approved_by": null, "body": "Hey,\n\nI get what you're saying. I'd just like to say that the illness you have right now - and it is an illness, a mental one - is twisting things. It blurs the good and makes it seem like the punctuation structuring a string a failures.\n\nYou are holding yourself to a very high standard. You don't need to present perfection to others, or expect it of yourself. You're a flawed bundle of mistakes and lessons, like every other lumpy human being on earth. It's what we all are, and that's okay. Nobody expects you to be better than that, and it's inhuman to expect it consistently.\n\nYou go to the gym twice a week, which is nice. Unleash that steam, vent some energy. Earn yourself some tangible benefits buddy, because I feel like you've been denying yourself a lot of praiseworthy efforts and attempts because there was space for more.\n\nYou don't have to be optimised for perfection, it's okay to just try your best and learn to be as forgiving with yourself as you would be with a close friend - so long as you kick them in the bum when they need it!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey,&lt;/p&gt;\n\n&lt;p&gt;I get what you&amp;#39;re saying. I&amp;#39;d just like to say that the illness you have right now - and it is an illness, a mental one - is twisting things. It blurs the good and makes it seem like the punctuation structuring a string a failures.&lt;/p&gt;\n\n&lt;p&gt;You are holding yourself to a very high standard. You don&amp;#39;t need to present perfection to others, or expect it of yourself. You&amp;#39;re a flawed bundle of mistakes and lessons, like every other lumpy human being on earth. It&amp;#39;s what we all are, and that&amp;#39;s okay. Nobody expects you to be better than that, and it&amp;#39;s inhuman to expect it consistently.&lt;/p&gt;\n\n&lt;p&gt;You go to the gym twice a week, which is nice. Unleash that steam, vent some energy. Earn yourself some tangible benefits buddy, because I feel like you&amp;#39;ve been denying yourself a lot of praiseworthy efforts and attempts because there was space for more.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to be optimised for perfection, it&amp;#39;s okay to just try your best and learn to be as forgiving with yourself as you would be with a close friend - so long as you kick them in the bum when they need it!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ptng", "score_hidden": false, "name": "t1_ch9ip4z", "created": 1399266744.0, "author_flair_text": null, "created_utc": 1399237944.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]