[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve hesitated over posting this, but I need to vent anyway. You know that &amp;quot;drive&amp;quot; that gets you up in the morning on the crappiest days? That feeling that keeps you going in life, that keeps you... you know... living? It might be a future plan, accomplishments to make, loved ones, pure survival instinct. Well, turns out that I&amp;#39;m loosing that drive. No, It&amp;#39;s not depression, I&amp;#39;ve been through that and it&amp;#39;s a totally different feeling (you don&amp;#39;t really feel anything with depression), experienced anxiety too, that has settled for now as well.\nIt&amp;#39;s a totally different thing... I&amp;#39;m involved in this senseless routine where I just do things because I have to or I&amp;#39;m supposed to. I just go through the motions of life, faking smiles here and there, doing &amp;quot;fun&amp;quot; stuff... while really, I&amp;#39;m just doing it well... because that&amp;#39;s what you do. \nBefore the depression and anxiety came, everything was absolutely fine... I used to be an optimistic by nature, did well in school, etc. and people always had high hopes for me, I felt involved, and actually liked living. I obviously had my downsides during high school, but in my mind &amp;quot;it wouldn&amp;#39;t matter because in a few years comes college, and that&amp;#39;s where amazing stuff happens and everything is awesome and then I get a career and its awesome (...)&amp;quot; You know, the &amp;quot;It gets better&amp;quot; thought process.\nBoy was I wrong...\nCollege time.\nConstantly stressed out, grades not so good, my social circle is made up of pretty much all the people from my class (high school) who also got accepted (I end up sharing a flat with those same people, supposedly 3 in total but ends up being 5 to 6 most of the time), started smoking (influenced by my peers but my &amp;quot;decision&amp;quot; nonetheless). From here it only gets worse... more recently I got officially diagnosed with depression and anxiety though I knew for long that it was a lingering problem up until it just &amp;quot;exploded&amp;quot;. I experienced first hand what having panic attack feels like (only once, thankfully) and basically I don&amp;#39;t think I can call anyone around me as friends.... not anymore anyways. I don&amp;#39;t know what happened, I just feel like they still talk to me and hang around out of pity or something. It&amp;#39;s a weird thing, I&amp;#39;m not even invited to anything these days.&lt;/p&gt;\n\n&lt;p&gt;So, I went from extremely optimistic to downright pessimistic in 2 years. I honestly don&amp;#39;t know what caused this but it&amp;#39;s real now and for as much support as my parents can give me, It&amp;#39;s still just my parents, the only people who care. It feels like my own world is crumbling at a slow but steady rate, and as hard as I try, I can&amp;#39;t stop it and can only predict one outcome. You probably guessed it by now. My depression is over, My anxiety is gone, but my daily life hasn&amp;#39;t changed one bit. It&amp;#39;s kind of scary when you don&amp;#39;t really know what to do anymore... for now, I&amp;#39;m just living... not sure how long I can keep this lie alive, really. I&amp;#39;m just becoming a burden.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve considered suicide for a while now, but I&amp;#39;d never have the willpower to do it on my own, and I&amp;#39;d put my family members through some rough emotional pain... I don&amp;#39;t want that, not after all they&amp;#39;ve done for me. But then again... if I can&amp;#39;t live properly and I can&amp;#39;t be dead, where does that leave me? I don&amp;#39;t know...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Entire life average to good overall, last 2 years the worst in my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've hesitated over posting this, but I need to vent anyway. You know that \"drive\" that gets you up in the morning on the crappiest days? That feeling that keeps you going in life, that keeps you... you know... living? It might be a future plan, accomplishments to make, loved ones, pure survival instinct. Well, turns out that I'm loosing that drive. No, It's not depression, I've been through that and it's a totally different feeling (you don't really feel anything with depression), experienced anxiety too, that has settled for now as well.\nIt's a totally different thing... I'm involved in this senseless routine where I just do things because I have to or I'm supposed to. I just go through the motions of life, faking smiles here and there, doing \"fun\" stuff... while really, I'm just doing it well... because that's what you do. \nBefore the depression and anxiety came, everything was absolutely fine... I used to be an optimistic by nature, did well in school, etc. and people always had high hopes for me, I felt involved, and actually liked living. I obviously had my downsides during high school, but in my mind \"it wouldn't matter because in a few years comes college, and that's where amazing stuff happens and everything is awesome and then I get a career and its awesome (...)\" You know, the \"It gets better\" thought process.\nBoy was I wrong...\nCollege time.\nConstantly stressed out, grades not so good, my social circle is made up of pretty much all the people from my class (high school) who also got accepted (I end up sharing a flat with those same people, supposedly 3 in total but ends up being 5 to 6 most of the time), started smoking (influenced by my peers but my \"decision\" nonetheless). From here it only gets worse... more recently I got officially diagnosed with depression and anxiety though I knew for long that it was a lingering problem up until it just \"exploded\". I experienced first hand what having panic attack feels like (only once, thankfully) and basically I don't think I can call anyone around me as friends.... not anymore anyways. I don't know what happened, I just feel like they still talk to me and hang around out of pity or something. It's a weird thing, I'm not even invited to anything these days.\n\nSo, I went from extremely optimistic to downright pessimistic in 2 years. I honestly don't know what caused this but it's real now and for as much support as my parents can give me, It's still just my parents, the only people who care. It feels like my own world is crumbling at a slow but steady rate, and as hard as I try, I can't stop it and can only predict one outcome. You probably guessed it by now. My depression is over, My anxiety is gone, but my daily life hasn't changed one bit. It's kind of scary when you don't really know what to do anymore... for now, I'm just living... not sure how long I can keep this lie alive, really. I'm just becoming a burden.\n\nI've considered suicide for a while now, but I'd never have the willpower to do it on my own, and I'd put my family members through some rough emotional pain... I don't want that, not after all they've done for me. But then again... if I can't live properly and I can't be dead, where does that leave me? I don't know...\n\n**TL;DR:** Entire life average to good overall, last 2 years the worst in my life.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2589vp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "KXrw0q1PqrZ9I", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2589vp/family_cares/", "name": "t3_2589vp", "created": 1399780951.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2589vp/family_cares/", "author_flair_text": null, "title": "Family cares", "created_utc": 1399752151.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]