[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently a high school student with a lot on my platter, too many expectations, shit friends, compulsive lying, and just feeling that I have absolutely no power over whatever the fuck goes down.&lt;/p&gt;\n\n&lt;p&gt;First off, I have very tiger parents. I&amp;#39;m expected to score 2300+ on tests such as the SAT, get 4.5+ GPA&amp;#39;s, have a bunch of leadership roles, and just be the perfect child that every parent wants. I complete all this BS, but even at the awards ceremony I always feel blank and hollowed out. I hardly feel like I&amp;#39;ve learned with this crap shoot of AP classes and Prep Books.&lt;/p&gt;\n\n&lt;p&gt;Second. I lied to a few of my friends that I drank at a dance to try to seem cool (shallow and stupid, right?). I also lied to them by saying that I was ranked super high even though I&amp;#39;m not (I&amp;#39;m decently high(top 3%), but the hype is too large at this point). Back to the first lie. A few of my &amp;quot;friends&amp;quot; told an administration (and I told them to promise to me that they wouldn&amp;#39;t), and now if they can muster up proof (screenshot of facebook or something) than I could potentially have that put on my record and all the top schools would reject me. Heck even mediocre schools would reject me.&lt;/p&gt;\n\n&lt;p&gt;I constantly feel stressed. I&amp;#39;m not good at anything besides maybe math. I suck at Tennis (Only Junior on JV). A ton of people hate me. Hell, I even suck at League of Legends (Silver 2).&lt;/p&gt;\n\n&lt;p&gt;With AP exams (I&amp;#39;m taking 6) coming up, I just feel like quitting and ending myself where I stand. And the suffering doesn&amp;#39;t end there. I still have to take 3 SAT Subject Tests, the ACT, then I have to begin righting my college essays, then I have to apply and it&amp;#39;s just so much, and I can&amp;#39;t deal with it. What&amp;#39;s even worse is that all of this pointless hard work can be easily nullified over something that didn&amp;#39;t even happen.&lt;/p&gt;\n\n&lt;p&gt;Please help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi...\n\nI'm currently a high school student with a lot on my platter, too many expectations, shit friends, compulsive lying, and just feeling that I have absolutely no power over whatever the fuck goes down.\n\nFirst off, I have very tiger parents. I'm expected to score 2300+ on tests such as the SAT, get 4.5+ GPA's, have a bunch of leadership roles, and just be the perfect child that every parent wants. I complete all this BS, but even at the awards ceremony I always feel blank and hollowed out. I hardly feel like I've learned with this crap shoot of AP classes and Prep Books.\n\nSecond. I lied to a few of my friends that I drank at a dance to try to seem cool (shallow and stupid, right?). I also lied to them by saying that I was ranked super high even though I'm not (I'm decently high(top 3%), but the hype is too large at this point). Back to the first lie. A few of my \"friends\" told an administration (and I told them to promise to me that they wouldn't), and now if they can muster up proof (screenshot of facebook or something) than I could potentially have that put on my record and all the top schools would reject me. Heck even mediocre schools would reject me.\n\n\nI constantly feel stressed. I'm not good at anything besides maybe math. I suck at Tennis (Only Junior on JV). A ton of people hate me. Hell, I even suck at League of Legends (Silver 2).\n\nWith AP exams (I'm taking 6) coming up, I just feel like quitting and ending myself where I stand. And the suffering doesn't end there. I still have to take 3 SAT Subject Tests, the ACT, then I have to begin righting my college essays, then I have to apply and it's just so much, and I can't deal with it. What's even worse is that all of this pointless hard work can be easily nullified over something that didn't even happen.\n\nPlease help.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240bou", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sneh902", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240bou/feeling_overwhelmed_worthless_and_anxious_i_just/", "name": "t3_240bou", "created": 1398513912.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240bou/feeling_overwhelmed_worthless_and_anxious_i_just/", "author_flair_text": null, "title": "Feeling overwhelmed, worthless, and anxious. I just want to quit...", "created_utc": 1398485112.0, "ups": 10, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch31h8n", "gilded": 0, "author": "sneh902", "parent_id": "t1_ch30d0v", "approved_by": null, "body": "I don't think joking would help. This is a serious ordeal and the organization that the teacher manages, and I am part of, may be dissolved if they confirm \"what I did\". Furthermore, I may even be extricated by the school.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think joking would help. This is a serious ordeal and the organization that the teacher manages, and I am part of, may be dissolved if they confirm &amp;quot;what I did&amp;quot;. Furthermore, I may even be extricated by the school.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240bou", "score_hidden": false, "name": "t1_ch31h8n", "created": 1398597408.0, "author_flair_text": null, "created_utc": 1398568608.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch30d0v", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2y3g0", "approved_by": null, "body": "[deleted]", "edited": 1398590694.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240bou", "score_hidden": false, "name": "t1_ch30d0v", "created": 1398594403.0, "author_flair_text": null, "created_utc": 1398565603.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2y3g0", "gilded": 0, "author": "sneh902", "parent_id": "t1_ch2qfl0", "approved_by": null, "body": "The problem is that I didn't do anything, but I chatted one over facebook saying I did and now that \"friend\" showed a screenshot to the teacher and I may possibly be screwed over very badly for something I never did. I'm feeling less suicidal today, but I'm still extremely stressed/worried.\n\nPeople hate me because I'm kind of outspoken.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is that I didn&amp;#39;t do anything, but I chatted one over facebook saying I did and now that &amp;quot;friend&amp;quot; showed a screenshot to the teacher and I may possibly be screwed over very badly for something I never did. I&amp;#39;m feeling less suicidal today, but I&amp;#39;m still extremely stressed/worried.&lt;/p&gt;\n\n&lt;p&gt;People hate me because I&amp;#39;m kind of outspoken.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240bou", "score_hidden": false, "name": "t1_ch2y3g0", "created": 1398588285.0, "author_flair_text": null, "created_utc": 1398559485.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2qfl0", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_240bou", "approved_by": null, "body": "hi Sneh902,\nnice to meet you. \n\nI read your first statement and you defined your parents \"tigers\", for the fact that they probably have strict rules especially for the study.\n\nFirst off, almost every parent out there wish their best for their children, and so what you say about yours do not surprise me as much as you would think. \nBut... if you think they are taxing you too much, you have to check the entirety of the drawing. What I mean to say is, that (if I read well from the Wikipedia and you live in the States) by taxing you they are trying to make you able to put yourself in every college that is out there, especially the best ones.\nI do not know how old you are, but bear with me, this is a little sacrifice you'll have to do, because it is for your best and if you don't, you may regret it later on.\nI don't know how healthy your relationship with your parents is, but have you tried talking with them about your feelings? \n\nSecond. I feel like that event that happened to you was the nail on the coffin. You are stressed and this \"event\" put you into greater despair because you think it could nullify all what you've done.\nSo, you'll have to tell someone. I don't frankly know how things things work there in Usa, but if you did something you shouldn't have done, you'll have to take the responsability for it. It is just the way it is. What you have to do right now, is not saving your face, but it is saving your future. So find a way to fix everything. Your friends are not that good if they promised you one thing and did another one. Find other friends. Or start making boundaries and if they trespass it you'll let them know.\n\nThird. The fact that you know you like Math is a good thing. Wouldn't that be a good choice when going to college?\n\nForth. Why do people hate you? Did you behave wrongly with them? There is (Almost) always the possibility to apologize if you wronged them. And if there is no choice to change, I guess this period is going to end sooner or later, so you can take this period as a testament on what you shouldn't have done.\n\nGood luck!\n \n\n\n\n\n\n", "edited": 1398592609.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hi Sneh902,\nnice to meet you. &lt;/p&gt;\n\n&lt;p&gt;I read your first statement and you defined your parents &amp;quot;tigers&amp;quot;, for the fact that they probably have strict rules especially for the study.&lt;/p&gt;\n\n&lt;p&gt;First off, almost every parent out there wish their best for their children, and so what you say about yours do not surprise me as much as you would think. \nBut... if you think they are taxing you too much, you have to check the entirety of the drawing. What I mean to say is, that (if I read well from the Wikipedia and you live in the States) by taxing you they are trying to make you able to put yourself in every college that is out there, especially the best ones.\nI do not know how old you are, but bear with me, this is a little sacrifice you&amp;#39;ll have to do, because it is for your best and if you don&amp;#39;t, you may regret it later on.\nI don&amp;#39;t know how healthy your relationship with your parents is, but have you tried talking with them about your feelings? &lt;/p&gt;\n\n&lt;p&gt;Second. I feel like that event that happened to you was the nail on the coffin. You are stressed and this &amp;quot;event&amp;quot; put you into greater despair because you think it could nullify all what you&amp;#39;ve done.\nSo, you&amp;#39;ll have to tell someone. I don&amp;#39;t frankly know how things things work there in Usa, but if you did something you shouldn&amp;#39;t have done, you&amp;#39;ll have to take the responsability for it. It is just the way it is. What you have to do right now, is not saving your face, but it is saving your future. So find a way to fix everything. Your friends are not that good if they promised you one thing and did another one. Find other friends. Or start making boundaries and if they trespass it you&amp;#39;ll let them know.&lt;/p&gt;\n\n&lt;p&gt;Third. The fact that you know you like Math is a good thing. Wouldn&amp;#39;t that be a good choice when going to college?&lt;/p&gt;\n\n&lt;p&gt;Forth. Why do people hate you? Did you behave wrongly with them? There is (Almost) always the possibility to apologize if you wronged them. And if there is no choice to change, I guess this period is going to end sooner or later, so you can take this period as a testament on what you shouldn&amp;#39;t have done.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240bou", "score_hidden": false, "name": "t1_ch2qfl0", "created": 1398568259.0, "author_flair_text": null, "created_utc": 1398539459.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]