[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, it&amp;#39;s my first time posting so I&amp;#39;m not really sure how to start this.&lt;/p&gt;\n\n&lt;p&gt;I think I&amp;#39;ve been wanting to die for more than 8 years now? I think it started in middle school between 7th and 8th grade. Since then I&amp;#39;ve been going online every few months to just google search &amp;quot;want to die/kill myself etc&amp;quot; and find any forums or even yahoo answers that would help. I used to just sit back and read through comments and bs, but a lot of posts would recommend this place or a suicide hotline. The reason I stayed away from posting or trying to talk to anyone for the past few years is because I&amp;#39;m not really sure why I want to die. It seems stupid to flat out say &amp;quot;hello I wish to die&amp;quot; and offer no explanation. I do have some financial, employment, educational issues but I can&amp;#39;t really say any of those is the reason I want to stop living. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had a lot of time to think/reflect/whatever and I think I am just unsure about everything. I am always uncertain of what I want/need. I&amp;#39;ve been afraid of explaining to friends/family because there is no explanation really. I really don&amp;#39;t want to call up a suicide hotline and waste time saying &amp;quot;oh i don&amp;#39;t know why.&amp;quot; I don&amp;#39;t want to sit with a therapist to do the same thing. I don&amp;#39;t want to share with anyone for that reason. I feel like I&amp;#39;m a burden not because I&amp;#39;m a heaping pile of luggage, but I have no luggage to speak of. I can&amp;#39;t pinpoint a single reason for why I want to die. It&amp;#39;s confusing to me and I&amp;#39;m sure it&amp;#39;s exponentially confusing to someone who isn&amp;#39;t me.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;ve gotten really fed up lately and I need at least get that out of the way right now.&lt;/p&gt;\n\n&lt;p&gt;The summer before highschool, I started cutting my wrists. Not because I was sad or seeking attention or anything; I really just felt like it. I had an urge. When PE was mandatory for the first 2 years, I wore a sweatband to cover it up and no one was the wiser. It became cumbersome and annoying so once the scars sorta covered themselves up, I got rid of the sweatband and moved to my upper arm and thighs. \nNote: I didn&amp;#39;t have a habit of cutting; though there are several cuts, I think I have only cut myself on 4 or 5 occasions. It was like a spur of the moment thing that I immediately regretted each time.&lt;/p&gt;\n\n&lt;p&gt;I have guitar cables with stretch marks from half-assed suicide &amp;quot;attempts.&amp;quot; I don&amp;#39;t have any medication lying around to kill me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve stopped cutting more than 2 years ago. Today I keep a fifth of rum under my mattress for extreme cases when I feel that &amp;quot;urge&amp;quot; again. I smoke about 2 packs a week + a year ago I got an ecig and I&amp;#39;m on that 24/7 (it completely defeats the purpose by smoking traditional cigarettes I know).&lt;/p&gt;\n\n&lt;p&gt;With all the time I spent scrolling through &amp;quot;advice&amp;quot; forums and whatnot, I&amp;#39;ve also spent a lot of time reading about suicide prevention. Like I&amp;#39;ve read through all the talking tips and risk assessment stuff here and I feel like I am getting more help just by reading those (rather than have someone else use those same guidelines to talk to me? I don&amp;#39;t get it)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m generally a happy person. I have good friends and family and whatever. I hang out with people; I think they think I&amp;#39;m okay. There&amp;#39;s girls I&amp;#39;m interested in, there are people I can rely on sometimes. With my closest friends, &amp;quot;I wish I was dead,&amp;quot; has become a catchphrase for me for the past 5 years. Life and death are just some kind of &amp;quot;joke&amp;quot; for me, they just don&amp;#39;t &amp;quot;&amp;quot;&amp;quot;get it.&amp;quot;&amp;quot;&amp;quot; In highschool, I told my friends I had a plan to kill myself on my 37th birthday. It was just some kind of joke and the number didn&amp;#39;t matter, but today I don&amp;#39;t see myself living that long.&lt;/p&gt;\n\n&lt;p&gt;Again, I think I am confusing others as well as my own self, but I am tired of pretending to be happy. I don&amp;#39;t even know if am pretending or what. I don&amp;#39;t know. Every day is confusing as hell and I go to bed wishing I won&amp;#39;t wake up. I&amp;#39;ve never typed all this out or told anyone the full story, so I guess I feel better, but I still want to die.&lt;/p&gt;\n\n&lt;p&gt;I am constantly dreaming up ways to kill myself whether it&amp;#39;s in front of a crowd or alone in a bathroom, do I want to make a mess or do I want it easy to clean up, do I write a note--does it matter, do I tell anyone at the last moment--do I tell them long beforehand, am I even capable of doing it. I feel as though I will never have the courage to get up and kill myself but then I will just suffer with this weird and confusing shit for the rest of my life. I don&amp;#39;t want to have to make a new post 2 years from now starting with, &amp;quot;Oh for the past decade now, I&amp;#39;ve done nothing...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading this far and I hope I haven&amp;#39;t made myself look like a complete dumbass riddled with unfounded teen angst in my 20s.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, it's my first time posting so I'm not really sure how to start this.\n\nI think I've been wanting to die for more than 8 years now? I think it started in middle school between 7th and 8th grade. Since then I've been going online every few months to just google search \"want to die/kill myself etc\" and find any forums or even yahoo answers that would help. I used to just sit back and read through comments and bs, but a lot of posts would recommend this place or a suicide hotline. The reason I stayed away from posting or trying to talk to anyone for the past few years is because I'm not really sure why I want to die. It seems stupid to flat out say \"hello I wish to die\" and offer no explanation. I do have some financial, employment, educational issues but I can't really say any of those is the reason I want to stop living. \n\nI've had a lot of time to think/reflect/whatever and I think I am just unsure about everything. I am always uncertain of what I want/need. I've been afraid of explaining to friends/family because there is no explanation really. I really don't want to call up a suicide hotline and waste time saying \"oh i don't know why.\" I don't want to sit with a therapist to do the same thing. I don't want to share with anyone for that reason. I feel like I'm a burden not because I'm a heaping pile of luggage, but I have no luggage to speak of. I can't pinpoint a single reason for why I want to die. It's confusing to me and I'm sure it's exponentially confusing to someone who isn't me.\n\nBut I've gotten really fed up lately and I need at least get that out of the way right now.\n\nThe summer before highschool, I started cutting my wrists. Not because I was sad or seeking attention or anything; I really just felt like it. I had an urge. When PE was mandatory for the first 2 years, I wore a sweatband to cover it up and no one was the wiser. It became cumbersome and annoying so once the scars sorta covered themselves up, I got rid of the sweatband and moved to my upper arm and thighs. \nNote: I didn't have a habit of cutting; though there are several cuts, I think I have only cut myself on 4 or 5 occasions. It was like a spur of the moment thing that I immediately regretted each time.\n\nI have guitar cables with stretch marks from half-assed suicide \"attempts.\" I don't have any medication lying around to kill me.\n\nI've stopped cutting more than 2 years ago. Today I keep a fifth of rum under my mattress for extreme cases when I feel that \"urge\" again. I smoke about 2 packs a week + a year ago I got an ecig and I'm on that 24/7 (it completely defeats the purpose by smoking traditional cigarettes I know).\n\nWith all the time I spent scrolling through \"advice\" forums and whatnot, I've also spent a lot of time reading about suicide prevention. Like I've read through all the talking tips and risk assessment stuff here and I feel like I am getting more help just by reading those (rather than have someone else use those same guidelines to talk to me? I don't get it)\n\nI'm generally a happy person. I have good friends and family and whatever. I hang out with people; I think they think I'm okay. There's girls I'm interested in, there are people I can rely on sometimes. With my closest friends, \"I wish I was dead,\" has become a catchphrase for me for the past 5 years. Life and death are just some kind of \"joke\" for me, they just don't \"\"\"get it.\"\"\" In highschool, I told my friends I had a plan to kill myself on my 37th birthday. It was just some kind of joke and the number didn't matter, but today I don't see myself living that long.\n\nAgain, I think I am confusing others as well as my own self, but I am tired of pretending to be happy. I don't even know if am pretending or what. I don't know. Every day is confusing as hell and I go to bed wishing I won't wake up. I've never typed all this out or told anyone the full story, so I guess I feel better, but I still want to die.\n\nI am constantly dreaming up ways to kill myself whether it's in front of a crowd or alone in a bathroom, do I want to make a mess or do I want it easy to clean up, do I write a note--does it matter, do I tell anyone at the last moment--do I tell them long beforehand, am I even capable of doing it. I feel as though I will never have the courage to get up and kill myself but then I will just suffer with this weird and confusing shit for the rest of my life. I don't want to have to make a new post 2 years from now starting with, \"Oh for the past decade now, I've done nothing...\"\n\nThank you for reading this far and I hope I haven't made myself look like a complete dumbass riddled with unfounded teen angst in my 20s.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25c6re", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tttthhhhrow", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25c6re/feeling_tired/", "name": "t3_25c6re", "created": 1399901689.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25c6re/feeling_tired/", "author_flair_text": null, "title": "feeling tired", "created_utc": 1399872889.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfr2jp", "gilded": 0, "author": "Follow214", "parent_id": "t3_25c6re", "approved_by": null, "body": "Hey, would you like to vent more? I'm listening if you would like to.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, would you like to vent more? I&amp;#39;m listening if you would like to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c6re", "score_hidden": false, "name": "t1_chfr2jp", "created": 1399902234.0, "author_flair_text": null, "created_utc": 1399873434.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]