[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve Asperger, am married and have a child. And I hate all of it. My husband studies in different state - 6 hours drive from us. He always wanted to have babies and I knew that if I refused to give him children, he would leave me and it would be right for him. In my heart I was always convinced and hoping that I couldn&amp;#39;t have children, so problem solved. Alas, my son is sleeping in the next room. And I hate every second that I have to spend caring about him. I never was social, tolerated people at most but he needs me constantly, always nagging and touching me, not leaving me alone. He is a baby and needs it, but I just hate it. I&amp;#39;m trying to get a PhD and his birth makes it highly unlikely. My research is my life, my true baby and the love of my life, but the flesh and blood baby takes so much of my time and strength that I simply couldn&amp;#39;t keep working during nights and watch over him during days. I couldn&amp;#39;t get childcare for him, in the town I&amp;#39;m studying in waiting lists are 1,5 years, we are in them, but no where close to being offered a space. I couldn&amp;#39;t find a nanny for him, I tried for almost a year, but the only available babysitters are students with erratic schedules who refuse to work more than few hours a week. We&amp;#39;ve changed 6 babysitters to date with no end in sight. &lt;/p&gt;\n\n&lt;p&gt;His presence constantly reminds me about my own childhood and I just couldn&amp;#39;t live it all over again helping him. I hated being a child, never fitting in, being different. I couldn&amp;#39;t possibly teach him how to be a good human, because I don&amp;#39;t know how to do it myself. I never understood and never will understand people, I don&amp;#39;t have any role models. My parents are separated, with my mother being a drunkard and father a recovered alcoholic. I tried asking for counselling on campus, but they turned me down, as nobody was available in the times when I could get a babysitter and they refused to let me bring my baby with me. &lt;/p&gt;\n\n&lt;p&gt;I think that they will be better without me and the pain I live in will stop. The only problem I still couldn&amp;#39;t come up with a 100% guaranteed way to kill myself. Please don&amp;#39;t tell me that antidepressants will help, as they couldn&amp;#39;t give me back my life, time and teach me how to fit it and pass this knowledge to my baby. &lt;/p&gt;\n\n&lt;p&gt;TLDR baby took my life, see no reason to keep on living. &lt;/p&gt;\n\n&lt;p&gt;EDIT: thank you all, I have a lot to think about and maybe some way to find counseling help. It&amp;#39;s such a taboo to even hint at not enjoying your new life with a baby, you helped me a lot. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've Asperger, am married and have a child. And I hate all of it. My husband studies in different state - 6 hours drive from us. He always wanted to have babies and I knew that if I refused to give him children, he would leave me and it would be right for him. In my heart I was always convinced and hoping that I couldn't have children, so problem solved. Alas, my son is sleeping in the next room. And I hate every second that I have to spend caring about him. I never was social, tolerated people at most but he needs me constantly, always nagging and touching me, not leaving me alone. He is a baby and needs it, but I just hate it. I'm trying to get a PhD and his birth makes it highly unlikely. My research is my life, my true baby and the love of my life, but the flesh and blood baby takes so much of my time and strength that I simply couldn't keep working during nights and watch over him during days. I couldn't get childcare for him, in the town I'm studying in waiting lists are 1,5 years, we are in them, but no where close to being offered a space. I couldn't find a nanny for him, I tried for almost a year, but the only available babysitters are students with erratic schedules who refuse to work more than few hours a week. We've changed 6 babysitters to date with no end in sight. \n\nHis presence constantly reminds me about my own childhood and I just couldn't live it all over again helping him. I hated being a child, never fitting in, being different. I couldn't possibly teach him how to be a good human, because I don't know how to do it myself. I never understood and never will understand people, I don't have any role models. My parents are separated, with my mother being a drunkard and father a recovered alcoholic. I tried asking for counselling on campus, but they turned me down, as nobody was available in the times when I could get a babysitter and they refused to let me bring my baby with me. \n\nI think that they will be better without me and the pain I live in will stop. The only problem I still couldn't come up with a 100% guaranteed way to kill myself. Please don't tell me that antidepressants will help, as they couldn't give me back my life, time and teach me how to fit it and pass this knowledge to my baby. \n\nTLDR baby took my life, see no reason to keep on living. \n\nEDIT: thank you all, I have a lot to think about and maybe some way to find counseling help. It's such a taboo to even hint at not enjoying your new life with a baby, you helped me a lot. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24i7pf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "hatemybaby", "media": null, "score": 17, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399058407.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 8, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24i7pf/feel_like_baby_took_my_life_see_no_reason_to_keep/", "name": "t3_24i7pf", "created": 1399022364.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24i7pf/feel_like_baby_took_my_life_see_no_reason_to_keep/", "author_flair_text": null, "title": "Feel like baby took my life, see no reason to keep on living", "created_utc": 1398993564.0, "ups": 25, "num_comments": 31, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7gv2c", "gilded": 0, "author": "metamyelocyte", "parent_id": "t1_ch7e6iu", "approved_by": null, "body": "I understand your concern, but as it is now staying in this relationship is destroying you. Your vision of a long term relationship are incompatible. No matter how you get along in the short run, you won't be able to have a happy life together. You, him, and the child, all deserve better than trapping yourselves in that dynamic.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your concern, but as it is now staying in this relationship is destroying you. Your vision of a long term relationship are incompatible. No matter how you get along in the short run, you won&amp;#39;t be able to have a happy life together. You, him, and the child, all deserve better than trapping yourselves in that dynamic.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7gv2c", "created": 1399030706.0, "author_flair_text": null, "created_utc": 1399001906.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch7e6iu", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7dx95", "approved_by": null, "body": "I could trust him. I still love him, that's why I agreed to have a baby in the first place. And giving him baby and leaving would mean an end to our relationship, he would never understand or forgive. I think sometimes about just going away one day and never coming back. But it's not possible, science world is small and I would become unemployable if it ever became known that I left my baby (and people would learn about it very quickly). A woman who left a baby couldn't be trusted in the minds of people... Society is far more forgiving about the man who left their children. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could trust him. I still love him, that&amp;#39;s why I agreed to have a baby in the first place. And giving him baby and leaving would mean an end to our relationship, he would never understand or forgive. I think sometimes about just going away one day and never coming back. But it&amp;#39;s not possible, science world is small and I would become unemployable if it ever became known that I left my baby (and people would learn about it very quickly). A woman who left a baby couldn&amp;#39;t be trusted in the minds of people... Society is far more forgiving about the man who left their children. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7e6iu", "created": 1399024490.0, "author_flair_text": null, "created_utc": 1398995690.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch7dx95", "gilded": 0, "author": "metamyelocyte", "parent_id": "t3_24i7pf", "approved_by": null, "body": "Could you trust your husband with the child? You two seem to have such different priorities that you might be happier celibate, and since he was the one who really wanted a child, he may be better suited to keep him. An unwilling parent is never really good no matter how they try, so it's best for the boy too.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you trust your husband with the child? You two seem to have such different priorities that you might be happier celibate, and since he was the one who really wanted a child, he may be better suited to keep him. An unwilling parent is never really good no matter how they try, so it&amp;#39;s best for the boy too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7dx95", "created": 1399023927.0, "author_flair_text": null, "created_utc": 1398995127.0, "distinguished": null, "num_reports": null, "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7uijv", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7n004", "approved_by": null, "body": "My husband won't let it happen", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My husband won&amp;#39;t let it happen&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7uijv", "created": 1399078541.0, "author_flair_text": null, "created_utc": 1399049741.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7n004", "gilded": 0, "author": "monkeyonafish", "parent_id": "t3_24i7pf", "approved_by": null, "body": "You thought about giving the child up for adoption", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You thought about giving the child up for adoption&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7n004", "created": 1399057103.0, "author_flair_text": null, "created_utc": 1399028303.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7f91d", "gilded": 0, "author": "saved_by_grace", "parent_id": "t1_ch7f0kz", "approved_by": null, "body": "Okay. As far as contacting them most churches have the pastor's email on website. If not call and leave message asking for meeting with pastor. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay. As far as contacting them most churches have the pastor&amp;#39;s email on website. If not call and leave message asking for meeting with pastor. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7f91d", "created": 1399026934.0, "author_flair_text": null, "created_utc": 1398998134.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7f0kz", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7es07", "approved_by": null, "body": "Thank you, I'll think about it. I was sure that anyone would simply call 911, but pastor might be more constraint by the seal of confession than campus counselor. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I&amp;#39;ll think about it. I was sure that anyone would simply call 911, but pastor might be more constraint by the seal of confession than campus counselor. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7f0kz", "created": 1399026392.0, "author_flair_text": null, "created_utc": 1398997592.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7es07", "gilded": 0, "author": "saved_by_grace", "parent_id": "t1_ch7edmw", "approved_by": null, "body": "I highly recommend you do so. Unless there is an immanent threat to your baby he is unlikely to divulge information you confide in him", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I highly recommend you do so. Unless there is an immanent threat to your baby he is unlikely to divulge information you confide in him&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7es07", "created": 1399025847.0, "author_flair_text": null, "created_utc": 1398997047.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7ne0q", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7ldp1", "approved_by": null, "body": "I don't think it is PPD as it's more philosophical problems. And maybe it is just bad counseling center not equipped to deal with my problems, but being kicked out of it was really hurtful and still hurts. Counseling without insurance (and mine doesn't cover anything less than very serious issues) is extremely expensive, I looked into it and couldn't justify such expenses for myself. This money should go to the baby. Anyway I just don't think that a counselor will work with me if I open up, instead of just institutionalizing me. They have to worry about their reputation and will try to pass it as if I'm a danger to the baby to get me out of their hair. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it is PPD as it&amp;#39;s more philosophical problems. And maybe it is just bad counseling center not equipped to deal with my problems, but being kicked out of it was really hurtful and still hurts. Counseling without insurance (and mine doesn&amp;#39;t cover anything less than very serious issues) is extremely expensive, I looked into it and couldn&amp;#39;t justify such expenses for myself. This money should go to the baby. Anyway I just don&amp;#39;t think that a counselor will work with me if I open up, instead of just institutionalizing me. They have to worry about their reputation and will try to pass it as if I&amp;#39;m a danger to the baby to get me out of their hair. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7ne0q", "created": 1399059202.0, "author_flair_text": null, "created_utc": 1399030402.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7ldp1", "gilded": 0, "author": "OutrageousOwls", "parent_id": "t1_ch7edmw", "approved_by": null, "body": "I will say this: you are not a horrible person for hating your child. You are not a horrible person for thinking these awful thoughts. \n\nI have felt some of the same things you do, OP. And have thought about a lot of very negative topics about myself and my child. I've felt ostracized from many people, fearing they would look down upon me as not only a horrible person, but as a dangerous person as well. Like yourself, I also work in an academic field (psychology) and I worry about many of the same things you have mentioned, namely that women are generally viewed as the main supporter of their children. \n\nIt's okay feeling concerned about not being able to teach your son lessons in life. I think every parent feels this way. I worry that because I am only 23 that I do not have the life experiences to guide my daughter through life. But I think that is a normal and understandable worry. \n\nAre you close to a larger city centre where you can take your child with you? Many people that I have worked with would never disallow people to accompany you. Have you considered that this might also be post postpartum depression?  \n\nThere are people who will help you through this. :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will say this: you are not a horrible person for hating your child. You are not a horrible person for thinking these awful thoughts. &lt;/p&gt;\n\n&lt;p&gt;I have felt some of the same things you do, OP. And have thought about a lot of very negative topics about myself and my child. I&amp;#39;ve felt ostracized from many people, fearing they would look down upon me as not only a horrible person, but as a dangerous person as well. Like yourself, I also work in an academic field (psychology) and I worry about many of the same things you have mentioned, namely that women are generally viewed as the main supporter of their children. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s okay feeling concerned about not being able to teach your son lessons in life. I think every parent feels this way. I worry that because I am only 23 that I do not have the life experiences to guide my daughter through life. But I think that is a normal and understandable worry. &lt;/p&gt;\n\n&lt;p&gt;Are you close to a larger city centre where you can take your child with you? Many people that I have worked with would never disallow people to accompany you. Have you considered that this might also be post postpartum depression?  &lt;/p&gt;\n\n&lt;p&gt;There are people who will help you through this. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7ldp1", "created": 1399046641.0, "author_flair_text": null, "created_utc": 1399017841.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7edmw", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7dvkq", "approved_by": null, "body": "I was thinking about it. But I study in a small town and not sure that such conversation will remain confidential. I'm afraid that if I even start talking about hating my baby he/she would simply call 911 on me as it's a very strict taboo in the US. I never hurt him in any way and try my best to show only love. I let myself cry only when he sleeps. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking about it. But I study in a small town and not sure that such conversation will remain confidential. I&amp;#39;m afraid that if I even start talking about hating my baby he/she would simply call 911 on me as it&amp;#39;s a very strict taboo in the US. I never hurt him in any way and try my best to show only love. I let myself cry only when he sleeps. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7edmw", "created": 1399024932.0, "author_flair_text": null, "created_utc": 1398996132.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7dvkq", "gilded": 0, "author": "saved_by_grace", "parent_id": "t3_24i7pf", "approved_by": null, "body": "Have you tried talking with a pastor or similar? They usually (and should) offer free counselling on demand and I'm sure they wouldn't mind you having baby with you.\n\nAs far as qualifications most pastors of mainline churches will have studied at least rudimentary counselling skills. \n\n  ", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried talking with a pastor or similar? They usually (and should) offer free counselling on demand and I&amp;#39;m sure they wouldn&amp;#39;t mind you having baby with you.&lt;/p&gt;\n\n&lt;p&gt;As far as qualifications most pastors of mainline churches will have studied at least rudimentary counselling skills. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7dvkq", "created": 1399023820.0, "author_flair_text": null, "created_utc": 1398995020.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7s5dj", "gilded": 0, "author": "Localidiot", "parent_id": "t1_ch7i7df", "approved_by": null, "body": "That is absolutely not true. My mother got her Phd when I was a toddler. It was hard work and required adjustments, but please don't think it's impossible. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is absolutely not true. My mother got her Phd when I was a toddler. It was hard work and required adjustments, but please don&amp;#39;t think it&amp;#39;s impossible. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7s5dj", "created": 1399073444.0, "author_flair_text": null, "created_utc": 1399044644.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7i7df", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7gmrx", "approved_by": null, "body": "Thanks, talking to you made me realize that I made a mistake by having a child and have to pay for that. There is no way for me to have an academic career and have a family. I was hoping deep inside that maybe I'm missing something, but unfortunately not. \n\nPost-partum depression means medication, but it doesn't solve existential crisis of a failed scientist whose human nature was a reason for failure. I sometimes think that I would been much happier if I was born in a male body. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, talking to you made me realize that I made a mistake by having a child and have to pay for that. There is no way for me to have an academic career and have a family. I was hoping deep inside that maybe I&amp;#39;m missing something, but unfortunately not. &lt;/p&gt;\n\n&lt;p&gt;Post-partum depression means medication, but it doesn&amp;#39;t solve existential crisis of a failed scientist whose human nature was a reason for failure. I sometimes think that I would been much happier if I was born in a male body. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7i7df", "created": 1399034242.0, "author_flair_text": null, "created_utc": 1399005442.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch7gmrx", "gilded": 0, "author": "curltest", "parent_id": "t3_24i7pf", "approved_by": null, "body": "This is possibly patronising, and trivialising, but help might be easier to find if you class yourself as suffering from [post-partum depression](http://en.wikipedia.org/wiki/Postpartum_depression). It probably gives you an avenue to disclose your feelings to your husband too.\n\nSecondly, you say you're getting a PhD in science. That avenue's ALWAYS going to be open to you. Something that, by definition, will be your unique, original contribution to all of humanity: whose value, due to the same definition, will be independent of the circumstances of how long you take to finish it, or when you do so. That's DEFINITELY something you shouldn't trade for the infinitely complicated vagaries of livelihood. You can go through the motions for the rest of the things you're saddled with, while still leaving yourself mentally invested in the PhD.\n\nPractically speaking, could you get a sabbatical at the same college, or a college close to the one your husband's studying at? Ask if there's any way that you'd be allowed to pursue some allied research - as a graduate Research Assistant, or Teaching Assistant, or other technical staff in the same department? That way you could split duties, and maintain currency in your area, until the kid's needs become more \"common\" and you're able to avail of child care services. You might even be able to save on some money if you could live with your husband. Sorry if this is all stating the obvious, and you've already explored all this.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is possibly patronising, and trivialising, but help might be easier to find if you class yourself as suffering from &lt;a href=\"http://en.wikipedia.org/wiki/Postpartum_depression\"&gt;post-partum depression&lt;/a&gt;. It probably gives you an avenue to disclose your feelings to your husband too.&lt;/p&gt;\n\n&lt;p&gt;Secondly, you say you&amp;#39;re getting a PhD in science. That avenue&amp;#39;s ALWAYS going to be open to you. Something that, by definition, will be your unique, original contribution to all of humanity: whose value, due to the same definition, will be independent of the circumstances of how long you take to finish it, or when you do so. That&amp;#39;s DEFINITELY something you shouldn&amp;#39;t trade for the infinitely complicated vagaries of livelihood. You can go through the motions for the rest of the things you&amp;#39;re saddled with, while still leaving yourself mentally invested in the PhD.&lt;/p&gt;\n\n&lt;p&gt;Practically speaking, could you get a sabbatical at the same college, or a college close to the one your husband&amp;#39;s studying at? Ask if there&amp;#39;s any way that you&amp;#39;d be allowed to pursue some allied research - as a graduate Research Assistant, or Teaching Assistant, or other technical staff in the same department? That way you could split duties, and maintain currency in your area, until the kid&amp;#39;s needs become more &amp;quot;common&amp;quot; and you&amp;#39;re able to avail of child care services. You might even be able to save on some money if you could live with your husband. Sorry if this is all stating the obvious, and you&amp;#39;ve already explored all this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7gmrx", "created": 1399030151.0, "author_flair_text": null, "created_utc": 1399001351.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7qfyk", "gilded": 0, "author": "Throwaway4secretshit", "parent_id": "t1_ch7ia0r", "approved_by": null, "body": "Could you just lie and pretend they never happened and move to another state? Or just say you agreed to let him have custody so you could advance your career. I don't know,  but as long as it didn't interfere with me getting a job, I don't give a flying fuck what anyone thinks of me or my parenting.  Once you get past giving a shit about what others think, you are in a so much better position.  \n\nYou come first. That's the end of it it. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you just lie and pretend they never happened and move to another state? Or just say you agreed to let him have custody so you could advance your career. I don&amp;#39;t know,  but as long as it didn&amp;#39;t interfere with me getting a job, I don&amp;#39;t give a flying fuck what anyone thinks of me or my parenting.  Once you get past giving a shit about what others think, you are in a so much better position.  &lt;/p&gt;\n\n&lt;p&gt;You come first. That&amp;#39;s the end of it it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7qfyk", "created": 1399069495.0, "author_flair_text": null, "created_utc": 1399040695.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7ia0r", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7gytm", "approved_by": null, "body": "The difference is that you could leave you ex with a child and still be kinda accepted by society. As a woman I don't have this choice, I would be ostracized, especially in an academic world. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The difference is that you could leave you ex with a child and still be kinda accepted by society. As a woman I don&amp;#39;t have this choice, I would be ostracized, especially in an academic world. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7ia0r", "created": 1399034451.0, "author_flair_text": null, "created_utc": 1399005651.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7hboq", "gilded": 0, "author": "curltest", "parent_id": "t1_ch7gytm", "approved_by": null, "body": "You should vent on /r/mensrights\n\nAnd age is a goddamn number. It means whatever you want it to mean :) Heck, you can still be in your twenties if you write your age in a different base.", "edited": false, "author_flair_css_class": null, "downs": 6, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should vent on &lt;a href=\"/r/mensrights\"&gt;/r/mensrights&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And age is a goddamn number. It means whatever you want it to mean :) Heck, you can still be in your twenties if you write your age in a different base.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7hboq", "created": 1399031843.0, "author_flair_text": null, "created_utc": 1399003043.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7gytm", "gilded": 0, "author": "Throwaway4secretshit", "parent_id": "t3_24i7pf", "approved_by": null, "body": "I felt same way too. Still do kinda. \n\nMy ex tricked me into having a kid (the old \"weird, the birth control pills don't work when u flush them in the toilet\" trick. \n\nI wanted to have a kid eventually just not at 20.  I wanted to party and live the fuck out of my twenties.  Nope, had to get job. Keep job forever and write her a fucking check every month. \n\nOne day I might just disappear (like move out of country) and let her fend for herself now that she got a degree on my dime. \n\nHe always wanted a kid? Great give him full custody. Get divorce and go live the life you wanted. Don't feel guilty for wanting to be happy.  At least you don't have to leave the country to avoid going to jail for failure to pay alimony. ", "edited": false, "author_flair_css_class": null, "downs": 5, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I felt same way too. Still do kinda. &lt;/p&gt;\n\n&lt;p&gt;My ex tricked me into having a kid (the old &amp;quot;weird, the birth control pills don&amp;#39;t work when u flush them in the toilet&amp;quot; trick. &lt;/p&gt;\n\n&lt;p&gt;I wanted to have a kid eventually just not at 20.  I wanted to party and live the fuck out of my twenties.  Nope, had to get job. Keep job forever and write her a fucking check every month. &lt;/p&gt;\n\n&lt;p&gt;One day I might just disappear (like move out of country) and let her fend for herself now that she got a degree on my dime. &lt;/p&gt;\n\n&lt;p&gt;He always wanted a kid? Great give him full custody. Get divorce and go live the life you wanted. Don&amp;#39;t feel guilty for wanting to be happy.  At least you don&amp;#39;t have to leave the country to avoid going to jail for failure to pay alimony. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7gytm", "created": 1399030958.0, "author_flair_text": null, "created_utc": 1399002158.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7of2a", "gilded": 0, "author": "Just4yourpost", "parent_id": "t1_ch7jsqk", "approved_by": null, "body": "You're SO needs to start shouldering some fucking responsibility, especially if he's the one that wanted the kid and criticizes you.\n\nWhen he gets back for that one week, you need to have the ability to take A LOT of time to yourself while he takes care of the kid.  NO exceptions.  This asshole needs to share the load.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re SO needs to start shouldering some fucking responsibility, especially if he&amp;#39;s the one that wanted the kid and criticizes you.&lt;/p&gt;\n\n&lt;p&gt;When he gets back for that one week, you need to have the ability to take A LOT of time to yourself while he takes care of the kid.  NO exceptions.  This asshole needs to share the load.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7of2a", "created": 1399063570.0, "author_flair_text": null, "created_utc": 1399034770.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8lh6i", "gilded": 0, "author": "Gargantuan_Cranium", "parent_id": "t1_ch7sspo", "approved_by": null, "body": "This is frowned upon by certain \"experts\" by my 9 month old loves baby einstein videos, and I am totally cool with putting two on in a row (they are 30 minutes each). I strap him in his highchair and put the laptop in front of him. I give him some puffs to eat while he watches. That hour is glorious and makes ALL the difference.\n\nIt will get much much better as he grows, you can send him in the backyard, he might make some friends in the area and he will go on playdates. Trust me, it won't be long before he starts school and you will have your days to yourself again. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is frowned upon by certain &amp;quot;experts&amp;quot; by my 9 month old loves baby einstein videos, and I am totally cool with putting two on in a row (they are 30 minutes each). I strap him in his highchair and put the laptop in front of him. I give him some puffs to eat while he watches. That hour is glorious and makes ALL the difference.&lt;/p&gt;\n\n&lt;p&gt;It will get much much better as he grows, you can send him in the backyard, he might make some friends in the area and he will go on playdates. Trust me, it won&amp;#39;t be long before he starts school and you will have your days to yourself again. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch8lh6i", "created": 1399163961.0, "author_flair_text": null, "created_utc": 1399135161.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7sspo", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7qk1v", "approved_by": null, "body": "Even talking helps. For now I live in hope that it will get better when he gets older and learns how to entertain himself (from what I could gather it might happen around age of two?). We were saving for it for years and never anticipated that you simply couldn't buy services (childcare in our case) that you need, it is unbelievable. I think he has every toy imaginable for his age group, but it doesn't help, he wants me.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even talking helps. For now I live in hope that it will get better when he gets older and learns how to entertain himself (from what I could gather it might happen around age of two?). We were saving for it for years and never anticipated that you simply couldn&amp;#39;t buy services (childcare in our case) that you need, it is unbelievable. I think he has every toy imaginable for his age group, but it doesn&amp;#39;t help, he wants me.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7sspo", "created": 1399074852.0, "author_flair_text": null, "created_utc": 1399046052.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7qk1v", "gilded": 0, "author": "Gargantuan_Cranium", "parent_id": "t1_ch7jsqk", "approved_by": null, "body": "I totally get that. My kids are on child care wait lists in two counties. The shortage is brutal. I also get that attachment, where they don't let you go pee let alone have a moment to yourself. I hope you get a break when your SO gets home. If you ever need to talk I am here, I have a 4 yo and despite feeling a lot like you do when she was a baby, I had another one who is now nine months old. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally get that. My kids are on child care wait lists in two counties. The shortage is brutal. I also get that attachment, where they don&amp;#39;t let you go pee let alone have a moment to yourself. I hope you get a break when your SO gets home. If you ever need to talk I am here, I have a 4 yo and despite feeling a lot like you do when she was a baby, I had another one who is now nine months old. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7qk1v", "created": 1399069768.0, "author_flair_text": null, "created_utc": 1399040968.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7jsqk", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7jgt4", "approved_by": null, "body": "My SO should be coming soon. \n\nI really hope that it will get better, as of now he gets upset if I leave him to play on his own for more than 5 minutes. Believe me I searched for childcare and was ready to pay any amount of money, there are simply no places. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My SO should be coming soon. &lt;/p&gt;\n\n&lt;p&gt;I really hope that it will get better, as of now he gets upset if I leave him to play on his own for more than 5 minutes. Believe me I searched for childcare and was ready to pay any amount of money, there are simply no places. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7jsqk", "created": 1399039364.0, "author_flair_text": null, "created_utc": 1399010564.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7jgt4", "gilded": 0, "author": "Gargantuan_Cranium", "parent_id": "t1_ch7j4sa", "approved_by": null, "body": "I'll never understand that aspect of motherhood....it's like people get off on freaking new moms &amp; dads out by proclaiming how hard it is - it really pisses me off. For me personally, my daughter turned two and everything got tremendously easier. I somehow found great child care, started recovering from the sleep deprivation, she was able to do more on her own and needed me a lot less. Since then her independence has grown, there's been no looking back. Being on your own all the time must be really hard, I feel you there. It sounds to me like you need a break? Is your SO coming back soon or did he just leave? Are there any opportunities for child care at all in your town? \n\nEdit: I had originally written \"sounds like you just need a break\" and when I reread I didn't like how that sounded...like some kind of quick fix. I'm sorry.", "edited": 1399009585.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll never understand that aspect of motherhood....it&amp;#39;s like people get off on freaking new moms &amp;amp; dads out by proclaiming how hard it is - it really pisses me off. For me personally, my daughter turned two and everything got tremendously easier. I somehow found great child care, started recovering from the sleep deprivation, she was able to do more on her own and needed me a lot less. Since then her independence has grown, there&amp;#39;s been no looking back. Being on your own all the time must be really hard, I feel you there. It sounds to me like you need a break? Is your SO coming back soon or did he just leave? Are there any opportunities for child care at all in your town? &lt;/p&gt;\n\n&lt;p&gt;Edit: I had originally written &amp;quot;sounds like you just need a break&amp;quot; and when I reread I didn&amp;#39;t like how that sounded...like some kind of quick fix. I&amp;#39;m sorry.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7jgt4", "created": 1399038189.0, "author_flair_text": null, "created_utc": 1399009389.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7j4sa", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch7iwe0", "approved_by": null, "body": "I just don't know which part is me having Asperger and getting really worn out and tired after interacting with people, which part is being tired because he is a baby, and which part is me living alone with him most of the time (my husband comes for a week once a month or less frequent). It just seems like never ending torture with people happily telling me that it will only get worse. As in little children, little problems; big children, big problems.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just don&amp;#39;t know which part is me having Asperger and getting really worn out and tired after interacting with people, which part is being tired because he is a baby, and which part is me living alone with him most of the time (my husband comes for a week once a month or less frequent). It just seems like never ending torture with people happily telling me that it will only get worse. As in little children, little problems; big children, big problems.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7j4sa", "created": 1399037108.0, "author_flair_text": null, "created_utc": 1399008308.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7iwe0", "gilded": 0, "author": "Gargantuan_Cranium", "parent_id": "t3_24i7pf", "approved_by": null, "body": "Babies don't stay babies forever. Eventually he will grow and looking back you might be surprised at how quickly they gain their independence. My daughter starts kindergarten this coming fall and I have no idea where the last four years have gone. I do remember a lot of long days...but the years went by so fast. I guess what I am trying to say is yes, babies are a tremendous amount of work, and yes becoming a mom does disrupt career paths...but it won't be like this forever. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Babies don&amp;#39;t stay babies forever. Eventually he will grow and looking back you might be surprised at how quickly they gain their independence. My daughter starts kindergarten this coming fall and I have no idea where the last four years have gone. I do remember a lot of long days...but the years went by so fast. I guess what I am trying to say is yes, babies are a tremendous amount of work, and yes becoming a mom does disrupt career paths...but it won&amp;#39;t be like this forever. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch7iwe0", "created": 1399036356.0, "author_flair_text": null, "created_utc": 1399007556.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch86sm2", "gilded": 0, "author": "hatemybaby", "parent_id": "t1_ch81im0", "approved_by": null, "body": "Exactly the response I was thinking I would get. I tried seeing a counselor and was kicked out (as you could read in my post), too much trouble with little chances of quickly fixing it with medication. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly the response I was thinking I would get. I tried seeing a counselor and was kicked out (as you could read in my post), too much trouble with little chances of quickly fixing it with medication. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch86sm2", "created": 1399106814.0, "author_flair_text": null, "created_utc": 1399078014.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch81im0", "gilded": 0, "author": "Vagabond_Sensei", "parent_id": "t3_24i7pf", "approved_by": null, "body": "I don't know if anybody's said this, but reading through your post, I see some red flags for genuine, clinical depression. Your perspective seems distorted and it's very important that you at least see a therapist or counselor, somebody with a mental health background. Medication can make a significant difference as it has for me. \n\nYou were pursuing a phd, so you're perfectly capable of finding some mental health treatment. This is really not an option for you. A pastor will not really be able to help, and doing nothing could prove very costly. Go do something about this. Now. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if anybody&amp;#39;s said this, but reading through your post, I see some red flags for genuine, clinical depression. Your perspective seems distorted and it&amp;#39;s very important that you at least see a therapist or counselor, somebody with a mental health background. Medication can make a significant difference as it has for me. &lt;/p&gt;\n\n&lt;p&gt;You were pursuing a phd, so you&amp;#39;re perfectly capable of finding some mental health treatment. This is really not an option for you. A pastor will not really be able to help, and doing nothing could prove very costly. Go do something about this. Now. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24i7pf", "score_hidden": false, "name": "t1_ch81im0", "created": 1399093500.0, "author_flair_text": null, "created_utc": 1399064700.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]