[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My family has always had money issues, but we always did okay. But since I&amp;#39;ve started attending an expensive university in an expensive city, I know things have gotten a lot worse. College is also where I started dealing with depression and anxiety I&amp;#39;ve had as long as I can remember. As a result of this, my family hasn&amp;#39;t only been having to pay for college, but also psychiatrist and therapist visits.\nI was suicidal to the point of taking a medical leave during my spring semester. In order to return to school in the fall, I need to have proof that I&amp;#39;ve been seeing someone for my issues. My home state has a horrible mental health system, the specialists we&amp;#39;ve been able to find are ridiculously expensive. Being at home, I&amp;#39;m exposed to how tough my family&amp;#39;s financial situation is. I know that I&amp;#39;m such a major burden. I don&amp;#39;t have any options. If I don&amp;#39;t have a pdoc, I can&amp;#39;t return to school. But, school is really expensive too, yet dropping out isn&amp;#39;t something my parents would let me do. Honestly, killing myself and relieving all this pressure feels like all I can do at this point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My family has always had money issues, but we always did okay. But since I've started attending an expensive university in an expensive city, I know things have gotten a lot worse. College is also where I started dealing with depression and anxiety I've had as long as I can remember. As a result of this, my family hasn't only been having to pay for college, but also psychiatrist and therapist visits.\nI was suicidal to the point of taking a medical leave during my spring semester. In order to return to school in the fall, I need to have proof that I've been seeing someone for my issues. My home state has a horrible mental health system, the specialists we've been able to find are ridiculously expensive. Being at home, I'm exposed to how tough my family's financial situation is. I know that I'm such a major burden. I don't have any options. If I don't have a pdoc, I can't return to school. But, school is really expensive too, yet dropping out isn't something my parents would let me do. Honestly, killing myself and relieving all this pressure feels like all I can do at this point.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24b2vk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "egginbasket", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24b2vk/financial_burden/", "name": "t3_24b2vk", "created": 1398832242.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24b2vk/financial_burden/", "author_flair_text": null, "title": "Financial burden", "created_utc": 1398803442.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]