[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throw away and hard to write this but Ive just realised that I kinda want to die.&lt;/p&gt;\n\n&lt;p&gt;I cant keep up with anything and everything is far to complicated. I&amp;#39;m not close with my family. I ran away from the only girl whose ever loved me and to this day she remains the only person to message and see how im feeling.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in Law school but I&amp;#39;ll be here for the next 5 years and the prospect of doing this shit for so long makes me sick. I love uni and I&amp;#39;m doing very well, but socially I&amp;#39;m disconnected from everyone. I drink before class most days because I cant stomach being there sober. I live in the dorms but no one here reminds me of myself or my true friends. I hang out with a lot of them regularly, but at the end of the day I enter my room alone and have no real connection with any other person.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also oddly obsessed with the Syrian Civil War and if it werent so dominated by jihadists, I fear I&amp;#39;d go there. Today I spent a long time seeing how hard it would be to move to Erbil, Iraq. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s becoming less and less reason to remain in this country, but the feeling is growing and I feel less reason to remain on this earth.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Throw away and hard to write this but Ive just realised that I kinda want to die.\n\nI cant keep up with anything and everything is far to complicated. I'm not close with my family. I ran away from the only girl whose ever loved me and to this day she remains the only person to message and see how im feeling.\n\nI'm in Law school but I'll be here for the next 5 years and the prospect of doing this shit for so long makes me sick. I love uni and I'm doing very well, but socially I'm disconnected from everyone. I drink before class most days because I cant stomach being there sober. I live in the dorms but no one here reminds me of myself or my true friends. I hang out with a lot of them regularly, but at the end of the day I enter my room alone and have no real connection with any other person.\n\nI'm also oddly obsessed with the Syrian Civil War and if it werent so dominated by jihadists, I fear I'd go there. Today I spent a long time seeing how hard it would be to move to Erbil, Iraq. \n\nThere's becoming less and less reason to remain in this country, but the feeling is growing and I feel less reason to remain on this earth.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2476tv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayG333", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2476tv/for_the_first_time_in_my_life_i_feel_like_id/", "name": "t3_2476tv", "created": 1398733213.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2476tv/for_the_first_time_in_my_life_i_feel_like_id/", "author_flair_text": null, "title": "For the first time in my life, I feel like id prefer death", "created_utc": 1398704413.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4gktk", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_2476tv", "approved_by": null, "body": "Hi there. I'm a recent law grad (about a year ago) and just recently passed the Bar. I'll be the first to tell you that Law School was one of the toughest, loneliest times in my life. I was suffering from major depression and anxiety disorders (yes, multiple ones...) and everything felt like a huge challenge. Balancing school, \"friends\", my career and my future seemed overwhelming. My best recommendation for you is to immerse yourself in your learning, and find others around you with similar goals. Create a study group with them. Go to movies with them on the weekends. Start slowly connecting with like-minded people. Maybe try to stop drinking before class and really pay attention to what you are learning. Start planting the seeds of social and educational life, no matter how pointless or frustrating it seems now. I'm sorry you're having such a hard time finding people to connect with, and I really hope you get out there and find some good folks around you. Law School just kinda sucks in general - do everything in your power (including a change of scenery) to make it as pleasant an experience as possible. You do you.   ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. I&amp;#39;m a recent law grad (about a year ago) and just recently passed the Bar. I&amp;#39;ll be the first to tell you that Law School was one of the toughest, loneliest times in my life. I was suffering from major depression and anxiety disorders (yes, multiple ones...) and everything felt like a huge challenge. Balancing school, &amp;quot;friends&amp;quot;, my career and my future seemed overwhelming. My best recommendation for you is to immerse yourself in your learning, and find others around you with similar goals. Create a study group with them. Go to movies with them on the weekends. Start slowly connecting with like-minded people. Maybe try to stop drinking before class and really pay attention to what you are learning. Start planting the seeds of social and educational life, no matter how pointless or frustrating it seems now. I&amp;#39;m sorry you&amp;#39;re having such a hard time finding people to connect with, and I really hope you get out there and find some good folks around you. Law School just kinda sucks in general - do everything in your power (including a change of scenery) to make it as pleasant an experience as possible. You do you.   &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2476tv", "score_hidden": false, "name": "t1_ch4gktk", "created": 1398723588.0, "author_flair_text": null, "created_utc": 1398719988.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4bjqa", "gilded": 0, "author": "tarlton24", "parent_id": "t3_2476tv", "approved_by": null, "body": "Sorry you're feeling this way. Why not drop out of law school and move somewhere else? Either Erbil, or Alaska, or wherever. Maybe the thing is that you're just not supposed to be in law school.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry you&amp;#39;re feeling this way. Why not drop out of law school and move somewhere else? Either Erbil, or Alaska, or wherever. Maybe the thing is that you&amp;#39;re just not supposed to be in law school.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2476tv", "score_hidden": false, "name": "t1_ch4bjqa", "created": 1398713545.0, "author_flair_text": null, "created_utc": 1398709945.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4e1id", "gilded": 0, "author": "ajovanov", "parent_id": "t3_2476tv", "approved_by": null, "body": "Why don't you switch courses and start studying history of the middle east if that interests you. I don't know about job prospects but I know that hating life beacuse of your profession is not the way to go. Also, try to hang out with truly happy people. You'll see a different perspective to life.\n\nGood luck.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why don&amp;#39;t you switch courses and start studying history of the middle east if that interests you. I don&amp;#39;t know about job prospects but I know that hating life beacuse of your profession is not the way to go. Also, try to hang out with truly happy people. You&amp;#39;ll see a different perspective to life.&lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2476tv", "score_hidden": false, "name": "t1_ch4e1id", "created": 1398743732.0, "author_flair_text": null, "created_utc": 1398714932.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]