[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I may be only 18, but as the days drag on, I begin to think that I am a complete and utter evolutionary failure, and that the responsible thing to do would be to remove myself from the gene pool. I have never explicitly planned a suicide, but I play with suicidal thoughts every day for many of my waking hours. These thoughts don&amp;#39;t stay long, but I do catch myself telling myself things out loud like &amp;quot;You should have been thrown off a cliff at birth&amp;quot;, &amp;quot;Your genes are inferior; you cannot control your emotions, and you&amp;#39;re behind every one of your peers maturity-wise&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;The reason for all this may sound extremely stupid, but it detracts my focus from more important things. The worst part is that it makes me play with dangerous thoughts more often than any healthy human being should, and I fear for my own health because of this. I want it to stop before it gets worse. &lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;it&amp;quot; I was referring to was the fact that no matter how hard or how many times I&amp;#39;ve tried, I cannot associate with women on more than a platonic level. Hell, I&amp;#39;ve never been able to have any casual flings, and it seems like most people my age accidentally stumble into them. The fact that I&amp;#39;m almost done with my first year of college and it still hasn&amp;#39;t happened is a testament to my inferior brain chemistry. I&amp;#39;m on a campus with an unbelievable amount of attractive women. Water, water everywhere, but not a drop to drink. I&amp;#39;m missing out on the thing that most people rate to be the best thing about being a human: sex.\nI have actually made friends and acquaintences with plenty of women, and it still hasn&amp;#39;t happened. I get looks and passing smiles all the time, so I can&amp;#39;t be that bad looking. They laugh at my jokes and everything, and sometimes (seemingly to me) they flirt. When I try to flirt back, however, they only seem interested for a little while, but that drops within a period of days. I don&amp;#39;t know why I&amp;#39;m wasting valuable space on this sub for those who actually need it, but maybe I&amp;#39;m just being a little bitch. I just need hope before I let my life fall apart due to this. I know I should just let it wait, but I don&amp;#39;t want to be 40 and still be like this. I also fear that something will happen, like the top 10% of males taking all the women into harems in the near future. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I may be only 18, but as the days drag on, I begin to think that I am a complete and utter evolutionary failure, and that the responsible thing to do would be to remove myself from the gene pool. I have never explicitly planned a suicide, but I play with suicidal thoughts every day for many of my waking hours. These thoughts don't stay long, but I do catch myself telling myself things out loud like \"You should have been thrown off a cliff at birth\", \"Your genes are inferior; you cannot control your emotions, and you're behind every one of your peers maturity-wise\". \n\nThe reason for all this may sound extremely stupid, but it detracts my focus from more important things. The worst part is that it makes me play with dangerous thoughts more often than any healthy human being should, and I fear for my own health because of this. I want it to stop before it gets worse. \n\nThe \"it\" I was referring to was the fact that no matter how hard or how many times I've tried, I cannot associate with women on more than a platonic level. Hell, I've never been able to have any casual flings, and it seems like most people my age accidentally stumble into them. The fact that I'm almost done with my first year of college and it still hasn't happened is a testament to my inferior brain chemistry. I'm on a campus with an unbelievable amount of attractive women. Water, water everywhere, but not a drop to drink. I'm missing out on the thing that most people rate to be the best thing about being a human: sex.\nI have actually made friends and acquaintences with plenty of women, and it still hasn't happened. I get looks and passing smiles all the time, so I can't be that bad looking. They laugh at my jokes and everything, and sometimes (seemingly to me) they flirt. When I try to flirt back, however, they only seem interested for a little while, but that drops within a period of days. I don't know why I'm wasting valuable space on this sub for those who actually need it, but maybe I'm just being a little bitch. I just need hope before I let my life fall apart due to this. I know I should just let it wait, but I don't want to be 40 and still be like this. I also fear that something will happen, like the top 10% of males taking all the women into harems in the near future. \n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24cd6m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "vtypejag", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398832947.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24cd6m/fresh_out_of_possibilities/", "name": "t3_24cd6m", "created": 1398861501.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24cd6m/fresh_out_of_possibilities/", "author_flair_text": null, "title": "Fresh out of possibilities", "created_utc": 1398832701.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5s769", "gilded": 0, "author": "SkyAvus", "parent_id": "t3_24cd6m", "approved_by": null, "body": "Hey, man. I'm also 18 and I understand where you are coming from. I hope my story helps. I wasn't born with the best genes either, heh. I have Tourettes, you see, and that continues to be a major factor and limiter in my social life/goals. I grew up being pitied and viewed myself as a burden to my parents. So I grew up having few friends and kept to myself most of the time. I wasn't the fittest fellow either cause of that.\n\nCome high school, I decided to devote myself to learning some sort of skill or some field of study. I joined the track team and, boy, did I suck. It was embarrassing, I was almost always last at every set we did. But I wasn't a stranger to embarrassment or feeling foolish. So I continued, found a event I was good at, and managed to make states my junior year. What I'm trying to get at is that you shouldn't feel like folding the crummy hand you've been dealt, sorta speak. Find something you feel good doing, practice it in privacy and accept humility. \n\nAnd, dude. Have you ever just asked one of them out. Just go for it. I know the feeling of rejection is humiliating and the idea really takes a toll, but you gotta make something happen. Just a tip, man. \n\nIf your want anyone to talk to. You can PM me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, man. I&amp;#39;m also 18 and I understand where you are coming from. I hope my story helps. I wasn&amp;#39;t born with the best genes either, heh. I have Tourettes, you see, and that continues to be a major factor and limiter in my social life/goals. I grew up being pitied and viewed myself as a burden to my parents. So I grew up having few friends and kept to myself most of the time. I wasn&amp;#39;t the fittest fellow either cause of that.&lt;/p&gt;\n\n&lt;p&gt;Come high school, I decided to devote myself to learning some sort of skill or some field of study. I joined the track team and, boy, did I suck. It was embarrassing, I was almost always last at every set we did. But I wasn&amp;#39;t a stranger to embarrassment or feeling foolish. So I continued, found a event I was good at, and managed to make states my junior year. What I&amp;#39;m trying to get at is that you shouldn&amp;#39;t feel like folding the crummy hand you&amp;#39;ve been dealt, sorta speak. Find something you feel good doing, practice it in privacy and accept humility. &lt;/p&gt;\n\n&lt;p&gt;And, dude. Have you ever just asked one of them out. Just go for it. I know the feeling of rejection is humiliating and the idea really takes a toll, but you gotta make something happen. Just a tip, man. &lt;/p&gt;\n\n&lt;p&gt;If your want anyone to talk to. You can PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24cd6m", "score_hidden": false, "name": "t1_ch5s769", "created": 1398867495.0, "author_flair_text": null, "created_utc": 1398838695.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]