[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello people of reddit, this is the first time doing anything like this hence the new account but I thought to myself, why not.&lt;/p&gt;\n\n&lt;p&gt;Every ones life has its ups and downs, some worse than others, It&amp;#39;s all relative so I wont bore you with that as I don&amp;#39;t feel it really matters.\nSince I was very young I was never one to see the light of the situation, nothing really phased me in a happy way, it was either bad or normal.\nAs time has gone on I&amp;#39;ve moved around, reconnected with family and severed ties with others, gotten and lost jobs, been in and out of relationships but nothing has changed, I still see the world under a grey filter and crucify myself at every turn (I&amp;#39;m my &amp;quot;own worst enemy&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;I have been to doctors, psychiatrists and psychologists who all tell me they don&amp;#39;t know what to do, having been through a litany of different medication of which either made me very sick, have night terrors or playing with my OCD (no, not just making the volume dial on an even number, having to walk through a door four times etc)\nSlowly my life has been sinking into a rut as I get older, roads seem to be ending and options seem thinner the longer I go, the area around me has very little employment in anything, fast food included (my family member is in job services and is always trying to find me something)..&lt;/p&gt;\n\n&lt;p&gt;Last year I gave myself two years to make something of myself, dig myself out of my rut and overcome this mutation of depression.. I&amp;#39;m nearly one and a half years down the track and the hole keeps on getting deeper which is making me think of cutting it short, I&amp;#39;m flying up to see my mates soon as a last ditch attempt to find something but it seems more like staring into the fridge hoping that something different from the things i saw the last 4 times I looked inside.\nAlthough I am going to do weed for the first time and a few other things with the reasoning, why not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if this is what people are meant to write but I&amp;#39;m kind of in the hours of why not, nothing to lose really ha,&lt;/p&gt;\n\n&lt;p&gt;Just to ad, I don&amp;#39;t want to die, I don&amp;#39;t think anyone with depression or whatever people like to call it want to die, it&amp;#39;s more that I&amp;#39;m too tired of living, I describe the feeling of being homesick, lonely and tired 24/7.\nIt just seems too logical to not just OD and reset, not sure what&amp;#39;s after this life but as far as i&amp;#39;m concerned nothing is holding me here and there&amp;#39;s a whole thing to explore after i take the plunge.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading.&lt;/p&gt;\n\n&lt;p&gt;P.S I&amp;#39;m not unstable, I&amp;#39;m approaching this with a clear head, don&amp;#39;t be afraid to &amp;quot;tip me over the edge&amp;quot; or coat the world in sugar if you&amp;#39;re inclined to comment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello people of reddit, this is the first time doing anything like this hence the new account but I thought to myself, why not.\n\nEvery ones life has its ups and downs, some worse than others, It's all relative so I wont bore you with that as I don't feel it really matters.\nSince I was very young I was never one to see the light of the situation, nothing really phased me in a happy way, it was either bad or normal.\nAs time has gone on I've moved around, reconnected with family and severed ties with others, gotten and lost jobs, been in and out of relationships but nothing has changed, I still see the world under a grey filter and crucify myself at every turn (I'm my \"own worst enemy\")\n\nI have been to doctors, psychiatrists and psychologists who all tell me they don't know what to do, having been through a litany of different medication of which either made me very sick, have night terrors or playing with my OCD (no, not just making the volume dial on an even number, having to walk through a door four times etc)\nSlowly my life has been sinking into a rut as I get older, roads seem to be ending and options seem thinner the longer I go, the area around me has very little employment in anything, fast food included (my family member is in job services and is always trying to find me something)..\n\nLast year I gave myself two years to make something of myself, dig myself out of my rut and overcome this mutation of depression.. I'm nearly one and a half years down the track and the hole keeps on getting deeper which is making me think of cutting it short, I'm flying up to see my mates soon as a last ditch attempt to find something but it seems more like staring into the fridge hoping that something different from the things i saw the last 4 times I looked inside.\nAlthough I am going to do weed for the first time and a few other things with the reasoning, why not.\n\nI'm not sure if this is what people are meant to write but I'm kind of in the hours of why not, nothing to lose really ha,\n\nJust to ad, I don't want to die, I don't think anyone with depression or whatever people like to call it want to die, it's more that I'm too tired of living, I describe the feeling of being homesick, lonely and tired 24/7.\nIt just seems too logical to not just OD and reset, not sure what's after this life but as far as i'm concerned nothing is holding me here and there's a whole thing to explore after i take the plunge.\n\nThanks for reading.\n\nP.S I'm not unstable, I'm approaching this with a clear head, don't be afraid to \"tip me over the edge\" or coat the world in sugar if you're inclined to comment.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2587ff", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Tazoo", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399754182.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2587ff/generic_title/", "name": "t3_2587ff", "created": 1399779235.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2587ff/generic_title/", "author_flair_text": null, "title": "Generic title", "created_utc": 1399750435.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheohsh", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2587ff", "approved_by": null, "body": "&gt; Last year I gave myself two years to make something of myself, dig myself out of my rut and overcome this mutation of depression..\n\nThis is pretty much the same thing I've done a few times in my life, and it was always about the dumbest things possible. Like right at this moment, I wouldn't kill myself because I want to see how season two of Arrow ends. I think another time some years ago, I refrained from committing suicide because I wanted to see how some video game trilogy ended. I always found it kind of funny that other people were driven and passionate about their families, jobs, and bettering themselves, and the only thing that sort of keeps me going is that I would be mildly annoyed if I died without seeing how Arrow ends.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Last year I gave myself two years to make something of myself, dig myself out of my rut and overcome this mutation of depression..&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is pretty much the same thing I&amp;#39;ve done a few times in my life, and it was always about the dumbest things possible. Like right at this moment, I wouldn&amp;#39;t kill myself because I want to see how season two of Arrow ends. I think another time some years ago, I refrained from committing suicide because I wanted to see how some video game trilogy ended. I always found it kind of funny that other people were driven and passionate about their families, jobs, and bettering themselves, and the only thing that sort of keeps me going is that I would be mildly annoyed if I died without seeing how Arrow ends.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2587ff", "score_hidden": false, "name": "t1_cheohsh", "created": 1399784334.0, "author_flair_text": null, "created_utc": 1399755534.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]