[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night my girlfriend and I were drunk and high, and we we&amp;#39;re having a deep conversation. She started talking about how she hates herself, doesn&amp;#39;t care about anything, and how she thinks she is dumb. She proceeded asked me what my views were on suicide. I told her my views, and she confessed about how she tried to commit suicide last summer. She told me that knows how she would kill herself, and that death seems almost comforting and that she is okay with the idea of it. I tried to tell her that she has a whole life to see, and she has no right to judge how her life will turn out based upon her current situation. I keep thinking &amp;quot;she would never do that, but then I realize that a lot of people who commit suicide don&amp;#39;t appear to be suicidal. I&amp;#39;ve never personally dealt with a suicidal person, but the things she said seem to be hints, and I these things are serious. I don&amp;#39;t know what to do. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last night my girlfriend and I were drunk and high, and we we're having a deep conversation. She started talking about how she hates herself, doesn't care about anything, and how she thinks she is dumb. She proceeded asked me what my views were on suicide. I told her my views, and she confessed about how she tried to commit suicide last summer. She told me that knows how she would kill herself, and that death seems almost comforting and that she is okay with the idea of it. I tried to tell her that she has a whole life to see, and she has no right to judge how her life will turn out based upon her current situation. I keep thinking \"she would never do that, but then I realize that a lot of people who commit suicide don't appear to be suicidal. I've never personally dealt with a suicidal person, but the things she said seem to be hints, and I these things are serious. I don't know what to do. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24qebm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "6to4", "media": null, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24qebm/girlfriend_speaks_of_suicide_and_i_dont_know_what/", "name": "t3_24qebm", "created": 1399276744.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24qebm/girlfriend_speaks_of_suicide_and_i_dont_know_what/", "author_flair_text": null, "title": "Girlfriend speaks of suicide, and I don't know what to do", "created_utc": 1399247944.0, "ups": 19, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9rps6", "gilded": 0, "author": "accioupvotes", "parent_id": "t1_ch9o7ap", "approved_by": null, "body": "Most importantly, let her know you are there for her. If you can, convince her to seek help. She sounds dangerously depressed. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most importantly, let her know you are there for her. If you can, convince her to seek help. She sounds dangerously depressed. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qebm", "score_hidden": false, "name": "t1_ch9rps6", "created": 1399287960.0, "author_flair_text": null, "created_utc": 1399259160.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9sx4h", "gilded": 0, "author": "SlowLoris303", "parent_id": "t1_ch9o7ap", "approved_by": null, "body": "^ Very much this! The delineating factor seems to be the separation between those that have a plan, and those that don't. That is overly simplistic, but in general, if someone expresses their explicit PLAN to kill themselves, emergency action should be taken. Most people *think* that they \"might as well kill myself\" from time to time. I myself have been in this position and I'm telling you, you should get her some help. You can either convince her to let you take her to the ER (which is an appropriate place to take someone in emotional distress), talk to her parents, or a school/community counselor. Don't go to her friends/enablers. Don't go to someone that has no experience with mental health issues. These problems are very BIG and complex, and need professional assistance to work through and come out the other side OK. I have a lot of love in my heart for people that find themselves in these situations because I've been there myself. It is miserable. The best possible thing you can do for her is to listen, support, and coax toward professional help.", "edited": 1399262438.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;^ Very much this! The delineating factor seems to be the separation between those that have a plan, and those that don&amp;#39;t. That is overly simplistic, but in general, if someone expresses their explicit PLAN to kill themselves, emergency action should be taken. Most people &lt;em&gt;think&lt;/em&gt; that they &amp;quot;might as well kill myself&amp;quot; from time to time. I myself have been in this position and I&amp;#39;m telling you, you should get her some help. You can either convince her to let you take her to the ER (which is an appropriate place to take someone in emotional distress), talk to her parents, or a school/community counselor. Don&amp;#39;t go to her friends/enablers. Don&amp;#39;t go to someone that has no experience with mental health issues. These problems are very BIG and complex, and need professional assistance to work through and come out the other side OK. I have a lot of love in my heart for people that find themselves in these situations because I&amp;#39;ve been there myself. It is miserable. The best possible thing you can do for her is to listen, support, and coax toward professional help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qebm", "score_hidden": false, "name": "t1_ch9sx4h", "created": 1399291029.0, "author_flair_text": null, "created_utc": 1399262229.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch9o7ap", "gilded": 0, "author": "The_Body", "parent_id": "t3_24qebm", "approved_by": null, "body": "You should know, having a plan is a serious sign. Talk to her soon, and make yourself available. I don't think you can force the conversation, but just being there will be a wealth of help to her, and we're here to support you when you need it, too. \n\nThis won't be an easy road. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should know, having a plan is a serious sign. Talk to her soon, and make yourself available. I don&amp;#39;t think you can force the conversation, but just being there will be a wealth of help to her, and we&amp;#39;re here to support you when you need it, too. &lt;/p&gt;\n\n&lt;p&gt;This won&amp;#39;t be an easy road. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qebm", "score_hidden": false, "name": "t1_ch9o7ap", "created": 1399279884.0, "author_flair_text": null, "created_utc": 1399251084.0, "distinguished": null, "num_reports": null, "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9o1u5", "gilded": 0, "author": "usmash", "parent_id": "t3_24qebm", "approved_by": null, "body": "Now that you're not drunk, talk to her about it. Don't be confrontational; you won't get her to change by trying to force your views on her.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now that you&amp;#39;re not drunk, talk to her about it. Don&amp;#39;t be confrontational; you won&amp;#39;t get her to change by trying to force your views on her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qebm", "score_hidden": false, "name": "t1_ch9o1u5", "created": 1399254330.0, "author_flair_text": null, "created_utc": 1399250730.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha0phq", "gilded": 0, "author": "boobmuncher", "parent_id": "t3_24qebm", "approved_by": null, "body": "Just be there for her. Don't judge her, don't tell her it's selfish. DON'T talk about your own experiences too much. Just be there for her and she will appreciate that more than you'll ever know. Check up on her of your own accord, but not too much that it's suffocating. I hope this helps and I wish you all the best.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just be there for her. Don&amp;#39;t judge her, don&amp;#39;t tell her it&amp;#39;s selfish. DON&amp;#39;T talk about your own experiences too much. Just be there for her and she will appreciate that more than you&amp;#39;ll ever know. Check up on her of your own accord, but not too much that it&amp;#39;s suffocating. I hope this helps and I wish you all the best.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qebm", "score_hidden": false, "name": "t1_cha0phq", "created": 1399325344.0, "author_flair_text": null, "created_utc": 1399296544.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]