[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been really down lately. I won&amp;#39;t go into the reasons why. I feel like this is going to sound very stupid to a lot of you, but I hope at least one person understands so I don&amp;#39;t feel so fucking broken. &lt;/p&gt;\n\n&lt;p&gt;I want to self-destruct. I&amp;#39;ve been smoking a lot of weed lately, and drinking too. That in itself isn&amp;#39;t too bad. I&amp;#39;ve been thinking about starting to cut again, but I also feel like there is something holding me back. Lately I&amp;#39;ve been thinking about suicide. I don&amp;#39;t believe I would actually commit suicide, but I&amp;#39;ve just been looking up ways to do it, lethal doses of medications, all that sort of stuff. &lt;/p&gt;\n\n&lt;p&gt;Anyways, I don&amp;#39;t know why, but I want to just fuck everything up. I want to fuck my life up and I want to be fucked up. Maybe its because I feel so fucked up and no one else sees it, maybe I want it to be visible. On the other hand, maybe I just want a reason to not be here anymore. I can&amp;#39;t commit suicide because I have things holding me back, people who love me. If I fuck my life up, maybe that will make it easier to let go of my life and just do it. I don&amp;#39;t know if I ever could though. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know if this is the right subreddit to post this in, but I suppose its as good as any. Please, please tell me that someone out there has felt this way and understands what is going on with me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been really down lately. I won't go into the reasons why. I feel like this is going to sound very stupid to a lot of you, but I hope at least one person understands so I don't feel so fucking broken. \n\nI want to self-destruct. I've been smoking a lot of weed lately, and drinking too. That in itself isn't too bad. I've been thinking about starting to cut again, but I also feel like there is something holding me back. Lately I've been thinking about suicide. I don't believe I would actually commit suicide, but I've just been looking up ways to do it, lethal doses of medications, all that sort of stuff. \n\nAnyways, I don't know why, but I want to just fuck everything up. I want to fuck my life up and I want to be fucked up. Maybe its because I feel so fucked up and no one else sees it, maybe I want it to be visible. On the other hand, maybe I just want a reason to not be here anymore. I can't commit suicide because I have things holding me back, people who love me. If I fuck my life up, maybe that will make it easier to let go of my life and just do it. I don't know if I ever could though. \n\nI don't even know if this is the right subreddit to post this in, but I suppose its as good as any. Please, please tell me that someone out there has felt this way and understands what is going on with me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wug4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SharkieRawr", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wug4/going_to_sound_so_stupid/", "name": "t3_24wug4", "created": 1399452176.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wug4/going_to_sound_so_stupid/", "author_flair_text": null, "title": "Going to sound so stupid...", "created_utc": 1399423376.0, "ups": 1, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbps9j", "gilded": 0, "author": "Zock123454321", "parent_id": "t1_chbjuqw", "approved_by": null, "body": "No problem bro!\nIf you ever just need to talk just reply here or PM me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem bro!\nIf you ever just need to talk just reply here or PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbps9j", "created": 1399460717.0, "author_flair_text": null, "created_utc": 1399457117.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chbjuqw", "gilded": 0, "author": "SharkieRawr", "parent_id": "t1_chbjs9b", "approved_by": null, "body": "Thank you for listening. Even if you don't understand, it feels good to have someone at least listen. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for listening. Even if you don&amp;#39;t understand, it feels good to have someone at least listen. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbjuqw", "created": 1399436738.0, "author_flair_text": null, "created_utc": 1399433138.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbjs9b", "gilded": 0, "author": "Zock123454321", "parent_id": "t1_chbikhc", "approved_by": null, "body": "I wish I could say I understand but honestly I can't relate to losing a parent. \n\nBut I know for sure that the drugs aren't helping. You need to get help and try to stop. I hope you have a good day bro!\nStay optimistic and it will get better!", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could say I understand but honestly I can&amp;#39;t relate to losing a parent. &lt;/p&gt;\n\n&lt;p&gt;But I know for sure that the drugs aren&amp;#39;t helping. You need to get help and try to stop. I hope you have a good day bro!\nStay optimistic and it will get better!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbjs9b", "created": 1399461777.0, "author_flair_text": null, "created_utc": 1399432977.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chbikhc", "gilded": 0, "author": "SharkieRawr", "parent_id": "t1_chbibdu", "approved_by": null, "body": "I'm not really sure. I mean, a lot of shit has happened in the last few months, maybe I'm just done. My mum died in February, I struggled to pass my college courses at the time, I moved back home (always a huge stressor for me), we just had to put down my mum's dog (at only three years old), I'm starting to feel like I need drugs and alcohol to be okay (which is not okay), and I just feel like shit all the time. I feel like nobody understands what its like to lose your mother (who is also your best friend) at age 20 and how badly it hurts knowing she'll never get to see your children. I don't have many friends, and most of them are online. I tried talking to them about it and they said things like, \"everyone's parents die eventually\" or \"one day I'll be able to relate, but right now I can't\". No, one day you WON'T be able to relate because it'll be under different circumstances. Your parents will have met your children, been at your college graduation, seen you grow up, move out, get a real job, get married. All of that. I'm sorry, I know I'm ranting. Thanks for listening. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not really sure. I mean, a lot of shit has happened in the last few months, maybe I&amp;#39;m just done. My mum died in February, I struggled to pass my college courses at the time, I moved back home (always a huge stressor for me), we just had to put down my mum&amp;#39;s dog (at only three years old), I&amp;#39;m starting to feel like I need drugs and alcohol to be okay (which is not okay), and I just feel like shit all the time. I feel like nobody understands what its like to lose your mother (who is also your best friend) at age 20 and how badly it hurts knowing she&amp;#39;ll never get to see your children. I don&amp;#39;t have many friends, and most of them are online. I tried talking to them about it and they said things like, &amp;quot;everyone&amp;#39;s parents die eventually&amp;quot; or &amp;quot;one day I&amp;#39;ll be able to relate, but right now I can&amp;#39;t&amp;quot;. No, one day you WON&amp;#39;T be able to relate because it&amp;#39;ll be under different circumstances. Your parents will have met your children, been at your college graduation, seen you grow up, move out, get a real job, get married. All of that. I&amp;#39;m sorry, I know I&amp;#39;m ranting. Thanks for listening. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbikhc", "created": 1399459008.0, "author_flair_text": null, "created_utc": 1399430208.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chbibdu", "gilded": 0, "author": "Zock123454321", "parent_id": "t1_chbi12t", "approved_by": null, "body": "First person who knows how it is like to hit themselves that I have talked to.\n\nDo you happen to have a pen or a sharpie nearby? Maybe you could draw some pictures on your arms. It would be visible and would probably remove some of the urge to cut.\n\nAnd being angry at the world is completely rational. The world will kick you down multiple times. You have to get up and look at it like an optimist. You learn from being kicked down and become a wiser person for it.\n\nWhat is causing your stress exactly?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First person who knows how it is like to hit themselves that I have talked to.&lt;/p&gt;\n\n&lt;p&gt;Do you happen to have a pen or a sharpie nearby? Maybe you could draw some pictures on your arms. It would be visible and would probably remove some of the urge to cut.&lt;/p&gt;\n\n&lt;p&gt;And being angry at the world is completely rational. The world will kick you down multiple times. You have to get up and look at it like an optimist. You learn from being kicked down and become a wiser person for it.&lt;/p&gt;\n\n&lt;p&gt;What is causing your stress exactly?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbibdu", "created": 1399458461.0, "author_flair_text": null, "created_utc": 1399429661.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chbi12t", "gilded": 0, "author": "SharkieRawr", "parent_id": "t1_chbhqjd", "approved_by": null, "body": "I live with my grandparents. They're holding me back because I know they can't take another loss. My mum (their child) died back in February. She was my best friend and I'm having trouble coping with it, and I've never been very good with coping in the first place (hence, self-harm and whatnot). I don't think I could talk to them about it. The other thing holding me back is my step-sister, who I don't live with. She's 15, but she has asperger's and seems a lot younger than her age. It obviously wouldn't be appropriate to talk to her. I do have a counselor who I trust very much and I do talk to, but I hurt so badly right now I just want to know that SOMEONE out there has felt what I'm feeling. I feel so lost, so hurt, so angry at the world and most of the people in it. I just don't know how to handle all of this. \n\nOne of the reasons I want to cut is so I can put something on my body that says how badly I'm feeling. I don't know why, but it is something that would make me feel better. \n\nI can relate to the head-hitting. Sometimes when I'm at my wits end and as frustrated or mad as I can be, I smack myself in the head as hard as I can, repeatedly. I've been trying to avoid that since I have given myself concussions. I'm glad that you are also trying to resist that urge. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live with my grandparents. They&amp;#39;re holding me back because I know they can&amp;#39;t take another loss. My mum (their child) died back in February. She was my best friend and I&amp;#39;m having trouble coping with it, and I&amp;#39;ve never been very good with coping in the first place (hence, self-harm and whatnot). I don&amp;#39;t think I could talk to them about it. The other thing holding me back is my step-sister, who I don&amp;#39;t live with. She&amp;#39;s 15, but she has asperger&amp;#39;s and seems a lot younger than her age. It obviously wouldn&amp;#39;t be appropriate to talk to her. I do have a counselor who I trust very much and I do talk to, but I hurt so badly right now I just want to know that SOMEONE out there has felt what I&amp;#39;m feeling. I feel so lost, so hurt, so angry at the world and most of the people in it. I just don&amp;#39;t know how to handle all of this. &lt;/p&gt;\n\n&lt;p&gt;One of the reasons I want to cut is so I can put something on my body that says how badly I&amp;#39;m feeling. I don&amp;#39;t know why, but it is something that would make me feel better. &lt;/p&gt;\n\n&lt;p&gt;I can relate to the head-hitting. Sometimes when I&amp;#39;m at my wits end and as frustrated or mad as I can be, I smack myself in the head as hard as I can, repeatedly. I&amp;#39;ve been trying to avoid that since I have given myself concussions. I&amp;#39;m glad that you are also trying to resist that urge. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbi12t", "created": 1399457860.0, "author_flair_text": null, "created_utc": 1399429060.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbhqjd", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24wug4", "approved_by": null, "body": "I get the trying not to self harm. I used to hit myself in the head as hard as I could and I still get really strong urges to do so nowadays but usually after I resist I feel much better.\n\nHave you tried talking to the people who are holding you back? Talking to people you know can help a lot more than it seems.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get the trying not to self harm. I used to hit myself in the head as hard as I could and I still get really strong urges to do so nowadays but usually after I resist I feel much better.&lt;/p&gt;\n\n&lt;p&gt;Have you tried talking to the people who are holding you back? Talking to people you know can help a lot more than it seems.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wug4", "score_hidden": false, "name": "t1_chbhqjd", "created": 1399457233.0, "author_flair_text": null, "created_utc": 1399428433.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]