[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She left me too crushed to go to work yesterday so I laid in bed all day. Today I mustered up the energy to actually go to work but the day has barely even started and I&amp;#39;m already regretting it. A few days ago, before this even happened, something irritated the hell out of my eyes and it created a red ring around them. It kinda looks like I&amp;#39;ve been crying (I have been but that&amp;#39;s beside the point.) today one of my buddies at work sees me and he makes a joke about if I&amp;#39;ve been crying if my girl left me or something. I mean, fuck, how do you even deal with that except for being completely crushed? I don&amp;#39;t want to be here. I don&amp;#39;t want to be anywhere. I don&amp;#39;t want to deal with my coworkers. I don&amp;#39;t want to deal with anybody. I&amp;#39;m just going through the motions at this point. I&amp;#39;m tired of hearing my family tell me &amp;quot;if she loves you she&amp;#39;ll come back to you.&amp;quot;  They don&amp;#39;t fucking understand that that&amp;#39;s the whole point. She doesn&amp;#39;t love me and she&amp;#39;s not coming back. I mean I understand that they are family and I&amp;#39;m glad they are there for me cause I have literally nobody else but every single thing they say just makes me more depressed. I just can&amp;#39;t face the facts. &lt;/p&gt;\n\n&lt;p&gt;What do you guys do when you feel like your every day mundane tasks are just you going through the motions? How can I snap out of this? What can I do to give meaning to my life? Because right now I don&amp;#39;t feel like being at work. I don&amp;#39;t feel like being awake. I don&amp;#39;t feel like being.... Here. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "She left me too crushed to go to work yesterday so I laid in bed all day. Today I mustered up the energy to actually go to work but the day has barely even started and I'm already regretting it. A few days ago, before this even happened, something irritated the hell out of my eyes and it created a red ring around them. It kinda looks like I've been crying (I have been but that's beside the point.) today one of my buddies at work sees me and he makes a joke about if I've been crying if my girl left me or something. I mean, fuck, how do you even deal with that except for being completely crushed? I don't want to be here. I don't want to be anywhere. I don't want to deal with my coworkers. I don't want to deal with anybody. I'm just going through the motions at this point. I'm tired of hearing my family tell me \"if she loves you she'll come back to you.\"  They don't fucking understand that that's the whole point. She doesn't love me and she's not coming back. I mean I understand that they are family and I'm glad they are there for me cause I have literally nobody else but every single thing they say just makes me more depressed. I just can't face the facts. \n\nWhat do you guys do when you feel like your every day mundane tasks are just you going through the motions? How can I snap out of this? What can I do to give meaning to my life? Because right now I don't feel like being at work. I don't feel like being awake. I don't feel like being.... Here. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24jjg6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "igotmyxomatosis", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24jjg6/going_through_the_motions_dont_want_to_do_this/", "name": "t3_24jjg6", "created": 1399068767.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24jjg6/going_through_the_motions_dont_want_to_do_this/", "author_flair_text": null, "title": "Going through the motions. Don't want to do this anymore.", "created_utc": 1399039967.0, "ups": 4, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch804vc", "gilded": 0, "author": "igotmyxomatosis", "parent_id": "t1_ch7zze7", "approved_by": null, "body": "I get that line of thinking and I'm sure she is gonna have her fun with other guys/girls but I literally have no interest in messing around with other girls. I don't even want to talk to other girls. I just want her back. I know it's not gonna happen and I know it's stupid but it's just what I truly feel. ", "edited": 1399061881.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get that line of thinking and I&amp;#39;m sure she is gonna have her fun with other guys/girls but I literally have no interest in messing around with other girls. I don&amp;#39;t even want to talk to other girls. I just want her back. I know it&amp;#39;s not gonna happen and I know it&amp;#39;s stupid but it&amp;#39;s just what I truly feel. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jjg6", "score_hidden": false, "name": "t1_ch804vc", "created": 1399090455.0, "author_flair_text": null, "created_utc": 1399061655.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7zze7", "gilded": 0, "author": "bignosebutkindahot", "parent_id": "t1_ch7ytx3", "approved_by": null, "body": "Ive heard the thing you can do is A. Be an asshole which you dont sound like and B. Fuck as many girls as you can, gotta get over it dude, even if she did come back whats the chance shell leave again, why do you even want that? I personally dont think love is for life, so fuck like  a rabbit. Shes probly gonna end up dating numerous assholes and thats okay because if shes dumb then thats that, thats why im sayin man fuck it do some wild shit, do something so you are reminded youre alive instead of convinced youre dead... just remember never go ass to mouth and try to wrap ot up, oh yeah no ass to pussy either.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ive heard the thing you can do is A. Be an asshole which you dont sound like and B. Fuck as many girls as you can, gotta get over it dude, even if she did come back whats the chance shell leave again, why do you even want that? I personally dont think love is for life, so fuck like  a rabbit. Shes probly gonna end up dating numerous assholes and thats okay because if shes dumb then thats that, thats why im sayin man fuck it do some wild shit, do something so you are reminded youre alive instead of convinced youre dead... just remember never go ass to mouth and try to wrap ot up, oh yeah no ass to pussy either.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jjg6", "score_hidden": false, "name": "t1_ch7zze7", "created": 1399090127.0, "author_flair_text": null, "created_utc": 1399061327.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7ytx3", "gilded": 0, "author": "igotmyxomatosis", "parent_id": "t1_ch7ykzv", "approved_by": null, "body": "Honestly the only reason I haven't done anything drastic is because of my parents. But I don't know how much longer I can last to be honest. I'm pretty much waiting on the moment where it finally clicks that she is never coming back and it'll probably push me over the edge. \n\nAs far as school is concerned, that ship sailed a long time ago. I fucked that up in embarrassing fashion just like I fucked up everything else in my life. She was going to help me get back into school. I was actually excited about being a student again. But now that excitement is gone. I needed her direction to get back in the game. The part that kills me is that she obviously doesn't give a shit about me, so I should be able to feel the same way in return right? Fuck it's just not fair.  Why did I have to be this way? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly the only reason I haven&amp;#39;t done anything drastic is because of my parents. But I don&amp;#39;t know how much longer I can last to be honest. I&amp;#39;m pretty much waiting on the moment where it finally clicks that she is never coming back and it&amp;#39;ll probably push me over the edge. &lt;/p&gt;\n\n&lt;p&gt;As far as school is concerned, that ship sailed a long time ago. I fucked that up in embarrassing fashion just like I fucked up everything else in my life. She was going to help me get back into school. I was actually excited about being a student again. But now that excitement is gone. I needed her direction to get back in the game. The part that kills me is that she obviously doesn&amp;#39;t give a shit about me, so I should be able to feel the same way in return right? Fuck it&amp;#39;s just not fair.  Why did I have to be this way? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jjg6", "score_hidden": false, "name": "t1_ch7ytx3", "created": 1399087643.0, "author_flair_text": null, "created_utc": 1399058843.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7ykzv", "gilded": 0, "author": "bignosebutkindahot", "parent_id": "t3_24jjg6", "approved_by": null, "body": "Man i wish i could say i felt differently, dont have many friends, hardly see them, broke as fuck with no solution, just going through the motions, dont care anymore and dont wanna be here but i cantimagine what itd do to my parents and family so i just keep going, the only \"solution\" offered is a palm full of antidepressants, antipsychotics and benzodiazapines, basically as a bandaid to make you feel fine with your situation and not actually chaning it, i guess id say the only way to change things is to... change things. Money would help a lot. Cant go back to school right now thoigh for having 2 academic holds because ay the time i was doing a lot of klonopin and i just didnt care, well of i can give you some advice dont fuck up school...\nEdit: i guess you have to make the change yourself, decide what needs to be different, like for me i just come home from work and get reeeaaallly hammered because ive been getting high for so long i dont know what else interests me, i should change that and stop ot but what do i replace it with? Dont have the money to save money so i feel kinda fucked", "edited": 1399058594.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man i wish i could say i felt differently, dont have many friends, hardly see them, broke as fuck with no solution, just going through the motions, dont care anymore and dont wanna be here but i cantimagine what itd do to my parents and family so i just keep going, the only &amp;quot;solution&amp;quot; offered is a palm full of antidepressants, antipsychotics and benzodiazapines, basically as a bandaid to make you feel fine with your situation and not actually chaning it, i guess id say the only way to change things is to... change things. Money would help a lot. Cant go back to school right now thoigh for having 2 academic holds because ay the time i was doing a lot of klonopin and i just didnt care, well of i can give you some advice dont fuck up school...\nEdit: i guess you have to make the change yourself, decide what needs to be different, like for me i just come home from work and get reeeaaallly hammered because ive been getting high for so long i dont know what else interests me, i should change that and stop ot but what do i replace it with? Dont have the money to save money so i feel kinda fucked&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jjg6", "score_hidden": false, "name": "t1_ch7ykzv", "created": 1399087116.0, "author_flair_text": null, "created_utc": 1399058316.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]