[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t care about a throw away. This is me, if anyone has any problems about it, it&amp;#39;s my life. Just a note for the people following from other subs.&lt;br/&gt;\nI&amp;#39;m 16, and I&amp;#39;ve been depressed since I was twelve. I&amp;#39;m glad I got this far, because I&amp;#39;ve started to realize that I have some people who like me back enough for a relationship. Too bad my depression ruins it. My last relationship ended yesterday, and me being me I apologized profusely, to the point of creeping out the girl a little. I can&amp;#39;t handle my emotions when I&amp;#39;m sad, I just go with the moment. It&amp;#39;s never thoughts of suicide until lately, but it&amp;#39;s always been terrible if I&amp;#39;m talking to others.&lt;br/&gt;\nI&amp;#39;ve always been quiet and antisocial, but that&amp;#39;s starting to change as I go through highschool. The only problem is I scare away people who can&amp;#39;t accept me for me. I&amp;#39;ve tried to get in relationships before, and each one failed. The added weight of family issues including an alcoholic dad and a verbally abusive mom doesn&amp;#39;t help. It&amp;#39;s gotten to the point where I keep a gun in my dresser for personal safety, but leaving my family would cripple me. I love them too much. As for the gun, it&amp;#39;s just sitting there un touched. It hasn&amp;#39;t moved in two months, but I recently had to snap myself out of grabbing it the other day. I don&amp;#39;t want to end like this, but I am worried it might happen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't care about a throw away. This is me, if anyone has any problems about it, it's my life. Just a note for the people following from other subs.  \nI'm 16, and I've been depressed since I was twelve. I'm glad I got this far, because I've started to realize that I have some people who like me back enough for a relationship. Too bad my depression ruins it. My last relationship ended yesterday, and me being me I apologized profusely, to the point of creeping out the girl a little. I can't handle my emotions when I'm sad, I just go with the moment. It's never thoughts of suicide until lately, but it's always been terrible if I'm talking to others.  \nI've always been quiet and antisocial, but that's starting to change as I go through highschool. The only problem is I scare away people who can't accept me for me. I've tried to get in relationships before, and each one failed. The added weight of family issues including an alcoholic dad and a verbally abusive mom doesn't help. It's gotten to the point where I keep a gun in my dresser for personal safety, but leaving my family would cripple me. I love them too much. As for the gun, it's just sitting there un touched. It hasn't moved in two months, but I recently had to snap myself out of grabbing it the other day. I don't want to end like this, but I am worried it might happen.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24trg2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Defyingtoitle", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24trg2/good_but_going_down_hill_fast/", "name": "t3_24trg2", "created": 1399368168.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24trg2/good_but_going_down_hill_fast/", "author_flair_text": null, "title": "Good, but going down hill. Fast.", "created_utc": 1399339368.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cham91g", "gilded": 0, "author": "sofar1776", "parent_id": "t3_24trg2", "approved_by": null, "body": "I am sorry for the situation you have found yourself in. I am afraid that there isn't anything I can offer but a little advice. First, you need to talk to someone like the school counselor or nurse. If you have been depressed for four years, you need help that nobody can give on a message board. But you can be helped. There are many things a professional can do for you. I would not be surprised if one or both of your parents knows about the gun. Perhaps you could put it somewhere a little harder to find? They need their own help, but they have to find it. You can't do that for anyone else. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry for the situation you have found yourself in. I am afraid that there isn&amp;#39;t anything I can offer but a little advice. First, you need to talk to someone like the school counselor or nurse. If you have been depressed for four years, you need help that nobody can give on a message board. But you can be helped. There are many things a professional can do for you. I would not be surprised if one or both of your parents knows about the gun. Perhaps you could put it somewhere a little harder to find? They need their own help, but they have to find it. You can&amp;#39;t do that for anyone else. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24trg2", "score_hidden": false, "name": "t1_cham91g", "created": 1399371329.0, "author_flair_text": null, "created_utc": 1399342529.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]