[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hate my life. For the last several years, I have looked forward to dying. I think maybe I&amp;#39;ll get terminal cancer and get happier and happier until I finally die, like anticipating leaving a job you hate. There&amp;#39;s a high probability I will eventually get melanoma and I have no money for medical care. I have had many moles removed and have another dozen more that look probable.&lt;/p&gt;\n\n&lt;p&gt;My whole life is serving other people. My husband is fucking clueless and nothing I ever say registers because he has a billion excuses to explain why being a selfish prick was really what I told him I wanted. I&amp;#39;ve spent twelve years trying to explain why his selfishness sucks and listening to his explanations of how he&amp;#39;s a great guy, I&amp;#39;m wrong and it&amp;#39;s my fault.&lt;/p&gt;\n\n&lt;p&gt;My high needs, ill middle school aged kids are narcissists who it would never occur to think of anyone else in any way. It is all about them twenty-four hours a day. They function like kindergartners and demand every waking second. My mom is a vampire sucking the life out of me. Every &amp;quot;friend&amp;quot; is somebody who wants something. I am uber-responsible. I take care of everyone,no one takes care of me. No one ever has and no one ever will. They suck the life out of me. And I am the idiot  fuck up who chose this man, chose to have kids and brought this nightmare to pass. It is my fault but I cannot fix it. No money, no energy, no health, no faith in anyone at this point.&lt;/p&gt;\n\n&lt;p&gt;As usual, for the twelfth year in a row, I got nothing for mother&amp;#39;s day but my kids screaming and crying about how mean I am for making them bathe and how they hate me. My husband gave me his spiel about how I really wanted to ignored and unacknowledged so he was just doing what I wanted. My life is just the fucking pits, it is a trainwreck. It is hopeless. I feel like a total failure. &lt;/p&gt;\n\n&lt;p&gt;I am thinking how can I kill myself and make it look like an accident, so I won&amp;#39;t be responsible for them dealing with the &amp;quot;my mom killed herself,&amp;quot; trip. Yes, it will suck but they will all be fine without me, that I know. My husband tells me bullshit about how I am the most important person in his life but that lasts for about five minutes until he gets back on his computer. Every day of my life is torture and has been for the last twelve years.I thought I should suck it up and be miserable for another thirty years (or hopefully less) but now I think, Christ, what&amp;#39;s the point?  Being dead sounds so great. No dragging myself out of bed after two hours of broken sleep, no kid screaming at me how they hate me and why don&amp;#39;t I just die for dragging them out of bed, no worries about unpaid bills, no more worrying about all my own health shit unattended to for years, no more dealing with my crazy mother, my siblings, my husband, people calling and demanding crap from me all the time. Just nothing, lots and lots of nothing which sounds like heaven.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hate my life. For the last several years, I have looked forward to dying. I think maybe I'll get terminal cancer and get happier and happier until I finally die, like anticipating leaving a job you hate. There's a high probability I will eventually get melanoma and I have no money for medical care. I have had many moles removed and have another dozen more that look probable.\n\n My whole life is serving other people. My husband is fucking clueless and nothing I ever say registers because he has a billion excuses to explain why being a selfish prick was really what I told him I wanted. I've spent twelve years trying to explain why his selfishness sucks and listening to his explanations of how he's a great guy, I'm wrong and it's my fault.\n\n My high needs, ill middle school aged kids are narcissists who it would never occur to think of anyone else in any way. It is all about them twenty-four hours a day. They function like kindergartners and demand every waking second. My mom is a vampire sucking the life out of me. Every \"friend\" is somebody who wants something. I am uber-responsible. I take care of everyone,no one takes care of me. No one ever has and no one ever will. They suck the life out of me. And I am the idiot  fuck up who chose this man, chose to have kids and brought this nightmare to pass. It is my fault but I cannot fix it. No money, no energy, no health, no faith in anyone at this point.\n\nAs usual, for the twelfth year in a row, I got nothing for mother's day but my kids screaming and crying about how mean I am for making them bathe and how they hate me. My husband gave me his spiel about how I really wanted to ignored and unacknowledged so he was just doing what I wanted. My life is just the fucking pits, it is a trainwreck. It is hopeless. I feel like a total failure. \n\nI am thinking how can I kill myself and make it look like an accident, so I won't be responsible for them dealing with the \"my mom killed herself,\" trip. Yes, it will suck but they will all be fine without me, that I know. My husband tells me bullshit about how I am the most important person in his life but that lasts for about five minutes until he gets back on his computer. Every day of my life is torture and has been for the last twelve years.I thought I should suck it up and be miserable for another thirty years (or hopefully less) but now I think, Christ, what's the point?  Being dead sounds so great. No dragging myself out of bed after two hours of broken sleep, no kid screaming at me how they hate me and why don't I just die for dragging them out of bed, no worries about unpaid bills, no more worrying about all my own health shit unattended to for years, no more dealing with my crazy mother, my siblings, my husband, people calling and demanding crap from me all the time. Just nothing, lots and lots of nothing which sounds like heaven.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25c20r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Lookingforeternity", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25c20r/happy_mothers_day/", "name": "t3_25c20r", "created": 1399897333.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25c20r/happy_mothers_day/", "author_flair_text": null, "title": "Happy Mother's Day", "created_utc": 1399868533.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfqgwe", "gilded": 0, "author": "Slyx", "parent_id": "t1_chfq4c3", "approved_by": null, "body": "It's unfortunate that he's not willing to go. \n\nDo you think you'd be able to go? I think it could help you a lot, and help you understand how to better communicate with your husband.  There are many places that offer sliding scale services and someone to talk to and someone to help get you through a tough family situation - and offer guidance on things you should do - could help you out a lot. Believe me, there are many, many more options than suicide, and I believe that you know that too in your heart.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s unfortunate that he&amp;#39;s not willing to go. &lt;/p&gt;\n\n&lt;p&gt;Do you think you&amp;#39;d be able to go? I think it could help you a lot, and help you understand how to better communicate with your husband.  There are many places that offer sliding scale services and someone to talk to and someone to help get you through a tough family situation - and offer guidance on things you should do - could help you out a lot. Believe me, there are many, many more options than suicide, and I believe that you know that too in your heart.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c20r", "score_hidden": false, "name": "t1_chfqgwe", "created": 1399900212.0, "author_flair_text": null, "created_utc": 1399871412.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfq4c3", "gilded": 0, "author": "Lookingforeternity", "parent_id": "t1_chfprew", "approved_by": null, "body": "We have insurance. We're headed for medical bankruptcy. Both kids have expensive conditions. We're not eligible for the ACA.\n\nHe won't go to therapy. He gets very defensive, which is why he tells me ridiculous bullshit like I told him I did not want to any acknowledgement of Mother's Day. Because he really could not be bothered.\n\nI really am not strong. If I were, I'd have the ability to think I could improve my own situation by some means other than suicide. I'd be able to see a future beyond non-existence. Even deserting them would be better probably and I can't (besides which, we have zero money.) \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We have insurance. We&amp;#39;re headed for medical bankruptcy. Both kids have expensive conditions. We&amp;#39;re not eligible for the ACA.&lt;/p&gt;\n\n&lt;p&gt;He won&amp;#39;t go to therapy. He gets very defensive, which is why he tells me ridiculous bullshit like I told him I did not want to any acknowledgement of Mother&amp;#39;s Day. Because he really could not be bothered.&lt;/p&gt;\n\n&lt;p&gt;I really am not strong. If I were, I&amp;#39;d have the ability to think I could improve my own situation by some means other than suicide. I&amp;#39;d be able to see a future beyond non-existence. Even deserting them would be better probably and I can&amp;#39;t (besides which, we have zero money.) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c20r", "score_hidden": false, "name": "t1_chfq4c3", "created": 1399899132.0, "author_flair_text": null, "created_utc": 1399870332.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfprew", "gilded": 0, "author": "Slyx", "parent_id": "t3_25c20r", "approved_by": null, "body": "Hi OP, Happy Mothers Day. \n\nAs far as insurance, have you looked into the affordable care act and it's provisions? You may be able to benefit from it, if you want to tell me what state you're in I can find the info for you and direct you to it. \n\nAs far as your issues with your husband, it sounds like there may be some communications issues there, and good communication is necessary to a healthy relationship. Have you ever considered couple's therapy? It's a great option so that someone can \"mediate\" and you can both talk about how you are feeling. \n\nYou sound like a wonderful person, a great mom, someone who gives everything they have to your family, even if they don't give anything back to you. And you know what? YOU should be commended, because that shows you are a strong woman. And you can persevere. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi OP, Happy Mothers Day. &lt;/p&gt;\n\n&lt;p&gt;As far as insurance, have you looked into the affordable care act and it&amp;#39;s provisions? You may be able to benefit from it, if you want to tell me what state you&amp;#39;re in I can find the info for you and direct you to it. &lt;/p&gt;\n\n&lt;p&gt;As far as your issues with your husband, it sounds like there may be some communications issues there, and good communication is necessary to a healthy relationship. Have you ever considered couple&amp;#39;s therapy? It&amp;#39;s a great option so that someone can &amp;quot;mediate&amp;quot; and you can both talk about how you are feeling. &lt;/p&gt;\n\n&lt;p&gt;You sound like a wonderful person, a great mom, someone who gives everything they have to your family, even if they don&amp;#39;t give anything back to you. And you know what? YOU should be commended, because that shows you are a strong woman. And you can persevere. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c20r", "score_hidden": false, "name": "t1_chfprew", "created": 1399898076.0, "author_flair_text": null, "created_utc": 1399869276.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]