[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A friend tells me repeatedly to go see a doctor for help with my depression and never ceasing thoughts of suicide. And I&amp;#39;ve been going to doctors since 2007. I&amp;#39;m on pills, and they help, but I feel like I told the doctor to put me on pills and the dozen or so different therapists and councilors who I&amp;#39;ve talked to never help curb the suicide thoughts. &lt;/p&gt;\n\n&lt;p&gt;I get so frustrated when I get told &amp;quot;go to a doctor, this is serious, they can help&amp;quot; because I am convinced they can&amp;#39;t help.&lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t want to give up hope, so does anyone out there have success stories of their battle to inspire me to go on and figure out how to fight mine?&lt;/p&gt;\n\n&lt;p&gt;Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A friend tells me repeatedly to go see a doctor for help with my depression and never ceasing thoughts of suicide. And I've been going to doctors since 2007. I'm on pills, and they help, but I feel like I told the doctor to put me on pills and the dozen or so different therapists and councilors who I've talked to never help curb the suicide thoughts. \n\nI get so frustrated when I get told \"go to a doctor, this is serious, they can help\" because I am convinced they can't help.\n\nBut I don't want to give up hope, so does anyone out there have success stories of their battle to inspire me to go on and figure out how to fight mine?\n\nThanks", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ht5u", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "johnie517", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ht5u/has_anyone_successfully_gotten_medical_help_for/", "name": "t3_24ht5u", "created": 1399012450.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ht5u/has_anyone_successfully_gotten_medical_help_for/", "author_flair_text": null, "title": "Has anyone successfully gotten medical help for their suicidal tendencies?", "created_utc": 1398983650.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch79gws", "gilded": 0, "author": "ifnnjk", "parent_id": "t3_24ht5u", "approved_by": null, "body": "Yes :) but what I learnt more than anything was that I had to believe in myself and I have to make it happen for myself. The doctors are just there as a support network for when I fall off the band wagon a little. To begin with I relied on them to make me better but after a while I realised that if I really wanted to feel happier and to stop how I was feeling, which I really did, then I needed to do it for myself. No one else could change me, only I can do that. After I started to believe in myself everything got a lot easier. I didn't feel bad if a felt a bit down one day, I started to appreciate all the smaller things and I started to feel better. \n\nI do simple things when I'm on a down to give myself a reality check. For instance, I close my eyes and think of 5 things I am grateful for. They could be things like grateful for my families health, grateful I woke up this morning, grateful I was able to have my favourite breakfast. Whatever they are and no matter how small they seem they will help build me up. \n\nIf every week you can feel 1% better than the week before, by a few months you'll be 30% better. By a year you'll be over 50% better. \n\nI believe in you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes :) but what I learnt more than anything was that I had to believe in myself and I have to make it happen for myself. The doctors are just there as a support network for when I fall off the band wagon a little. To begin with I relied on them to make me better but after a while I realised that if I really wanted to feel happier and to stop how I was feeling, which I really did, then I needed to do it for myself. No one else could change me, only I can do that. After I started to believe in myself everything got a lot easier. I didn&amp;#39;t feel bad if a felt a bit down one day, I started to appreciate all the smaller things and I started to feel better. &lt;/p&gt;\n\n&lt;p&gt;I do simple things when I&amp;#39;m on a down to give myself a reality check. For instance, I close my eyes and think of 5 things I am grateful for. They could be things like grateful for my families health, grateful I woke up this morning, grateful I was able to have my favourite breakfast. Whatever they are and no matter how small they seem they will help build me up. &lt;/p&gt;\n\n&lt;p&gt;If every week you can feel 1% better than the week before, by a few months you&amp;#39;ll be 30% better. By a year you&amp;#39;ll be over 50% better. &lt;/p&gt;\n\n&lt;p&gt;I believe in you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ht5u", "score_hidden": false, "name": "t1_ch79gws", "created": 1399013490.0, "author_flair_text": null, "created_utc": 1398984690.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7hjx6", "gilded": 0, "author": "soucy666", "parent_id": "t3_24ht5u", "approved_by": null, "body": "After my first suicide attempt I was committed to a local mental hospital.  Really they're supposed to let you in even if you don't attempt but are considering and have compliant insurance.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After my first suicide attempt I was committed to a local mental hospital.  Really they&amp;#39;re supposed to let you in even if you don&amp;#39;t attempt but are considering and have compliant insurance.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ht5u", "score_hidden": false, "name": "t1_ch7hjx6", "created": 1399032437.0, "author_flair_text": null, "created_utc": 1399003637.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7did2", "gilded": 0, "author": "inRuin", "parent_id": "t3_24ht5u", "approved_by": null, "body": "I am now 28, married to a great woman and have 3 wonderful children. I had a rather rough childhood and attempted suicide around the age of 16. I kept being told by everyone that it wasn't worth it and that before I knew it all the things that made me feel suicidal would be long forgotten. I resented these people and it angered me even more. I thought it was just a load that they were feeding me because they felt they had to. But here I am, 12 years later, and I no longer remember why I thought ending it all would be a good choice.\n\nI truly believe time heals all wounds. The pain fades and things get better. Just remember, you are the most important person in your life. Nothing is worth ending your own life.\n\nI used to think that the issues I had were going to be lifelong issues. That they would always be significant and I would always feel the pain. But then I found that even in one year, so many good changes could be made. And now I'm happy I did not succeed.\n\nHang in there. Life does get better, even if it gets bumpy at times.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am now 28, married to a great woman and have 3 wonderful children. I had a rather rough childhood and attempted suicide around the age of 16. I kept being told by everyone that it wasn&amp;#39;t worth it and that before I knew it all the things that made me feel suicidal would be long forgotten. I resented these people and it angered me even more. I thought it was just a load that they were feeding me because they felt they had to. But here I am, 12 years later, and I no longer remember why I thought ending it all would be a good choice.&lt;/p&gt;\n\n&lt;p&gt;I truly believe time heals all wounds. The pain fades and things get better. Just remember, you are the most important person in your life. Nothing is worth ending your own life.&lt;/p&gt;\n\n&lt;p&gt;I used to think that the issues I had were going to be lifelong issues. That they would always be significant and I would always feel the pain. But then I found that even in one year, so many good changes could be made. And now I&amp;#39;m happy I did not succeed.&lt;/p&gt;\n\n&lt;p&gt;Hang in there. Life does get better, even if it gets bumpy at times.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ht5u", "score_hidden": false, "name": "t1_ch7did2", "created": 1399023000.0, "author_flair_text": null, "created_utc": 1398994200.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]