[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seriously, some people would probably wonder why I would ever want to kill myself. I found the perfect girl, we&amp;#39;re getting married this year. I just graduated from college with a 4-year degree. I have a family that loves me, friends, people say I&amp;#39;m &amp;quot;attractive&amp;quot;, but I want to die. I&amp;#39;ve wanted to kill myself for a very long time now.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 29, just graduated with an IT-related degree after going back to college. I&amp;#39;ve always been extremely shy. Had friends throughout middle and high school, but I didn&amp;#39;t talk much. I was picked on by the &amp;quot;jocks&amp;quot;/older kids for being awkwardly shy. Most people just assumed I was gay. Even my friends and family did, whatever.  &lt;/p&gt;\n\n&lt;p&gt;Went to college, smoked a lot of pot with some new friends, eventually was just made fun of by them for being shy. 2nd year of college I moved in with a few friends from highschool. They would frequently throw house parties and I was so asocial I would stay in my room the entire night. Even pissing in bottles I would later throw away just so I wouldn&amp;#39;t have to show my face if I had to use the bathroom or something. If I got hungry I would just starve until the party subsided. Basically I locked myself in my room for a year and played video games and smoked weed. I stopped going to class and eventually just failed out and moved back home with my parents for 4 years. I started thinking maybe I was schizophrenic.  &lt;/p&gt;\n\n&lt;p&gt;For the next four years I worked a full-time job while living at home. This is probably my loneliest point of my life as all of my friends had moved on. I would work, come home, smoke weed and play video games. I would occasionally go visit some of my old high school friends down in &amp;quot;college town&amp;quot; and during one party decided maybe it would be best if I tried moving back there out of my parent&amp;#39;s house. I sure as hell wasn&amp;#39;t accomplishing anything by living at home. \nSo I started a new job, moved in with a friend (even though he and most others were now graduating soon). Really, I had just gotten sick of living with my parents and was embarrassed with myself for being such a loser. A year later, at 25, I met a girl and we really hit it off. I also finally lost my virginity at this time. We have so much in common so things are great there. I decided I didn&amp;#39;t want to be a &amp;quot;bum&amp;quot; working minimum wage if I actually met an awesome girl to spend my life with so I decided to go back to college.  &lt;/p&gt;\n\n&lt;p&gt;The next four years are pretty good. We eventually moved in together, I proposed last year, I opened up a bit, but I&amp;#39;m still socially retarded. It&amp;#39;s so hard for me to speak to people. This is really where all of my depression is coming from nowadays. I mean I hardly speak a word when I go to family functions. I sometimes, but rarely will get a wind where I actually am able to speak to people, but most of the time if I speak I fuck up sentences or questions when I go to ask them. It&amp;#39;s hard for me to pay attention to people. You can speak directly to me and a lot of times I won&amp;#39;t have a single clue what you just said. I have had an internship for the past year that I basically blew off. I was always too afraid to speak up and ask questions if I had them. I would sit at my desk for days/weeks before my boss would finally ask if I was alright with my current task and would eventually have to help me along. I could have been answering the help-desk line but was afraid to because I was afraid I wouldn&amp;#39;t be able to answer the question/help the other person. It really showed too when I went to an interview for an IT related position the other week and couldn&amp;#39;t answer a single help-desk related question because I basically had zero practice due to my shyness.   &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen a psychiatrist, I&amp;#39;ve tried probably 5 different anti-depressant/anti-anxienty drugs, but nothing really helps at all. I was diagnosed as having ADD/anxiety/depression, but my fiance seems to think I have aspergers as well, and I have to admit I do have just about every symptom. I really feel like I wasted my time getting a degree. I know that any big-person job I get I am just going to completely fail due to my inept ability to work with other people. I can&amp;#39;t even see a Dr. right now cause I have no insurance. I was fired from my job 2 months ago after working there for 6 years. Basically got fed up with my boss and didn&amp;#39;t do something he asked me to. My boss at my paid internship has graciously allowed me to continue working there for the next month since I don&amp;#39;t have another job started yet. I think he just feels bad for me. I mean it&amp;#39;s no secret I have been a horrible intern, but people always say I&amp;#39;m a &amp;quot;nice young man&amp;quot;.. Okay maybe it&amp;#39;s the old ladies that speak that line specifically.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I want to do with my life anymore. All I know is I do not want to work weekends/evenings/holidays anymore. I&amp;#39;ve been doing that the last 10 years and I hate it. My fiance and I like to keep our weekends free to go do things (it&amp;#39;s really the only time I&amp;#39;m happy), even though we&amp;#39;re broke right now from the upcoming wedding and honeymoon. I don&amp;#39;t even care if my job is computer related. I do know I only look forward to coming home after work so I don&amp;#39;t have to be near anyone anymore. When I am home I&amp;#39;m bored out of my mind thoughs and don&amp;#39;t really enjoy doing much anymore. I really just feel like an empty shell. So much so that I don&amp;#39;t care about the good things in my life anymore. I really am just a shell. I&amp;#39;ve never had much of a personality. I&amp;#39;m 29 now. I&amp;#39;ve had pleeeeennnty of time to try and fix my life, be more social, enjoy shit more, I don&amp;#39;t see it getting much better in another 10 years. It&amp;#39;s gotten to the point where I&amp;#39;m once again searching for suicide methods and have one picked out. My fiance knows I&amp;#39;m suicidal and now I&amp;#39;m thinking about calling off the wedding because I don&amp;#39;t see the point anymore. No point in her trying to make a life with me if I&amp;#39;m eventually just going to kill myself anyways. Might as well start closing things up so I can get this shit done with for once.  &lt;/p&gt;\n\n&lt;p&gt;Sorry that this is so long... I know many people won&amp;#39;t want to take the time to read something this long, but I really could go on and on. I&amp;#39;m just trying to get others to understand my situation and how asocial I truly am despite having several good things going for me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Seriously, some people would probably wonder why I would ever want to kill myself. I found the perfect girl, we're getting married this year. I just graduated from college with a 4-year degree. I have a family that loves me, friends, people say I'm \"attractive\", but I want to die. I've wanted to kill myself for a very long time now.  \n \nI'm 29, just graduated with an IT-related degree after going back to college. I've always been extremely shy. Had friends throughout middle and high school, but I didn't talk much. I was picked on by the \"jocks\"/older kids for being awkwardly shy. Most people just assumed I was gay. Even my friends and family did, whatever.  \n\nWent to college, smoked a lot of pot with some new friends, eventually was just made fun of by them for being shy. 2nd year of college I moved in with a few friends from highschool. They would frequently throw house parties and I was so asocial I would stay in my room the entire night. Even pissing in bottles I would later throw away just so I wouldn't have to show my face if I had to use the bathroom or something. If I got hungry I would just starve until the party subsided. Basically I locked myself in my room for a year and played video games and smoked weed. I stopped going to class and eventually just failed out and moved back home with my parents for 4 years. I started thinking maybe I was schizophrenic.  \n\nFor the next four years I worked a full-time job while living at home. This is probably my loneliest point of my life as all of my friends had moved on. I would work, come home, smoke weed and play video games. I would occasionally go visit some of my old high school friends down in \"college town\" and during one party decided maybe it would be best if I tried moving back there out of my parent's house. I sure as hell wasn't accomplishing anything by living at home. \nSo I started a new job, moved in with a friend (even though he and most others were now graduating soon). Really, I had just gotten sick of living with my parents and was embarrassed with myself for being such a loser. A year later, at 25, I met a girl and we really hit it off. I also finally lost my virginity at this time. We have so much in common so things are great there. I decided I didn't want to be a \"bum\" working minimum wage if I actually met an awesome girl to spend my life with so I decided to go back to college.  \n\nThe next four years are pretty good. We eventually moved in together, I proposed last year, I opened up a bit, but I'm still socially retarded. It's so hard for me to speak to people. This is really where all of my depression is coming from nowadays. I mean I hardly speak a word when I go to family functions. I sometimes, but rarely will get a wind where I actually am able to speak to people, but most of the time if I speak I fuck up sentences or questions when I go to ask them. It's hard for me to pay attention to people. You can speak directly to me and a lot of times I won't have a single clue what you just said. I have had an internship for the past year that I basically blew off. I was always too afraid to speak up and ask questions if I had them. I would sit at my desk for days/weeks before my boss would finally ask if I was alright with my current task and would eventually have to help me along. I could have been answering the help-desk line but was afraid to because I was afraid I wouldn't be able to answer the question/help the other person. It really showed too when I went to an interview for an IT related position the other week and couldn't answer a single help-desk related question because I basically had zero practice due to my shyness.   \n\nI've seen a psychiatrist, I've tried probably 5 different anti-depressant/anti-anxienty drugs, but nothing really helps at all. I was diagnosed as having ADD/anxiety/depression, but my fiance seems to think I have aspergers as well, and I have to admit I do have just about every symptom. I really feel like I wasted my time getting a degree. I know that any big-person job I get I am just going to completely fail due to my inept ability to work with other people. I can't even see a Dr. right now cause I have no insurance. I was fired from my job 2 months ago after working there for 6 years. Basically got fed up with my boss and didn't do something he asked me to. My boss at my paid internship has graciously allowed me to continue working there for the next month since I don't have another job started yet. I think he just feels bad for me. I mean it's no secret I have been a horrible intern, but people always say I'm a \"nice young man\".. Okay maybe it's the old ladies that speak that line specifically.  \n\nI don't know what I want to do with my life anymore. All I know is I do not want to work weekends/evenings/holidays anymore. I've been doing that the last 10 years and I hate it. My fiance and I like to keep our weekends free to go do things (it's really the only time I'm happy), even though we're broke right now from the upcoming wedding and honeymoon. I don't even care if my job is computer related. I do know I only look forward to coming home after work so I don't have to be near anyone anymore. When I am home I'm bored out of my mind thoughs and don't really enjoy doing much anymore. I really just feel like an empty shell. So much so that I don't care about the good things in my life anymore. I really am just a shell. I've never had much of a personality. I'm 29 now. I've had pleeeeennnty of time to try and fix my life, be more social, enjoy shit more, I don't see it getting much better in another 10 years. It's gotten to the point where I'm once again searching for suicide methods and have one picked out. My fiance knows I'm suicidal and now I'm thinking about calling off the wedding because I don't see the point anymore. No point in her trying to make a life with me if I'm eventually just going to kill myself anyways. Might as well start closing things up so I can get this shit done with for once.  \n\nSorry that this is so long... I know many people won't want to take the time to read something this long, but I really could go on and on. I'm just trying to get others to understand my situation and how asocial I truly am despite having several good things going for me.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25e0tb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway198420__", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25e0tb/have_it_made_want_to_die_due_to_my_shy_personality/", "name": "t3_25e0tb", "created": 1399955629.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25e0tb/have_it_made_want_to_die_due_to_my_shy_personality/", "author_flair_text": null, "title": "Have it made. Want to die due to my shy personality.", "created_utc": 1399926829.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgv8zz", "gilded": 0, "author": "throwaway198420__", "parent_id": "t1_chgt03c", "approved_by": null, "body": "Wouldn't it be a good idea to get out of my \"comfort zone\" though and practice being more sociable? I know you're right about me being too self conscious, but how exactly does one become less self conscious? I'm also just really bad at listening and reading comprehension. I've had problems pronouncing words correctly at a very young age and my family said I used to just make up words. Pretty sure they thought I was mildly retarded until I was 5. I honestly think I have a form of autism/aspergers that was never really diagnosed, and I hate going to the Dr. and trying to explain my situation cause I have an extremely hard time answering questions when asked to recall something on the spot or to put 2 and 2 together in the health sense. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t it be a good idea to get out of my &amp;quot;comfort zone&amp;quot; though and practice being more sociable? I know you&amp;#39;re right about me being too self conscious, but how exactly does one become less self conscious? I&amp;#39;m also just really bad at listening and reading comprehension. I&amp;#39;ve had problems pronouncing words correctly at a very young age and my family said I used to just make up words. Pretty sure they thought I was mildly retarded until I was 5. I honestly think I have a form of autism/aspergers that was never really diagnosed, and I hate going to the Dr. and trying to explain my situation cause I have an extremely hard time answering questions when asked to recall something on the spot or to put 2 and 2 together in the health sense. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chgv8zz", "created": 1400022490.0, "author_flair_text": null, "created_utc": 1399993690.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgt03c", "gilded": 0, "author": "ignorethename", "parent_id": "t1_chgst95", "approved_by": null, "body": "even then, you should really avoid going to places that make you feel too uncomfortable. that D&amp;D game looks all right. at the same time, you also need to be comfortable with your own silence in social situation. I will bet you that 80% of the problem is due to your own self consciousness about your silence or lack of ability to converse much. If you were not self conscious, I am sure you'd do much better. EVEN if you did not chat much then, at least you wont feel bad about it!\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;even then, you should really avoid going to places that make you feel too uncomfortable. that D&amp;amp;D game looks all right. at the same time, you also need to be comfortable with your own silence in social situation. I will bet you that 80% of the problem is due to your own self consciousness about your silence or lack of ability to converse much. If you were not self conscious, I am sure you&amp;#39;d do much better. EVEN if you did not chat much then, at least you wont feel bad about it!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chgt03c", "created": 1400016887.0, "author_flair_text": null, "created_utc": 1399988087.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgst95", "gilded": 0, "author": "throwaway198420__", "parent_id": "t1_chgoopv", "approved_by": null, "body": "There is no social place where I feel comfortable unfortunately. If I'm at work and my coworkers start talking about something I'm interested in I keep my mouth shut most of the time. I'm awkward around family, my best friends. I just tried playing D&amp;D for the first time the other day with people I'm comfortable around for the most part. I'm a huge RPG nerd as far as games are concerned so D&amp;D is something that has interested me that I haven't tried before. I started off trying to be somewhat social but after a half hour or so I just fall silent and don't feel confident in my ability to speak anymore. I don't even socialize much with my fiance whom I live with. It doesn't matter who I talk to. I'm bound to fuck up my sentence structure somehow, or to even conjure up the vocabulary needed in order to complete a sentence.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no social place where I feel comfortable unfortunately. If I&amp;#39;m at work and my coworkers start talking about something I&amp;#39;m interested in I keep my mouth shut most of the time. I&amp;#39;m awkward around family, my best friends. I just tried playing D&amp;amp;D for the first time the other day with people I&amp;#39;m comfortable around for the most part. I&amp;#39;m a huge RPG nerd as far as games are concerned so D&amp;amp;D is something that has interested me that I haven&amp;#39;t tried before. I started off trying to be somewhat social but after a half hour or so I just fall silent and don&amp;#39;t feel confident in my ability to speak anymore. I don&amp;#39;t even socialize much with my fiance whom I live with. It doesn&amp;#39;t matter who I talk to. I&amp;#39;m bound to fuck up my sentence structure somehow, or to even conjure up the vocabulary needed in order to complete a sentence.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chgst95", "created": 1400016328.0, "author_flair_text": null, "created_utc": 1399987528.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chgoopv", "gilded": 0, "author": "ignorethename", "parent_id": "t1_chgdzom", "approved_by": null, "body": "point one: stop going to these social events where you feel bad about yourself. \n\nRather go to social places where you are a little bit comfortable. Like anme convention, book reading clubs, or chess championship, whatever. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;point one: stop going to these social events where you feel bad about yourself. &lt;/p&gt;\n\n&lt;p&gt;Rather go to social places where you are a little bit comfortable. Like anme convention, book reading clubs, or chess championship, whatever. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chgoopv", "created": 1399996011.0, "author_flair_text": null, "created_utc": 1399967211.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chgdzom", "gilded": 0, "author": "throwaway198420__", "parent_id": "t1_chg91i7", "approved_by": null, "body": "Thanks. I feel like depression is so deeply embedded in me at this point that there's no way I will ever be truly happy. Every time I go somewhere that I'm expected to be social I just end up getting depressed afterwards. Mainly because I see how everyone else is socializing and having a good time and I basically sit back and watch it all fly by. Believe me, I would LOVE to be more social, but communicating with others is extremely hard for me to do, and it's extra frustrating because I feel like other people just think I should outright be able to talk to others easily \"if I want to\", but it's just not that easy. Then I feel like other people just start judging me as a freak that hates everyone. I hate going to work and listening to all the conversations that I could easily jump into but I'm afraid to make a squeak, which is sometimes the noise that I might as well make for all the times that I've failed to form a coherent sentence. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I feel like depression is so deeply embedded in me at this point that there&amp;#39;s no way I will ever be truly happy. Every time I go somewhere that I&amp;#39;m expected to be social I just end up getting depressed afterwards. Mainly because I see how everyone else is socializing and having a good time and I basically sit back and watch it all fly by. Believe me, I would LOVE to be more social, but communicating with others is extremely hard for me to do, and it&amp;#39;s extra frustrating because I feel like other people just think I should outright be able to talk to others easily &amp;quot;if I want to&amp;quot;, but it&amp;#39;s just not that easy. Then I feel like other people just start judging me as a freak that hates everyone. I hate going to work and listening to all the conversations that I could easily jump into but I&amp;#39;m afraid to make a squeak, which is sometimes the noise that I might as well make for all the times that I&amp;#39;ve failed to form a coherent sentence. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chgdzom", "created": 1399967243.0, "author_flair_text": null, "created_utc": 1399938443.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chg91i7", "gilded": 0, "author": "throwawaypornjobs", "parent_id": "t3_25e0tb", "approved_by": null, "body": "I read every word, congratulations to your girlfriend and yourself! You've got so much on your side, times are hard, things will always be difficult but Reddit will always be here for you.. reply or Pm me back if you want to chat :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read every word, congratulations to your girlfriend and yourself! You&amp;#39;ve got so much on your side, times are hard, things will always be difficult but Reddit will always be here for you.. reply or Pm me back if you want to chat :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e0tb", "score_hidden": false, "name": "t1_chg91i7", "created": 1399956585.0, "author_flair_text": null, "created_utc": 1399927785.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]