[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t normally post or say things like this, but I have been going over and over the scenario in my head for the last few weeks, and no matter how hard I try I just can&amp;#39;t think of a solution or a future where I will be happy. I am a 25 year old male. I had a well paid job until recently because I left due to wanting a change, I worked there for 5 years and wanted a new challenge. I have been accepted into 4 Universities and will be starting a course in September. I also have a good job offer lined up to work for until I start Uni, and I know that these are all good things and I should be happy for myself, but I have a problem that I just don&amp;#39;t know what to do.&lt;/p&gt;\n\n&lt;p&gt;I am gay but I have only told my best friend, as I am not sure how everybody else will react if I tell them. The thing is, and I feel so stupid, is that I know that I am in love with him (cringe worthy and soppy I know) and I know that eventually, he is going to find some girl and one day become married, kids etc. Eventually there won&amp;#39;t be much room in his life for me, and I will be left alone. It sounds dumb, and I usually don&amp;#39;t believe in this kind of stuff, but I know that I won&amp;#39;t find anybody I love more than him, and even just the thought of living the rest of my life without him gets me so upset that I don&amp;#39;t know what to do.&lt;/p&gt;\n\n&lt;p&gt;I have been going over it in my head and I just can&amp;#39;t see a future for me that involves me being happy. Im starting to think that maybe the happiest years of my life are behind me, and the only option I can see that will stop me being so miserable is to just end it. It isn&amp;#39;t a good choice, and I know that I will hurt a lot of people, and that fact is the only thing that has been keeping me going for awhile, is that I don&amp;#39;t want to hurt the people I would leave behind, but at the same time, living my life like this is so hard and miserable that I don&amp;#39;t want to go on like this.&lt;/p&gt;\n\n&lt;p&gt;Has anybody else felt like this? How do you get passed it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't normally post or say things like this, but I have been going over and over the scenario in my head for the last few weeks, and no matter how hard I try I just can't think of a solution or a future where I will be happy. I am a 25 year old male. I had a well paid job until recently because I left due to wanting a change, I worked there for 5 years and wanted a new challenge. I have been accepted into 4 Universities and will be starting a course in September. I also have a good job offer lined up to work for until I start Uni, and I know that these are all good things and I should be happy for myself, but I have a problem that I just don't know what to do.\n\nI am gay but I have only told my best friend, as I am not sure how everybody else will react if I tell them. The thing is, and I feel so stupid, is that I know that I am in love with him (cringe worthy and soppy I know) and I know that eventually, he is going to find some girl and one day become married, kids etc. Eventually there won't be much room in his life for me, and I will be left alone. It sounds dumb, and I usually don't believe in this kind of stuff, but I know that I won't find anybody I love more than him, and even just the thought of living the rest of my life without him gets me so upset that I don't know what to do.\n\nI have been going over it in my head and I just can't see a future for me that involves me being happy. Im starting to think that maybe the happiest years of my life are behind me, and the only option I can see that will stop me being so miserable is to just end it. It isn't a good choice, and I know that I will hurt a lot of people, and that fact is the only thing that has been keeping me going for awhile, is that I don't want to hurt the people I would leave behind, but at the same time, living my life like this is so hard and miserable that I don't want to go on like this.\n\nHas anybody else felt like this? How do you get passed it?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23uk3n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Annon1212", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23uk3n/have_you_ever_reached_a_point_in_your_life_when/", "name": "t3_23uk3n", "created": 1398364214.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23uk3n/have_you_ever_reached_a_point_in_your_life_when/", "author_flair_text": null, "title": "Have you ever reached a point in your life when you just can't see anything getting better?", "created_utc": 1398335414.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch18jg4", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_23uk3n", "approved_by": null, "body": "You need someone or something to surprise you. It is easy to become too certain in your own ability to predict the future. \n\nIt's a sign that I either need to be confused; it is time to move to a new place or try dating again or undertake some project that I simply do not understand. If I am not confused often enough then I get melancholic and develop a potentially lethal case of ennui.\n\nPM me weird things, please. No dicks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need someone or something to surprise you. It is easy to become too certain in your own ability to predict the future. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a sign that I either need to be confused; it is time to move to a new place or try dating again or undertake some project that I simply do not understand. If I am not confused often enough then I get melancholic and develop a potentially lethal case of ennui.&lt;/p&gt;\n\n&lt;p&gt;PM me weird things, please. No dicks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23uk3n", "score_hidden": false, "name": "t1_ch18jg4", "created": 1398383598.0, "author_flair_text": null, "created_utc": 1398379998.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]