[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Using a throwaway, and have kind of a long story, so please bear with the wall of text.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 18, 19 in June. In High School, I had a good life. Good grades, pretty popular. Enjoyed school. Then I started Sixth Form/College (I&amp;#39;m in the U.K), and out of nowhere, my life started to go to shit.&lt;/p&gt;\n\n&lt;p&gt;I was diagnosed with clinical depression in December of 2011. I couldn&amp;#39;t pinpoint what caused it, it just sort of happened. After months of struggling, and the school trying their best to help me, I couldn&amp;#39;t take it, and left. The school said I could take a year to recover, and start the year over next year. I got better. I was happy again.&lt;/p&gt;\n\n&lt;p&gt;Then I started school again, enjoyed the first month, then it all happened again. Like clockwork. December 2012, I was re-diagnosed. It was at that point I concluded that school was making me like this, and I had to get out. I would find a job or something.&lt;/p&gt;\n\n&lt;p&gt;After a couple months of job hunting, and repeated failures, I started to lose all hope. I had no qualifications, no experience. Nothing. How was I going to live? I am currently living with my parents, getting money from disability welfare (under Depression). I feel so fucking pathetic.&lt;/p&gt;\n\n&lt;p&gt;All those friends I made, they&amp;#39;re ALL, literally ALL at University, having the time of their lives. Being successful, having parties, having relationships (something I never had), studying subjects they love.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile I&amp;#39;&amp;#39;m stuck at my parents house, lonely, unhappy, thinking about suicide all day. No planning or anything, just thinking how I wish there was an off button. (Though I do know about the Exit Bag, and that would be the preferred method, should I ever get to that point).&lt;/p&gt;\n\n&lt;p&gt;I think the worst part of it is knowing how privileged I am. I look at these other posts, of people who were abused, abandoned, family hates them etc. And I have a family who loves and supports me. I should be happy. And me not being happy just makes me feel guilty, and the cycle continues.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Using a throwaway, and have kind of a long story, so please bear with the wall of text.\n\nI'm 18, 19 in June. In High School, I had a good life. Good grades, pretty popular. Enjoyed school. Then I started Sixth Form/College (I'm in the U.K), and out of nowhere, my life started to go to shit.\n\nI was diagnosed with clinical depression in December of 2011. I couldn't pinpoint what caused it, it just sort of happened. After months of struggling, and the school trying their best to help me, I couldn't take it, and left. The school said I could take a year to recover, and start the year over next year. I got better. I was happy again.\n\nThen I started school again, enjoyed the first month, then it all happened again. Like clockwork. December 2012, I was re-diagnosed. It was at that point I concluded that school was making me like this, and I had to get out. I would find a job or something.\n\nAfter a couple months of job hunting, and repeated failures, I started to lose all hope. I had no qualifications, no experience. Nothing. How was I going to live? I am currently living with my parents, getting money from disability welfare (under Depression). I feel so fucking pathetic.\n\nAll those friends I made, they're ALL, literally ALL at University, having the time of their lives. Being successful, having parties, having relationships (something I never had), studying subjects they love.\n\nMeanwhile I''m stuck at my parents house, lonely, unhappy, thinking about suicide all day. No planning or anything, just thinking how I wish there was an off button. (Though I do know about the Exit Bag, and that would be the preferred method, should I ever get to that point).\n\nI think the worst part of it is knowing how privileged I am. I look at these other posts, of people who were abused, abandoned, family hates them etc. And I have a family who loves and supports me. I should be happy. And me not being happy just makes me feel guilty, and the cycle continues.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bzzn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "VXUDBZ", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24bzzn/having_a_lot_of_nonspecific_suicidal_thoughts/", "name": "t3_24bzzn", "created": 1398852231.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24bzzn/having_a_lot_of_nonspecific_suicidal_thoughts/", "author_flair_text": null, "title": "Having a lot of nonspecific suicidal thoughts.", "created_utc": 1398823431.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5npx6", "gilded": 0, "author": "VXUDBZ", "parent_id": "t1_ch5n26o", "approved_by": null, "body": "Been seeing a therapist for around 6 months now. Luckily we get free treatment here in the UK, and have been on Antidepressants for around 2. \n\nI have a weird relationship with my antidepressants. Like, they help me do things I enjoy for longer. Before them, I would get bored of things I used to love so quickly, but now I can do them for longer. So in that sense they are kind of working.\n\nBut once I stop, playing video games or guitar for instance, suddenly, my mind goes back to a dark spot again. It seems like the only way I can push these thoughts out is by distracting them, and the antidepressants aren't stopping these thoughts, just delaying them. I don't know if that's normal or not, but it doesn't feel great.\n\nI've told 2 of my friends about how I'm feeling, and while they've been great and supportive, there's only so much they can do over facebook when they're across the country.\n\nI just feel so lonely.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been seeing a therapist for around 6 months now. Luckily we get free treatment here in the UK, and have been on Antidepressants for around 2. &lt;/p&gt;\n\n&lt;p&gt;I have a weird relationship with my antidepressants. Like, they help me do things I enjoy for longer. Before them, I would get bored of things I used to love so quickly, but now I can do them for longer. So in that sense they are kind of working.&lt;/p&gt;\n\n&lt;p&gt;But once I stop, playing video games or guitar for instance, suddenly, my mind goes back to a dark spot again. It seems like the only way I can push these thoughts out is by distracting them, and the antidepressants aren&amp;#39;t stopping these thoughts, just delaying them. I don&amp;#39;t know if that&amp;#39;s normal or not, but it doesn&amp;#39;t feel great.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve told 2 of my friends about how I&amp;#39;m feeling, and while they&amp;#39;ve been great and supportive, there&amp;#39;s only so much they can do over facebook when they&amp;#39;re across the country.&lt;/p&gt;\n\n&lt;p&gt;I just feel so lonely.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bzzn", "score_hidden": false, "name": "t1_ch5npx6", "created": 1398830463.0, "author_flair_text": null, "created_utc": 1398826863.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5n26o", "gilded": 0, "author": "jkizzleEe420", "parent_id": "t3_24bzzn", "approved_by": null, "body": "First of all, do not be ashamed that you have depression. So many people have it and it does not matter if you have the best life in the whole entire world, you can still get it. It comes out of nowhere due to imbalances in the brain. Are you on any sort of medication/seeing a therapist? I do both of these things and it's been a long winding road but I am finally making progress and it feels so amazing to take control of my own feelings like this. You are NOT pathetic and you are also not alone. I know it's hard, but try not to compare yourself to others. Mental health illnesses are no joke. I have seen the effects of them on many people and it is so sad, because otherwise these people are healthy and great to be around. Not saying the mental illness makes you bad to be around, but in your head you probably think it does. If you are not already, I highly recommend therapy/medication. Keep yourself busy if possible and try to take care of yourself. We are here for you. xoxo", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, do not be ashamed that you have depression. So many people have it and it does not matter if you have the best life in the whole entire world, you can still get it. It comes out of nowhere due to imbalances in the brain. Are you on any sort of medication/seeing a therapist? I do both of these things and it&amp;#39;s been a long winding road but I am finally making progress and it feels so amazing to take control of my own feelings like this. You are NOT pathetic and you are also not alone. I know it&amp;#39;s hard, but try not to compare yourself to others. Mental health illnesses are no joke. I have seen the effects of them on many people and it is so sad, because otherwise these people are healthy and great to be around. Not saying the mental illness makes you bad to be around, but in your head you probably think it does. If you are not already, I highly recommend therapy/medication. Keep yourself busy if possible and try to take care of yourself. We are here for you. xoxo&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bzzn", "score_hidden": false, "name": "t1_ch5n26o", "created": 1398854286.0, "author_flair_text": null, "created_utc": 1398825486.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5vwas", "gilded": 0, "author": "reaching-out", "parent_id": "t3_24bzzn", "approved_by": null, "body": "This happened to me, at exactly the same point in time (first year of college and had my first depressive episode...could not function). It can lead to a bleak few months/years of borderline agoraphobia, benefits, GP visits, nothingness, etc. However, from someone who is further ahead in age now, perhaps finding out we had a (completely normal!) illness early on was best in preparing us for the future and for future management. \n\nIt hurts seeing your friends pursue what you believe is 'normality' and going off to uni but I can guarantee that amongst the partying they are under some extreme pressure too. It would have been unfair to you to put yourself through that at your lowest. You have plenty of time for that when you have learned more how to manage your depression. \n\nI don't want to give you my life story (this is YOUR story...it's just so similar) but I ended up doing the uni thing, the postgrad thing, the work thing all with depression and ongoing support. I just did it later than others and took opportunities during times when I felt better. It's your path in life to take and it doesn't matter if you go off the beaten track so to speak. Do it at your own pace and in your own way :) \n\nYou sound understandably distressed about your suicidal thoughts but try to remember they are responses to your inner turmoil and frustrations about your current situation. And just thoughts, not anything you are compelled to act upon. You're being incredibly proactive by seeking the help you need and deserve. \n\nBe kind to yourself. It's hell, but keep going. You'll have so much insight from this experience which may even be an advantage in the future. \n\nP.S. if you ever feel well enough for voluntary work then I would strongly advise that, for your sense of wellbeing and also to show yourself that you're just as competent as everyone else, even with a mental illness.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This happened to me, at exactly the same point in time (first year of college and had my first depressive episode...could not function). It can lead to a bleak few months/years of borderline agoraphobia, benefits, GP visits, nothingness, etc. However, from someone who is further ahead in age now, perhaps finding out we had a (completely normal!) illness early on was best in preparing us for the future and for future management. &lt;/p&gt;\n\n&lt;p&gt;It hurts seeing your friends pursue what you believe is &amp;#39;normality&amp;#39; and going off to uni but I can guarantee that amongst the partying they are under some extreme pressure too. It would have been unfair to you to put yourself through that at your lowest. You have plenty of time for that when you have learned more how to manage your depression. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to give you my life story (this is YOUR story...it&amp;#39;s just so similar) but I ended up doing the uni thing, the postgrad thing, the work thing all with depression and ongoing support. I just did it later than others and took opportunities during times when I felt better. It&amp;#39;s your path in life to take and it doesn&amp;#39;t matter if you go off the beaten track so to speak. Do it at your own pace and in your own way :) &lt;/p&gt;\n\n&lt;p&gt;You sound understandably distressed about your suicidal thoughts but try to remember they are responses to your inner turmoil and frustrations about your current situation. And just thoughts, not anything you are compelled to act upon. You&amp;#39;re being incredibly proactive by seeking the help you need and deserve. &lt;/p&gt;\n\n&lt;p&gt;Be kind to yourself. It&amp;#39;s hell, but keep going. You&amp;#39;ll have so much insight from this experience which may even be an advantage in the future. &lt;/p&gt;\n\n&lt;p&gt;P.S. if you ever feel well enough for voluntary work then I would strongly advise that, for your sense of wellbeing and also to show yourself that you&amp;#39;re just as competent as everyone else, even with a mental illness.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bzzn", "score_hidden": false, "name": "t1_ch5vwas", "created": 1398861812.0, "author_flair_text": null, "created_utc": 1398858212.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]