[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so lost. I&amp;#39;ve never used Reddit but a friend of mine directed me here, so here it goes.&lt;/p&gt;\n\n&lt;p&gt;My dad suffers from a lot of mental problems (schizophrenia, depression), he&amp;#39;s 65. Last time this happened (three years ago shortly after he lost his wife), he tried to kill himself but was committed for four months. \nDue to circumstances, I live with him, but I left the country for three months and returned the middle of march. I found out that while I was gone he was using hard drugs and went off his meds. I confronted him today, and that was really hard to do. I don&amp;#39;t know what I should do for him. His debt is giant, more than I ever imagined. I just don&amp;#39;t know what I should be doing. Should I give him the benefit of the doubt and not seek to commit him? He agreed to see a financial advisor this week, but I&amp;#39;m scared. I don&amp;#39;t want him to try something, I don&amp;#39;t know how unstable he is. I&amp;#39;m not really going into much detail here... &lt;/p&gt;\n\n&lt;p&gt;On one hand after a long talk, I feel like he&amp;#39;s actually heard me out more than ever before, but on the other hand I don&amp;#39;t want to overlook something that I shouldn&amp;#39;t be. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in Ontario, Canada right now. Does anyone have any phone numbers, anyone I can call, any advice? Anything is appreciated. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm so lost. I've never used Reddit but a friend of mine directed me here, so here it goes.\n\nMy dad suffers from a lot of mental problems (schizophrenia, depression), he's 65. Last time this happened (three years ago shortly after he lost his wife), he tried to kill himself but was committed for four months. \nDue to circumstances, I live with him, but I left the country for three months and returned the middle of march. I found out that while I was gone he was using hard drugs and went off his meds. I confronted him today, and that was really hard to do. I don't know what I should do for him. His debt is giant, more than I ever imagined. I just don't know what I should be doing. Should I give him the benefit of the doubt and not seek to commit him? He agreed to see a financial advisor this week, but I'm scared. I don't want him to try something, I don't know how unstable he is. I'm not really going into much detail here... \n\nOn one hand after a long talk, I feel like he's actually heard me out more than ever before, but on the other hand I don't want to overlook something that I shouldn't be. \n\nI'm in Ontario, Canada right now. Does anyone have any phone numbers, anyone I can call, any advice? Anything is appreciated. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2428pu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Bluegirl78", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2428pu/help_in_ontario_my_dad/", "name": "t3_2428pu", "created": 1398580308.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2428pu/help_in_ontario_my_dad/", "author_flair_text": null, "title": "Help in Ontario, my dad.", "created_utc": 1398551508.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2xmb7", "gilded": 0, "author": "MoonCrisisMakeup", "parent_id": "t3_2428pu", "approved_by": null, "body": "If it's an emergency situation call 911. You can also call TeleHealth (Telehealth Ontario at 1-866-797-0000) or a crisis center. Here is a link from CAMH for a list of crisis centers in Ontario: http://www.camh.ca/en/hospital/health_information/finding_help/Pages/distress_crisis_resources.aspx\n\nCAMH may be able to help you as well. I suggest you take a look around on their website. I'm sorry that you and your father are going through this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s an emergency situation call 911. You can also call TeleHealth (Telehealth Ontario at 1-866-797-0000) or a crisis center. Here is a link from CAMH for a list of crisis centers in Ontario: &lt;a href=\"http://www.camh.ca/en/hospital/health_information/finding_help/Pages/distress_crisis_resources.aspx\"&gt;http://www.camh.ca/en/hospital/health_information/finding_help/Pages/distress_crisis_resources.aspx&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;CAMH may be able to help you as well. I suggest you take a look around on their website. I&amp;#39;m sorry that you and your father are going through this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2428pu", "score_hidden": false, "name": "t1_ch2xmb7", "created": 1398586959.0, "author_flair_text": null, "created_utc": 1398558159.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc8bol", "gilded": 0, "author": "quejesache", "parent_id": "t3_2428pu", "approved_by": null, "body": "I hope I'm not too late to add this, but COAST is fantastic.  It links directly to community agencies, and a qualified nurse or social worker will answer the call or call you back with advice and support (for both you and your dad).\n\nI'm sorry you're going through this.  Stay well and I'm wishing you and your father all the best.\n\nCOAST: 905-972-8338", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope I&amp;#39;m not too late to add this, but COAST is fantastic.  It links directly to community agencies, and a qualified nurse or social worker will answer the call or call you back with advice and support (for both you and your dad).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re going through this.  Stay well and I&amp;#39;m wishing you and your father all the best.&lt;/p&gt;\n\n&lt;p&gt;COAST: 905-972-8338&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2428pu", "score_hidden": false, "name": "t1_chc8bol", "created": 1399531045.0, "author_flair_text": null, "created_utc": 1399502245.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]