[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m not suicidal myself, but have a close friend who has been for awhile now. I recently found out about this, and have been talking to her and trying to help as much as possible, but it seems as if sometimes I can&amp;#39;t get to her, it scares me. We relate somewhat because I self harm and we are going through some(?) Of the same things, but sometimes I&amp;#39;m just at a loss for words. She&amp;#39;s telling me about how she feels like her heart is just not there, or that she&amp;#39;s only alive because her heart is beating, and that&amp;#39;s it, no other reason. Most the time I can make her feel a little better but sometimes I worry, she wants to move which will hopefully give enough change to make her feel like she wants to continue, but until then what should I do?&lt;/p&gt;\n\n&lt;p&gt;BTW I read through the rules and didn&amp;#39;t see anything against posts like this, but if it belongs in a different subreddit feel free to tell me&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I'm not suicidal myself, but have a close friend who has been for awhile now. I recently found out about this, and have been talking to her and trying to help as much as possible, but it seems as if sometimes I can't get to her, it scares me. We relate somewhat because I self harm and we are going through some(?) Of the same things, but sometimes I'm just at a loss for words. She's telling me about how she feels like her heart is just not there, or that she's only alive because her heart is beating, and that's it, no other reason. Most the time I can make her feel a little better but sometimes I worry, she wants to move which will hopefully give enough change to make her feel like she wants to continue, but until then what should I do?\n\nBTW I read through the rules and didn't see anything against posts like this, but if it belongs in a different subreddit feel free to tell me", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250hbm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "_states_and_minds", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250hbm/help/", "name": "t3_250hbm", "created": 1399549008.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250hbm/help/", "author_flair_text": null, "title": "Help", "created_utc": 1399520208.0, "ups": 7, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcmro4", "gilded": 0, "author": "_states_and_minds", "parent_id": "t1_chchs3f", "approved_by": null, "body": "Yea I've told her over and over that I'm gonna be here to help no matter what. She says that it cant be fixed though, which I know Is wrong, but the only somewhat good thing, at least it seems good, is that she thinks that it could be just really bad anxiety", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I&amp;#39;ve told her over and over that I&amp;#39;m gonna be here to help no matter what. She says that it cant be fixed though, which I know Is wrong, but the only somewhat good thing, at least it seems good, is that she thinks that it could be just really bad anxiety&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250hbm", "score_hidden": false, "name": "t1_chcmro4", "created": 1399578003.0, "author_flair_text": null, "created_utc": 1399549203.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chchs3f", "gilded": 0, "author": "Buzzzsaws", "parent_id": "t3_250hbm", "approved_by": null, "body": "The only thing I can tell you is to be there for her. \n\nSometimes just the fact of sharing your emotions or knowing someone's listening to you is good for the heart.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing I can tell you is to be there for her. &lt;/p&gt;\n\n&lt;p&gt;Sometimes just the fact of sharing your emotions or knowing someone&amp;#39;s listening to you is good for the heart.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250hbm", "score_hidden": false, "name": "t1_chchs3f", "created": 1399528165.0, "author_flair_text": null, "created_utc": 1399524565.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdcn58", "gilded": 0, "author": "MattColt", "parent_id": "t1_chcmurt", "approved_by": null, "body": "not lie, just have a positive outlook. I guess it's kind of like a debate, she is arguing the cons and you need to help her by arguing the pros. You don't need to make up the way you feel, since that is important too, but you can be a positive force even if that means you have to say things like \"it will get better\" even if you don't necessarily know if that is true. Good luck and remember to take care of yourself as well.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;not lie, just have a positive outlook. I guess it&amp;#39;s kind of like a debate, she is arguing the cons and you need to help her by arguing the pros. You don&amp;#39;t need to make up the way you feel, since that is important too, but you can be a positive force even if that means you have to say things like &amp;quot;it will get better&amp;quot; even if you don&amp;#39;t necessarily know if that is true. Good luck and remember to take care of yourself as well.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250hbm", "score_hidden": false, "name": "t1_chdcn58", "created": 1399634726.0, "author_flair_text": null, "created_utc": 1399605926.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chcmurt", "gilded": 0, "author": "_states_and_minds", "parent_id": "t1_chcikjp", "approved_by": null, "body": "Ive tried to emphasize with her through the self harm, but you're right, that won't do anything except enable her thoughts and make it seem okay. And for talking about myself, do you mean lie? I have had the thoughts, and told her, but no where near as extreme as hers. She thinks that It could be really bad anxiety, which I'm really hoping it is, and I guess doing stuff like hanging out more could help a lot. We mostly text about this just because of school and working, and we don't see each other much during the day.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ive tried to emphasize with her through the self harm, but you&amp;#39;re right, that won&amp;#39;t do anything except enable her thoughts and make it seem okay. And for talking about myself, do you mean lie? I have had the thoughts, and told her, but no where near as extreme as hers. She thinks that It could be really bad anxiety, which I&amp;#39;m really hoping it is, and I guess doing stuff like hanging out more could help a lot. We mostly text about this just because of school and working, and we don&amp;#39;t see each other much during the day.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250hbm", "score_hidden": false, "name": "t1_chcmurt", "created": 1399578412.0, "author_flair_text": null, "created_utc": 1399549612.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chcikjp", "gilded": 0, "author": "MattColt", "parent_id": "t3_250hbm", "approved_by": null, "body": "1) Don't make it too evident that you are doing these things specifically because you are worried about her, she won't take them as seriously and might start to feel uncomfortable that you know something so personal about her.\n\n2) Realize that a lot of people that are in her situation have shitty people around them. So don't be a shitty person.\n\n3) When you were talking about how you self harm and so you can relate to her in that way, it makes me think that you talk to her about those kind of things, maybe often. Now this might be hard for you, but one of the best things you can do for your friend is not talk about those kinds of things since it reinforces her own idea that they are alright. It is definitely a bad thing when a person is so depressed they cut them selves and contemplate suicide. \n\n4) When she talks about the way she is feeling, don't be like \"but look at how beautiful the world is and all the things you an do in life\". That will make her not trust you with her personal feelings because she will think you don't understand.\n\n5) Emphasize with her. \n\n6) A good way to make her feel better is by talking about yourself instead of her. If she tells you that \nshe doesn't think there's any point in living especially since all she feels is pain, tell her that you understand, and you sometimes feel that way too, but you think you aren't giving the good shit a chance. That maybe you and her should try and put some good shit in your lives, just to give it a chance.\n\n7) Put some good shit in both of your lives. Be with her. Go to a stupid romantic comedy, walk like a mile to get a good meal at a place you haven't been before. Walk and talk.\n\n8) Give her attention. Everyone needs some attention. Some people don't get enough good attention from family and that is the origin of many of their problems. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) Don&amp;#39;t make it too evident that you are doing these things specifically because you are worried about her, she won&amp;#39;t take them as seriously and might start to feel uncomfortable that you know something so personal about her.&lt;/p&gt;\n\n&lt;p&gt;2) Realize that a lot of people that are in her situation have shitty people around them. So don&amp;#39;t be a shitty person.&lt;/p&gt;\n\n&lt;p&gt;3) When you were talking about how you self harm and so you can relate to her in that way, it makes me think that you talk to her about those kind of things, maybe often. Now this might be hard for you, but one of the best things you can do for your friend is not talk about those kinds of things since it reinforces her own idea that they are alright. It is definitely a bad thing when a person is so depressed they cut them selves and contemplate suicide. &lt;/p&gt;\n\n&lt;p&gt;4) When she talks about the way she is feeling, don&amp;#39;t be like &amp;quot;but look at how beautiful the world is and all the things you an do in life&amp;quot;. That will make her not trust you with her personal feelings because she will think you don&amp;#39;t understand.&lt;/p&gt;\n\n&lt;p&gt;5) Emphasize with her. &lt;/p&gt;\n\n&lt;p&gt;6) A good way to make her feel better is by talking about yourself instead of her. If she tells you that \nshe doesn&amp;#39;t think there&amp;#39;s any point in living especially since all she feels is pain, tell her that you understand, and you sometimes feel that way too, but you think you aren&amp;#39;t giving the good shit a chance. That maybe you and her should try and put some good shit in your lives, just to give it a chance.&lt;/p&gt;\n\n&lt;p&gt;7) Put some good shit in both of your lives. Be with her. Go to a stupid romantic comedy, walk like a mile to get a good meal at a place you haven&amp;#39;t been before. Walk and talk.&lt;/p&gt;\n\n&lt;p&gt;8) Give her attention. Everyone needs some attention. Some people don&amp;#39;t get enough good attention from family and that is the origin of many of their problems. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250hbm", "score_hidden": false, "name": "t1_chcikjp", "created": 1399555921.0, "author_flair_text": null, "created_utc": 1399527121.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]