[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My boyfriend is struggling with depression and it&amp;#39;s getting worse and worse. Recently he was talking a lot about suicide and today I feel like he might do it. he lives three hours from me and I&amp;#39;m going to drive there tonight at midnight, as I only have my drivers license by then (crossed a red light, police caught me, one month not allowed to drive). I will arrive around 4 am and I&amp;#39;m incredible scared that it will be to late. He is saying &amp;quot;don&amp;#39;t worry, I won&amp;#39;t&amp;quot; but at the same time he is asking why he should stay. We were trying to find therapists for him over the last months but as he doesn&amp;#39;t speak German very well we didn&amp;#39;t find anyone yet. I&amp;#39;m desperate, I don&amp;#39;t know how to help him anymore, when he asks me why he should stay I don&amp;#39;t know any answer because I have borderline and never found a reason myself, luckily I&amp;#39;m in therapy now. His family is on the other side of the world. Should I call the psychiatric hospital? police? What if I&amp;#39;m overreacting? Should I wait and try to support him? What should I say to him? I&amp;#39;m saying everything that I wish someone had said to me when I was there a couple years ago, but nothing works. He always says &amp;quot;whatever&amp;quot; or &amp;quot;everybody will get over it eventually&amp;quot; and how worthless he is and a shit and a loser. He doesn&amp;#39;t seem to see any light anymore. I&amp;#39;m so scared, is don&amp;#39;t want to lose him, I want to help him, please tell me what to do&lt;/p&gt;\n\n&lt;p&gt;Edit: a ewe months ago we had a threesome that didn&amp;#39;t work out for him where he felt forgotten by me and not loved and he keeps talking about it and making me feel even more scared. He uses that to prove that not even I love him and if even I forget him that fast within a night I will also forget him fast when he&amp;#39;s dead. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My boyfriend is struggling with depression and it's getting worse and worse. Recently he was talking a lot about suicide and today I feel like he might do it. he lives three hours from me and I'm going to drive there tonight at midnight, as I only have my drivers license by then (crossed a red light, police caught me, one month not allowed to drive). I will arrive around 4 am and I'm incredible scared that it will be to late. He is saying \"don't worry, I won't\" but at the same time he is asking why he should stay. We were trying to find therapists for him over the last months but as he doesn't speak German very well we didn't find anyone yet. I'm desperate, I don't know how to help him anymore, when he asks me why he should stay I don't know any answer because I have borderline and never found a reason myself, luckily I'm in therapy now. His family is on the other side of the world. Should I call the psychiatric hospital? police? What if I'm overreacting? Should I wait and try to support him? What should I say to him? I'm saying everything that I wish someone had said to me when I was there a couple years ago, but nothing works. He always says \"whatever\" or \"everybody will get over it eventually\" and how worthless he is and a shit and a loser. He doesn't seem to see any light anymore. I'm so scared, is don't want to lose him, I want to help him, please tell me what to do\n\nEdit: a ewe months ago we had a threesome that didn't work out for him where he felt forgotten by me and not loved and he keeps talking about it and making me feel even more scared. He uses that to prove that not even I love him and if even I forget him that fast within a night I will also forget him fast when he's dead. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24dbga", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Mimimagblumen", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398868885.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24dbga/help_i_dont_know_what_to_do/", "name": "t3_24dbga", "created": 1398897368.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24dbga/help_i_dont_know_what_to_do/", "author_flair_text": null, "title": "Help, I don't know what to do.", "created_utc": 1398868568.0, "ups": 2, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch60zn1", "gilded": 0, "author": "Mimimagblumen", "parent_id": "t1_ch60py9", "approved_by": null, "body": "Ok, I will do that. Thank u.\n\nYes, it is Germany. I think I would have to call the police.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, I will do that. Thank u.&lt;/p&gt;\n\n&lt;p&gt;Yes, it is Germany. I think I would have to call the police.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24dbga", "score_hidden": false, "name": "t1_ch60zn1", "created": 1398900965.0, "author_flair_text": null, "created_utc": 1398872165.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}, "saved": false, "id": "ch60py9", "gilded": 0, "author": "powerrangers98", "parent_id": "t1_ch60bz0", "approved_by": null, "body": "If you think he is really going to hurt himself, make sure you call the proper authority.  I don't know how it work there (I am assuming Germany), but I am sure there is someone you can call.  \n  \nIn his lowest time, you need to be there as a good listener.  If you can't get to him in person, call him and listen to what he has to say.  Let him vent about everything he's going through.  Paraphrase what he says.  If this problem is ongoing, seek professional help for him.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think he is really going to hurt himself, make sure you call the proper authority.  I don&amp;#39;t know how it work there (I am assuming Germany), but I am sure there is someone you can call.  &lt;/p&gt;\n\n&lt;p&gt;In his lowest time, you need to be there as a good listener.  If you can&amp;#39;t get to him in person, call him and listen to what he has to say.  Let him vent about everything he&amp;#39;s going through.  Paraphrase what he says.  If this problem is ongoing, seek professional help for him.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24dbga", "score_hidden": false, "name": "t1_ch60py9", "created": 1398900412.0, "author_flair_text": null, "created_utc": 1398871612.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch60bz0", "gilded": 0, "author": "Mimimagblumen", "parent_id": "t1_ch605yz", "approved_by": null, "body": "He seems to be going through a depression for years now, but it has gotten worse in the last months. He is getting divorced right now, moved to a new city and started a new job. His coping mechanism so far was sex with random girls, but he doesn't want to do that anymore since we met.\nHe had bad days before, but I feel like something snapped in him today. I told him that it is worth fighting and that it will get better and he will be happy that he made it through it one day. And that even though he thinks everybody will get over it eventually this is something people who love him will never overcome. I told him that I love him and that I would even accept if he fucks whoever if it makes him feel better. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He seems to be going through a depression for years now, but it has gotten worse in the last months. He is getting divorced right now, moved to a new city and started a new job. His coping mechanism so far was sex with random girls, but he doesn&amp;#39;t want to do that anymore since we met.\nHe had bad days before, but I feel like something snapped in him today. I told him that it is worth fighting and that it will get better and he will be happy that he made it through it one day. And that even though he thinks everybody will get over it eventually this is something people who love him will never overcome. I told him that I love him and that I would even accept if he fucks whoever if it makes him feel better. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24dbga", "score_hidden": false, "name": "t1_ch60bz0", "created": 1398899592.0, "author_flair_text": null, "created_utc": 1398870792.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}, "saved": false, "id": "ch605yz", "gilded": 0, "author": "powerrangers98", "parent_id": "t3_24dbga", "approved_by": null, "body": "I am going to be blunt with you.  Let's shift focus to about him more than about you, because he is the one that needs the help right now.  \n  \nTell us the reason why he is going through this depression.  Have anything like this occurred before?  What kind of things have you told him?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am going to be blunt with you.  Let&amp;#39;s shift focus to about him more than about you, because he is the one that needs the help right now.  &lt;/p&gt;\n\n&lt;p&gt;Tell us the reason why he is going through this depression.  Have anything like this occurred before?  What kind of things have you told him?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24dbga", "score_hidden": false, "name": "t1_ch605yz", "created": 1398899233.0, "author_flair_text": null, "created_utc": 1398870433.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]