[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I need help with a friend who is very depressed, with moderate suicidal tendencies. She and I are not really that close in day to day life, but I was always nice to her (back in high school, I am in college now), and maybe she looked up to me or something, so she often messages me on facebook to talk about her issues, and I try to help when I can. Here is a copy of her last two messages:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;DUDE ok just bringing up the musical to me makes me hella happy. Thank you.  Out of all the productions I&amp;#39;ve ever worked on outside and inside of school, it was definitely one of the most badass things ever. I know you said to not apologize, but I have to. I have to add on a few things I forgot to mention last night. Something else that&amp;#39;s not helping is the fact that my scars are fading. I don&amp;#39;t want them to be there, but I do. I don&amp;#39;t want them to be there because they make me uglier than I already am. And what if I get a boyfriend? HA, that&amp;#39;s a slim chance, but what if I do? I&amp;#39;m positive every single guy on the planet would leave their girlfriend if they saw they had scars. We both know that&amp;#39;s true. As much as those things suck and make me want to never see scars again, seeing them fade is one of the most triggering things ever. It&amp;#39;s a reminder that I haven&amp;#39;t done it for awhile which makes me miss it even more. Something else that I&amp;#39;m worried about is this summer. If I&amp;#39;m still trying to stay clean, by/during summer, it&amp;#39;s going to be an even bigger struggle. Summer is either the best or the worst thing ever. There is no in between. I hate summer because you&amp;#39;re expected to wear shorts and I have to be cautious of what types of shorts I wear because of scars on my thighs. They&amp;#39;ve faded, but they&amp;#39;re still clearly visible. I hate summer because it reminds me of how lost I really am. Actually, I don&amp;#39;t even know if I consider myself lost. When you&amp;#39;re lost, you know where you&amp;#39;re supposed to be but you don&amp;#39;t know how to get there. I don&amp;#39;t even know where I&amp;#39;m supposed to be. Anyway, I still hang out with people and some of the best memories of my entire life have been during the summer, but at the same time, I spend so much time being alone. I could be out with my friends, but half the time I&amp;#39;m up at 5:00 am because I can&amp;#39;t sleep, thinking about how much my life has fallen apart, how much I hate myself, and how insignificant my life is. Some people who I thought I mattered to don&amp;#39;t even talk to me the whole summer. I can be forgotten so easily. It&amp;#39;s going to be rough to not relapse when all those things are working against me. And for the past two summers, my self-harm has gotten worse. I started in eighth grade. More specifically, February 2012. Summer 2012 going into freshman year was when it got worse. October 2012 it got even worse. February 2013 it became even more serious, but then it hit summer 2013 going into this school year and I don&amp;#39;t think I&amp;#39;ve ever been that damaged in my entire life. That&amp;#39;s when it became severe and when I started doing it more frequently than I ever have before. If summer 2012 and summer 2013 were both times I&amp;#39;ve pinpointed where it had gotten worse, what would make this summer any different? I&amp;#39;ve never seriously tried to kill myself, but I&amp;#39;ve came somewhat close. June 20th, 2013 was a horrible day. I remember before I went to bed that night I just took a handful of pills. I don&amp;#39;t know how many there were because I didn&amp;#39;t bother to count, but I took them and thought nothing else. I knew they most likely weren&amp;#39;t going to kill me, but I knew there was still a chance and I couldn&amp;#39;t care less. I didn&amp;#39;t know if it wouldn&amp;#39;t even do anything at all, I didn&amp;#39;t know if I&amp;#39;d just sleep well, I didn&amp;#39;t know if I&amp;#39;d be put in a deep sleep, I didn&amp;#39;t know if I&amp;#39;d end up in the hospital, I didn&amp;#39;t know if I&amp;#39;d just feel like crap the next day, I didn&amp;#39;t know if I&amp;#39;d die and I just couldn&amp;#39;t care less. Like I said, I knew I probably didn&amp;#39;t die, but I wish I did. I&amp;#39;m sick of waking up in my skin. I&amp;#39;m sick of waking up at all. I wish I could go back to that night and tell myself to take four times as many pills as I did. That probably would&amp;#39;ve killed me. I should have died that day. I wish I did. I know that when it comes to that day again this year, I&amp;#39;m going to be a wreck. Unless some miracle happens by then and I realize I have a reason to live (HA, which is a joke) then I don&amp;#39;t know how I&amp;#39;m going to deal with that day. I know it&amp;#39;ll be a struggle to not relapse. And even if I don&amp;#39;t, it&amp;#39;s still going to be a rough day. I just feel like I&amp;#39;m too far gone. I&amp;#39;m too far gone to recover from self-harm. I&amp;#39;m too far gone to even live. Those took awhile to explain so I&amp;#39;m sorry about that, but I had to say them.  But to get back on track to what you were saying last night, please don&amp;#39;t be worried. It&amp;#39;s just me. I appreciate FAR more than you know your willingness to understand and help me. I don&amp;#39;t know why you have stayed by my side, but I&amp;#39;m not going to question it because most people leave me so I appreciate this all. I&amp;#39;ll keep going (for now at least), but I just don&amp;#39;t feel very hopeful. You said you believe in me, but I highly doubt I can do this. Why do you say I can do this and you believe in me? I already told you that people stay clean and then give in. Why would I not be one of those people? And even if I have the potential, I&amp;#39;m just not getting anything from it so far. You&amp;#39;re not going to win a battle if you don&amp;#39;t want it and that&amp;#39;s my problem. I don&amp;#39;t see why I should do this. I&amp;#39;d have a bigger will to fight if I had a reason. It&amp;#39;s just so hard. It&amp;#39;s hard to make a change, but it&amp;#39;s harder when I&amp;#39;m not even sure if I want to. I wish I never quit. Or I just never started in the first place. Or I could have just never been born. That is basically the root to all my problems. I literally have no clue why I haven&amp;#39;t relapsed. I&amp;#39;ve been telling myself not to, but I don&amp;#39;t understand why. I have no clue where I stand right now and I want to cry. Another reason why I should act on the impulse is because I won&amp;#39;t have to deal with all the question if I can do it, how I can do it, if I deserve it, or how I can stop missing it. And like I said, it was helping me, so why not? I just don&amp;#39;t know anymore. I&amp;#39;m sorry if this didn&amp;#39;t make sense again. Everything just sucks. Please, please, please just let me die or at least sleep for like 50 days. I&amp;#39;m 1080% done with everything. I&amp;#39;m sorry. I&amp;#39;m sorry if you&amp;#39;re disappointed in me. Thank you for listening to me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey. If you can, may I please talk to you? I can imagine I&amp;#39;m the last person you want to talk to, but I need to just say what&amp;#39;s all on my mind ASAP, even though I&amp;#39;m not exactly sure what&amp;#39;s going on. I know you&amp;#39;re going to be upset with me, but I relapsed. I&amp;#39;m sorry, I just couldn&amp;#39;t do it...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;TLDR: Long history of self harm, no self worth, wishes she had killed herself in the past. Be clean from self harm for a few months, recently relapsed.&lt;/p&gt;\n\n&lt;p&gt;For anyone who gets through that wall of text thank you. I just don&amp;#39;t know what to do anymore. I have read the sidebar help, have tried being compassionate and non judgmental as I can, but I don&amp;#39;t know if I can do this anymore. I am seriously worried for her and her well being, but I don&amp;#39;t know if I am up to being an emotional outlet. I wish she would try to get help from someone more professional, but she is averse to the idea.&lt;/p&gt;\n\n&lt;p&gt;Anyone here who can give me advice on how to approach the situation, or where I can direct her would be greatly appreciated. Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I need help with a friend who is very depressed, with moderate suicidal tendencies. She and I are not really that close in day to day life, but I was always nice to her (back in high school, I am in college now), and maybe she looked up to me or something, so she often messages me on facebook to talk about her issues, and I try to help when I can. Here is a copy of her last two messages:\n\n\"DUDE ok just bringing up the musical to me makes me hella happy. Thank you.  Out of all the productions I've ever worked on outside and inside of school, it was definitely one of the most badass things ever. I know you said to not apologize, but I have to. I have to add on a few things I forgot to mention last night. Something else that's not helping is the fact that my scars are fading. I don't want them to be there, but I do. I don't want them to be there because they make me uglier than I already am. And what if I get a boyfriend? HA, that's a slim chance, but what if I do? I'm positive every single guy on the planet would leave their girlfriend if they saw they had scars. We both know that's true. As much as those things suck and make me want to never see scars again, seeing them fade is one of the most triggering things ever. It's a reminder that I haven't done it for awhile which makes me miss it even more. Something else that I'm worried about is this summer. If I'm still trying to stay clean, by/during summer, it's going to be an even bigger struggle. Summer is either the best or the worst thing ever. There is no in between. I hate summer because you're expected to wear shorts and I have to be cautious of what types of shorts I wear because of scars on my thighs. They've faded, but they're still clearly visible. I hate summer because it reminds me of how lost I really am. Actually, I don't even know if I consider myself lost. When you're lost, you know where you're supposed to be but you don't know how to get there. I don't even know where I'm supposed to be. Anyway, I still hang out with people and some of the best memories of my entire life have been during the summer, but at the same time, I spend so much time being alone. I could be out with my friends, but half the time I'm up at 5:00 am because I can't sleep, thinking about how much my life has fallen apart, how much I hate myself, and how insignificant my life is. Some people who I thought I mattered to don't even talk to me the whole summer. I can be forgotten so easily. It's going to be rough to not relapse when all those things are working against me. And for the past two summers, my self-harm has gotten worse. I started in eighth grade. More specifically, February 2012. Summer 2012 going into freshman year was when it got worse. October 2012 it got even worse. February 2013 it became even more serious, but then it hit summer 2013 going into this school year and I don't think I've ever been that damaged in my entire life. That's when it became severe and when I started doing it more frequently than I ever have before. If summer 2012 and summer 2013 were both times I've pinpointed where it had gotten worse, what would make this summer any different? I've never seriously tried to kill myself, but I've came somewhat close. June 20th, 2013 was a horrible day. I remember before I went to bed that night I just took a handful of pills. I don't know how many there were because I didn't bother to count, but I took them and thought nothing else. I knew they most likely weren't going to kill me, but I knew there was still a chance and I couldn't care less. I didn't know if it wouldn't even do anything at all, I didn't know if I'd just sleep well, I didn't know if I'd be put in a deep sleep, I didn't know if I'd end up in the hospital, I didn't know if I'd just feel like crap the next day, I didn't know if I'd die and I just couldn't care less. Like I said, I knew I probably didn't die, but I wish I did. I'm sick of waking up in my skin. I'm sick of waking up at all. I wish I could go back to that night and tell myself to take four times as many pills as I did. That probably would've killed me. I should have died that day. I wish I did. I know that when it comes to that day again this year, I'm going to be a wreck. Unless some miracle happens by then and I realize I have a reason to live (HA, which is a joke) then I don't know how I'm going to deal with that day. I know it'll be a struggle to not relapse. And even if I don't, it's still going to be a rough day. I just feel like I'm too far gone. I'm too far gone to recover from self-harm. I'm too far gone to even live. Those took awhile to explain so I'm sorry about that, but I had to say them.  But to get back on track to what you were saying last night, please don't be worried. It's just me. I appreciate FAR more than you know your willingness to understand and help me. I don't know why you have stayed by my side, but I'm not going to question it because most people leave me so I appreciate this all. I'll keep going (for now at least), but I just don't feel very hopeful. You said you believe in me, but I highly doubt I can do this. Why do you say I can do this and you believe in me? I already told you that people stay clean and then give in. Why would I not be one of those people? And even if I have the potential, I'm just not getting anything from it so far. You're not going to win a battle if you don't want it and that's my problem. I don't see why I should do this. I'd have a bigger will to fight if I had a reason. It's just so hard. It's hard to make a change, but it's harder when I'm not even sure if I want to. I wish I never quit. Or I just never started in the first place. Or I could have just never been born. That is basically the root to all my problems. I literally have no clue why I haven't relapsed. I've been telling myself not to, but I don't understand why. I have no clue where I stand right now and I want to cry. Another reason why I should act on the impulse is because I won't have to deal with all the question if I can do it, how I can do it, if I deserve it, or how I can stop missing it. And like I said, it was helping me, so why not? I just don't know anymore. I'm sorry if this didn't make sense again. Everything just sucks. Please, please, please just let me die or at least sleep for like 50 days. I'm 1080% done with everything. I'm sorry. I'm sorry if you're disappointed in me. Thank you for listening to me.\"\n\n\n\"Hey. If you can, may I please talk to you? I can imagine I'm the last person you want to talk to, but I need to just say what's all on my mind ASAP, even though I'm not exactly sure what's going on. I know you're going to be upset with me, but I relapsed. I'm sorry, I just couldn't do it...\"\n\n\nTLDR: Long history of self harm, no self worth, wishes she had killed herself in the past. Be clean from self harm for a few months, recently relapsed.\n\n\nFor anyone who gets through that wall of text thank you. I just don't know what to do anymore. I have read the sidebar help, have tried being compassionate and non judgmental as I can, but I don't know if I can do this anymore. I am seriously worried for her and her well being, but I don't know if I am up to being an emotional outlet. I wish she would try to get help from someone more professional, but she is averse to the idea.\n\nAnyone here who can give me advice on how to approach the situation, or where I can direct her would be greatly appreciated. Thanks", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24mfp6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "maestro02", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24mfp6/help_with_a_friend_i_dont_know_what_to_do/", "name": "t3_24mfp6", "created": 1399156932.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24mfp6/help_with_a_friend_i_dont_know_what_to_do/", "author_flair_text": null, "title": "Help with a friend. I don't know what to do.", "created_utc": 1399128132.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8m8wf", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24mfp6", "approved_by": null, "body": "Self harm (and her entire message) is a big cry for help.\n\nFirst, explain to her that NO ONE is EVER \"too far gone\" when it comes to depression. No one.  She recognizes she's in pain and needs help. That's a big step all in itself.  If she knows she needs help then maybe help her look for it. A school guidance counselor or social worker might be a good option.\n\nSecond, high school is a shitty time for a lot of people. It was for me. But  she has the strength to shoulder her way through it. It may take a lot of effort but this pain, and her troubles, are temporary. Things will improve eventually.  If she needs some inspiration, remind her of how many celebrities had a shitty time in high school too. But they survived and so can she.\n\nThird, if you're seriously worried for her, tell someone. Call a sympathetic adult (relative, teacher, principal, etc) who will intervene on her behalf.  She may hate you for it, but it's better than risking her hurting herself.\n\nI hope things work out for you and your friend. Good luck.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Self harm (and her entire message) is a big cry for help.&lt;/p&gt;\n\n&lt;p&gt;First, explain to her that NO ONE is EVER &amp;quot;too far gone&amp;quot; when it comes to depression. No one.  She recognizes she&amp;#39;s in pain and needs help. That&amp;#39;s a big step all in itself.  If she knows she needs help then maybe help her look for it. A school guidance counselor or social worker might be a good option.&lt;/p&gt;\n\n&lt;p&gt;Second, high school is a shitty time for a lot of people. It was for me. But  she has the strength to shoulder her way through it. It may take a lot of effort but this pain, and her troubles, are temporary. Things will improve eventually.  If she needs some inspiration, remind her of how many celebrities had a shitty time in high school too. But they survived and so can she.&lt;/p&gt;\n\n&lt;p&gt;Third, if you&amp;#39;re seriously worried for her, tell someone. Call a sympathetic adult (relative, teacher, principal, etc) who will intervene on her behalf.  She may hate you for it, but it&amp;#39;s better than risking her hurting herself.&lt;/p&gt;\n\n&lt;p&gt;I hope things work out for you and your friend. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mfp6", "score_hidden": false, "name": "t1_ch8m8wf", "created": 1399165926.0, "author_flair_text": null, "created_utc": 1399137126.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chanc65", "gilded": 0, "author": "Lostinthewoods42", "parent_id": "t3_24mfp6", "approved_by": null, "body": "\nA couple of my friends were in the same situation, but they didn't talk as much as your friend does. I think that's a sign that she really wants help, especially from you since you seem to be the only one she trusts. You say she does not want to get professional help, but imo it's one of the best things to help her. I'm telling this but really I don't know shit im only 15.. Anyways i've been in the same situation as you and I've managed to get one of my friend out of self harm and suicide by taking her to the school psycologist (\"psychologue\" I only know the word in french sorry look it up) so i don't know how different you have to act since you are clearly plder than me. Anyways hope that helps a bit amd I really hopw your friend gets better. Everyone is worth living and I love her.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A couple of my friends were in the same situation, but they didn&amp;#39;t talk as much as your friend does. I think that&amp;#39;s a sign that she really wants help, especially from you since you seem to be the only one she trusts. You say she does not want to get professional help, but imo it&amp;#39;s one of the best things to help her. I&amp;#39;m telling this but really I don&amp;#39;t know shit im only 15.. Anyways i&amp;#39;ve been in the same situation as you and I&amp;#39;ve managed to get one of my friend out of self harm and suicide by taking her to the school psycologist (&amp;quot;psychologue&amp;quot; I only know the word in french sorry look it up) so i don&amp;#39;t know how different you have to act since you are clearly plder than me. Anyways hope that helps a bit amd I really hopw your friend gets better. Everyone is worth living and I love her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mfp6", "score_hidden": false, "name": "t1_chanc65", "created": 1399373672.0, "author_flair_text": null, "created_utc": 1399344872.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]