[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband. I live for him. I&amp;#39;ve started to formulate hundreds of plans that take place if I lose him. He is the balm for my broken heart and I know I&amp;#39;m playing a dangerous game by placing all of my existence in his hands. But there it is. I have my reason to live, even as I count the ones to die.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s funny because it&amp;#39;s my job to stop people from killing themselves. I&amp;#39;ve talked people out of taking pills, pulling triggers, slicing their wrists... And everyone tells me how good I am at it. I derive a sort of satisfaction in pulling people out of that dark place because I figure if I can take one more day, maybe I can encourage them to too. I almost feel like I&amp;#39;m worth something when I successfully get someone transported to a hospital. Then I remember that they&amp;#39;re dead. I was pregnant three times. Three times they died. I feel like a fucking idiot because they were never far along. But secretly I still named them, cried for them, grieved for these sparks of life that were not human enough to deserve mourning from anyone but their mother. &lt;/p&gt;\n\n&lt;p&gt;My husband tries to understand. He has been beyond patient and loving. Some days I feel okay. I can forget that I will never be a real mother. Then someone asks a stupid question or suggests I adopt. I don&amp;#39;t want a kid. I don&amp;#39;t want someone else&amp;#39;s baby. I never even wanted to be pregnant. But once it happened... There I was. In love with the unexpected I was expecting. I was so stupid to get my hopes up each time. Each time I would tell myself, &amp;quot;they&amp;#39;re going to die, you know.&amp;quot; And each time I would find some shred of hope to grasp until the end. &lt;/p&gt;\n\n&lt;p&gt;So now I live in a body that I hate. I&amp;#39;m stuck here until the only person I truly love leaves the world. Then I will disappear. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My husband. I live for him. I've started to formulate hundreds of plans that take place if I lose him. He is the balm for my broken heart and I know I'm playing a dangerous game by placing all of my existence in his hands. But there it is. I have my reason to live, even as I count the ones to die.\n\nIt's funny because it's my job to stop people from killing themselves. I've talked people out of taking pills, pulling triggers, slicing their wrists... And everyone tells me how good I am at it. I derive a sort of satisfaction in pulling people out of that dark place because I figure if I can take one more day, maybe I can encourage them to too. I almost feel like I'm worth something when I successfully get someone transported to a hospital. Then I remember that they're dead. I was pregnant three times. Three times they died. I feel like a fucking idiot because they were never far along. But secretly I still named them, cried for them, grieved for these sparks of life that were not human enough to deserve mourning from anyone but their mother. \n\nMy husband tries to understand. He has been beyond patient and loving. Some days I feel okay. I can forget that I will never be a real mother. Then someone asks a stupid question or suggests I adopt. I don't want a kid. I don't want someone else's baby. I never even wanted to be pregnant. But once it happened... There I was. In love with the unexpected I was expecting. I was so stupid to get my hopes up each time. Each time I would tell myself, \"they're going to die, you know.\" And each time I would find some shred of hope to grasp until the end. \n\nSo now I live in a body that I hate. I'm stuck here until the only person I truly love leaves the world. Then I will disappear. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bo8e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Audubonbaby", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bo8e/hes_the_only_thing_keeping_me_alive/", "name": "t3_25bo8e", "created": 1399887075.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bo8e/hes_the_only_thing_keeping_me_alive/", "author_flair_text": null, "title": "He's The Only Thing Keeping Me Alive", "created_utc": 1399858275.0, "ups": 1, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgr1dh", "gilded": 0, "author": "TouchingMeTouchingU", "parent_id": "t1_chgf8xs", "approved_by": null, "body": "i'm so glad that you feel like you are able to work towards getting to a better place. you're stronger than you think, and you just need some time to prove that to yourself. congrats on taking the high road today at work... god only knows how hard that is sometimes. \n\nbest of luck with your appointment and finding a good counselor. if you ever need to chat, just let me know! on here or i'm on kik with the same username. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m so glad that you feel like you are able to work towards getting to a better place. you&amp;#39;re stronger than you think, and you just need some time to prove that to yourself. congrats on taking the high road today at work... god only knows how hard that is sometimes. &lt;/p&gt;\n\n&lt;p&gt;best of luck with your appointment and finding a good counselor. if you ever need to chat, just let me know! on here or i&amp;#39;m on kik with the same username. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo8e", "score_hidden": false, "name": "t1_chgr1dh", "created": 1400009878.0, "author_flair_text": null, "created_utc": 1399981078.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgf8xs", "gilded": 0, "author": "Audubonbaby", "parent_id": "t1_chfy3zd", "approved_by": null, "body": "From the bottom of my heart, thank you. I have a doctors appointment Wednesday to talk to him about anxiety and grief. I took the high ground today at work. I didn't participate in back biting, in losing control, or in letting others control me. And despite it being a hectic day at work, I was okay. I know every day won't be as okay, but it's a work in progress.\n\nI'm looking for a good grief counselor to help me work through the loss, but on my terms. And I'm grateful. For people in the world like you. For guardians like my husband and family. There's some good. To much for throwing away.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From the bottom of my heart, thank you. I have a doctors appointment Wednesday to talk to him about anxiety and grief. I took the high ground today at work. I didn&amp;#39;t participate in back biting, in losing control, or in letting others control me. And despite it being a hectic day at work, I was okay. I know every day won&amp;#39;t be as okay, but it&amp;#39;s a work in progress.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m looking for a good grief counselor to help me work through the loss, but on my terms. And I&amp;#39;m grateful. For people in the world like you. For guardians like my husband and family. There&amp;#39;s some good. To much for throwing away.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo8e", "score_hidden": false, "name": "t1_chgf8xs", "created": 1399970041.0, "author_flair_text": null, "created_utc": 1399941241.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfy3zd", "gilded": 0, "author": "TouchingMeTouchingU", "parent_id": "t1_chfnt0p", "approved_by": null, "body": "I believe that the only person that can define the validity of your need to grieve is YOU. It doesn't matter what other people think. Don't let what they say control you. You have every right and reason to feel the way you do about your loss. Tell yourself that its ok. And find people that will support you in your healing process. I promise you that there are people out there that can be your support. Thousands of women have been right where you are right now and can be there to relate and to support you during the healing process. \n\nYou know that people use different methods to cope with their problems, and I think that your mother is trying to push you in a direction that would work for her: distracting her from the pain allows her not to have to think about it. She wants you to do the same thing with trying to have another child, as if having another child in your life will fill that void that you have in your life right now. I don't believe that her suggestion is malicious in any way, but i also don't believe it is an effective method of dealing with your grief. I think you feel the same way. Try and make her hear you: having another child will not make the pain go away, and the risk of another miscarriage is too big to have to go through again. You have every right to feel this way. You need to find another method of healing and you need her to support you in the method that YOU choose. I believe that she loves you and can be a wonderful asset for you during the healing process if you can get her to understand where you are coming from. \n\nregarding the situation at work; i don't know where you live but here in the US, that could be construed as a serious HR offense on their part. If you work for a large company, you can talk to someone in the HR department. Using a mother's grief as a suggestion of the reason behind another problem at work is disgraceful. I'm sorry that you have to deal with insensitive assholes like that. However, you can be totally in charge of how you react to this situation. Right now, you are letting your emotional response control your entire feeling towards work. And even though that is pretty normal, it doesn't have to dictate your feeling towards work going forward. I know its hard, but tell yourself that you arent going to let these jerks ruin your day, or your week. YOU will decide how you feel today. If someone suggests that you are having a conflict because of your grief, politely explain to them that is simply not the case. You should have sufficient evidence of why you feel threatened by your coworker. Use that as your defense. \n\nTake control. You have the power to do so. I know, i know it seems impossible and overwhelming at times. Lean on your loved ones when times get hard. But be determined to take control of your life. You can do it! Don't let other people control how you feel. Once you take control, you will find yourself in a better place. Let me know what i can do to help. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that the only person that can define the validity of your need to grieve is YOU. It doesn&amp;#39;t matter what other people think. Don&amp;#39;t let what they say control you. You have every right and reason to feel the way you do about your loss. Tell yourself that its ok. And find people that will support you in your healing process. I promise you that there are people out there that can be your support. Thousands of women have been right where you are right now and can be there to relate and to support you during the healing process. &lt;/p&gt;\n\n&lt;p&gt;You know that people use different methods to cope with their problems, and I think that your mother is trying to push you in a direction that would work for her: distracting her from the pain allows her not to have to think about it. She wants you to do the same thing with trying to have another child, as if having another child in your life will fill that void that you have in your life right now. I don&amp;#39;t believe that her suggestion is malicious in any way, but i also don&amp;#39;t believe it is an effective method of dealing with your grief. I think you feel the same way. Try and make her hear you: having another child will not make the pain go away, and the risk of another miscarriage is too big to have to go through again. You have every right to feel this way. You need to find another method of healing and you need her to support you in the method that YOU choose. I believe that she loves you and can be a wonderful asset for you during the healing process if you can get her to understand where you are coming from. &lt;/p&gt;\n\n&lt;p&gt;regarding the situation at work; i don&amp;#39;t know where you live but here in the US, that could be construed as a serious HR offense on their part. If you work for a large company, you can talk to someone in the HR department. Using a mother&amp;#39;s grief as a suggestion of the reason behind another problem at work is disgraceful. I&amp;#39;m sorry that you have to deal with insensitive assholes like that. However, you can be totally in charge of how you react to this situation. Right now, you are letting your emotional response control your entire feeling towards work. And even though that is pretty normal, it doesn&amp;#39;t have to dictate your feeling towards work going forward. I know its hard, but tell yourself that you arent going to let these jerks ruin your day, or your week. YOU will decide how you feel today. If someone suggests that you are having a conflict because of your grief, politely explain to them that is simply not the case. You should have sufficient evidence of why you feel threatened by your coworker. Use that as your defense. &lt;/p&gt;\n\n&lt;p&gt;Take control. You have the power to do so. I know, i know it seems impossible and overwhelming at times. Lean on your loved ones when times get hard. But be determined to take control of your life. You can do it! Don&amp;#39;t let other people control how you feel. Once you take control, you will find yourself in a better place. Let me know what i can do to help. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo8e", "score_hidden": false, "name": "t1_chfy3zd", "created": 1399933486.0, "author_flair_text": null, "created_utc": 1399904686.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfnt0p", "gilded": 0, "author": "Audubonbaby", "parent_id": "t1_chfm2to", "approved_by": null, "body": "I feel like my grief is foolish because everyone keeps telling me that having a baby will solve the problem. My mother keeps telling me just to keep trying. I think three miscarriages is enough. But people keep pushing and saying, \"Why not just get a surrogate? Why not adopt?\" I don't want to. So I feel like it's my fault I'm still feeling the loneliness. \n\nTo make matters worse people have been using my grief against me. I recently placed a complaint at work because another employee has been making my workplace hostile. I told my bosses how much I hate being at work because of him. They asked me if i was really just still upset because of my miscarriages. I was so angry I couldn't do anything but cry. It was infuriating to basically be called emotionally unstable and seeing things that weren't there because of my grief. \n\nNow I have panic attacks at the thought of going to work. I don't want to leave my house but I'm forced to because I have bills.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like my grief is foolish because everyone keeps telling me that having a baby will solve the problem. My mother keeps telling me just to keep trying. I think three miscarriages is enough. But people keep pushing and saying, &amp;quot;Why not just get a surrogate? Why not adopt?&amp;quot; I don&amp;#39;t want to. So I feel like it&amp;#39;s my fault I&amp;#39;m still feeling the loneliness. &lt;/p&gt;\n\n&lt;p&gt;To make matters worse people have been using my grief against me. I recently placed a complaint at work because another employee has been making my workplace hostile. I told my bosses how much I hate being at work because of him. They asked me if i was really just still upset because of my miscarriages. I was so angry I couldn&amp;#39;t do anything but cry. It was infuriating to basically be called emotionally unstable and seeing things that weren&amp;#39;t there because of my grief. &lt;/p&gt;\n\n&lt;p&gt;Now I have panic attacks at the thought of going to work. I don&amp;#39;t want to leave my house but I&amp;#39;m forced to because I have bills.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo8e", "score_hidden": false, "name": "t1_chfnt0p", "created": 1399892891.0, "author_flair_text": null, "created_utc": 1399864091.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfm2to", "gilded": 0, "author": "TouchingMeTouchingU", "parent_id": "t3_25bo8e", "approved_by": null, "body": "I have a lot of questions for you. Why do you think it was wrong of you to love the thought of having a baby? Why was it wrong to get your hopes up? Why do you not feel like you can grieve for your unborn children?\n\nI believe that it is perfectly natural to experience grief because of a miscarriage. I know that I would be devastated if my wife miscarried our child. I would grieve for that child never knowing life, and for me not being able to show that child all the love I could. \n\nGrieve for you loss. It is absolutely ok for you to do so. The hurt and pain will never disappear completely, but I believe that you can only learn to overcome the grief if you face it, and allow yourself to grieve. With time to heal, I believe that you can be happy again, but that healing process is crucial. Talk to a counselor. Lean on your friends and family for support. Allow yourself to grieve, and allow yourself to heal. I wish you the best!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a lot of questions for you. Why do you think it was wrong of you to love the thought of having a baby? Why was it wrong to get your hopes up? Why do you not feel like you can grieve for your unborn children?&lt;/p&gt;\n\n&lt;p&gt;I believe that it is perfectly natural to experience grief because of a miscarriage. I know that I would be devastated if my wife miscarried our child. I would grieve for that child never knowing life, and for me not being able to show that child all the love I could. &lt;/p&gt;\n\n&lt;p&gt;Grieve for you loss. It is absolutely ok for you to do so. The hurt and pain will never disappear completely, but I believe that you can only learn to overcome the grief if you face it, and allow yourself to grieve. With time to heal, I believe that you can be happy again, but that healing process is crucial. Talk to a counselor. Lean on your friends and family for support. Allow yourself to grieve, and allow yourself to heal. I wish you the best!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo8e", "score_hidden": false, "name": "t1_chfm2to", "created": 1399888948.0, "author_flair_text": null, "created_utc": 1399860148.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]