[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mum and I have never gotten along, ever since I was eight or nine. I got bullied and school and fought back...got suspended. She hated me. She still does. My dad is not in the picture.&lt;/p&gt;\n\n&lt;p&gt;Few days ago, I was locked out of my mum&amp;#39;s house because one of my lazy fucking brothers didn&amp;#39;t put the spare key back. I got mad, kicked the storm door, put a dent in it. My lazy as shit brother FINALLY got his lazy ass out of bed to let me in, after I sat there for thirty fucking minutes outside with a dead phone, waiting. My mum came home, saw the not-even-slightly-dented storm door and freaked the fuck out. Yelling, screaming, etc. &lt;/p&gt;\n\n&lt;p&gt;I got drunk. Very drunk. I went upstairs, grabbed a knife and began to cut my leg right in front of her. I went back downstairs, and she threatened me--blatantly threatened--to send me to the hospital. There was no, &amp;quot;I&amp;#39;m concerned about you&amp;quot;. There was no, &amp;quot;Why are doing this to yourself?&amp;quot; She just said straight up, &amp;quot;YOU&amp;#39;RE GOING TO THE HOSPITAL WHETHER YOU LIKE IT OR NOT.&amp;quot; Well, instead of letting me go to my room or at least go outside and cool down, my mum starts physically getting in front of me and PUSHING ME back towards my computer desk, which is positioned near a corner so I couldn&amp;#39;t get out. She pushed me up against the desk, and I just fucking lost it. I backhanded her in the face. She recoiled enough that I could get away from her, but as I was walking up the stairs, she grabbed an electronic keyboard and fucking hit me with it about fifty times. I threw a few things at her--my wine bottle, a book--and she kept following me upstairs. I made a grab for the knife to cut myself again, and she fought with me over it. She immediately kicked me out of the house. I had nothing except my wallet, phone, phone charger.&lt;/p&gt;\n\n&lt;p&gt;Nobody would let me stay with them for a while until I could figure something out. I called three or four different friends. Even my own girlfriend wouldn&amp;#39;t let me stay with her. I was forced to go to a homeless shelter. It is literally the worst place I have ever been in my life. Everything is micro managed, and you are treated like a very small child. They must know your whereabouts at all times, and you must be back by 10pm (unless you&amp;#39;re working). The people in my room despise me and constantly accuse me of smelling bad, even though I shower every fucking day. The police and paramedics constantly visit due to drug busts, theft and other shit. I don&amp;#39;t speak to ANYONE at the shelter, and I feel completely alone while I&amp;#39;m there. &lt;/p&gt;\n\n&lt;p&gt;Because of the way the shelters work, I can only be there until May 19th. I found a nice 2 bedroom apartment that my girlfriend and best friend will split cash for. The people can have me move in on May 15th, but they want the first month&amp;#39;s rent. NBD, ill get temporary welfare to cover the first month, right? Wrong. They want a rental agreement, which I can only get if I pay the first month&amp;#39;s rent...which I have to cover alone. And naturally, my girlfriend and best friend can&amp;#39;t pay into the first month&amp;#39;s rent.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m now homeless, and if I don&amp;#39;t come up with 900$ by Monday, I&amp;#39;ll be on the streets. What the fucking hell do I do?&lt;/p&gt;\n\n&lt;p&gt;I think I should just kill myself. I&amp;#39;m a burden and a cancer to everyone around me, and everyone just wants to fuck me for everything I&amp;#39;m worth. I go try and get a second job as a bartender, and they hire a big titted slut instead...because she&amp;#39;s a slut, and has tits. I WOULD just do landscaping, but I&amp;#39;m fat and incredibly out of shape. Any way I look at it, I am totally fucked. My job barely pays 800$ a month, and even then, I have bills to pay. Government won&amp;#39;t help, and if I apply for disability, I doubt it will help. I hate money and i despise myself. I despise my mother for doing this to me. I just want out.&lt;/p&gt;\n\n&lt;p&gt;I plan to spend one last night with my girlfriend, then go to my old house and hang myself over the balcony. Teach that fucking cunt a lesson or two.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My mum and I have never gotten along, ever since I was eight or nine. I got bullied and school and fought back...got suspended. She hated me. She still does. My dad is not in the picture.\n\nFew days ago, I was locked out of my mum's house because one of my lazy fucking brothers didn't put the spare key back. I got mad, kicked the storm door, put a dent in it. My lazy as shit brother FINALLY got his lazy ass out of bed to let me in, after I sat there for thirty fucking minutes outside with a dead phone, waiting. My mum came home, saw the not-even-slightly-dented storm door and freaked the fuck out. Yelling, screaming, etc. \n\nI got drunk. Very drunk. I went upstairs, grabbed a knife and began to cut my leg right in front of her. I went back downstairs, and she threatened me--blatantly threatened--to send me to the hospital. There was no, \"I'm concerned about you\". There was no, \"Why are doing this to yourself?\" She just said straight up, \"YOU'RE GOING TO THE HOSPITAL WHETHER YOU LIKE IT OR NOT.\" Well, instead of letting me go to my room or at least go outside and cool down, my mum starts physically getting in front of me and PUSHING ME back towards my computer desk, which is positioned near a corner so I couldn't get out. She pushed me up against the desk, and I just fucking lost it. I backhanded her in the face. She recoiled enough that I could get away from her, but as I was walking up the stairs, she grabbed an electronic keyboard and fucking hit me with it about fifty times. I threw a few things at her--my wine bottle, a book--and she kept following me upstairs. I made a grab for the knife to cut myself again, and she fought with me over it. She immediately kicked me out of the house. I had nothing except my wallet, phone, phone charger.\n\nNobody would let me stay with them for a while until I could figure something out. I called three or four different friends. Even my own girlfriend wouldn't let me stay with her. I was forced to go to a homeless shelter. It is literally the worst place I have ever been in my life. Everything is micro managed, and you are treated like a very small child. They must know your whereabouts at all times, and you must be back by 10pm (unless you're working). The people in my room despise me and constantly accuse me of smelling bad, even though I shower every fucking day. The police and paramedics constantly visit due to drug busts, theft and other shit. I don't speak to ANYONE at the shelter, and I feel completely alone while I'm there. \n\nBecause of the way the shelters work, I can only be there until May 19th. I found a nice 2 bedroom apartment that my girlfriend and best friend will split cash for. The people can have me move in on May 15th, but they want the first month's rent. NBD, ill get temporary welfare to cover the first month, right? Wrong. They want a rental agreement, which I can only get if I pay the first month's rent...which I have to cover alone. And naturally, my girlfriend and best friend can't pay into the first month's rent.\n\nSo I'm now homeless, and if I don't come up with 900$ by Monday, I'll be on the streets. What the fucking hell do I do?\n\nI think I should just kill myself. I'm a burden and a cancer to everyone around me, and everyone just wants to fuck me for everything I'm worth. I go try and get a second job as a bartender, and they hire a big titted slut instead...because she's a slut, and has tits. I WOULD just do landscaping, but I'm fat and incredibly out of shape. Any way I look at it, I am totally fucked. My job barely pays 800$ a month, and even then, I have bills to pay. Government won't help, and if I apply for disability, I doubt it will help. I hate money and i despise myself. I despise my mother for doing this to me. I just want out.\n\nI plan to spend one last night with my girlfriend, then go to my old house and hang myself over the balcony. Teach that fucking cunt a lesson or two.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ms6j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BillDickles", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ms6j/homeless_and_ready_to_kill_myself/", "name": "t3_24ms6j", "created": 1399166546.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ms6j/homeless_and_ready_to_kill_myself/", "author_flair_text": null, "title": "Homeless and ready to kill myself", "created_utc": 1399137746.0, "ups": 0, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8qeur", "gilded": 0, "author": "BillDickles", "parent_id": "t1_ch8njhn", "approved_by": null, "body": "I've looked at loan options. I really, really don't want to get into any more debt than I'm already in. I'm almost 15,000 $ in the shitter because of school, and I don't even have a degree yet.\n\nI will consider plasma. I'm with my girlfriend now. Things are great when I'm with her, but I know that when she tells me to go, i'll be stuck back in my shitty situation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve looked at loan options. I really, really don&amp;#39;t want to get into any more debt than I&amp;#39;m already in. I&amp;#39;m almost 15,000 $ in the shitter because of school, and I don&amp;#39;t even have a degree yet.&lt;/p&gt;\n\n&lt;p&gt;I will consider plasma. I&amp;#39;m with my girlfriend now. Things are great when I&amp;#39;m with her, but I know that when she tells me to go, i&amp;#39;ll be stuck back in my shitty situation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ms6j", "score_hidden": false, "name": "t1_ch8qeur", "created": 1399176426.0, "author_flair_text": null, "created_utc": 1399147626.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8njhn", "gilded": 0, "author": "allyouneediscats", "parent_id": "t3_24ms6j", "approved_by": null, "body": "I think you should ask for help from someone you know. A close friend, or your girlfriend. Let someone know that you are contemplating suicide. They may be able to change your mind, or give you hope that things will get better.\n\nI'm sure that your girlfriend and friends don't see you as a burden like you see yourself. I'm sure they had their reasons why they couldn't let you stay with them. But you have to take care of yourself in the world when no one else will. Which you did. You found a shelter on your own and you're abiding by the strict rules in order to stay there. That's more than some people I know can say. At least you're not on the streets, or doing illegal things for a place to stay.\n\nYou have a job, you have a girlfriend, you have a plan for what to do when you can no longer stay at the shelter. I really think you will make it through this. You seem smart enough to find a way out of this shitty situation.\n\nEdit: Have you ever tried donating plasma for money? I know people who do it. You don't earn great money doing it, but you can donate every week or two weeks I think. Or maybe you could take out some sort of loan?\n\nIf you can't come up with the money you need to rent the apartment, maybe you could try staying at a weekly or nightly motel until then. They suck, but it would be better than being completely homeless. You're just in between homes, is what I would call it.", "edited": 1399140708.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should ask for help from someone you know. A close friend, or your girlfriend. Let someone know that you are contemplating suicide. They may be able to change your mind, or give you hope that things will get better.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure that your girlfriend and friends don&amp;#39;t see you as a burden like you see yourself. I&amp;#39;m sure they had their reasons why they couldn&amp;#39;t let you stay with them. But you have to take care of yourself in the world when no one else will. Which you did. You found a shelter on your own and you&amp;#39;re abiding by the strict rules in order to stay there. That&amp;#39;s more than some people I know can say. At least you&amp;#39;re not on the streets, or doing illegal things for a place to stay.&lt;/p&gt;\n\n&lt;p&gt;You have a job, you have a girlfriend, you have a plan for what to do when you can no longer stay at the shelter. I really think you will make it through this. You seem smart enough to find a way out of this shitty situation.&lt;/p&gt;\n\n&lt;p&gt;Edit: Have you ever tried donating plasma for money? I know people who do it. You don&amp;#39;t earn great money doing it, but you can donate every week or two weeks I think. Or maybe you could take out some sort of loan?&lt;/p&gt;\n\n&lt;p&gt;If you can&amp;#39;t come up with the money you need to rent the apartment, maybe you could try staying at a weekly or nightly motel until then. They suck, but it would be better than being completely homeless. You&amp;#39;re just in between homes, is what I would call it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ms6j", "score_hidden": false, "name": "t1_ch8njhn", "created": 1399169177.0, "author_flair_text": null, "created_utc": 1399140377.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]