[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,there. I was wandering around the internet, saw this, and since I&amp;#39;m at the end of my rope, I decided &amp;quot;Why not.&amp;quot;\nI&amp;#39;m about to graduate in a couple of days, (BA), but I can&amp;#39;t help but feel absolutely worthless. I&amp;#39;ve tried to get a job, I&amp;#39;ve landed some interviews, the managers absolutely love me...But nothing. This is at retail. It does something to your confidence when you can&amp;#39;t even land those types of jobs, even after you say you are available anytime, anywhere. \nMy problem is really my &amp;quot;support system.&amp;quot; My best friend, who I&amp;#39;ve known for 10 years, never calls me, except for a week out of the entire year. My other friends, I bend over backwards for them, write them letters of recommendations, but when it&amp;#39;s time to help me...Silence. They don&amp;#39;t care. \nThat&amp;#39;s not even the real problem, though. My main problem is my parents. My mom especially. She doesn&amp;#39;t just understand why I don&amp;#39;t just get a job. She graduated with her RN years back, she got a job right out of school, a job was guaranteed for her. She calls me useless on a daily basis, how worthless I am. This has been going on for a while now. My two sisters aren&amp;#39;t even in school, they just sit around all day, not looking for jobs, and everything is peachy keen for them. I volunteer whenever I can, my sisters don&amp;#39;t even do that. My dad calls me a bum, and how stupid I am. \nMy confidence has just been gone for the last couple of months. My boyfriend broke up almost a year ago, but him and his new girlfriend have been harassing me. \nI&amp;#39;m doing great in school, getting mostly A&amp;#39;s in upper-division, but that&amp;#39;s still not enough for my family. I don&amp;#39;t know what to do anymore. I&amp;#39;m just at the end, I don&amp;#39;t see a way out. Suicidal thoughts aren&amp;#39;t new for me, I&amp;#39;ve thought about it on and off for awhile now. I just feel everyone would be better off without me. \nI was in a car accident and upon seeing the wreck, the EMTs were surprised I was alive (my car didn&amp;#39;t have airbags). Why am I alive? I&amp;#39;m no good. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi,there. I was wandering around the internet, saw this, and since I'm at the end of my rope, I decided \"Why not.\"\nI'm about to graduate in a couple of days, (BA), but I can't help but feel absolutely worthless. I've tried to get a job, I've landed some interviews, the managers absolutely love me...But nothing. This is at retail. It does something to your confidence when you can't even land those types of jobs, even after you say you are available anytime, anywhere. \nMy problem is really my \"support system.\" My best friend, who I've known for 10 years, never calls me, except for a week out of the entire year. My other friends, I bend over backwards for them, write them letters of recommendations, but when it's time to help me...Silence. They don't care. \nThat's not even the real problem, though. My main problem is my parents. My mom especially. She doesn't just understand why I don't just get a job. She graduated with her RN years back, she got a job right out of school, a job was guaranteed for her. She calls me useless on a daily basis, how worthless I am. This has been going on for a while now. My two sisters aren't even in school, they just sit around all day, not looking for jobs, and everything is peachy keen for them. I volunteer whenever I can, my sisters don't even do that. My dad calls me a bum, and how stupid I am. \nMy confidence has just been gone for the last couple of months. My boyfriend broke up almost a year ago, but him and his new girlfriend have been harassing me. \nI'm doing great in school, getting mostly A's in upper-division, but that's still not enough for my family. I don't know what to do anymore. I'm just at the end, I don't see a way out. Suicidal thoughts aren't new for me, I've thought about it on and off for awhile now. I just feel everyone would be better off without me. \nI was in a car accident and upon seeing the wreck, the EMTs were surprised I was alive (my car didn't have airbags). Why am I alive? I'm no good. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zq8o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Enviunity", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zq8o/hopeless/", "name": "t3_24zq8o", "created": 1399531220.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zq8o/hopeless/", "author_flair_text": null, "title": "Hopeless.", "created_utc": 1399502420.0, "ups": 2, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcar5y", "gilded": 0, "author": "reverienoire", "parent_id": "t1_chcaf7s", "approved_by": null, "body": "are you religious at all? i'm sorry your best friend has been so dismissive. she sounds totally unequipped to deal with this, and i know how hurtful it can be because i'm in the same boat with a lot of the people in my life.\n\nhow have your parents joked about suicide? to you? in general? if it's to you, in relation to you, that is beyond insensitive. that would be cruel, utterly cruel, and i'd be horrified if it were true. *you deserve better.*\n\nyou're welcome. i'm glad to be here, talking to you.\n\ni feel hopless too, a lot of the time, albeit for different reasons. and it's very hard to keep going when you feel that way. i find the option of suicide very comforting, actually, because it's always there. ironically i suppose that's what does allow me to stay kinda sorta functional - knowing i can check out any time. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;are you religious at all? i&amp;#39;m sorry your best friend has been so dismissive. she sounds totally unequipped to deal with this, and i know how hurtful it can be because i&amp;#39;m in the same boat with a lot of the people in my life.&lt;/p&gt;\n\n&lt;p&gt;how have your parents joked about suicide? to you? in general? if it&amp;#39;s to you, in relation to you, that is beyond insensitive. that would be cruel, utterly cruel, and i&amp;#39;d be horrified if it were true. &lt;em&gt;you deserve better.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;you&amp;#39;re welcome. i&amp;#39;m glad to be here, talking to you.&lt;/p&gt;\n\n&lt;p&gt;i feel hopless too, a lot of the time, albeit for different reasons. and it&amp;#39;s very hard to keep going when you feel that way. i find the option of suicide very comforting, actually, because it&amp;#39;s always there. ironically i suppose that&amp;#39;s what does allow me to stay kinda sorta functional - knowing i can check out any time. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chcar5y", "created": 1399536533.0, "author_flair_text": null, "created_utc": 1399507733.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chcaf7s", "gilded": 0, "author": "Enviunity", "parent_id": "t1_chca2yb", "approved_by": null, "body": "Yes,I'm in the US.\nI do food preparation, I've done customer service in estate sales, cashier jobs for my family (dealing with my grandma's estate), and I've worked as a supervisor's assistant and a teacher for a summer program. \nMy dad is the person in charge of the estate and the money hooplah, and he's tired on the weekends, so he hasn't really worked on it, so there really is nothing to investigate. \n\nThank you for taking the time to talk to me. When I call that best friend, she just always tries to say \"Pray about it\" and be done with the conversation. \nI just don't see the \"light at the end of the tunnel.\" My parents have joked about suicide, but I really do feel I'm at that point.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes,I&amp;#39;m in the US.\nI do food preparation, I&amp;#39;ve done customer service in estate sales, cashier jobs for my family (dealing with my grandma&amp;#39;s estate), and I&amp;#39;ve worked as a supervisor&amp;#39;s assistant and a teacher for a summer program. \nMy dad is the person in charge of the estate and the money hooplah, and he&amp;#39;s tired on the weekends, so he hasn&amp;#39;t really worked on it, so there really is nothing to investigate. &lt;/p&gt;\n\n&lt;p&gt;Thank you for taking the time to talk to me. When I call that best friend, she just always tries to say &amp;quot;Pray about it&amp;quot; and be done with the conversation. \nI just don&amp;#39;t see the &amp;quot;light at the end of the tunnel.&amp;quot; My parents have joked about suicide, but I really do feel I&amp;#39;m at that point.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chcaf7s", "created": 1399535773.0, "author_flair_text": null, "created_utc": 1399506973.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chca2yb", "gilded": 0, "author": "reverienoire", "parent_id": "t1_chc9qkm", "approved_by": null, "body": "your mom *would* say that the economy is fine because she's never had to struggle to find a job. it's easy for her to be dismissive about it. \n\nare you in the us?\n\nwhat kind of volunteering work do you do? \n\ni don't know a lot about trusts, but i would encourage you to look into it (quietly, privately, without your parents knowing if at all possible) and see what's going on. do you know if there's an age limit on it? if there really is supposed to be money there for your college education it should be there. i hope hope hope your parents (or someone else) aren't fucking with it. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;your mom &lt;em&gt;would&lt;/em&gt; say that the economy is fine because she&amp;#39;s never had to struggle to find a job. it&amp;#39;s easy for her to be dismissive about it. &lt;/p&gt;\n\n&lt;p&gt;are you in the us?&lt;/p&gt;\n\n&lt;p&gt;what kind of volunteering work do you do? &lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t know a lot about trusts, but i would encourage you to look into it (quietly, privately, without your parents knowing if at all possible) and see what&amp;#39;s going on. do you know if there&amp;#39;s an age limit on it? if there really is supposed to be money there for your college education it should be there. i hope hope hope your parents (or someone else) aren&amp;#39;t fucking with it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chca2yb", "created": 1399534998.0, "author_flair_text": null, "created_utc": 1399506198.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcae5n", "gilded": 0, "author": "reverienoire", "parent_id": "t1_chc9qkm", "approved_by": null, "body": "the reason i ask if you're in the us is that, if the lack of a job prospect is really the biggest stressor or cause of stressors, perhaps you could look into something like americorps or the peace corps. if you like volunteering that sounds like a good fit for you, and not only would it get you out of that house, it would look amazing on your resume.\n\nif you live elsewhere, i'm sure there are similar programs but i just wouldn't happen to know what they are.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the reason i ask if you&amp;#39;re in the us is that, if the lack of a job prospect is really the biggest stressor or cause of stressors, perhaps you could look into something like americorps or the peace corps. if you like volunteering that sounds like a good fit for you, and not only would it get you out of that house, it would look amazing on your resume.&lt;/p&gt;\n\n&lt;p&gt;if you live elsewhere, i&amp;#39;m sure there are similar programs but i just wouldn&amp;#39;t happen to know what they are.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chcae5n", "created": 1399535705.0, "author_flair_text": null, "created_utc": 1399506905.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chc9qkm", "gilded": 0, "author": "Enviunity", "parent_id": "t1_chc99uv", "approved_by": null, "body": "I've volunteered before, I've been called one of the best volunteers that organization has ever had. The economy is tough, my mom says it's fine though. \nI could write the story of the ex boyfriend but I feel that'd be a topic in itself. To sum it up, he's a man child, blames everyone else for his problems. That type.\nI'm currently living with my parents, that's why I'm so desperate to find anything. I'm fine with the idea of working multiple jobs, at this point,I don't care. They do not support college financially. My grandma just died and I was in her trust, I was supposed to get enough to cover college and some money every month, but I haven't seen any of it. Therefore, I'm taking out loans.That's another subject entirely. \nI'm just so at the end. I mean I've told the best friend (10 years one) that I've had these thoughts, but after I hang up the phone, she doesn't try to talk to me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve volunteered before, I&amp;#39;ve been called one of the best volunteers that organization has ever had. The economy is tough, my mom says it&amp;#39;s fine though. \nI could write the story of the ex boyfriend but I feel that&amp;#39;d be a topic in itself. To sum it up, he&amp;#39;s a man child, blames everyone else for his problems. That type.\nI&amp;#39;m currently living with my parents, that&amp;#39;s why I&amp;#39;m so desperate to find anything. I&amp;#39;m fine with the idea of working multiple jobs, at this point,I don&amp;#39;t care. They do not support college financially. My grandma just died and I was in her trust, I was supposed to get enough to cover college and some money every month, but I haven&amp;#39;t seen any of it. Therefore, I&amp;#39;m taking out loans.That&amp;#39;s another subject entirely. \nI&amp;#39;m just so at the end. I mean I&amp;#39;ve told the best friend (10 years one) that I&amp;#39;ve had these thoughts, but after I hang up the phone, she doesn&amp;#39;t try to talk to me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chc9qkm", "created": 1399534227.0, "author_flair_text": null, "created_utc": 1399505427.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chc99uv", "gilded": 0, "author": "reverienoire", "parent_id": "t3_24zq8o", "approved_by": null, "body": "your mom says some awful things! no one is worthless, and no one is going to feel motivated after hearing something like that. way to be supportive, mom! same goes for your dad. you got a raw deal with them, and i'm sorry. parents aren't supposed to be like that. \n\nyou're right, though, she doesn't understand. you're not alone in not being able to find a job and it has nothing to do with your competency or intelligence or experience or education or whatever. it's the economy, and it's affecting thousands upon thousands of people just like yourself, and it's really fucking scary.\n\nwhat's the story with your ex-boyfriend and his new gf harassing you? who the hell does something like that? \n\nbest friends don't act like that, either. real friends don't act like that. friends are supposed to genuinely care about each other. \n\nwhat's your living situation? you seem to be in contact with your parents alot, are you still living with them? do they support your college education financially? \n\nno one deserves verbal and emotional abuse like this. if there's any chance you can get away from your family that might be a good idea.\n\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;your mom says some awful things! no one is worthless, and no one is going to feel motivated after hearing something like that. way to be supportive, mom! same goes for your dad. you got a raw deal with them, and i&amp;#39;m sorry. parents aren&amp;#39;t supposed to be like that. &lt;/p&gt;\n\n&lt;p&gt;you&amp;#39;re right, though, she doesn&amp;#39;t understand. you&amp;#39;re not alone in not being able to find a job and it has nothing to do with your competency or intelligence or experience or education or whatever. it&amp;#39;s the economy, and it&amp;#39;s affecting thousands upon thousands of people just like yourself, and it&amp;#39;s really fucking scary.&lt;/p&gt;\n\n&lt;p&gt;what&amp;#39;s the story with your ex-boyfriend and his new gf harassing you? who the hell does something like that? &lt;/p&gt;\n\n&lt;p&gt;best friends don&amp;#39;t act like that, either. real friends don&amp;#39;t act like that. friends are supposed to genuinely care about each other. &lt;/p&gt;\n\n&lt;p&gt;what&amp;#39;s your living situation? you seem to be in contact with your parents alot, are you still living with them? do they support your college education financially? &lt;/p&gt;\n\n&lt;p&gt;no one deserves verbal and emotional abuse like this. if there&amp;#39;s any chance you can get away from your family that might be a good idea.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zq8o", "score_hidden": false, "name": "t1_chc99uv", "created": 1399533169.0, "author_flair_text": null, "created_utc": 1399504369.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]