[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have no idea how I am supposed to deal with this situation.&lt;/p&gt;\n\n&lt;p&gt;As a backstory, my friend (who we can call A throughout this post) attempted suicide back in 2011, when we were in grade 11. It occurred at the end of the high school year but I didn&amp;#39;t find out until a few months afterwards when she told me the real reason she was in the hospital - she hadn&amp;#39;t wanted anyone to know, nor did her family. As an aside, but important none the less, she isn&amp;#39;t super close to her family since she stopped going to church in grade nine or so.&lt;/p&gt;\n\n&lt;p&gt;There was an element of shock when I found out and it was less processed to be honest, more like accepted and moving on, trying to go forward. She was getting help and she was happy and that&amp;#39;s all I wanted for her. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to September 2013, she took a job as an au pair in Europe (we live in North America) and I entered my second year of university at a school about three hours away. A was excited and while we didn&amp;#39;t get in contact while she was in Europe as often as we planned, we WhatsApp&amp;#39;ed when we could. &lt;/p&gt;\n\n&lt;p&gt;Last Thursday, I got a text from her and it just said &amp;#39;in hospital&amp;#39;. It took until Friday after a day of panic that I found out she attempted suicide. I didn&amp;#39;t have any details, still don&amp;#39;t, but she stayed in the hospital until yesterday when her dad flew out and she flew back here with him.&lt;/p&gt;\n\n&lt;p&gt;I just...I have no idea how to process this. It brings back feelings of when I thought of suicide back in high school and I feel guilty I am thinking about that because I never tried but she did and why am I thinking about myself. I feel like I should cry about this and be super worried but I&amp;#39;m just like, numb, a jumbled mess of worry and fear and sad. I thought she was happy there. I don&amp;#39;t know why she would do this. I want to help but I don&amp;#39;t know what I can do because obviously I did it wrong last time and then I feel guilty because I know it isn&amp;#39;t something so easily controlled for her and it isn&amp;#39;t her fault and it isn&amp;#39;t my fault either.&lt;/p&gt;\n\n&lt;p&gt;I just... I don&amp;#39;t know what I can do and I don&amp;#39;t think that the fact that I could have lost a girl who is like my sister has sunk in yet. I finished my term of university and I find this out and at the same time we recently had a huge health scare with my grandma and I just have no idea.&lt;/p&gt;\n\n&lt;p&gt;I know this isn&amp;#39;t me asking talking about my suicide, but I know that some of you have probably dealt with similar situations either on A&amp;#39;s side or mine and to be honest I just want someone to help me figure out how I&amp;#39;m supposed to deal with this and how I&amp;#39;m supposed to help her because thinking and wondering how I&amp;#39;m supposed to deal with it feels selfish knowing that she was brought so low.&lt;/p&gt;\n\n&lt;p&gt;I apologized for the wall of text, I just needed to vent.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have no idea how I am supposed to deal with this situation.\n\nAs a backstory, my friend (who we can call A throughout this post) attempted suicide back in 2011, when we were in grade 11. It occurred at the end of the high school year but I didn't find out until a few months afterwards when she told me the real reason she was in the hospital - she hadn't wanted anyone to know, nor did her family. As an aside, but important none the less, she isn't super close to her family since she stopped going to church in grade nine or so.\n\nThere was an element of shock when I found out and it was less processed to be honest, more like accepted and moving on, trying to go forward. She was getting help and she was happy and that's all I wanted for her. \n\nFast forward to September 2013, she took a job as an au pair in Europe (we live in North America) and I entered my second year of university at a school about three hours away. A was excited and while we didn't get in contact while she was in Europe as often as we planned, we WhatsApp'ed when we could. \n\nLast Thursday, I got a text from her and it just said 'in hospital'. It took until Friday after a day of panic that I found out she attempted suicide. I didn't have any details, still don't, but she stayed in the hospital until yesterday when her dad flew out and she flew back here with him.\n\nI just...I have no idea how to process this. It brings back feelings of when I thought of suicide back in high school and I feel guilty I am thinking about that because I never tried but she did and why am I thinking about myself. I feel like I should cry about this and be super worried but I'm just like, numb, a jumbled mess of worry and fear and sad. I thought she was happy there. I don't know why she would do this. I want to help but I don't know what I can do because obviously I did it wrong last time and then I feel guilty because I know it isn't something so easily controlled for her and it isn't her fault and it isn't my fault either.\n\nI just... I don't know what I can do and I don't think that the fact that I could have lost a girl who is like my sister has sunk in yet. I finished my term of university and I find this out and at the same time we recently had a huge health scare with my grandma and I just have no idea.\n\nI know this isn't me asking talking about my suicide, but I know that some of you have probably dealt with similar situations either on A's side or mine and to be honest I just want someone to help me figure out how I'm supposed to deal with this and how I'm supposed to help her because thinking and wondering how I'm supposed to deal with it feels selfish knowing that she was brought so low.\n\nI apologized for the wall of text, I just needed to vent.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25fluc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NarwhalsAreUnicorns_", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25fluc/how_can_i_dealhelp_with_this_situation/", "name": "t3_25fluc", "created": 1399996926.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25fluc/how_can_i_dealhelp_with_this_situation/", "author_flair_text": null, "title": "How can I deal/help with this situation?", "created_utc": 1399968126.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgq3ft", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_25fluc", "approved_by": null, "body": "If she's in Europe, there isn't much you can do face-to-face.  All you can do is listen/talk to her on the phone/online, but that's a lot.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she&amp;#39;s in Europe, there isn&amp;#39;t much you can do face-to-face.  All you can do is listen/talk to her on the phone/online, but that&amp;#39;s a lot.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25fluc", "score_hidden": false, "name": "t1_chgq3ft", "created": 1400004644.0, "author_flair_text": null, "created_utc": 1399975844.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]