[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know a lot of the people on this sub are people who have had suicidal thoughts in the past, for the ones of you who have been able to cope may I ask how? When I become even slightly disappointed my initial thought is always suicide. Can I get some advice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I know a lot of the people on this sub are people who have had suicidal thoughts in the past, for the ones of you who have been able to cope may I ask how? When I become even slightly disappointed my initial thought is always suicide. Can I get some advice?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240i9c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sabely123", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240i9c/how_to_cope/", "name": "t3_240i9c", "created": 1398520272.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240i9c/how_to_cope/", "author_flair_text": null, "title": "How to cope.", "created_utc": 1398491472.0, "ups": 2, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2egph", "gilded": 0, "author": "LightAbsol", "parent_id": "t3_240i9c", "approved_by": null, "body": "What would you like to hear about specifically? For me, when my mother committed suicide, it shocked me and had elevated my own deeper and darker thoughts of the time...I wanted to join her and be free of the maddening pain that I called life. It was extremely hard coping with the thoughts that accompanied that, so I kept doing things that heavily stimulated my brain, so it kept me focused enough to let those thoughts go, one by one. Personally, I played video games that require a lot of action to keep me busy during high tides of emotion, and when it was less intense, I would just keep myself involved in talking to people or learning about things on the internet. I still use these methods today, not only because I love video games, but I've also learned how to kind of \"derail\" those bad thoughts and even laugh at things unexpectedly when I'm in a bad mood.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What would you like to hear about specifically? For me, when my mother committed suicide, it shocked me and had elevated my own deeper and darker thoughts of the time...I wanted to join her and be free of the maddening pain that I called life. It was extremely hard coping with the thoughts that accompanied that, so I kept doing things that heavily stimulated my brain, so it kept me focused enough to let those thoughts go, one by one. Personally, I played video games that require a lot of action to keep me busy during high tides of emotion, and when it was less intense, I would just keep myself involved in talking to people or learning about things on the internet. I still use these methods today, not only because I love video games, but I&amp;#39;ve also learned how to kind of &amp;quot;derail&amp;quot; those bad thoughts and even laugh at things unexpectedly when I&amp;#39;m in a bad mood.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240i9c", "score_hidden": false, "name": "t1_ch2egph", "created": 1398520782.0, "author_flair_text": null, "created_utc": 1398491982.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2i5s1", "gilded": 0, "author": "hermitiancat", "parent_id": "t3_240i9c", "approved_by": null, "body": "For me it was a little bit of CBT. \n\nI realized that when I'm exhausted or stressed out (when things are going poorly or I've failed) my thoughts tend to be more extreme and somewhat revisionist. \n\nFor example, \"we're fighting today\" became \"he hates me and I never do anything right so I should kill myself.\" The truth is not that extreme though, even if my feelings were. \n\nWhat I really want when I wish I were dead is escape. I'm feeling overwhelmed. I need help. I don't have the energy to think slowly and reasonably. \n\nSo I get my brain the energy it needs. I rest. I eat something. I refuse to make any decisions, after all something like suicide needs to be planned perfectly, can't be rushed. I get around some people like at a coffee shop or something and just sit quietly and watch. Then I go back and revisit my logic and try to see the places where my brains have gone off track. After a few days, I will be feeling more like myself, and less on alert. \n\nMy strategies are only suited for existential depression though. A lot of people come in here with life problems that I can't even address or imagine and I wish there was more I could say to help them. Like it's all well and good for me to say \"just take a nap first\" to that homeless guy. Yeah, that's not really going to cut it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me it was a little bit of CBT. &lt;/p&gt;\n\n&lt;p&gt;I realized that when I&amp;#39;m exhausted or stressed out (when things are going poorly or I&amp;#39;ve failed) my thoughts tend to be more extreme and somewhat revisionist. &lt;/p&gt;\n\n&lt;p&gt;For example, &amp;quot;we&amp;#39;re fighting today&amp;quot; became &amp;quot;he hates me and I never do anything right so I should kill myself.&amp;quot; The truth is not that extreme though, even if my feelings were. &lt;/p&gt;\n\n&lt;p&gt;What I really want when I wish I were dead is escape. I&amp;#39;m feeling overwhelmed. I need help. I don&amp;#39;t have the energy to think slowly and reasonably. &lt;/p&gt;\n\n&lt;p&gt;So I get my brain the energy it needs. I rest. I eat something. I refuse to make any decisions, after all something like suicide needs to be planned perfectly, can&amp;#39;t be rushed. I get around some people like at a coffee shop or something and just sit quietly and watch. Then I go back and revisit my logic and try to see the places where my brains have gone off track. After a few days, I will be feeling more like myself, and less on alert. &lt;/p&gt;\n\n&lt;p&gt;My strategies are only suited for existential depression though. A lot of people come in here with life problems that I can&amp;#39;t even address or imagine and I wish there was more I could say to help them. Like it&amp;#39;s all well and good for me to say &amp;quot;just take a nap first&amp;quot; to that homeless guy. Yeah, that&amp;#39;s not really going to cut it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240i9c", "score_hidden": false, "name": "t1_ch2i5s1", "created": 1398542294.0, "author_flair_text": null, "created_utc": 1398513494.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2i8ir", "gilded": 0, "author": "hermitiancat", "parent_id": "t1_ch2fw73", "approved_by": null, "body": "Such an honest response. Especially about experiencing the thoughts as separate from actions, knowing that you can feel suicidal sometimes and also knowing that you won't actually hurt yourself. \n\nI'm sorry that you feel like you can't share with those around you. Glad you can come here. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Such an honest response. Especially about experiencing the thoughts as separate from actions, knowing that you can feel suicidal sometimes and also knowing that you won&amp;#39;t actually hurt yourself. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that you feel like you can&amp;#39;t share with those around you. Glad you can come here. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240i9c", "score_hidden": false, "name": "t1_ch2i8ir", "created": 1398517538.0, "author_flair_text": null, "created_utc": 1398513938.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2fw73", "gilded": 0, "author": "marvinGPP", "parent_id": "t3_240i9c", "approved_by": null, "body": "I think about suicide, and the \"release\" of death all the time- many times a day, and I have for over 25 years now. I have used multiple strategies over the years including  therapy and anti-depressants, which were helpful in different ways in different times. \n\nBut I think that overall, the most effective strategy has been programming myself to \"know\" that I can't do it, no matter how I feel. And that came from repetition. So now, even in my darkest pain, I can beg the universe for death, and I think about killing myself, but I know that I am not going to take any action. And that is something I think about when I'm not in a depressed state, because I want the thought to be automatic when I am. \n\nThis started when I was a teen after my second attempt, and my parents made me promise every day that I wouldn't do it that day: \"Promise me you won't kill yourself today,\" took the place of \"Have a good day.\"\n\nThis practice was actually effective for multiple reasons. First, I was able to let go of my struggle with the question about whether or not I would do it that day, and say to myself \"ok, maybe I will tomorrow, but not today.\" So I think it must like what addicts do, and taking it one day at a time helped me to manage it. \n\nThe other reason it was helpful was that I became very sick and tired of being the fragile, depressed person that they walked on egg shells around. I decided that I was never going to let them know how depressed I really was again, so that we would not have to make my suicidal feelings a daily topic of conversation. \n\nSo now, even though I still struggle, I am very aware of the fact that if I took any action toward suicide that another person was aware of, it would change the way people treated me. \n\nI have attempted suicide as an adult, I do still slip and start \"planning\" sometimes, but overall, most of the time, I just know that it's not what I am really going to do.  \n\nIt's normal to be thrown by disappointment and failure. And for some number of us, it's our normal to think about suicide and death. But that doesn't mean you have to become suicidal and actually make an effort towards killing yourself- that's where you can draw a line that you won't cross. \n\nI hope it helps some. I wish you the best. I think it's wonderful that we have this forum to talk openly on, anonymously. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think about suicide, and the &amp;quot;release&amp;quot; of death all the time- many times a day, and I have for over 25 years now. I have used multiple strategies over the years including  therapy and anti-depressants, which were helpful in different ways in different times. &lt;/p&gt;\n\n&lt;p&gt;But I think that overall, the most effective strategy has been programming myself to &amp;quot;know&amp;quot; that I can&amp;#39;t do it, no matter how I feel. And that came from repetition. So now, even in my darkest pain, I can beg the universe for death, and I think about killing myself, but I know that I am not going to take any action. And that is something I think about when I&amp;#39;m not in a depressed state, because I want the thought to be automatic when I am. &lt;/p&gt;\n\n&lt;p&gt;This started when I was a teen after my second attempt, and my parents made me promise every day that I wouldn&amp;#39;t do it that day: &amp;quot;Promise me you won&amp;#39;t kill yourself today,&amp;quot; took the place of &amp;quot;Have a good day.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This practice was actually effective for multiple reasons. First, I was able to let go of my struggle with the question about whether or not I would do it that day, and say to myself &amp;quot;ok, maybe I will tomorrow, but not today.&amp;quot; So I think it must like what addicts do, and taking it one day at a time helped me to manage it. &lt;/p&gt;\n\n&lt;p&gt;The other reason it was helpful was that I became very sick and tired of being the fragile, depressed person that they walked on egg shells around. I decided that I was never going to let them know how depressed I really was again, so that we would not have to make my suicidal feelings a daily topic of conversation. &lt;/p&gt;\n\n&lt;p&gt;So now, even though I still struggle, I am very aware of the fact that if I took any action toward suicide that another person was aware of, it would change the way people treated me. &lt;/p&gt;\n\n&lt;p&gt;I have attempted suicide as an adult, I do still slip and start &amp;quot;planning&amp;quot; sometimes, but overall, most of the time, I just know that it&amp;#39;s not what I am really going to do.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s normal to be thrown by disappointment and failure. And for some number of us, it&amp;#39;s our normal to think about suicide and death. But that doesn&amp;#39;t mean you have to become suicidal and actually make an effort towards killing yourself- that&amp;#39;s where you can draw a line that you won&amp;#39;t cross. &lt;/p&gt;\n\n&lt;p&gt;I hope it helps some. I wish you the best. I think it&amp;#39;s wonderful that we have this forum to talk openly on, anonymously. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240i9c", "score_hidden": false, "name": "t1_ch2fw73", "created": 1398501998.0, "author_flair_text": null, "created_utc": 1398498398.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]