[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I originally started this account to post here... That was a few days ago. I dont think I have the will to type properly right now, so please just bear with me. sorry if i am all over the place, i cant really think properly&lt;/p&gt;\n\n&lt;p&gt;im 17 years old. I am an atheist. tomorrow is friday, when i usually spend the night at my pretty much perfect girlfriends house, although her family is a bit much to handle at times. I am apparently incredibly smart. People have high expectations for me. My principals want me to go into nano technology, but i have no intentions on doing that. i am also the tech geek in my school, i build computers and modify smartphones. I want to drop out of school. I want to get out of my town. i want to put a bullet in my head&lt;/p&gt;\n\n&lt;p&gt;I was raised somewhat normally besides my dad having a very open opinion about people of the opposite races, just like his father. in about kindergarten or first grade, my sister touched me and made me touch her. she is 6 years older than i am. she told me to play &amp;quot;mummy&amp;quot;. a game where one person controls your whole body and you cant move. I didnt think anything about it. i actually realized it at about age 15 when i remembered it and thought about it a bit more. granted, it was a one time thing, it still hurts me. &lt;/p&gt;\n\n&lt;p&gt;when i was 7 years old, i made a friend who lived in my neighborhood. he skated and got me into it. he pretty much convinced me to do bad shit all day, and it was fun. When I was 8, he started to grab on me and it eventually escalated to anal rape. this went on almost every day until i was 11 and he moved to the next state over.  from that, i now have severe PTSD, OCD, anxiety, severe depression, mild paranoia and bipolar disorder. Along with this, I also have ADD and ADHD. i never told anyone because he said he would rape my sister and kill my dog. i should have told from the first touch, but i know now that my 17 year old mind wasnt the same as my 8, 9, 10, and 11 year old mind.&lt;/p&gt;\n\n&lt;p&gt;during (9 years old was the beginning of it) and after that i suffered sexual, physical, and verbal abuse from my racist, alcoholic, and overly old fashioned father (he is 60 years old as of January) and from my alcoholic narcissistic super religious mother. When i would try to vent to my sister, she said that since she never got any of that, that i must be doing something awful to them to deserve it. &lt;em&gt;i was being fucking raped to protect you, and oh how badly i wanted to tell you so you would help me, but instead you told me to stop complaining about abused&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;i dont have the will to go into details about how much my sister was preferred over me, but i will give a glimpse of it. my parents took money from me to give to her when i was younger, she always got new clothes, and anything she asked for, she got. my parents paid for her college and her sorority stuff, along with her &lt;em&gt;house&lt;/em&gt; in her college town. she didnt get a job in college, but out of fucking nowhere now works for a very esteemed place in nashville, where they illegally hired her. something about not being able to have an intern after they graduate college and keeping her anyway, then eventually she was hired because they were warned of what they were doing. she also has a fiance that is loaded. even before that, she babysat for some very famous people and made about a $800 a week, which didnt include the free trips to new york, hawaii, and a few other places, just to babysit. she was paid during the trips, too. they give her shoes that cost over a thousand fucking dollars in the amount that requires a &lt;strong&gt;&lt;em&gt;garbage bag to carry them&lt;/em&gt;&lt;/strong&gt;. she has so much money it is almost funny. almost. meanwhile my parents still pay for her new iphone every year, her phone bill, her car insurance, BOUGHT her a new car for a second time, and constantly pay for her car to be fixed after frequent car accidents. my family spends money on her that we dont fucking have, and meanwhile, i ask for $10 to buy a pair of headphones, and they tell me that i ask for too much and that they dont think they should be funding things related to computers, since &amp;quot;technology will all fail someday&amp;quot;. they constantly guilt me for paying for the electricity and water bill to me saying that i am making it go up with my tv going and my computer on and showering too long (my showers take about 6-8 minutes, 10 tops, 15 if I am crying, but that is when they arent home). I forgot to throw this in, but my parents paid for my sisters private school education and I went to public school and have to pay for my own college. my parents treat me like shit and they will never in their life admit it.&lt;/p&gt;\n\n&lt;p&gt;I did end up going to private school in 5th and 6th grade, because my dad thought there were &amp;quot;too many niggers now at that damn new public school!&amp;quot;. I was bullied furiously, and eventually tried to hang myself. I was in 6th grade. I tied a backpack through the hinges on my closet door and looped around the other strap and... hung there. i kicked and tried to use my feet, but i just couldnt move, and it hurt so much, i wanted it to stop. I was eventually caught in the midst of it by my parents and the rest was sort of a blur. no hugging and saying they are sorry, just sobs of &amp;quot;how can you do this to me&amp;quot; and such. I started therapy the following months. During the first few sessions, i talked about my molestation and eventually, the therapist only wanted to talk about my sister. not in a therapeutic way, but in a normal type of conversation. even a therapist wouldnt listen and didnt care about me. I eventually stopped going because it was making it worse. I told my parents i was better and since my dad thinks therapy is liberal propaganda (i shit you not), so i eventually fell into a deeper depression. people at my school said i was gay, made fun of me for being raped, told people i worshiped the devil (this started when i wore a guns n roses tshoirt that had their heads on the cross. they had never heard of GNR so they assumed the worst they could) and eventually, the teachers started hating me, since they all thought that i was a gay satanist, &lt;em&gt;in 6th fucking grade&lt;/em&gt;. I left for public school the next year. i became a huge bully because i was starting my reputation over. i was a swimmer, a golfer, and was pretty good at soccer, plus i would occasionally wear nice clothes that i would beg my parents for. I didnt care if they guilted me, i couldnt go back to being bulllied. I was a selfish fuck and i hate my 7th and 8th grade self. &lt;/p&gt;\n\n&lt;p&gt;going into freshman year, i became addicted to k2, a synthetic form of weed. i smoked all day and it really fucked me up, but drugs made me feel better so i decided to keep doing them. i was beginning to lose my religion. that also really fucked with my head. i was still very suicidal, but i was starting to gain a real sense of my real self once i realized that being racist is wrong, that my religion was a lie, and that being a radical conservative didnt give me any type of moral high-ground over anyone. well, later into the year, i was getting close to going to state for swimming. i already went as an 8th grader and was killing it as a freshman. if you swim, i was doing a 23.6 in my 50 free as a freshman and murdering in the 200 IM. i was busted for selling spice about 2 weeks before regionals and expelled from school, and sent to alternative schooling for 14 weeks. i was heavily dependent on my current girlfriend who also treated me pretty terribly, but i took it because i was desperate. anyway, a few days after my arrest, my parents found out that i knew where the gun was in my house and planned on using it within the week. they sent me to a mental health center for drug addicts and people who are suicidal. i spent a week there, since i am manipulative and, like i said, smart. I hated it there, but the food was good i guess. i got out to find that i was now single. my world was turned upside down. i didnt know what to do. i was banned from the internet since i mentioned visiting 4chan frequently and reddit occasionally to my therapist in there, and unfortunately enough for me, she got on 4chan, and went to /b/, which is what i told her i usually go on to vent about suicide and whatnot. she thought it was a nice little internet chat group i assume, but instead found pretty much everything you would expect. so, now that my mind number was gone, i was completely out of ideas, and back to being as suicidal as ever. I secretly dated the girl for about a year and eventually, her parents said i could date her again. shortly after, her feminist friends said that i control her by not letting her go to parties with guys she flirts with. They spun it as &amp;quot;HE TELLS HER SHE ISNT ALLOWED TO HAVE ANY FRIENDS AND ALWAYS YELLS AT HER AND I THINK HE HIT HER TOO!!!&amp;quot; I wake up one morning to the sound of my mother calling me in. she said &amp;quot;that was Mr. ____, he said you put his daughter on pills?&amp;quot; i had NO fucking idea what she was talking about. apparently, his daughters friends spun it that she needed sleeping pills because i stress her out too much. that was not the case at all, but she lied because she was caught in a lie with her friends. I tried to overdose, but just seized up and vomited until the morning. that was my second suicide attempt, and that was as a sophomore.&lt;/p&gt;\n\n&lt;p&gt;I cant take much more typing... ive been typing this for about an hour and a half, with crying and smoke breaks here and there. I am going to summarize quickly on what has happened recently, and if someone needs me to elaborate further then i will. I eventually couldnt stand people and my disorders had gotten worse exponentially, making normal school nearly impossible. i applied for another form of schooling where i could be alone and work at my own pace, and was told that worst case scenario, i will be gone by the middle of the third 9 weeks, this was said to me at the end of the 2nd 9 weeks. I am now told, at the beginning of the 4th 9 weeks, that i will not go this year. i am failing all of my classes besides histoy. I lost my car due to awful grades. i had awful grades because i was told im in a &amp;quot;transitional period between this school and the self paced school&amp;quot; and that my classes would start over. I now have about 400 missing assignments that i simply cannot make up. i now will have to go to summer school, and will not get my car back until december. the school &lt;strong&gt;&lt;em&gt;fucking LIED TO ME AND FUCKED ME OVER&lt;/em&gt;&lt;/strong&gt;. The only thing i was fucking looking forward to was having a summer free of school stress and people constantly bothering my disorders. here is the thing though, i was put as a low priority because i am smart, and they wanted people at the school who were stupid to get in first due to them being a higher threat of dropping out. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;At this point, i am willing to commit suicide because i know it will not hurt. I will not go to hell, i will just feel the way i did before i was born, nothing. I only started feeling this way once i realized how little goes right in my life. people keep telling me that it only goes up from here, and then my life proves them wrong. I dont want to feel pain anymore. i dont deserve it. i knew i would probably die from suicide, but... i didnt think this early. im not ready yet, but i am getting more comfortable with the idea with every day i have to endure. I not only have the means to do it, but now i have the will. i am waiting this week out and will go back to the mental place to try and get through it, but i doubt it will work. if it doesnt work (although i will give it an honest shot) then i will do it, and i wont hurt anymore... Sorry for the wall of text... It has over 11600 characters, so its okay if you didnt read it all. soon i will be dead, and nobody will have to read another wall of text of my life again. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I originally started this account to post here... That was a few days ago. I dont think I have the will to type properly right now, so please just bear with me. sorry if i am all over the place, i cant really think properly\n\nim 17 years old. I am an atheist. tomorrow is friday, when i usually spend the night at my pretty much perfect girlfriends house, although her family is a bit much to handle at times. I am apparently incredibly smart. People have high expectations for me. My principals want me to go into nano technology, but i have no intentions on doing that. i am also the tech geek in my school, i build computers and modify smartphones. I want to drop out of school. I want to get out of my town. i want to put a bullet in my head\n\nI was raised somewhat normally besides my dad having a very open opinion about people of the opposite races, just like his father. in about kindergarten or first grade, my sister touched me and made me touch her. she is 6 years older than i am. she told me to play \"mummy\". a game where one person controls your whole body and you cant move. I didnt think anything about it. i actually realized it at about age 15 when i remembered it and thought about it a bit more. granted, it was a one time thing, it still hurts me. \n\nwhen i was 7 years old, i made a friend who lived in my neighborhood. he skated and got me into it. he pretty much convinced me to do bad shit all day, and it was fun. When I was 8, he started to grab on me and it eventually escalated to anal rape. this went on almost every day until i was 11 and he moved to the next state over.  from that, i now have severe PTSD, OCD, anxiety, severe depression, mild paranoia and bipolar disorder. Along with this, I also have ADD and ADHD. i never told anyone because he said he would rape my sister and kill my dog. i should have told from the first touch, but i know now that my 17 year old mind wasnt the same as my 8, 9, 10, and 11 year old mind.\n\nduring (9 years old was the beginning of it) and after that i suffered sexual, physical, and verbal abuse from my racist, alcoholic, and overly old fashioned father (he is 60 years old as of January) and from my alcoholic narcissistic super religious mother. When i would try to vent to my sister, she said that since she never got any of that, that i must be doing something awful to them to deserve it. *i was being fucking raped to protect you, and oh how badly i wanted to tell you so you would help me, but instead you told me to stop complaining about abused* \n\ni dont have the will to go into details about how much my sister was preferred over me, but i will give a glimpse of it. my parents took money from me to give to her when i was younger, she always got new clothes, and anything she asked for, she got. my parents paid for her college and her sorority stuff, along with her *house* in her college town. she didnt get a job in college, but out of fucking nowhere now works for a very esteemed place in nashville, where they illegally hired her. something about not being able to have an intern after they graduate college and keeping her anyway, then eventually she was hired because they were warned of what they were doing. she also has a fiance that is loaded. even before that, she babysat for some very famous people and made about a $800 a week, which didnt include the free trips to new york, hawaii, and a few other places, just to babysit. she was paid during the trips, too. they give her shoes that cost over a thousand fucking dollars in the amount that requires a ***garbage bag to carry them***. she has so much money it is almost funny. almost. meanwhile my parents still pay for her new iphone every year, her phone bill, her car insurance, BOUGHT her a new car for a second time, and constantly pay for her car to be fixed after frequent car accidents. my family spends money on her that we dont fucking have, and meanwhile, i ask for $10 to buy a pair of headphones, and they tell me that i ask for too much and that they dont think they should be funding things related to computers, since \"technology will all fail someday\". they constantly guilt me for paying for the electricity and water bill to me saying that i am making it go up with my tv going and my computer on and showering too long (my showers take about 6-8 minutes, 10 tops, 15 if I am crying, but that is when they arent home). I forgot to throw this in, but my parents paid for my sisters private school education and I went to public school and have to pay for my own college. my parents treat me like shit and they will never in their life admit it.\n\nI did end up going to private school in 5th and 6th grade, because my dad thought there were \"too many niggers now at that damn new public school!\". I was bullied furiously, and eventually tried to hang myself. I was in 6th grade. I tied a backpack through the hinges on my closet door and looped around the other strap and... hung there. i kicked and tried to use my feet, but i just couldnt move, and it hurt so much, i wanted it to stop. I was eventually caught in the midst of it by my parents and the rest was sort of a blur. no hugging and saying they are sorry, just sobs of \"how can you do this to me\" and such. I started therapy the following months. During the first few sessions, i talked about my molestation and eventually, the therapist only wanted to talk about my sister. not in a therapeutic way, but in a normal type of conversation. even a therapist wouldnt listen and didnt care about me. I eventually stopped going because it was making it worse. I told my parents i was better and since my dad thinks therapy is liberal propaganda (i shit you not), so i eventually fell into a deeper depression. people at my school said i was gay, made fun of me for being raped, told people i worshiped the devil (this started when i wore a guns n roses tshoirt that had their heads on the cross. they had never heard of GNR so they assumed the worst they could) and eventually, the teachers started hating me, since they all thought that i was a gay satanist, *in 6th fucking grade*. I left for public school the next year. i became a huge bully because i was starting my reputation over. i was a swimmer, a golfer, and was pretty good at soccer, plus i would occasionally wear nice clothes that i would beg my parents for. I didnt care if they guilted me, i couldnt go back to being bulllied. I was a selfish fuck and i hate my 7th and 8th grade self. \n\ngoing into freshman year, i became addicted to k2, a synthetic form of weed. i smoked all day and it really fucked me up, but drugs made me feel better so i decided to keep doing them. i was beginning to lose my religion. that also really fucked with my head. i was still very suicidal, but i was starting to gain a real sense of my real self once i realized that being racist is wrong, that my religion was a lie, and that being a radical conservative didnt give me any type of moral high-ground over anyone. well, later into the year, i was getting close to going to state for swimming. i already went as an 8th grader and was killing it as a freshman. if you swim, i was doing a 23.6 in my 50 free as a freshman and murdering in the 200 IM. i was busted for selling spice about 2 weeks before regionals and expelled from school, and sent to alternative schooling for 14 weeks. i was heavily dependent on my current girlfriend who also treated me pretty terribly, but i took it because i was desperate. anyway, a few days after my arrest, my parents found out that i knew where the gun was in my house and planned on using it within the week. they sent me to a mental health center for drug addicts and people who are suicidal. i spent a week there, since i am manipulative and, like i said, smart. I hated it there, but the food was good i guess. i got out to find that i was now single. my world was turned upside down. i didnt know what to do. i was banned from the internet since i mentioned visiting 4chan frequently and reddit occasionally to my therapist in there, and unfortunately enough for me, she got on 4chan, and went to /b/, which is what i told her i usually go on to vent about suicide and whatnot. she thought it was a nice little internet chat group i assume, but instead found pretty much everything you would expect. so, now that my mind number was gone, i was completely out of ideas, and back to being as suicidal as ever. I secretly dated the girl for about a year and eventually, her parents said i could date her again. shortly after, her feminist friends said that i control her by not letting her go to parties with guys she flirts with. They spun it as \"HE TELLS HER SHE ISNT ALLOWED TO HAVE ANY FRIENDS AND ALWAYS YELLS AT HER AND I THINK HE HIT HER TOO!!!\" I wake up one morning to the sound of my mother calling me in. she said \"that was Mr. ____, he said you put his daughter on pills?\" i had NO fucking idea what she was talking about. apparently, his daughters friends spun it that she needed sleeping pills because i stress her out too much. that was not the case at all, but she lied because she was caught in a lie with her friends. I tried to overdose, but just seized up and vomited until the morning. that was my second suicide attempt, and that was as a sophomore.\n\nI cant take much more typing... ive been typing this for about an hour and a half, with crying and smoke breaks here and there. I am going to summarize quickly on what has happened recently, and if someone needs me to elaborate further then i will. I eventually couldnt stand people and my disorders had gotten worse exponentially, making normal school nearly impossible. i applied for another form of schooling where i could be alone and work at my own pace, and was told that worst case scenario, i will be gone by the middle of the third 9 weeks, this was said to me at the end of the 2nd 9 weeks. I am now told, at the beginning of the 4th 9 weeks, that i will not go this year. i am failing all of my classes besides histoy. I lost my car due to awful grades. i had awful grades because i was told im in a \"transitional period between this school and the self paced school\" and that my classes would start over. I now have about 400 missing assignments that i simply cannot make up. i now will have to go to summer school, and will not get my car back until december. the school ***fucking LIED TO ME AND FUCKED ME OVER***. The only thing i was fucking looking forward to was having a summer free of school stress and people constantly bothering my disorders. here is the thing though, i was put as a low priority because i am smart, and they wanted people at the school who were stupid to get in first due to them being a higher threat of dropping out. \n\n________________________________________________________\n\nAt this point, i am willing to commit suicide because i know it will not hurt. I will not go to hell, i will just feel the way i did before i was born, nothing. I only started feeling this way once i realized how little goes right in my life. people keep telling me that it only goes up from here, and then my life proves them wrong. I dont want to feel pain anymore. i dont deserve it. i knew i would probably die from suicide, but... i didnt think this early. im not ready yet, but i am getting more comfortable with the idea with every day i have to endure. I not only have the means to do it, but now i have the will. i am waiting this week out and will go back to the mental place to try and get through it, but i doubt it will work. if it doesnt work (although i will give it an honest shot) then i will do it, and i wont hurt anymore... Sorry for the wall of text... It has over 11600 characters, so its okay if you didnt read it all. soon i will be dead, and nobody will have to read another wall of text of my life again. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23x91h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nowthatsenough", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23x91h/i_always_thought_i_wouldnt_actually_do_it_but_i/", "name": "t3_23x91h", "created": 1398426065.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23x91h/i_always_thought_i_wouldnt_actually_do_it_but_i/", "author_flair_text": null, "title": "I always thought I wouldn't actually do it, but... I just can't keep letting life get worse anymore. I have a large prescription of Clonidine and may take them and never wake up, if not that, i will shoot myself. I want out", "created_utc": 1398397265.0, "ups": 5, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4rwti", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch4rrie", "approved_by": null, "body": "Thank you, I appreciate that.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I appreciate that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch4rwti", "created": 1398747128.0, "author_flair_text": null, "created_utc": 1398743528.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch4rrie", "gilded": 0, "author": "bobbyjr45", "parent_id": "t1_ch4po0q", "approved_by": null, "body": "No problem. And remember if you ever need to talk/vent I'll be here for you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem. And remember if you ever need to talk/vent I&amp;#39;ll be here for you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch4rrie", "created": 1398771986.0, "author_flair_text": null, "created_utc": 1398743186.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4po0q", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch4p1ra", "approved_by": null, "body": "thank you", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch4po0q", "created": 1398742394.0, "author_flair_text": null, "created_utc": 1398738794.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4p1ra", "gilded": 0, "author": "bobbyjr45", "parent_id": "t1_ch4o4l8", "approved_by": null, "body": "I hope it all works out", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope it all works out&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch4p1ra", "created": 1398741179.0, "author_flair_text": null, "created_utc": 1398737579.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4o4l8", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch1idqj", "approved_by": null, "body": "We will be staying together, but her parents have now expressed to me what they think needs to happen, and it's making the situation very trivial. I again have to wait it out. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We will be staying together, but her parents have now expressed to me what they think needs to happen, and it&amp;#39;s making the situation very trivial. I again have to wait it out. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch4o4l8", "created": 1398764585.0, "author_flair_text": null, "created_utc": 1398735785.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1iiur", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch1idqj", "approved_by": null, "body": "I will... thank you for reading everything and replying. Also, if you need to vent too, im also here. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will... thank you for reading everything and replying. Also, if you need to vent too, im also here. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1iiur", "created": 1398406817.0, "author_flair_text": null, "created_utc": 1398403217.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1idqj", "gilded": 0, "author": "bobbyjr45", "parent_id": "t1_ch1i9gs", "approved_by": null, "body": "Please update me on this. You can message me or reply on here. I want to be here for you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please update me on this. You can message me or reply on here. I want to be here for you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1idqj", "created": 1398406383.0, "author_flair_text": null, "created_utc": 1398402783.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1i9gs", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch1hh64", "approved_by": null, "body": "i will wait a bit longer. her family doesnt see us lasting, and that isnt a good sign. but, i dont know that for sure so for the time being, i will wait. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i will wait a bit longer. her family doesnt see us lasting, and that isnt a good sign. but, i dont know that for sure so for the time being, i will wait. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1i9gs", "created": 1398431236.0, "author_flair_text": null, "created_utc": 1398402436.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1hh64", "gilded": 0, "author": "bobbyjr45", "parent_id": "t1_ch1gpty", "approved_by": null, "body": "I've been in the same exact place as you. I've done the exact fucking thing you want to do. I need you to understand that I am your friend now. I will help you through anything. So do not do it. I care about you a great deal and I love you and I don't know you but please be strong. Don't give in to thus world. Don't let it fucking win. I will do my very best to save you from now on. You tell me if something is wrong and I will help you through it. If I can save you then maybe I won't close that fucking gap from the roof to the concrete. Please understand that I care. I genuinely do.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in the same exact place as you. I&amp;#39;ve done the exact fucking thing you want to do. I need you to understand that I am your friend now. I will help you through anything. So do not do it. I care about you a great deal and I love you and I don&amp;#39;t know you but please be strong. Don&amp;#39;t give in to thus world. Don&amp;#39;t let it fucking win. I will do my very best to save you from now on. You tell me if something is wrong and I will help you through it. If I can save you then maybe I won&amp;#39;t close that fucking gap from the roof to the concrete. Please understand that I care. I genuinely do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1hh64", "created": 1398428990.0, "author_flair_text": null, "created_utc": 1398400190.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1gpty", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch1gj71", "approved_by": null, "body": "i have been telling myself i will be better since after my first suicide attempt... it has gotten worse with every week that goes by, and i mean that literally. i dont like waiting for things to get worse... im tearing up again and i cant stop shaking. ive been crying and throwing up since after school. i also just got a text from my girlfriend saying that we need to talk. her parents found out i am an atheist because her brother, who is heavily catholic, since he said that i am going to try to convert everyone in the family and acted like i am poisoning their family. that was my only safe place to go from my hell hole of a house. i cant lose her, she is the only one who has actually made me feel happy. if her parents ban me from seeing their daughter because someone else lied about me for a second time, i wont be able to handle it\n\nif she ends it then this will be my last post. \n\n....im sorry", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i have been telling myself i will be better since after my first suicide attempt... it has gotten worse with every week that goes by, and i mean that literally. i dont like waiting for things to get worse... im tearing up again and i cant stop shaking. ive been crying and throwing up since after school. i also just got a text from my girlfriend saying that we need to talk. her parents found out i am an atheist because her brother, who is heavily catholic, since he said that i am going to try to convert everyone in the family and acted like i am poisoning their family. that was my only safe place to go from my hell hole of a house. i cant lose her, she is the only one who has actually made me feel happy. if her parents ban me from seeing their daughter because someone else lied about me for a second time, i wont be able to handle it&lt;/p&gt;\n\n&lt;p&gt;if she ends it then this will be my last post. &lt;/p&gt;\n\n&lt;p&gt;....im sorry&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1gpty", "created": 1398427046.0, "author_flair_text": null, "created_utc": 1398398246.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1gj71", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23x91h", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x91h", "score_hidden": false, "name": "t1_ch1gj71", "created": 1398426588.0, "author_flair_text": null, "created_utc": 1398397788.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]