[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throw-away because, well ya know. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m honestly just done with my life. Sick of it all. The past 6 months have put me in more pain than I used to be able to imagine. I used to be happy..Then I just started feeling so shitty about myself. I have always been an anxious person but it just heightened horribly. I was diagnosed with GAD and anorexia. After a solid 3 months of treatment I still feel worthless and like an even bigger failure, seeking out more treatment just feels humiliating. I don&amp;#39;t feel like starving myself or exercising non-stop anymore but damn it I just constantly feel anxious and stressed. I have no motivation or confidence. If I get out of the door my family considers that a win. They expect that little of me now.. I don&amp;#39;t care enough anymore to do anything. I know my way out and it would be quick and probably pain free...I just can&amp;#39;t bring myself to do it. Yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Throw-away because, well ya know. \n\nI'm honestly just done with my life. Sick of it all. The past 6 months have put me in more pain than I used to be able to imagine. I used to be happy..Then I just started feeling so shitty about myself. I have always been an anxious person but it just heightened horribly. I was diagnosed with GAD and anorexia. After a solid 3 months of treatment I still feel worthless and like an even bigger failure, seeking out more treatment just feels humiliating. I don't feel like starving myself or exercising non-stop anymore but damn it I just constantly feel anxious and stressed. I have no motivation or confidence. If I get out of the door my family considers that a win. They expect that little of me now.. I don't care enough anymore to do anything. I know my way out and it would be quick and probably pain free...I just can't bring myself to do it. Yet.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23wsky", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "WhyBotherAnyways", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23wsky/i_am_done_with_this_all/", "name": "t3_23wsky", "created": 1398415094.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23wsky/i_am_done_with_this_all/", "author_flair_text": null, "title": "I am done with this all.", "created_utc": 1398386294.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1dxzw", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch1dg1r", "approved_by": null, "body": "I completely understand, I know treatment is expensive.  I understand that you feel ashamed to ask for more help, but you need to understand that your anorexia and anxiety aren't defects in your character.  You've done nothing wrong and you didn't ask for this--who on earth would? Your family may be sad that you aren't improving, but they aren't going to be upset at you for something that's beyond your control.  They'll be proud of you for advocating for yourself--heck, I'll be proud of you for advocating for yourself, it's a hard thing to do.  If you worry about their disappointment in you for asking for help, imagine their disappointment if they have to bury their daughter.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely understand, I know treatment is expensive.  I understand that you feel ashamed to ask for more help, but you need to understand that your anorexia and anxiety aren&amp;#39;t defects in your character.  You&amp;#39;ve done nothing wrong and you didn&amp;#39;t ask for this--who on earth would? Your family may be sad that you aren&amp;#39;t improving, but they aren&amp;#39;t going to be upset at you for something that&amp;#39;s beyond your control.  They&amp;#39;ll be proud of you for advocating for yourself--heck, I&amp;#39;ll be proud of you for advocating for yourself, it&amp;#39;s a hard thing to do.  If you worry about their disappointment in you for asking for help, imagine their disappointment if they have to bury their daughter.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wsky", "score_hidden": false, "name": "t1_ch1dxzw", "created": 1398395634.0, "author_flair_text": null, "created_utc": 1398392034.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1dg1r", "gilded": 0, "author": "WhyBotherAnyways", "parent_id": "t1_ch1d6pl", "approved_by": null, "body": "I know I need help but I am just so ashamed. When I was in my most extensive treatment I was doing so well. The treatment team and my family both praised how quickly I was getting better but since leaving I am just deteriorating to where I was before.. I don't want to burden my parents with more medical bills and disappointment.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I need help but I am just so ashamed. When I was in my most extensive treatment I was doing so well. The treatment team and my family both praised how quickly I was getting better but since leaving I am just deteriorating to where I was before.. I don&amp;#39;t want to burden my parents with more medical bills and disappointment.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wsky", "score_hidden": false, "name": "t1_ch1dg1r", "created": 1398394577.0, "author_flair_text": null, "created_utc": 1398390977.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1d6pl", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23wsky", "approved_by": null, "body": "Anorexia and GAD are both tough things to deal with, but by no means impossible.  I know that three months seems like a long time, but when you've been suffering from something as long as you have, the change and improvement isn't going to be overnight.  There is no shame in getting further treatment for your conditions. It's brave and adult to admit you have an issue that needs more help.  There are people out there that are trained to help you through this. Just like our bodies break down sometimes, so do our brain.  ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anorexia and GAD are both tough things to deal with, but by no means impossible.  I know that three months seems like a long time, but when you&amp;#39;ve been suffering from something as long as you have, the change and improvement isn&amp;#39;t going to be overnight.  There is no shame in getting further treatment for your conditions. It&amp;#39;s brave and adult to admit you have an issue that needs more help.  There are people out there that are trained to help you through this. Just like our bodies break down sometimes, so do our brain.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wsky", "score_hidden": false, "name": "t1_ch1d6pl", "created": 1398394031.0, "author_flair_text": null, "created_utc": 1398390431.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]