[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I am just done with this shit. This year has been hell, I&amp;#39;ve battled Anorexia and GAD and whatever I am feeling now. I&amp;#39;ve gone through treatment and I felt normal for the first time in at least a year but I am right back to where I started. I feel like a lifeless zombie going through the motions again and again with no point. I DON&amp;#39;T REMEMBER WHAT HAPPINESS OR LOVE FEELS LIKE. It has been months since the last time I really smiled or felt even a connection with another human being.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t go to treatment again. The stigma, shame and money are something I can&amp;#39;t do. Let alone what my family thinks. Last week, in tears, I told my dad I think I need more help and he told me to get over it and be a man. There is no getting over it; there is no escape.. The only thing keeping me from pulling the trigger is fear of what happens next but I don&amp;#39;t think it can be worse than this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Honestly I am just done with this shit. This year has been hell, I've battled Anorexia and GAD and whatever I am feeling now. I've gone through treatment and I felt normal for the first time in at least a year but I am right back to where I started. I feel like a lifeless zombie going through the motions again and again with no point. I DON'T REMEMBER WHAT HAPPINESS OR LOVE FEELS LIKE. It has been months since the last time I really smiled or felt even a connection with another human being.\n\n I can't go to treatment again. The stigma, shame and money are something I can't do. Let alone what my family thinks. Last week, in tears, I told my dad I think I need more help and he told me to get over it and be a man. There is no getting over it; there is no escape.. The only thing keeping me from pulling the trigger is fear of what happens next but I don't think it can be worse than this.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24r457", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NothingInMyHeart", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24r457/i_am_ready_to_go/", "name": "t3_24r457", "created": 1399295533.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24r457/i_am_ready_to_go/", "author_flair_text": null, "title": "I am ready to go.", "created_utc": 1399266733.0, "ups": 9, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9vm00", "gilded": 0, "author": "theatrelover", "parent_id": "t3_24r457", "approved_by": null, "body": "Sometimes I don't remember what that feels like either. It helps to have someone, anyone IRL to talk to. Do you have a friend, religious person, counselor, doctor, teacher, hotline, *anyone?* The loneliness is hard. I hear ya. Having your dad say that was massively unhelpful. It's worth trying, though, to connect with someone. Is there *anyone* you could think of?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I don&amp;#39;t remember what that feels like either. It helps to have someone, anyone IRL to talk to. Do you have a friend, religious person, counselor, doctor, teacher, hotline, &lt;em&gt;anyone?&lt;/em&gt; The loneliness is hard. I hear ya. Having your dad say that was massively unhelpful. It&amp;#39;s worth trying, though, to connect with someone. Is there &lt;em&gt;anyone&lt;/em&gt; you could think of?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r457", "score_hidden": false, "name": "t1_ch9vm00", "created": 1399299699.0, "author_flair_text": null, "created_utc": 1399270899.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9wq7g", "gilded": 0, "author": "Elephantasaur", "parent_id": "t3_24r457", "approved_by": null, "body": "You should never feel shame for trying to put your life back together. What you've done is fucking awesome. I'm sorry it didn't work out for you last time. Maybe another go wouldn't be so bad, who knows. What do you really have to lose from it? Money, sure, but you can always make money. Hell, my dad got disability payment for being mentally ill. You shouldn't lose any self-image, because being proactive about your health is awesome. Fight the stigma. I fight it every day I hear someone say something negative about people who are trying to put their lives back together. I'm really sorry about your pop, though. That's a part of the stigma and it's a damn shame he's perpetuating it. Perhaps he just doesn't understand the way that depression works. It's a chemical imbalance that is mostly out of your control. A lot of people are taught differently. They want to believe that it's simply a weakness and that they're stronger. They're not though. Getting help is what makes you stronger, because it's no easy feat to A) admit that you need it and B) actually seek it out despite what others may think. \n\nBut fuck what others think, man. You're living this life for you, not them. I'm sorry that it has sucked so far, I really am. I hope you get help and find everything you need in this life. I hope you find happiness and love and everything that will fulfill you. I hope that you stay.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should never feel shame for trying to put your life back together. What you&amp;#39;ve done is fucking awesome. I&amp;#39;m sorry it didn&amp;#39;t work out for you last time. Maybe another go wouldn&amp;#39;t be so bad, who knows. What do you really have to lose from it? Money, sure, but you can always make money. Hell, my dad got disability payment for being mentally ill. You shouldn&amp;#39;t lose any self-image, because being proactive about your health is awesome. Fight the stigma. I fight it every day I hear someone say something negative about people who are trying to put their lives back together. I&amp;#39;m really sorry about your pop, though. That&amp;#39;s a part of the stigma and it&amp;#39;s a damn shame he&amp;#39;s perpetuating it. Perhaps he just doesn&amp;#39;t understand the way that depression works. It&amp;#39;s a chemical imbalance that is mostly out of your control. A lot of people are taught differently. They want to believe that it&amp;#39;s simply a weakness and that they&amp;#39;re stronger. They&amp;#39;re not though. Getting help is what makes you stronger, because it&amp;#39;s no easy feat to A) admit that you need it and B) actually seek it out despite what others may think. &lt;/p&gt;\n\n&lt;p&gt;But fuck what others think, man. You&amp;#39;re living this life for you, not them. I&amp;#39;m sorry that it has sucked so far, I really am. I hope you get help and find everything you need in this life. I hope you find happiness and love and everything that will fulfill you. I hope that you stay.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r457", "score_hidden": false, "name": "t1_ch9wq7g", "created": 1399304935.0, "author_flair_text": null, "created_utc": 1399276135.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]