[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, this is my first post here in &lt;a href=\"/r/suicidewatch\"&gt;/r/suicidewatch&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I am a 22 year old male trainee in the IT-Business. This is my final year and today is my final exam. Not everything was fine up till now, but i managed to get to this point. I am heavily obese, shy and addicted to anything PC related, be it gaming or surfing the web or anything, because it&amp;#39;s the only place i feel comfortable around and don&amp;#39;t have to bear the judging looks of strangers. I know that i can change myself and loose weight, but i can&amp;#39;t get through it because of my addiction. I never had a problem with money because of my parents, never learned discipline or the harsh life outside of my room where i get my meals and have everything i need. &lt;/p&gt;\n\n&lt;p&gt;Now i learned that i am not accepted for the final exam of my apprenticeship and all 3 years of training are going to waste. If my father hears about this he will throw me out into the streets and i am done for. With my heavy obesity no one is willing to hire me as a trainee here and i can&amp;#39;t do labor work because just walking up 2 floors makes me loose all my breath. I know i can&amp;#39;t survive in the outside world and i know my father will really throw me out, because he knows of my addiction and rightfully blames it for my failure. He doesn&amp;#39;t want to feed me all his life, especially after he retires next year. &lt;/p&gt;\n\n&lt;p&gt;I know that all of this is my fault and if i only changed a little i could have passed my final exam with good grades, but i am too lazy and too addicted to my virtual world. I don&amp;#39;t know what to do anymore. I will have no job, no home, no chance of getting hired for a job. I just don&amp;#39;t know what i can do about my future. I can&amp;#39;t sleep anymore because i know i am done for. I seriously fucked up my whole life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, this is my first post here in /r/suicidewatch.\n\nI am a 22 year old male trainee in the IT-Business. This is my final year and today is my final exam. Not everything was fine up till now, but i managed to get to this point. I am heavily obese, shy and addicted to anything PC related, be it gaming or surfing the web or anything, because it's the only place i feel comfortable around and don't have to bear the judging looks of strangers. I know that i can change myself and loose weight, but i can't get through it because of my addiction. I never had a problem with money because of my parents, never learned discipline or the harsh life outside of my room where i get my meals and have everything i need. \n\nNow i learned that i am not accepted for the final exam of my apprenticeship and all 3 years of training are going to waste. If my father hears about this he will throw me out into the streets and i am done for. With my heavy obesity no one is willing to hire me as a trainee here and i can't do labor work because just walking up 2 floors makes me loose all my breath. I know i can't survive in the outside world and i know my father will really throw me out, because he knows of my addiction and rightfully blames it for my failure. He doesn't want to feed me all his life, especially after he retires next year. \n\nI know that all of this is my fault and if i only changed a little i could have passed my final exam with good grades, but i am too lazy and too addicted to my virtual world. I don't know what to do anymore. I will have no job, no home, no chance of getting hired for a job. I just don't know what i can do about my future. I can't sleep anymore because i know i am done for. I seriously fucked up my whole life.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24x15t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayiwillforge7", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24x15t/i_am_fcked/", "name": "t3_24x15t", "created": 1399456687.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24x15t/i_am_fcked/", "author_flair_text": null, "title": "I am f*cked...", "created_utc": 1399427887.0, "ups": 7, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc2k7d", "gilded": 0, "author": "oldandgreat", "parent_id": "t1_chbm63f", "approved_by": null, "body": "Your father seems pretty hard. One suggestion, give him your pc, say you want one more chance. Than you can get a plan straight for your future self. Weight loss. Education. In a year you could do so much. You can shut your tab and carry on, or you stop right now.  If you need help, we can give you some advice. Just think about it. If you show your dad, i made this mistake, but i will be fucking correct it. In a year, you can get it all right. Im here to help, i trusting you that you are able to do that! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your father seems pretty hard. One suggestion, give him your pc, say you want one more chance. Than you can get a plan straight for your future self. Weight loss. Education. In a year you could do so much. You can shut your tab and carry on, or you stop right now.  If you need help, we can give you some advice. Just think about it. If you show your dad, i made this mistake, but i will be fucking correct it. In a year, you can get it all right. Im here to help, i trusting you that you are able to do that! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x15t", "score_hidden": false, "name": "t1_chc2k7d", "created": 1399519504.0, "author_flair_text": null, "created_utc": 1399490704.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbm63f", "gilded": 0, "author": "throwawayiwillforge7", "parent_id": "t1_chbkwmb", "approved_by": null, "body": "Basically if you don't pass the final exam you won't complete your apprenticeship meaning no one will hire you because you can't prove that you are qualified for it. It doesn't matter if anyone can vouch for you or not. \n\nThe problem is i know that but every time i want to do something about that i either fall back after maybe 1 week or pretend i forgot about it.\n\nThe funny thing is what we learn and need for our job and what we need to learn for the final exam is completely different. We are asked about stuff from around 2000-2005 which is not relevant for what we need to know in this day and age. Especially in the fast changing IT-Business. We learn things no one anymore uses today and are tested in that. And if we don't pass that test we can't call ourself \"trained\" or \"qualified\" which somehow is totally retarded.\n\nI actually signed me up to a seminar about healthy food and stuff back in March. Together with my father who is just slight obese. But after he learns i basically lost 3 years of my life because i can't get my certificate i don't know what will happen. He always threatens me with \"if you fail this one i throw you out\". And i just failed. He is a man of his words.\n\nThats why i probably need a therapist of some sort. But i won't have money for that after i am jobless and probably homeless if i can't stay somewhere at a friends for a while. For a long long time i didn't care about the real life. I went to a fitness center to loose some weight and get laughed and stared at. I try using home exercises and simply fall back into playing some games. If i force myself not to turn my PC on and do something about myself i get withdrawal symptoms of some sort. Like i get frustrated, stressed, angry. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically if you don&amp;#39;t pass the final exam you won&amp;#39;t complete your apprenticeship meaning no one will hire you because you can&amp;#39;t prove that you are qualified for it. It doesn&amp;#39;t matter if anyone can vouch for you or not. &lt;/p&gt;\n\n&lt;p&gt;The problem is i know that but every time i want to do something about that i either fall back after maybe 1 week or pretend i forgot about it.&lt;/p&gt;\n\n&lt;p&gt;The funny thing is what we learn and need for our job and what we need to learn for the final exam is completely different. We are asked about stuff from around 2000-2005 which is not relevant for what we need to know in this day and age. Especially in the fast changing IT-Business. We learn things no one anymore uses today and are tested in that. And if we don&amp;#39;t pass that test we can&amp;#39;t call ourself &amp;quot;trained&amp;quot; or &amp;quot;qualified&amp;quot; which somehow is totally retarded.&lt;/p&gt;\n\n&lt;p&gt;I actually signed me up to a seminar about healthy food and stuff back in March. Together with my father who is just slight obese. But after he learns i basically lost 3 years of my life because i can&amp;#39;t get my certificate i don&amp;#39;t know what will happen. He always threatens me with &amp;quot;if you fail this one i throw you out&amp;quot;. And i just failed. He is a man of his words.&lt;/p&gt;\n\n&lt;p&gt;Thats why i probably need a therapist of some sort. But i won&amp;#39;t have money for that after i am jobless and probably homeless if i can&amp;#39;t stay somewhere at a friends for a while. For a long long time i didn&amp;#39;t care about the real life. I went to a fitness center to loose some weight and get laughed and stared at. I try using home exercises and simply fall back into playing some games. If i force myself not to turn my PC on and do something about myself i get withdrawal symptoms of some sort. Like i get frustrated, stressed, angry. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x15t", "score_hidden": false, "name": "t1_chbm63f", "created": 1399468217.0, "author_flair_text": null, "created_utc": 1399439417.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chbkwmb", "gilded": 0, "author": "mysteryweapon", "parent_id": "t1_chbisdy", "approved_by": null, "body": "What does the final exam get you? Does it invalidate the actual knowledge you have gained? It sounds like if your trainer failed to notice too, you really can't entirely blame yourself for that.\n\nYour health and your addiction are another matter. One step at a time. \n\nWhat have you actually learned that you can apply to getting a job even if you haven't passed the final exam?\n\nFind a way to get help for your addiction through either therapy, or maybe [Overeaters Anonymous](http://www.oa.org/). \n\nYou can throw away an account here on reddit, but throwing away your body means ignoring every single possible opportunity that could happen between now and the rest of your life.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does the final exam get you? Does it invalidate the actual knowledge you have gained? It sounds like if your trainer failed to notice too, you really can&amp;#39;t entirely blame yourself for that.&lt;/p&gt;\n\n&lt;p&gt;Your health and your addiction are another matter. One step at a time. &lt;/p&gt;\n\n&lt;p&gt;What have you actually learned that you can apply to getting a job even if you haven&amp;#39;t passed the final exam?&lt;/p&gt;\n\n&lt;p&gt;Find a way to get help for your addiction through either therapy, or maybe &lt;a href=\"http://www.oa.org/\"&gt;Overeaters Anonymous&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;You can throw away an account here on reddit, but throwing away your body means ignoring every single possible opportunity that could happen between now and the rest of your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x15t", "score_hidden": false, "name": "t1_chbkwmb", "created": 1399464571.0, "author_flair_text": null, "created_utc": 1399435771.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbisdy", "gilded": 0, "author": "throwawayiwillforge7", "parent_id": "t1_chbhmu1", "approved_by": null, "body": "Because me and my trainer failed to notice that you have to bring your training certificate also to the written exam, not only to the presentation of your project work.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because me and my trainer failed to notice that you have to bring your training certificate also to the written exam, not only to the presentation of your project work.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x15t", "score_hidden": false, "name": "t1_chbisdy", "created": 1399459488.0, "author_flair_text": null, "created_utc": 1399430688.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbhmu1", "gilded": 0, "author": "Tonyruatx", "parent_id": "t3_24x15t", "approved_by": null, "body": "Why didn't you get accepted for your exam?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why didn&amp;#39;t you get accepted for your exam?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x15t", "score_hidden": false, "name": "t1_chbhmu1", "created": 1399457014.0, "author_flair_text": null, "created_utc": 1399428214.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]