[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have about 60 pages of heavy duty research papers to do this week, have no more ADHD/depression meds, have to move out in a little bit, am worried about graduating (bachelors), am afraid of moving back in with my dysfunctional family, and have a presentation i havnt started due in about 4 hours. My family and abusive brother are coming out to watch me &amp;quot;graduate&amp;quot; but I don&amp;#39;t even know if I can make it through a day let alone actually finish all this work. My scholarship wont cover another year and if I take a fifth I&amp;#39;ll be swimming in a mountain of debt. Even if i do graduate I have no clue what I am going to do once I&amp;#39;m out of college. &lt;/p&gt;\n\n&lt;p&gt;I have been struggling with suicidal urges since I was 9 years old and despise nearly everything about myself. I&amp;#39;ve been self harming for about 8 years (cutting, burning, scratching). I&amp;#39;ve been diagnosed with disthymia. I don&amp;#39;t really have a best friend to talk to about this.&lt;/p&gt;\n\n&lt;p&gt;I actually work in a program at our school to help people going through moments of crisis, as a helper. None of my coworkers know that I am probably at a higher risk of committing suicide than most of our clients. I have stopped taking cases and have not told them why. Several of them have figured out something was up and have tried to help, only to give up because my case is so convoluted and deep rooted.&lt;/p&gt;\n\n&lt;p&gt;My professors have given me extension after extension but iit just doesnt help. I am terrified of writing at this point because I am so overwhelmed by deadlines and finals (next week). &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have the courage to end my own life, but I think a part of that is my fear of my own blood. I need a gun or a place to hang a rope. There are no good hanging spots nearby save for a tree, but if I do that someone might try to save me, and then I&amp;#39;d be in mental institutes for the rest of my life. My dad will likely have his little pistol that shoots shotgun shells though, and I know if I have access to it things might get messy. &lt;/p&gt;\n\n&lt;p&gt;Everyone has such high expectations of me and I don&amp;#39;t understand why. I got a full ride to the best private college in the state. WHY?! I&amp;#39;m an obnoxious dunce who can&amp;#39;t focus on anything.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care how it happens, I just WANT OUT. The stress is too much and I can&amp;#39;t take it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have about 60 pages of heavy duty research papers to do this week, have no more ADHD/depression meds, have to move out in a little bit, am worried about graduating (bachelors), am afraid of moving back in with my dysfunctional family, and have a presentation i havnt started due in about 4 hours. My family and abusive brother are coming out to watch me \"graduate\" but I don't even know if I can make it through a day let alone actually finish all this work. My scholarship wont cover another year and if I take a fifth I'll be swimming in a mountain of debt. Even if i do graduate I have no clue what I am going to do once I'm out of college. \n\nI have been struggling with suicidal urges since I was 9 years old and despise nearly everything about myself. I've been self harming for about 8 years (cutting, burning, scratching). I've been diagnosed with disthymia. I don't really have a best friend to talk to about this.\n\nI actually work in a program at our school to help people going through moments of crisis, as a helper. None of my coworkers know that I am probably at a higher risk of committing suicide than most of our clients. I have stopped taking cases and have not told them why. Several of them have figured out something was up and have tried to help, only to give up because my case is so convoluted and deep rooted.\n\nMy professors have given me extension after extension but iit just doesnt help. I am terrified of writing at this point because I am so overwhelmed by deadlines and finals (next week). \n\nI don't have the courage to end my own life, but I think a part of that is my fear of my own blood. I need a gun or a place to hang a rope. There are no good hanging spots nearby save for a tree, but if I do that someone might try to save me, and then I'd be in mental institutes for the rest of my life. My dad will likely have his little pistol that shoots shotgun shells though, and I know if I have access to it things might get messy. \n\nEveryone has such high expectations of me and I don't understand why. I got a full ride to the best private college in the state. WHY?! I'm an obnoxious dunce who can't focus on anything.  \n\nI don't care how it happens, I just WANT OUT. The stress is too much and I can't take it. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24rqkq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ScreamsWithoutAVoice", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24rqkq/i_am_full_on_panic_mode_right_now_and_i_would/", "name": "t3_24rqkq", "created": 1399322277.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24rqkq/i_am_full_on_panic_mode_right_now_and_i_would/", "author_flair_text": null, "title": "I am full on panic mode right now and I would like nothing more than to shishkebab my own heart with the knife next to me.", "created_utc": 1399293477.0, "ups": 12, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9zxax", "gilded": 0, "author": "talktoaliens", "parent_id": "t3_24rqkq", "approved_by": null, "body": "You might not believe it or be able to understand it yourself, but others saw something in you. You're not a dunce, and definitely not obnoxious.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might not believe it or be able to understand it yourself, but others saw something in you. You&amp;#39;re not a dunce, and definitely not obnoxious.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rqkq", "score_hidden": false, "name": "t1_ch9zxax", "created": 1399322703.0, "author_flair_text": null, "created_utc": 1399293903.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha0ubb", "gilded": 0, "author": "ultrapreneruship", "parent_id": "t3_24rqkq", "approved_by": null, "body": "I really want to send you a hug, just keep being as brave as you had ever been, just keep going.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really want to send you a hug, just keep being as brave as you had ever been, just keep going.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rqkq", "score_hidden": false, "name": "t1_cha0ubb", "created": 1399325744.0, "author_flair_text": null, "created_utc": 1399296944.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha093v", "gilded": 0, "author": "purpleaquarius", "parent_id": "t3_24rqkq", "approved_by": null, "body": "Take a breathe for a moment. Same boat. Finals are so stressful, got a full ride, finals and all kinds of things on my plate. Its hard, and trust me I've been tempted myself. Know that your going to be OK, you've made it so far don't give up  now, if you have access with Google drive, I'd be more than willing to help you finish your work and what not, in any way possible. Stress is something that is so stressful, killing yourself, I assure you will solve nothing, once you complete this it'll be alright. People love and care about you, and expectations people will always have different ones, all you can do is your best, and personally want to applaud you, you sound like you've gone through a lot and to be doing this much takes courage. Don't give up. You can do this, there are people here for you. ", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a breathe for a moment. Same boat. Finals are so stressful, got a full ride, finals and all kinds of things on my plate. Its hard, and trust me I&amp;#39;ve been tempted myself. Know that your going to be OK, you&amp;#39;ve made it so far don&amp;#39;t give up  now, if you have access with Google drive, I&amp;#39;d be more than willing to help you finish your work and what not, in any way possible. Stress is something that is so stressful, killing yourself, I assure you will solve nothing, once you complete this it&amp;#39;ll be alright. People love and care about you, and expectations people will always have different ones, all you can do is your best, and personally want to applaud you, you sound like you&amp;#39;ve gone through a lot and to be doing this much takes courage. Don&amp;#39;t give up. You can do this, there are people here for you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rqkq", "score_hidden": false, "name": "t1_cha093v", "created": 1399323871.0, "author_flair_text": null, "created_utc": 1399295071.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha1gdq", "gilded": 0, "author": "qaqa1", "parent_id": "t3_24rqkq", "approved_by": null, "body": "Everyone gets into these situations in life where they feel like they're being crushed under all the pressure and expectations and they should just end it all because then they won't have to deal with it all. You and I both know this situation you're in will eventually pass and you'l be just fine. Just try and get your presentation done now and get it handed in, then try and get through your research papers little by little. You'll be fine in the end, don't worry :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone gets into these situations in life where they feel like they&amp;#39;re being crushed under all the pressure and expectations and they should just end it all because then they won&amp;#39;t have to deal with it all. You and I both know this situation you&amp;#39;re in will eventually pass and you&amp;#39;l be just fine. Just try and get your presentation done now and get it handed in, then try and get through your research papers little by little. You&amp;#39;ll be fine in the end, don&amp;#39;t worry :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rqkq", "score_hidden": false, "name": "t1_cha1gdq", "created": 1399327463.0, "author_flair_text": null, "created_utc": 1399298663.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]