[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 19. I recently did some really fucked up stuff that I don&amp;#39;t exactly feel comfortable articulating in any way; I don&amp;#39;t think I deserve to live.&lt;/p&gt;\n\n&lt;p&gt;Why? Well, this past December I cheated on my girlfriend. Why? I don&amp;#39;t know. I haven&amp;#39;t done anything like that in my life before. I didn&amp;#39;t think I was capable of something like that. Yet I did it. Then to make it worse, I lied by not telling my girlfriend. Then I lied by &amp;quot;confessing&amp;quot;, telling her I kissed someone and felt guilty. Then I confessed, my guilt having built up. She broke up with me, which is obviously a solid move. This is fucked up. I know. I don&amp;#39;t recognize myself with these actions. I&amp;#39;m getting ready to graduate from university early, my relationship with her had been great, etc.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if I can live with myself. I know there&amp;#39;s other people but that&amp;#39;s not what I care about. I don&amp;#39;t even know who I am. I mean, I stooped to a really goddamn low fucking level.&lt;/p&gt;\n\n&lt;p&gt;I would feel so much better if she would forgive me and take me back, but I know she doesn&amp;#39;t have to at all; I realize that I hurt her enough that I deserve to be dumped like the sack of shit I am.&lt;/p&gt;\n\n&lt;p&gt;She said we could be friends, and even hang out, maybe even be intimate, as long as we&amp;#39;re not dating. That concept scares the fuck out of me, considering we were talking about moving in; we had more than enough reason to believe we would have a life together. Last year, we had an unwanted pregnancy and she had an abortion. We talked about having kids when the time was right. My point is, there were so many feelings and we were heading in a direction, together.&lt;/p&gt;\n\n&lt;p&gt;Then I fucked it up, and I can&amp;#39;t explain my actions. I truly can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I want you to convince me that I&amp;#39;m ok, but I feel like most of the people on here have good character and will look down on me. I understand. I&amp;#39;m looking down upon myself.&lt;/p&gt;\n\n&lt;p&gt;I just want to poison myself with CO or something, just get it over with.&lt;/p&gt;\n\n&lt;p&gt;Also, if you were to say, &amp;quot;it&amp;#39;s not that bad, you could have done A, B, C...&amp;quot;, that doesn&amp;#39;t excuse a damn thing.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I chatted on a hotline earlier, it made me feel better but I don&amp;#39;t know if I can forgive myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 19. I recently did some really fucked up stuff that I don't exactly feel comfortable articulating in any way; I don't think I deserve to live.\n\nWhy? Well, this past December I cheated on my girlfriend. Why? I don't know. I haven't done anything like that in my life before. I didn't think I was capable of something like that. Yet I did it. Then to make it worse, I lied by not telling my girlfriend. Then I lied by \"confessing\", telling her I kissed someone and felt guilty. Then I confessed, my guilt having built up. She broke up with me, which is obviously a solid move. This is fucked up. I know. I don't recognize myself with these actions. I'm getting ready to graduate from university early, my relationship with her had been great, etc.\n\nI don't know if I can live with myself. I know there's other people but that's not what I care about. I don't even know who I am. I mean, I stooped to a really goddamn low fucking level.\n\nI would feel so much better if she would forgive me and take me back, but I know she doesn't have to at all; I realize that I hurt her enough that I deserve to be dumped like the sack of shit I am.\n\nShe said we could be friends, and even hang out, maybe even be intimate, as long as we're not dating. That concept scares the fuck out of me, considering we were talking about moving in; we had more than enough reason to believe we would have a life together. Last year, we had an unwanted pregnancy and she had an abortion. We talked about having kids when the time was right. My point is, there were so many feelings and we were heading in a direction, together.\n\nThen I fucked it up, and I can't explain my actions. I truly can't.\n\nI want you to convince me that I'm ok, but I feel like most of the people on here have good character and will look down on me. I understand. I'm looking down upon myself.\n\nI just want to poison myself with CO or something, just get it over with.\n\nAlso, if you were to say, \"it's not that bad, you could have done A, B, C...\", that doesn't excuse a damn thing.\n\nEDIT: I chatted on a hotline earlier, it made me feel better but I don't know if I can forgive myself.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24u6ac", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "shame1237651", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24u6ac/i_am_a_piece_of_shit_listen_if_you_want_but_i/", "name": "t3_24u6ac", "created": 1399378255.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24u6ac/i_am_a_piece_of_shit_listen_if_you_want_but_i/", "author_flair_text": null, "title": "I am a piece of shit. Listen if you want but I warned you.", "created_utc": 1399349455.0, "ups": 5, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaq8gm", "gilded": 0, "author": "theatrelover", "parent_id": "t3_24u6ac", "approved_by": null, "body": "You did a bad thing. No doubt. You know it, I know it, it's out there. You unquestionably did a bad thing.\n\nHowever...did you really do something that merits the death penalty? Have you done something that shows you are an irreparably *bad* person? I don't think so. I think if you die now, you've missed out on many years of doing the right thing. Of making better choices, making others happy, fulfilling potential, helping make the world a better place. This ride isn't worth much if we fuck up once and get voted off the island. I think it's a better deal to know we've fucked up and we have to make things right whenever, wherever we can. Good luck to you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did a bad thing. No doubt. You know it, I know it, it&amp;#39;s out there. You unquestionably did a bad thing.&lt;/p&gt;\n\n&lt;p&gt;However...did you really do something that merits the death penalty? Have you done something that shows you are an irreparably &lt;em&gt;bad&lt;/em&gt; person? I don&amp;#39;t think so. I think if you die now, you&amp;#39;ve missed out on many years of doing the right thing. Of making better choices, making others happy, fulfilling potential, helping make the world a better place. This ride isn&amp;#39;t worth much if we fuck up once and get voted off the island. I think it&amp;#39;s a better deal to know we&amp;#39;ve fucked up and we have to make things right whenever, wherever we can. Good luck to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24u6ac", "score_hidden": false, "name": "t1_chaq8gm", "created": 1399380845.0, "author_flair_text": null, "created_utc": 1399352045.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaq4e6", "gilded": 0, "author": "fairyqueen2000", "parent_id": "t3_24u6ac", "approved_by": null, "body": "Hey there, I'm sorry to hear that. I don't doubt for a second that you really valued your relationship. How are you feeling right this moment? I'm glad you feel better after talking it out! As the sidebar says, this is a place of support; don't worry about being judged. :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there, I&amp;#39;m sorry to hear that. I don&amp;#39;t doubt for a second that you really valued your relationship. How are you feeling right this moment? I&amp;#39;m glad you feel better after talking it out! As the sidebar says, this is a place of support; don&amp;#39;t worry about being judged. :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24u6ac", "score_hidden": false, "name": "t1_chaq4e6", "created": 1399380512.0, "author_flair_text": null, "created_utc": 1399351712.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chau8tg", "gilded": 0, "author": "Maun-U", "parent_id": "t3_24u6ac", "approved_by": null, "body": "Think about this way - if you kill yourself she will be devastated. I guarantee that the pain she will go through will be far worse than what cheating on her has done.\nDo everything you can to stay on track and keep living. It's hard, you've lost someone who was incredibly important to you. But you need to keep on. Things will invariably improve.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think about this way - if you kill yourself she will be devastated. I guarantee that the pain she will go through will be far worse than what cheating on her has done.\nDo everything you can to stay on track and keep living. It&amp;#39;s hard, you&amp;#39;ve lost someone who was incredibly important to you. But you need to keep on. Things will invariably improve.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24u6ac", "score_hidden": false, "name": "t1_chau8tg", "created": 1399400898.0, "author_flair_text": null, "created_utc": 1399372098.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]