[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you understand that phrase than you know exactly how i feel. I feel so alone all the time with no exceptions. I fell hard into drugs this year and now i feel like every friendship, relationship, or positive acquaintance has been due to me being able to either get drugs or me knowing people who can. i want to quit but i can&amp;#39;t without a crippling fear of losing everyone i have met and formed any sort of bond with. I just can&amp;#39;t see a way out and I have no idea what to do. I just wandered around my town seriously debating suicide for the first time ever. I just don&amp;#39;t know what to do anymore and all of my options are so bleak all the fucking time. I just don&amp;#39;t know. Even more than this, I feel selfish when i bring it up to anyone and always get the same shit that &amp;quot;well you should just stop using and see who your real friends are&amp;quot; but its not that easy. I am so scared of losing everyone and just do not know anymore what I should do. Even the friends I still have from high school i am afraid to say how I feel. I don&amp;#39;t know what to do anymore. Any help would be appreciated because i just can&amp;#39;t live this way anymore and suicide has become my only option.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If you understand that phrase than you know exactly how i feel. I feel so alone all the time with no exceptions. I fell hard into drugs this year and now i feel like every friendship, relationship, or positive acquaintance has been due to me being able to either get drugs or me knowing people who can. i want to quit but i can't without a crippling fear of losing everyone i have met and formed any sort of bond with. I just can't see a way out and I have no idea what to do. I just wandered around my town seriously debating suicide for the first time ever. I just don't know what to do anymore and all of my options are so bleak all the fucking time. I just don't know. Even more than this, I feel selfish when i bring it up to anyone and always get the same shit that \"well you should just stop using and see who your real friends are\" but its not that easy. I am so scared of losing everyone and just do not know anymore what I should do. Even the friends I still have from high school i am afraid to say how I feel. I don't know what to do anymore. Any help would be appreciated because i just can't live this way anymore and suicide has become my only option.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24940h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "trigeronos", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398746830.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24940h/i_am_alone_even_though_im_not/", "name": "t3_24940h", "created": 1398775412.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24940h/i_am_alone_even_though_im_not/", "author_flair_text": null, "title": "I am alone even though i'm not", "created_utc": 1398746612.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4twyd", "gilded": 0, "author": "AlwaysTodash", "parent_id": "t3_24940h", "approved_by": null, "body": "Well you could start by pursuing other hobbies. You'll hopefully meet people who share the same interest the same way you did with this whole drug situation.\nThen you can slowly start quitting, and maybe the friends you'd met and are afraid of losing might understand and not even ditch you, but if they do, you'll eventually be able to move on, because you have new friends. That's what I might try anyway.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well you could start by pursuing other hobbies. You&amp;#39;ll hopefully meet people who share the same interest the same way you did with this whole drug situation.\nThen you can slowly start quitting, and maybe the friends you&amp;#39;d met and are afraid of losing might understand and not even ditch you, but if they do, you&amp;#39;ll eventually be able to move on, because you have new friends. That&amp;#39;s what I might try anyway.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24940h", "score_hidden": false, "name": "t1_ch4twyd", "created": 1398777532.0, "author_flair_text": null, "created_utc": 1398748732.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]