[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have crimes committed against me at least weekly. Some are small, some are major. But they all add up. It used to be daily. People are mean. And when I stick up for myself, they are on the mean person&amp;#39;s side. Well, thank you Missouri and the people in it, for never protecting me from the criminals like you were supposed to. And thank you for creating these new laws and bills making gun and ammo ownership easy. Now I can give myself something that actually works. Because enforcing the law is not your style. I don&amp;#39;t even try any more. I have no faith in the criminal justice system. Even if you try to revise your entire criminal code, you&amp;#39;ll still be the same people who don&amp;#39;t care. Because you&amp;#39;re just doing it to make your jobs easier. If you decide that you won&amp;#39;t let someone kidnap my corpse and throw it along the side of the road, then when you bury me, please just leave my dead body alone. Don&amp;#39;t pretend that you care AFTER the fact. I am just one in seven billion people. I tried to help myself and you were not willing to work with me. This also goes to the Fortune 1000 international megacorporation that let the woman punch me in the head for no reason and never fired her. Pass that one last bill Missouri and then my plans will be completed for a so long and farewill.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have crimes committed against me at least weekly. Some are small, some are major. But they all add up. It used to be daily. People are mean. And when I stick up for myself, they are on the mean person's side. Well, thank you Missouri and the people in it, for never protecting me from the criminals like you were supposed to. And thank you for creating these new laws and bills making gun and ammo ownership easy. Now I can give myself something that actually works. Because enforcing the law is not your style. I don't even try any more. I have no faith in the criminal justice system. Even if you try to revise your entire criminal code, you'll still be the same people who don't care. Because you're just doing it to make your jobs easier. If you decide that you won't let someone kidnap my corpse and throw it along the side of the road, then when you bury me, please just leave my dead body alone. Don't pretend that you care AFTER the fact. I am just one in seven billion people. I tried to help myself and you were not willing to work with me. This also goes to the Fortune 1000 international megacorporation that let the woman punch me in the head for no reason and never fired her. Pass that one last bill Missouri and then my plans will be completed for a so long and farewill.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259jlp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "newlawsaregood", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259jlp/i_am_sick_of_this_now_thank_you_missouri/", "name": "t3_259jlp", "created": 1399818210.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259jlp/i_am_sick_of_this_now_thank_you_missouri/", "author_flair_text": null, "title": "I am sick of this now. Thank you, Missouri.", "created_utc": 1399789410.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]