[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll come out and say it. I don&amp;#39;t want to die. I don&amp;#39;t! I want to stay here...things seem to be getting better right now! I have a beautiful girlfriend, who I love very much.&lt;/p&gt;\n\n&lt;p&gt;However, that&amp;#39;s not to be confused with I&amp;#39;m staying. I am only posting this because I really hope to leave with some positivity in my mind. &lt;/p&gt;\n\n&lt;p&gt;My parents, surprisingly, have pushed me over the edge. I quit a single club, and now they are under the influence that I won&amp;#39;t be getting into college. They are kicking me out of the house after school ends this year, and will not be providing for me any longer. I am a 17 year old boy. I cannot provide for myself. (Granted, this isn&amp;#39;t the only thing that has lead me to my decision, it has merely pushed me over the edge)&lt;/p&gt;\n\n&lt;p&gt;Tonight, I have finally attempted to leave. I have taken a variety of pills, and excluding Ibprophen, I have no clue what they are. They all seem to not be what I am after, considering it has been 2.5 hours, and I only feel very tired, very cloudy, and light headed, however, that is most likely due to the second attempt. &lt;/p&gt;\n\n&lt;p&gt;Only a bit ago, I decided to attempt to cut my arm, longways, as I heard that cutting in such a way leads to results. After quite a bit of pain, and blood that is still pouring out, I decided that this wasn&amp;#39;t the method for me. It has been taped, as I could no longer deal with the sight of blood. &lt;/p&gt;\n\n&lt;p&gt;I will be leaving my house tonight, in hopes to die via car crash, in the same spot that my best friend, three years ago died. I do not think that the world is against me, so I will be only taking myself, in hitting the same tree that Zach did. No one else needs to die because of me. (He died at 18 years old. It isn&amp;#39;t fair. I still don&amp;#39;t understand how it could have happened. He was a very cautious driver, however this is aside the point)&lt;/p&gt;\n\n&lt;p&gt;I still do not understand how my mother is not suspicious of anything. She cares about me so little, that after the argument, she has not seen me again, or heard the shuffling for the pills, or even heard the knife drop to the floor, after the shock from the cut.&lt;/p&gt;\n\n&lt;p&gt;Please, anyone still in school, don&amp;#39;t worry about what people have to say, or think, just worry about getting good grades, and perhaps you will be able to pull through your depression after all. &lt;/p&gt;\n\n&lt;p&gt;Thank you for your time. You have, in those few minutes, given me more of your time than most of the people in my life give me. I thank you. This is my first post to Suicide Watch, and my last. I don&amp;#39;t want to leave, however I have too much pride to live on the streets, without an education, and far too stupid to start a life for myself. Thanks for your time.&lt;/p&gt;\n\n&lt;p&gt;I will not be leaving for atleast an hour, in hopes that I can clear anything up. I know it shouldn&amp;#39;t matter, however, this is my suicide note, and I don&amp;#39;t want it to be unclear, because I really don&amp;#39;t want to hurt my Brother, Girlfriend, or best friend. In fact, I love all of them, and in case they ever find this: &lt;/p&gt;\n\n&lt;p&gt;I love you Robbie, you were the best brother i could have had. You were always so incredibly understanding. Thanks \nI love you Mikaela, Thanks for making these past three months the best of my life. \nI love you Trevor, You are my best friend. I&amp;#39;ll miss you.&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m still here. The cut on my arm was discovered by my mom when I tried to get my keys. I most likely couldn&amp;#39;t have wrecked the car anyways. I do want to finish this year. I am very OCD, and I can&amp;#39;t leave a year unfinished. I will update at the beginning of summer. It was too rash of a decision to kill myself. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll come out and say it. I don't want to die. I don't! I want to stay here...things seem to be getting better right now! I have a beautiful girlfriend, who I love very much.\n\nHowever, that's not to be confused with I'm staying. I am only posting this because I really hope to leave with some positivity in my mind. \n\nMy parents, surprisingly, have pushed me over the edge. I quit a single club, and now they are under the influence that I won't be getting into college. They are kicking me out of the house after school ends this year, and will not be providing for me any longer. I am a 17 year old boy. I cannot provide for myself. (Granted, this isn't the only thing that has lead me to my decision, it has merely pushed me over the edge)\n\nTonight, I have finally attempted to leave. I have taken a variety of pills, and excluding Ibprophen, I have no clue what they are. They all seem to not be what I am after, considering it has been 2.5 hours, and I only feel very tired, very cloudy, and light headed, however, that is most likely due to the second attempt. \n\nOnly a bit ago, I decided to attempt to cut my arm, longways, as I heard that cutting in such a way leads to results. After quite a bit of pain, and blood that is still pouring out, I decided that this wasn't the method for me. It has been taped, as I could no longer deal with the sight of blood. \n\nI will be leaving my house tonight, in hopes to die via car crash, in the same spot that my best friend, three years ago died. I do not think that the world is against me, so I will be only taking myself, in hitting the same tree that Zach did. No one else needs to die because of me. (He died at 18 years old. It isn't fair. I still don't understand how it could have happened. He was a very cautious driver, however this is aside the point)\n\nI still do not understand how my mother is not suspicious of anything. She cares about me so little, that after the argument, she has not seen me again, or heard the shuffling for the pills, or even heard the knife drop to the floor, after the shock from the cut.\n\nPlease, anyone still in school, don't worry about what people have to say, or think, just worry about getting good grades, and perhaps you will be able to pull through your depression after all. \n\nThank you for your time. You have, in those few minutes, given me more of your time than most of the people in my life give me. I thank you. This is my first post to Suicide Watch, and my last. I don't want to leave, however I have too much pride to live on the streets, without an education, and far too stupid to start a life for myself. Thanks for your time.\n\nI will not be leaving for atleast an hour, in hopes that I can clear anything up. I know it shouldn't matter, however, this is my suicide note, and I don't want it to be unclear, because I really don't want to hurt my Brother, Girlfriend, or best friend. In fact, I love all of them, and in case they ever find this: \n\nI love you Robbie, you were the best brother i could have had. You were always so incredibly understanding. Thanks \nI love you Mikaela, Thanks for making these past three months the best of my life. \nI love you Trevor, You are my best friend. I'll miss you.\n\nEdit: I'm still here. The cut on my arm was discovered by my mom when I tried to get my keys. I most likely couldn't have wrecked the car anyways. I do want to finish this year. I am very OCD, and I can't leave a year unfinished. I will update at the beginning of summer. It was too rash of a decision to kill myself. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248mfa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Paladin_of_Darkness", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398775460.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248mfa/i_attempted_suicide_twice_tonightalmost_ironic/", "name": "t3_248mfa", "created": 1398763670.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248mfa/i_attempted_suicide_twice_tonightalmost_ironic/", "author_flair_text": null, "title": "I attempted suicide twice tonight...almost ironic how I can't even kill myself right...", "created_utc": 1398734870.0, "ups": 7, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch53jam", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch4ze3o", "approved_by": null, "body": "YES! OH MY GOD YOU REPLIED. And hey, we want to do the same thing! Join us at /r/pcmasterrace, /r/pcgaming, /r/buildapc and any other sub if you haven't already! And don't mention it, I'm glad to head you're okay! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YES! OH MY GOD YOU REPLIED. And hey, we want to do the same thing! Join us at &lt;a href=\"/r/pcmasterrace\"&gt;/r/pcmasterrace&lt;/a&gt;, &lt;a href=\"/r/pcgaming\"&gt;/r/pcgaming&lt;/a&gt;, &lt;a href=\"/r/buildapc\"&gt;/r/buildapc&lt;/a&gt; and any other sub if you haven&amp;#39;t already! And don&amp;#39;t mention it, I&amp;#39;m glad to head you&amp;#39;re okay! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch53jam", "created": 1398814735.0, "author_flair_text": null, "created_utc": 1398785935.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch4ze3o", "gilded": 0, "author": "Paladin_of_Darkness", "parent_id": "t1_ch4plnm", "approved_by": null, "body": "Thank you so much! You are an amazing person, however, after discussing it with my brother, I will be living with him. Granted, I won't be furthering my education, but I'm hoping to be able to get a job repairing pc's. Something I truly love. \n\nThanks again for the open arms.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! You are an amazing person, however, after discussing it with my brother, I will be living with him. Granted, I won&amp;#39;t be furthering my education, but I&amp;#39;m hoping to be able to get a job repairing pc&amp;#39;s. Something I truly love. &lt;/p&gt;\n\n&lt;p&gt;Thanks again for the open arms.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch4ze3o", "created": 1398804288.0, "author_flair_text": null, "created_utc": 1398775488.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4x0gq", "gilded": 0, "author": "chancewilliams", "parent_id": "t1_ch4v82g", "approved_by": null, "body": "okay cause you know everything this person is going through.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;okay cause you know everything this person is going through.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch4x0gq", "created": 1398766818.0, "author_flair_text": null, "created_utc": 1398763218.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4zfvy", "gilded": 0, "author": "Paladin_of_Darkness", "parent_id": "t1_ch4v82g", "approved_by": null, "body": "I can't leave an assignment unfinished. As I said, I am very OCD. I know it shouldn't have mattered, because I wouldn't have to deal with the consequences anyway, but it did. That is, however, irrelevant to the fact that I attempted suicide twice before it was posted, and irrelevant to the fact that I wanted to kill myself after that. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t leave an assignment unfinished. As I said, I am very OCD. I know it shouldn&amp;#39;t have mattered, because I wouldn&amp;#39;t have to deal with the consequences anyway, but it did. That is, however, irrelevant to the fact that I attempted suicide twice before it was posted, and irrelevant to the fact that I wanted to kill myself after that. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch4zfvy", "created": 1398804458.0, "author_flair_text": null, "created_utc": 1398775658.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4v82g", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4plnm", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch4v82g", "created": 1398782353.0, "author_flair_text": null, "created_utc": 1398753553.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4plnm", "gilded": 0, "author": "nowthatsenough", "parent_id": "t3_248mfa", "approved_by": null, "body": "I am 17 too. If you live close to me, I will literally give you my room and everything in it for as long as you need. I will get a job and at least put you through community college. We can smoke weed and play video games and do whatever we want and it will be awesome. What state are you in? If you aren't near me, then call child protective services. They will take your parents away for neglect and provide you with a family who will probably offer the same that i did. If nothing else, at least make them pay for your college. There are places to go when you are 17 and homeless. Even if you aren't religious, go to a church. They will feed you and clothe you. You can be safe\n\n\n\n\n\n\n\n\n\n\ni was too late wasnt i", "edited": 1398740672.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 17 too. If you live close to me, I will literally give you my room and everything in it for as long as you need. I will get a job and at least put you through community college. We can smoke weed and play video games and do whatever we want and it will be awesome. What state are you in? If you aren&amp;#39;t near me, then call child protective services. They will take your parents away for neglect and provide you with a family who will probably offer the same that i did. If nothing else, at least make them pay for your college. There are places to go when you are 17 and homeless. Even if you aren&amp;#39;t religious, go to a church. They will feed you and clothe you. You can be safe&lt;/p&gt;\n\n&lt;p&gt;i was too late wasnt i&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248mfa", "score_hidden": false, "name": "t1_ch4plnm", "created": 1398767462.0, "author_flair_text": null, "created_utc": 1398738662.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}]