[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 27, been a student for 7 years, got an IQ of 154, i had my first existencial crisis at the age of 6 and i&amp;#39;ve been having suicidal thoughts for as long as i can remember.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not writing in search of pity or attention, i merely want to present you with the thoughts of an introvert who has always prefered the company of himself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m somewhat bi-polar with the ups and downs that comes along with it. Though most of my life i&amp;#39;ve been on the down low, i&amp;#39;ve hade extraordinary moments of joy and bliss that i wish upon everyone i meet. &lt;/p&gt;\n\n&lt;p&gt;The most recent up-period lasted for about 2 years during my early years as a student. I was in the pick up game at the moment and thouroghly enjoyed the present and made a lot of good friends and girlfriends. Making friends and sleeping around was something i did effortlessly, though it eventually became routine. I got the hang of it and felt &amp;quot;been there, done that&amp;quot; about every situation i found myself in and wondered &amp;quot;is this all?&amp;quot;, &amp;quot;is it this easy?&amp;quot; Even though i experienced and learned all this it never felt like anyone met the real me, but my alterego with his own nickname, style and purpose. I felt like a fraud since i prefer spending my time inside my own head with my thoughts with all the possibilities they have to offer. I began disappearing for months on end, having no contact with anyone at all. Eventually people forgot about me since i never answered any calls or text messages. &lt;/p&gt;\n\n&lt;p&gt;I passed my exams with ease without going to class or reading the books recommended for each course (be it biology, chemestry, biomedicine, economics, law or whatever class i took), everything just made sence to me from the start. Thats what made me fall deeper than i&amp;#39;ve ever fallen before. I had all theese brilliant ideas about changing the world for the better, inventing cures or doing something for the good of mankind. But i was always stuck on the slow route with an ever growing impatiance and a decresing hope for mankinds bright future when i found out what was actually taught in many of those subjects. Some i never developed an interest for and some simply killed my motivation, i was stuck in a loop where i felt i wasn&amp;#39;t able to use the full extent of my abilities.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve often been called an old soul, and i&amp;#39;m called wize and knowledgeble by my surroundings. The few times i actually speak nowadays i have great thought and insight uttered from my lips according to the few people who i still conversate with from time to time. Though it mostly feel like a burden to talk to people nowadays and i get irate when someone tries to initiate small talk, i&amp;#39;ve found that simply ignoring someone when they try is the most efficient way to get out of the situarion.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never understood the need for small talk or talking about nonscense when there are so many pressing issues around the world that needs resloving to leave the world a better place for the youth of our time. Because of this (amongst other things) i&amp;#39;ve decided to never have children. I wouldn&amp;#39;t want my children to grow up in an imperfect world when the solution for many of the world problems would be fairly simple to achieve if there were more understanding, compassion and willingness to cooperate amongst the worlds population and the leaders. As we are all imperfect in one way or another, the only way to create a perfect world is one where we work together to create a sum that is greater than its components. For someone like me to bring up children in this world, i see no other outcome than children who will suffer like i do, and i don&amp;#39;t wish that even upon my worst enemy.&lt;/p&gt;\n\n&lt;p&gt;Even if i kicked the chair away from under the noose and survived i still don&amp;#39;t see a point in continuing my life much longer. I&amp;#39;ve always thought it would be best to survive my parents before actually doing anything again, but with all my grandparents still alive it seems the wait could be long and not worth it. I&amp;#39;ve had thoughts of simply disappearing, leaving no trace, but i&amp;#39;m not sure i would like to deprive everyone of getting closure instead of one day simply beeing gone, never to be heard of again and leaving questions on everyones minds.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m becoming a godfather next weekend, my brothers child. I wish i could be happy about that, but i havn&amp;#39;t felt anything for a really long time. I feel like there is a void inside me eating it all up. At first i thought i simply didn&amp;#39;t allow myself to be happy, but later i&amp;#39;ve come to realize that there is simply nothing left for me to enjoy.&lt;/p&gt;\n\n&lt;p&gt;I know what life is, with its ups and downs. I&amp;#39;ve tried to balance it out with meditation, new surroundings, new people, medication and therapy. &lt;/p&gt;\n\n&lt;p&gt;The light outside of the darknes has slowly faded away from my field of vision and left me advancing no more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 27, been a student for 7 years, got an IQ of 154, i had my first existencial crisis at the age of 6 and i've been having suicidal thoughts for as long as i can remember.\n\nI'm not writing in search of pity or attention, i merely want to present you with the thoughts of an introvert who has always prefered the company of himself.\n\nI'm somewhat bi-polar with the ups and downs that comes along with it. Though most of my life i've been on the down low, i've hade extraordinary moments of joy and bliss that i wish upon everyone i meet. \n\nThe most recent up-period lasted for about 2 years during my early years as a student. I was in the pick up game at the moment and thouroghly enjoyed the present and made a lot of good friends and girlfriends. Making friends and sleeping around was something i did effortlessly, though it eventually became routine. I got the hang of it and felt \"been there, done that\" about every situation i found myself in and wondered \"is this all?\", \"is it this easy?\" Even though i experienced and learned all this it never felt like anyone met the real me, but my alterego with his own nickname, style and purpose. I felt like a fraud since i prefer spending my time inside my own head with my thoughts with all the possibilities they have to offer. I began disappearing for months on end, having no contact with anyone at all. Eventually people forgot about me since i never answered any calls or text messages. \n\nI passed my exams with ease without going to class or reading the books recommended for each course (be it biology, chemestry, biomedicine, economics, law or whatever class i took), everything just made sence to me from the start. Thats what made me fall deeper than i've ever fallen before. I had all theese brilliant ideas about changing the world for the better, inventing cures or doing something for the good of mankind. But i was always stuck on the slow route with an ever growing impatiance and a decresing hope for mankinds bright future when i found out what was actually taught in many of those subjects. Some i never developed an interest for and some simply killed my motivation, i was stuck in a loop where i felt i wasn't able to use the full extent of my abilities.\n\nI've often been called an old soul, and i'm called wize and knowledgeble by my surroundings. The few times i actually speak nowadays i have great thought and insight uttered from my lips according to the few people who i still conversate with from time to time. Though it mostly feel like a burden to talk to people nowadays and i get irate when someone tries to initiate small talk, i've found that simply ignoring someone when they try is the most efficient way to get out of the situarion.\n\nI've never understood the need for small talk or talking about nonscense when there are so many pressing issues around the world that needs resloving to leave the world a better place for the youth of our time. Because of this (amongst other things) i've decided to never have children. I wouldn't want my children to grow up in an imperfect world when the solution for many of the world problems would be fairly simple to achieve if there were more understanding, compassion and willingness to cooperate amongst the worlds population and the leaders. As we are all imperfect in one way or another, the only way to create a perfect world is one where we work together to create a sum that is greater than its components. For someone like me to bring up children in this world, i see no other outcome than children who will suffer like i do, and i don't wish that even upon my worst enemy.\n\nEven if i kicked the chair away from under the noose and survived i still don't see a point in continuing my life much longer. I've always thought it would be best to survive my parents before actually doing anything again, but with all my grandparents still alive it seems the wait could be long and not worth it. I've had thoughts of simply disappearing, leaving no trace, but i'm not sure i would like to deprive everyone of getting closure instead of one day simply beeing gone, never to be heard of again and leaving questions on everyones minds.\n\nI'm becoming a godfather next weekend, my brothers child. I wish i could be happy about that, but i havn't felt anything for a really long time. I feel like there is a void inside me eating it all up. At first i thought i simply didn't allow myself to be happy, but later i've come to realize that there is simply nothing left for me to enjoy.\n\nI know what life is, with its ups and downs. I've tried to balance it out with meditation, new surroundings, new people, medication and therapy. \n\nThe light outside of the darknes has slowly faded away from my field of vision and left me advancing no more.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250j2p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Skvintiljon", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250j2p/i_but_advance_a_moment_only_to_wheel_and_hurry/", "name": "t3_250j2p", "created": 1399550359.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250j2p/i_but_advance_a_moment_only_to_wheel_and_hurry/", "author_flair_text": null, "title": "I but advance a moment only to wheel and hurry back in darkness (wall of text +rambling)", "created_utc": 1399521559.0, "ups": 5, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chclnbn", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_250j2p", "approved_by": null, "body": "What bothers you the most about the way academic subjects in college are taught?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What bothers you the most about the way academic subjects in college are taught?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250j2p", "score_hidden": false, "name": "t1_chclnbn", "created": 1399571542.0, "author_flair_text": null, "created_utc": 1399542742.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]