[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want this to stop. It&amp;#39;s so hard to have a reason to do it when there is nothing I feel anymore. I just don&amp;#39;t want to have to do this anymore. The only thing holding me back is that they will misinterpret my actions and say thing like &amp;quot; he was such a quite, kind, smart kid. Why did he do it. He must have been so alone.&amp;quot; The truth is I am alone. So alone I don&amp;#39;t feel anything. And the worst part is that I am bored. I&amp;#39;m bored of my miserable sad lonely life. And it might just be one of the many kinks with me. I just would like to know what would happen. Would people miss me, and for how long a month? A week? A day? Maybe not at all. I used to be my mom who was indirectly stoping me from doing it but now that&amp;#39;s not the case. Does anyone else feel nothing anymore?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just want this to stop. It's so hard to have a reason to do it when there is nothing I feel anymore. I just don't want to have to do this anymore. The only thing holding me back is that they will misinterpret my actions and say thing like \" he was such a quite, kind, smart kid. Why did he do it. He must have been so alone.\" The truth is I am alone. So alone I don't feel anything. And the worst part is that I am bored. I'm bored of my miserable sad lonely life. And it might just be one of the many kinks with me. I just would like to know what would happen. Would people miss me, and for how long a month? A week? A day? Maybe not at all. I used to be my mom who was indirectly stoping me from doing it but now that's not the case. Does anyone else feel nothing anymore?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24xg38", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "CavemanChris", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24xg38/i_cant_go_on_like_this/", "name": "t3_24xg38", "created": 1399467444.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24xg38/i_cant_go_on_like_this/", "author_flair_text": null, "title": "I can't go on like this.", "created_utc": 1399438644.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chboizi", "gilded": 0, "author": "speedytheturtle", "parent_id": "t3_24xg38", "approved_by": null, "body": "sup. I have similar thoughts as yours too. I don't know the answer to your last question man, but there's probably people that would miss you.  For how long? I don't know. Most likely for awhile upon hearing the news, but then people will have to eventually press forward and move on with their life.  It doesn't mean that they don't care; I think people just have to move on/keep an eye out for the brighter, happier experiences in life before everyone dies.  \n\nI think many people has some experience with loneliness at times, feelings of hopelessness, or nothing at all, but I guess it let's us understand and appreciate when one day we might perhaps find some people willing to accept us/spend time/interact with us.  Dunno about the future, but stay strong in the harsh times of the overwhelming feelings of low. I'd like to think it's when you really need it when your inner character traits develop.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sup. I have similar thoughts as yours too. I don&amp;#39;t know the answer to your last question man, but there&amp;#39;s probably people that would miss you.  For how long? I don&amp;#39;t know. Most likely for awhile upon hearing the news, but then people will have to eventually press forward and move on with their life.  It doesn&amp;#39;t mean that they don&amp;#39;t care; I think people just have to move on/keep an eye out for the brighter, happier experiences in life before everyone dies.  &lt;/p&gt;\n\n&lt;p&gt;I think many people has some experience with loneliness at times, feelings of hopelessness, or nothing at all, but I guess it let&amp;#39;s us understand and appreciate when one day we might perhaps find some people willing to accept us/spend time/interact with us.  Dunno about the future, but stay strong in the harsh times of the overwhelming feelings of low. I&amp;#39;d like to think it&amp;#39;s when you really need it when your inner character traits develop.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xg38", "score_hidden": false, "name": "t1_chboizi", "created": 1399477907.0, "author_flair_text": null, "created_utc": 1399449107.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]