[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Between finals that I am probably going to fail, a family who I can&amp;#39;t stand, and being alone; I just can&amp;#39;t take anymore...I just turned 21 two weeks ago, I am a male to female transgender that has to stay closeted because of a stupid conservative family. I am a math major in college, but I feel like its not worth it most of the time because of all the stress it causes. I have finals monday, tuesday, and wednesday and no matter how hard I study it feels like it doesn&amp;#39;t matter...\nI spend most of my time alone, I have no friends really, and I can&amp;#39;t ever fit in anywhere online because I like to &amp;quot;pretend&amp;quot; to be a girl online so I can be myself at least part of the day, but some issue with me being trans always comes up. \nI don&amp;#39;t think I can take anymore, my brain hurts so much mentally and emotionally that it just doesn&amp;#39;t feel worth it to go on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Between finals that I am probably going to fail, a family who I can't stand, and being alone; I just can't take anymore...I just turned 21 two weeks ago, I am a male to female transgender that has to stay closeted because of a stupid conservative family. I am a math major in college, but I feel like its not worth it most of the time because of all the stress it causes. I have finals monday, tuesday, and wednesday and no matter how hard I study it feels like it doesn't matter...\nI spend most of my time alone, I have no friends really, and I can't ever fit in anywhere online because I like to \"pretend\" to be a girl online so I can be myself at least part of the day, but some issue with me being trans always comes up. \nI don't think I can take anymore, my brain hurts so much mentally and emotionally that it just doesn't feel worth it to go on.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bm54", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Skyeborne", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bm54/i_cant_take_anymore/", "name": "t3_25bm54", "created": 1399885562.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bm54/i_cant_take_anymore/", "author_flair_text": null, "title": "I can't take anymore...", "created_utc": 1399856762.0, "ups": 6, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfpsoj", "gilded": 0, "author": "kittenkaboodlee", "parent_id": "t3_25bm54", "approved_by": null, "body": "Hello! I don't know if this is going to help but I wanted to say that I just got finished with my finals and I was majorly stressing out. It feels much better on the other side of finals. I don't mean to make your stresses seem small but it feels much better on the other side. You can make it. Do you enjoy being a math major?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello! I don&amp;#39;t know if this is going to help but I wanted to say that I just got finished with my finals and I was majorly stressing out. It feels much better on the other side of finals. I don&amp;#39;t mean to make your stresses seem small but it feels much better on the other side. You can make it. Do you enjoy being a math major?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bm54", "score_hidden": false, "name": "t1_chfpsoj", "created": 1399898175.0, "author_flair_text": null, "created_utc": 1399869375.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfs4kg", "gilded": 0, "author": "meatrocket8", "parent_id": "t3_25bm54", "approved_by": null, "body": "Look... This might be a longshot but i have a friend female transgender who has now started embracing it and all the stuff that comes with it and she's happy. Would you like to maybe get in touch to her to talk?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look... This might be a longshot but i have a friend female transgender who has now started embracing it and all the stuff that comes with it and she&amp;#39;s happy. Would you like to maybe get in touch to her to talk?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bm54", "score_hidden": false, "name": "t1_chfs4kg", "created": 1399906238.0, "author_flair_text": null, "created_utc": 1399877438.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]