[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My story is long, but I need to let it out. There&amp;#39;s nobody in my life I can turn to, so I&amp;#39;m hoping there&amp;#39;s someone out there willing to listen.&lt;/p&gt;\n\n&lt;p&gt;From an outsider&amp;#39;s perspective, my life is perfect. I&amp;#39;m working toward my dream career, I have a loving boyfriend of eight years, a supportive family, and plenty of friends who care. &lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s all they see. Nobody sees how I am in the bottom 20 of my class, how I&amp;#39;ve struggled and worked so hard since day one to be slightly below average. I don&amp;#39;t think I&amp;#39;m struggling because I&amp;#39;m lazy, I think I&amp;#39;m struggling because I can&amp;#39;t cope with any of this emotionally. I failed a class last year and didn&amp;#39;t have time to pull myself together. I was expected to get back to studying the very next day and keep working for the next class, and the next, and then my remediation exam for the class I failed. One week off for Summer break then back to studying again. I cried every day multiple times a day feeling like a failure, feeling inferior to my peers. I often fantasized about my death- getting into a terrible car accident, getting kidnapped and murdered, or getting attacked by a rabid dog. Or maybe ending everything peacefully-alone with a bottle of Everclear and Tylenol, or maybe in a closed garage. The possibilities were endless in my mind. I once told my boyfriend about my suicidal thoughts, and his response was, &amp;quot;Don&amp;#39;t say things like that. I don&amp;#39;t know what I&amp;#39;d do without you.&amp;quot; I tried to get better, I kept working. Months passed and nothing changed. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend was at the end of his rope dealing with me. I was scared he would leave. So I went to the school psychiatrist for help.  I was diagnosed with Generalized Anxiety Disorder and a depressed mood. She didn&amp;#39;t want to label me with Major Depressive Disorder because that&amp;#39;s something she&amp;#39;d have to report, which in the long run could affect me when getting certified as a physician. She suggested SSRIs. I talked it through with my boyfriend first, and he said, &amp;quot;No because nothing is wrong with you.&amp;quot; So I opted for psychotherapy only. I went for a few months, and it helped a little. But I never felt like I could openly talk about wanting to end my life. I guess I was scared that I&amp;#39;d be hospitalized and end up bringing embarrassment and shame to my family. So I&amp;#39;ve kept everything to myself. Slowly my mood improved and slowly it felt like I was ok. Instead of getting angry at myself for my failures, I accepted that my negative thoughts would come and go. I also ended up embracing any thoughts I had of ending my life- I guess I started thinking of these thoughts as a passenger along for the ride, but without any control over the steering wheel.&lt;/p&gt;\n\n&lt;p&gt;However, now that my first board exam is coming up in a month, my stress levels are insanely high. The only solace or escape I can find is to think about what I can do to leave it all behind. I get scared sometimes of how badly I want it all to end, and if I followed through with anything I worry about how it would affect my loved ones. But they aren&amp;#39;t the ones who struggling with this stress or these thoughts. Sometimes I hate myself so much for thinking this way.&lt;/p&gt;\n\n&lt;p&gt;But to be honest, I think I&amp;#39;ve struggled with suicidal thoughts since I was a kid. Back then, though, my thoughts were masked with religious undertones. I&amp;#39;d often write in my diary, &amp;quot;I wish my life would end so I can be with God, away from all this pain and suffering.&amp;quot; The frequency of these thoughts would increase whenever I got in a fight with my mom or if I had a problem in school or my social life. I once got into a car accident in college. I was in so much pain that I wanted to die by overdosing on my Vicodin. Scared that I would actually follow through, I told my mom. Her response was, &amp;quot;These thoughts are from the devil. Let&amp;#39;s pray and cast them out of your mind.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I thought I was cured, and I&amp;#39;d never struggle with these thoughts again. Looking back, I&amp;#39;ve struggled every year of my life. And I think I&amp;#39;m at a point where I might follow through soon. The most convenient time would be between apartments when all my things are packed away neatly into boxes. It would make getting rid of my things easier on my family. I&amp;#39;d leave everyone notes of course so nobody blames themselves. I just can&amp;#39;t go on anymore&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My story is long, but I need to let it out. There's nobody in my life I can turn to, so I'm hoping there's someone out there willing to listen.\n\nFrom an outsider's perspective, my life is perfect. I'm working toward my dream career, I have a loving boyfriend of eight years, a supportive family, and plenty of friends who care. \n\nBut that's all they see. Nobody sees how I am in the bottom 20 of my class, how I've struggled and worked so hard since day one to be slightly below average. I don't think I'm struggling because I'm lazy, I think I'm struggling because I can't cope with any of this emotionally. I failed a class last year and didn't have time to pull myself together. I was expected to get back to studying the very next day and keep working for the next class, and the next, and then my remediation exam for the class I failed. One week off for Summer break then back to studying again. I cried every day multiple times a day feeling like a failure, feeling inferior to my peers. I often fantasized about my death- getting into a terrible car accident, getting kidnapped and murdered, or getting attacked by a rabid dog. Or maybe ending everything peacefully-alone with a bottle of Everclear and Tylenol, or maybe in a closed garage. The possibilities were endless in my mind. I once told my boyfriend about my suicidal thoughts, and his response was, \"Don't say things like that. I don't know what I'd do without you.\" I tried to get better, I kept working. Months passed and nothing changed. \n\nMy boyfriend was at the end of his rope dealing with me. I was scared he would leave. So I went to the school psychiatrist for help.  I was diagnosed with Generalized Anxiety Disorder and a depressed mood. She didn't want to label me with Major Depressive Disorder because that's something she'd have to report, which in the long run could affect me when getting certified as a physician. She suggested SSRIs. I talked it through with my boyfriend first, and he said, \"No because nothing is wrong with you.\" So I opted for psychotherapy only. I went for a few months, and it helped a little. But I never felt like I could openly talk about wanting to end my life. I guess I was scared that I'd be hospitalized and end up bringing embarrassment and shame to my family. So I've kept everything to myself. Slowly my mood improved and slowly it felt like I was ok. Instead of getting angry at myself for my failures, I accepted that my negative thoughts would come and go. I also ended up embracing any thoughts I had of ending my life- I guess I started thinking of these thoughts as a passenger along for the ride, but without any control over the steering wheel.\n\nHowever, now that my first board exam is coming up in a month, my stress levels are insanely high. The only solace or escape I can find is to think about what I can do to leave it all behind. I get scared sometimes of how badly I want it all to end, and if I followed through with anything I worry about how it would affect my loved ones. But they aren't the ones who struggling with this stress or these thoughts. Sometimes I hate myself so much for thinking this way.\n\nBut to be honest, I think I've struggled with suicidal thoughts since I was a kid. Back then, though, my thoughts were masked with religious undertones. I'd often write in my diary, \"I wish my life would end so I can be with God, away from all this pain and suffering.\" The frequency of these thoughts would increase whenever I got in a fight with my mom or if I had a problem in school or my social life. I once got into a car accident in college. I was in so much pain that I wanted to die by overdosing on my Vicodin. Scared that I would actually follow through, I told my mom. Her response was, \"These thoughts are from the devil. Let's pray and cast them out of your mind.\" \n\nI thought I was cured, and I'd never struggle with these thoughts again. Looking back, I've struggled every year of my life. And I think I'm at a point where I might follow through soon. The most convenient time would be between apartments when all my things are packed away neatly into boxes. It would make getting rid of my things easier on my family. I'd leave everyone notes of course so nobody blames themselves. I just can't go on anymore", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242n2j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "mylastday052414", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242n2j/i_can_no_longer_cope_with_the_stress_of_medical/", "name": "t3_242n2j", "created": 1398591276.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242n2j/i_can_no_longer_cope_with_the_stress_of_medical/", "author_flair_text": null, "title": "I can no longer cope with the stress of medical school", "created_utc": 1398562476.0, "ups": 4, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3as0a", "gilded": 0, "author": "mylastday052414", "parent_id": "t1_ch30xpb", "approved_by": null, "body": "I wish I could go to my parents, but they think mental health issues should only be treated with prayer. And if I am struggling with suicidal thoughts or depression, it's because my faith in God is lacking. That's what they would say at least. As far as taking time off school, I wish it were easy. I am already $70K in debt and halfway through medical school. I guess you can say once you're in the system, you're stuck. Hardly anyone ever leaves. I wish I could take time off, but if there's a good time for that it's in two years when I graduate. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could go to my parents, but they think mental health issues should only be treated with prayer. And if I am struggling with suicidal thoughts or depression, it&amp;#39;s because my faith in God is lacking. That&amp;#39;s what they would say at least. As far as taking time off school, I wish it were easy. I am already $70K in debt and halfway through medical school. I guess you can say once you&amp;#39;re in the system, you&amp;#39;re stuck. Hardly anyone ever leaves. I wish I could take time off, but if there&amp;#39;s a good time for that it&amp;#39;s in two years when I graduate. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3as0a", "created": 1398612806.0, "author_flair_text": null, "created_utc": 1398609206.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch30xpb", "gilded": 0, "author": "sativan", "parent_id": "t3_242n2j", "approved_by": null, "body": "Tell your parents because your boyfriend is not your care taker and isn't helping you by pushing you away from medication you probably need.\n\nTake some time off from school not all the rest of your life off from life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell your parents because your boyfriend is not your care taker and isn&amp;#39;t helping you by pushing you away from medication you probably need.&lt;/p&gt;\n\n&lt;p&gt;Take some time off from school not all the rest of your life off from life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch30xpb", "created": 1398570734.0, "author_flair_text": null, "created_utc": 1398567134.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3rwra", "gilded": 0, "author": "sofar1776", "parent_id": "t1_ch3ay5j", "approved_by": null, "body": "Glad I could help. You can't be blamed for what pops into your head. Nobody can. I have had some pretty vile thoughts just appear in there, the test is what I do when they arrive. If I understand correctly, even Catholics don't call something a sin until you actually decide to make it happen. Just thinking of something is not the bad thing. Rising above the temptation is the hard part.     \nMaybe your school psychiatrist is right, I disagree though. Then again, I don't have her training. It isn't anything worth arguing about. As long as you are feeling better that is all it takes to make me happy. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad I could help. You can&amp;#39;t be blamed for what pops into your head. Nobody can. I have had some pretty vile thoughts just appear in there, the test is what I do when they arrive. If I understand correctly, even Catholics don&amp;#39;t call something a sin until you actually decide to make it happen. Just thinking of something is not the bad thing. Rising above the temptation is the hard part.&lt;br/&gt;\nMaybe your school psychiatrist is right, I disagree though. Then again, I don&amp;#39;t have her training. It isn&amp;#39;t anything worth arguing about. As long as you are feeling better that is all it takes to make me happy. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3rwra", "created": 1398678308.0, "author_flair_text": null, "created_utc": 1398649508.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3ay5j", "gilded": 0, "author": "mylastday052414", "parent_id": "t1_ch30yrx", "approved_by": null, "body": "Thank you for this. Your message was enough to calm me down last night, enough to try and think rationally again. When I saw the school psychiatrist she asked if I ever had thoughts of killing myself, I said, \"Yes, but doesn't everyone?\" She then proceeded to explain how that is not normal at all and few people actually think that way. Thanks for telling me it's normal if these thoughts come into my head once in a while. I've gotten better at telling myself to postpone the end, but last night was really bad. Thank you for getting back to me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. Your message was enough to calm me down last night, enough to try and think rationally again. When I saw the school psychiatrist she asked if I ever had thoughts of killing myself, I said, &amp;quot;Yes, but doesn&amp;#39;t everyone?&amp;quot; She then proceeded to explain how that is not normal at all and few people actually think that way. Thanks for telling me it&amp;#39;s normal if these thoughts come into my head once in a while. I&amp;#39;ve gotten better at telling myself to postpone the end, but last night was really bad. Thank you for getting back to me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3ay5j", "created": 1398638530.0, "author_flair_text": null, "created_utc": 1398609730.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch30yrx", "gilded": 0, "author": "sofar1776", "parent_id": "t3_242n2j", "approved_by": null, "body": "You can never keep others from blaming themselves. Even if you left a fifty page note, someone would say that you were just trying to make them feel better and that it was all their fault. Sorry, but that's how it is. Meanwhile, can we just look for a way to prevent that part? A lot of us have suicidal thoughts some times. More so when we are stressed, or upset. That is fairly normal as far as I know.    \nI can't imagine how hard medical school is. I know a couple of doctors, but that doesn't give me the insight you have. Perhaps the SSRIs would be good course to take, if you need the help. That is your decision. If they will help you go on, then try it. If you are determined to end it, there is nothing to lose by trying to postpone it long enough to find out if they can help.     \nI am not trying to minimize your suffering, a few sentences on a message board are not enough for me to really understand you and what you are going through. But I hope you will take every possible step to prevent that permanent end from coming. As a medical student, you know it will come eventually no matter what anyone does. Wouldn't it be better to try to have the time first? Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can never keep others from blaming themselves. Even if you left a fifty page note, someone would say that you were just trying to make them feel better and that it was all their fault. Sorry, but that&amp;#39;s how it is. Meanwhile, can we just look for a way to prevent that part? A lot of us have suicidal thoughts some times. More so when we are stressed, or upset. That is fairly normal as far as I know.&lt;br/&gt;\nI can&amp;#39;t imagine how hard medical school is. I know a couple of doctors, but that doesn&amp;#39;t give me the insight you have. Perhaps the SSRIs would be good course to take, if you need the help. That is your decision. If they will help you go on, then try it. If you are determined to end it, there is nothing to lose by trying to postpone it long enough to find out if they can help.&lt;br/&gt;\nI am not trying to minimize your suffering, a few sentences on a message board are not enough for me to really understand you and what you are going through. But I hope you will take every possible step to prevent that permanent end from coming. As a medical student, you know it will come eventually no matter what anyone does. Wouldn&amp;#39;t it be better to try to have the time first? Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch30yrx", "created": 1398596018.0, "author_flair_text": null, "created_utc": 1398567218.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3gum5", "gilded": 0, "author": "egates09", "parent_id": "t1_ch3b4tv", "approved_by": null, "body": "Hey, thanks for sticking around long enough to hear us out! It's tough out there for almost everyone and I would recommend checking out /r/lostgeneration for more information/moral support. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, thanks for sticking around long enough to hear us out! It&amp;#39;s tough out there for almost everyone and I would recommend checking out &lt;a href=\"/r/lostgeneration\"&gt;/r/lostgeneration&lt;/a&gt; for more information/moral support. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3gum5", "created": 1398627897.0, "author_flair_text": null, "created_utc": 1398624297.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3b4tv", "gilded": 0, "author": "mylastday052414", "parent_id": "t1_ch31ar8", "approved_by": null, "body": "I often dream of doing something different. I knew medical school was going to be hard, but I never thought it would be *this* hard. Now all I want is an 8-5 job where I do the same things day in and out. Unfortunately, I'm $70K in debt and half way through school. Taking time off is not possible until after I graduate in two years or have a death or birth in the family. I'm supposed to move to another town next month to start my third year of medical school. Maybe the change of city and the transition from book work to being in the hospital will be good for me. \n\nThank you for getting back to me last night. I couldn't reach anyone in my phone to talk to. Hearing back on here was enough. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I often dream of doing something different. I knew medical school was going to be hard, but I never thought it would be &lt;em&gt;this&lt;/em&gt; hard. Now all I want is an 8-5 job where I do the same things day in and out. Unfortunately, I&amp;#39;m $70K in debt and half way through school. Taking time off is not possible until after I graduate in two years or have a death or birth in the family. I&amp;#39;m supposed to move to another town next month to start my third year of medical school. Maybe the change of city and the transition from book work to being in the hospital will be good for me. &lt;/p&gt;\n\n&lt;p&gt;Thank you for getting back to me last night. I couldn&amp;#39;t reach anyone in my phone to talk to. Hearing back on here was enough. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3b4tv", "created": 1398613887.0, "author_flair_text": null, "created_utc": 1398610287.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch31ar8", "gilded": 0, "author": "egates09", "parent_id": "t3_242n2j", "approved_by": null, "body": "I read everything, and as a total internet stranger I just wanted to put forth the idea that maybe you aren't happy because you're in desperate need of an environment change. College is hard, and I can't even begin to imagine the amount of stress it takes to get through a medical degree. Perhaps you could use a break. \n\nI was profoundly unhappy when I was going through college. I'd wake up every day looking at the white concrete walls and feel like I was in prison. After my first year I dropped out, got a less-than-lucrative job delivering pizzas in my hometown, and found  a fantastic summer job working at a resort in the north woods. The money isn't all there but I actually love and look forward to going to work now. Totally eliminated the unnecessary stress that coincides with academia.\n\nNot saying you should drop out of school or nothing but perhaps you could just use a good break and in the meantime pursue some other interests or hobbies you may have. I almost guarantee you'll be better off for it.\n\nAlso, try not to beat yourself up too much for mistakes. I know it's a lot easier said then done, but in the end if you acknowledge that you aren't perfect (no one is), and that you are willing to learn from your previous mistakes then it won't ever get to you. But if you choose to dwell on your perceived imperfections then you are shedding too much light on your negatives, and less on your positives.\n\nSorry if this seems like inane ramblings, I had a couple beers before I typed this out.\n\nJust know that I completely empathize with your situation and wish you the best of luck. :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read everything, and as a total internet stranger I just wanted to put forth the idea that maybe you aren&amp;#39;t happy because you&amp;#39;re in desperate need of an environment change. College is hard, and I can&amp;#39;t even begin to imagine the amount of stress it takes to get through a medical degree. Perhaps you could use a break. &lt;/p&gt;\n\n&lt;p&gt;I was profoundly unhappy when I was going through college. I&amp;#39;d wake up every day looking at the white concrete walls and feel like I was in prison. After my first year I dropped out, got a less-than-lucrative job delivering pizzas in my hometown, and found  a fantastic summer job working at a resort in the north woods. The money isn&amp;#39;t all there but I actually love and look forward to going to work now. Totally eliminated the unnecessary stress that coincides with academia.&lt;/p&gt;\n\n&lt;p&gt;Not saying you should drop out of school or nothing but perhaps you could just use a good break and in the meantime pursue some other interests or hobbies you may have. I almost guarantee you&amp;#39;ll be better off for it.&lt;/p&gt;\n\n&lt;p&gt;Also, try not to beat yourself up too much for mistakes. I know it&amp;#39;s a lot easier said then done, but in the end if you acknowledge that you aren&amp;#39;t perfect (no one is), and that you are willing to learn from your previous mistakes then it won&amp;#39;t ever get to you. But if you choose to dwell on your perceived imperfections then you are shedding too much light on your negatives, and less on your positives.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this seems like inane ramblings, I had a couple beers before I typed this out.&lt;/p&gt;\n\n&lt;p&gt;Just know that I completely empathize with your situation and wish you the best of luck. :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch31ar8", "created": 1398571718.0, "author_flair_text": null, "created_utc": 1398568118.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3hidb", "gilded": 0, "author": "dark-eyes", "parent_id": "t3_242n2j", "approved_by": null, "body": "Hey.  I'm so sorry you are going through all of this... it sounds like things are really hard right now.  I'm also a medical student, so I know a bit about how tough the program is and what the expectations are like.\n\nA couple of thoughts regarding what you've said.\n\n\"I cried every day multiple times a day feeling like a failure, feeling inferior to my peers.\"\n\n-You are not a failure, and you are not inferior.  You are very clearly a capable person, evidenced by the things you are doing in your life right now.  You're studying for your medical school board exams!  Just to be in that position is something I hope you feel proud of.  You just have more on your plate right now than some of your peers may.\n\n\"Scared that I would actually follow through, I told my mom. Her response was, 'These thoughts are from the devil. Let's pray and cast them out of your mind.'\"\n\n-Any thoughts you have are certainly not from the devil.  There is nothing evil or wrong about you as a person, but these thoughts are obviously not good.  I think you should go back to your school psychiatrist (if you trust her).  If you don't, you've got to find one that you trust.  Tell them everything... about how long this has been going on, about your boyfriend's reluctance with medication, about your mother's statements, the anxiety, the depression, your suicidal thoughts.  If you end up on medication, that does NOT mean anything bad about you.\n\nIf you would like to talk, please PM me.  I would be happy to hear from you.  Things can and will get better, but it will probably just take a little time.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey.  I&amp;#39;m so sorry you are going through all of this... it sounds like things are really hard right now.  I&amp;#39;m also a medical student, so I know a bit about how tough the program is and what the expectations are like.&lt;/p&gt;\n\n&lt;p&gt;A couple of thoughts regarding what you&amp;#39;ve said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I cried every day multiple times a day feeling like a failure, feeling inferior to my peers.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;-You are not a failure, and you are not inferior.  You are very clearly a capable person, evidenced by the things you are doing in your life right now.  You&amp;#39;re studying for your medical school board exams!  Just to be in that position is something I hope you feel proud of.  You just have more on your plate right now than some of your peers may.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Scared that I would actually follow through, I told my mom. Her response was, &amp;#39;These thoughts are from the devil. Let&amp;#39;s pray and cast them out of your mind.&amp;#39;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;-Any thoughts you have are certainly not from the devil.  There is nothing evil or wrong about you as a person, but these thoughts are obviously not good.  I think you should go back to your school psychiatrist (if you trust her).  If you don&amp;#39;t, you&amp;#39;ve got to find one that you trust.  Tell them everything... about how long this has been going on, about your boyfriend&amp;#39;s reluctance with medication, about your mother&amp;#39;s statements, the anxiety, the depression, your suicidal thoughts.  If you end up on medication, that does NOT mean anything bad about you.&lt;/p&gt;\n\n&lt;p&gt;If you would like to talk, please PM me.  I would be happy to hear from you.  Things can and will get better, but it will probably just take a little time.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242n2j", "score_hidden": false, "name": "t1_ch3hidb", "created": 1398629380.0, "author_flair_text": null, "created_utc": 1398625780.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]