[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No more life please. I just want it all to be over. It&amp;#39;s been one large negative experience and whatever mental disorder I have won&amp;#39;t allow me to receive help. I am unable to talk to people face to face, and probably won&amp;#39;t even respond to this due to my anxiety. I can&amp;#39;t advance in life at all. I will never get past living in this one bedroom apartment working up the mental energy to goto work so that I can come home with zero mental energy because I had to be around people all day. &lt;/p&gt;\n\n&lt;p&gt;People are my number one problem. I can&amp;#39;t explain how bad I feel after being around them. I throw up most mornings before I goto work because I know I&amp;#39;m going to be around people. At work I&amp;#39;m always causing problems because I can&amp;#39;t deal with people so I get yelled at pretty much all day long. My interactions are extremely negative with people. I&amp;#39;ve been permanently injured from being beaten repeatedly by people because I can&amp;#39;t deal with them. There is no place in this world for me and I know there isn&amp;#39;t because I can&amp;#39;t be happy. No one will allow me to be happy. Only those at arms length can tolerate me. I will never own anything worth having, be close to anyone or look back on my life and say I did something worth wile or accomplished something with hard work. My disorder leaves me in pain and isolation and killing myself is the only escape. I just can&amp;#39;t wake up tomorrow. I can&amp;#39;t face another day in this world. I don&amp;#39;t even like looking at people. I can&amp;#39;t even take a walk because of how bad I was beaten when I was younger so I&amp;#39;m trapped physically too. &lt;/p&gt;\n\n&lt;p&gt;I just can&amp;#39;t be anymore. I want it all to end and I want it to end now. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "No more life please. I just want it all to be over. It's been one large negative experience and whatever mental disorder I have won't allow me to receive help. I am unable to talk to people face to face, and probably won't even respond to this due to my anxiety. I can't advance in life at all. I will never get past living in this one bedroom apartment working up the mental energy to goto work so that I can come home with zero mental energy because I had to be around people all day. \n\nPeople are my number one problem. I can't explain how bad I feel after being around them. I throw up most mornings before I goto work because I know I'm going to be around people. At work I'm always causing problems because I can't deal with people so I get yelled at pretty much all day long. My interactions are extremely negative with people. I've been permanently injured from being beaten repeatedly by people because I can't deal with them. There is no place in this world for me and I know there isn't because I can't be happy. No one will allow me to be happy. Only those at arms length can tolerate me. I will never own anything worth having, be close to anyone or look back on my life and say I did something worth wile or accomplished something with hard work. My disorder leaves me in pain and isolation and killing myself is the only escape. I just can't wake up tomorrow. I can't face another day in this world. I don't even like looking at people. I can't even take a walk because of how bad I was beaten when I was younger so I'm trapped physically too. \n\nI just can't be anymore. I want it all to end and I want it to end now. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248rao", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "karvious", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248rao/i_cant_exist_in_this_world_its_too_painful/", "name": "t3_248rao", "created": 1398766604.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248rao/i_cant_exist_in_this_world_its_too_painful/", "author_flair_text": null, "title": "I can't exist in this world. It's too painful.", "created_utc": 1398737804.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4pss2", "gilded": 0, "author": "sofar1776", "parent_id": "t3_248rao", "approved_by": null, "body": "I can't imagine the position you are in, but I can argue for trying some more. Whatever disorder you speak of, can you talk on a phone? There must be some therapist who has seen this before and come up with a way to help. All you have to do is find him or her. There are even people to do that for you if you ask. People can be very hard to deal with, but there are some good ones out there. I am sorry for the things you have had to suffer through, but I ask that you explore any option you can before you give in. After all, it is only postponing your plan to explore the options. You might come up with a good strategy to deal with your disorder and continue. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t imagine the position you are in, but I can argue for trying some more. Whatever disorder you speak of, can you talk on a phone? There must be some therapist who has seen this before and come up with a way to help. All you have to do is find him or her. There are even people to do that for you if you ask. People can be very hard to deal with, but there are some good ones out there. I am sorry for the things you have had to suffer through, but I ask that you explore any option you can before you give in. After all, it is only postponing your plan to explore the options. You might come up with a good strategy to deal with your disorder and continue. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248rao", "score_hidden": false, "name": "t1_ch4pss2", "created": 1398742659.0, "author_flair_text": null, "created_utc": 1398739059.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]