[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nothing has happened that would make such a dramatic change in my mood, but it&amp;#39;s been years since I&amp;#39;ve thought about suicide this much. My life is going great, I have a fun job that pays me well, supportive friends, an adorable apartment, and hobbies I enjoy. But for some reason, despite all of that, I&amp;#39;m just very unhappy. I push people I date and potential relationships away and create problems when there is no reason to - only because I&amp;#39;m afraid of becoming even more depressed when it will inevitably end. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any plans, it&amp;#39;s not that I think I&amp;#39;m going to go home and do something about it. But there is just this sinking feeling in my gut that is preventing me from feeling real happiness, or from feeling like I can get out of this. I&amp;#39;m only in my mid-twenties, and for the most part I&amp;#39;m a really social girl who can get along with everyone. But for some reason, I just keep remembering times when I was happy and I&amp;#39;m afraid that at this point, I might not ever feel that way again. I feel like I had my glory days. I&amp;#39;m so miserable that at this point, I&amp;#39;m terrified of the day where I&amp;#39;ll begin to hate everything. &lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t want to get to that point. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Nothing has happened that would make such a dramatic change in my mood, but it's been years since I've thought about suicide this much. My life is going great, I have a fun job that pays me well, supportive friends, an adorable apartment, and hobbies I enjoy. But for some reason, despite all of that, I'm just very unhappy. I push people I date and potential relationships away and create problems when there is no reason to - only because I'm afraid of becoming even more depressed when it will inevitably end. \n\nI don't have any plans, it's not that I think I'm going to go home and do something about it. But there is just this sinking feeling in my gut that is preventing me from feeling real happiness, or from feeling like I can get out of this. I'm only in my mid-twenties, and for the most part I'm a really social girl who can get along with everyone. But for some reason, I just keep remembering times when I was happy and I'm afraid that at this point, I might not ever feel that way again. I feel like I had my glory days. I'm so miserable that at this point, I'm terrified of the day where I'll begin to hate everything. \n\nI really don't want to get to that point. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zboi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "k11111", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zboi/i_cant_really_get_the_idea_out_of_my_head/", "name": "t3_24zboi", "created": 1399522850.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zboi/i_cant_really_get_the_idea_out_of_my_head/", "author_flair_text": null, "title": "I can't really get the idea out of my head.", "created_utc": 1399494050.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd3g5l", "gilded": 0, "author": "k11111", "parent_id": "t1_chd2y14", "approved_by": null, "body": "Thank you. :)\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zboi", "score_hidden": false, "name": "t1_chd3g5l", "created": 1399615370.0, "author_flair_text": null, "created_utc": 1399586570.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd2y14", "gilded": 0, "author": "reverienoire", "parent_id": "t1_chd0nin", "approved_by": null, "body": "therapy sounds like a great idea for you. you'd be able to unload and be selfish (that's what you're paying them for, after all) and have them respond in appropriate ways. as much as the people in our lives love and care for us, most of them (nearly all of them) simply aren't equipped to handle it. not because they don't want to, they just don't have the knowledge and strategies a therapist has. \n\nit doesn't sound silly at all, though. and i've had that queasy gut feeling too when i've been really depressed and anxious. i know that feeling very, very well.\n\ngood luck with everything. if you ever need to chat i'm available, just pm me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;therapy sounds like a great idea for you. you&amp;#39;d be able to unload and be selfish (that&amp;#39;s what you&amp;#39;re paying them for, after all) and have them respond in appropriate ways. as much as the people in our lives love and care for us, most of them (nearly all of them) simply aren&amp;#39;t equipped to handle it. not because they don&amp;#39;t want to, they just don&amp;#39;t have the knowledge and strategies a therapist has. &lt;/p&gt;\n\n&lt;p&gt;it doesn&amp;#39;t sound silly at all, though. and i&amp;#39;ve had that queasy gut feeling too when i&amp;#39;ve been really depressed and anxious. i know that feeling very, very well.&lt;/p&gt;\n\n&lt;p&gt;good luck with everything. if you ever need to chat i&amp;#39;m available, just pm me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zboi", "score_hidden": false, "name": "t1_chd2y14", "created": 1399614287.0, "author_flair_text": null, "created_utc": 1399585487.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chd0nin", "gilded": 0, "author": "k11111", "parent_id": "t1_chcbqx9", "approved_by": null, "body": "Thank you. At one point in high school, when I was going through this (But much worse), I did get some professional help and it was very beneficial for me. And it's not that I don't have a good support system around me either, I do have really great friends. It's just very difficult to describe how I feel without sounding ungrateful or selfish, so I think I'm really afraid to talk about it. Even more so, I don't know what to talk about, other than \"I feel like I'm slipping into a black hole for no reason.\"\n\nIt know it sounds silly. It's getting very physical feeling, like actually nauseated and unable to eat just because my mind is so preoccupied. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. At one point in high school, when I was going through this (But much worse), I did get some professional help and it was very beneficial for me. And it&amp;#39;s not that I don&amp;#39;t have a good support system around me either, I do have really great friends. It&amp;#39;s just very difficult to describe how I feel without sounding ungrateful or selfish, so I think I&amp;#39;m really afraid to talk about it. Even more so, I don&amp;#39;t know what to talk about, other than &amp;quot;I feel like I&amp;#39;m slipping into a black hole for no reason.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It know it sounds silly. It&amp;#39;s getting very physical feeling, like actually nauseated and unable to eat just because my mind is so preoccupied. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zboi", "score_hidden": false, "name": "t1_chd0nin", "created": 1399609667.0, "author_flair_text": null, "created_utc": 1399580867.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcbqx9", "gilded": 0, "author": "reverienoire", "parent_id": "t3_24zboi", "approved_by": null, "body": "have you tried professional help? you sound like you're in a good place, atleast financially, for it to be a possibility. you definitely sound depressed, and there are options to treat depression, and i really encourage you to sort through the options. it's really really great that you recognize things are going south and you don't want them to go any further. please take that step and contact a professional. it might take some time and effort to get just what you need, but please don't give up. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;have you tried professional help? you sound like you&amp;#39;re in a good place, atleast financially, for it to be a possibility. you definitely sound depressed, and there are options to treat depression, and i really encourage you to sort through the options. it&amp;#39;s really really great that you recognize things are going south and you don&amp;#39;t want them to go any further. please take that step and contact a professional. it might take some time and effort to get just what you need, but please don&amp;#39;t give up. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zboi", "score_hidden": false, "name": "t1_chcbqx9", "created": 1399538843.0, "author_flair_text": null, "created_utc": 1399510043.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]