[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;WHy am I alive?  Why is anyone alive?  Why should I be alive when I&amp;#39;ve been in nearly constant pain for months on end with barely any relief?&lt;/p&gt;\n\n&lt;p&gt;I have an emergency appointment with my psychiatrist later today, i hope that helps\n.  He&amp;#39;s switching me to a new antidepressant, Fetzima, and ever since I&amp;#39;ve been on it I&amp;#39;ve had nothing but more problems: racing thoughts, severe agitation, severe depression and energy all at once.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of it.  Done.  Done.  I hysterically screamed at the top of my lungs last night for someone to help me, how I wanted to slit my wrists, how I wanted jump out the window and wanted to die.  My parents refused to take me to the hospital, I have a final exam for college I have to take today, I was actually supposed to take it last week but I fail at life so I need to f-ing make it up because I&amp;#39;m a piece of S_--.  I typed to my boyfriend how desperate I was to kill myself.  Anyway my parents wouldn&amp;#39;t take me to the hspital because if I miss this final I faill nursing god forbid that happen instead of me winding up miserablly depressed and wanting to die constantly.  I don&amp;#39;t even know what&amp;#39;s keeping me going, fear of failure?  But I just anticipate the worst anyway and it makes me want to crawl into a hole and die, I can&amp;#39;t do this anymore.  I have a job that I need to do things for on Friday and I start soon, I don&amp;#39;t know how the f--- I&amp;#39;m gong to handle it.  I really don&amp;#39;t, I really don&amp;#39;t know how to function, I&amp;#39;m so done, I have no sense of humor, nothing good about myself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m on 300mg of Lamictal, 1mg-1.25mg of Klonopin, 10mg of Saphris, and 40mg of Fetzima weaning off 40mg of Viibryd.&lt;/p&gt;\n\n&lt;p&gt;At around 8pm last night I took 30mg of Saphris, 100mg extra of Lamictal, and 2.5mg extra of Klonopin and almost kept going until my mom took all my pills. I wimped out and told her what I was doing as my boyfriend was threatening to call 911 and we don&amp;#39;t have money for an ambulance.  I think my brother broke his finger trying to restrain me (i thought he was tyring to harm me) as I lept towards my mom to get my pills back.  I&amp;#39;m desperate I just want to die, now I have no way to do it that I&amp;#39;d be happy with.&lt;/p&gt;\n\n&lt;p&gt;Nothing makes anything better, absolutely nothing, I can&amp;#39;t see myself living anymore.  No, no, no way.  I have freaking responsibilities, who cares?  Everyone would be better off with me dead, yeah I&amp;#39;d leave behind my debt but it&amp;#39;d be better than them yelling at me all the time, me breaking down to them and making them miserable.  I can&amp;#39;t go on like this, I can&amp;#39;t, I can&amp;#39;t, I can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m exhausted, all that extra medication barely did anything, I drank coffee afterwards in hopes I could stay up and study for my final today.  WEll I got a lot of work done but only after I took a &amp;quot;nap&amp;quot; for 30 minutes where I woke up to snoozing every five minutes, the medication feels like it has completely worn off and I&amp;#39;m back to wanting to die again, seriously, what is the point of living when you&amp;#39;re in so much never ending pain and you don&amp;#39;t want to be an adult with responsibliites and go on and life is too much??????&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "WHy am I alive?  Why is anyone alive?  Why should I be alive when I've been in nearly constant pain for months on end with barely any relief?\n\nI have an emergency appointment with my psychiatrist later today, i hope that helps\n.  He's switching me to a new antidepressant, Fetzima, and ever since I've been on it I've had nothing but more problems: racing thoughts, severe agitation, severe depression and energy all at once.\n\nI'm sick of it.  Done.  Done.  I hysterically screamed at the top of my lungs last night for someone to help me, how I wanted to slit my wrists, how I wanted jump out the window and wanted to die.  My parents refused to take me to the hospital, I have a final exam for college I have to take today, I was actually supposed to take it last week but I fail at life so I need to f-ing make it up because I'm a piece of S_--.  I typed to my boyfriend how desperate I was to kill myself.  Anyway my parents wouldn't take me to the hspital because if I miss this final I faill nursing god forbid that happen instead of me winding up miserablly depressed and wanting to die constantly.  I don't even know what's keeping me going, fear of failure?  But I just anticipate the worst anyway and it makes me want to crawl into a hole and die, I can't do this anymore.  I have a job that I need to do things for on Friday and I start soon, I don't know how the f--- I'm gong to handle it.  I really don't, I really don't know how to function, I'm so done, I have no sense of humor, nothing good about myself.\n\nI'm on 300mg of Lamictal, 1mg-1.25mg of Klonopin, 10mg of Saphris, and 40mg of Fetzima weaning off 40mg of Viibryd.\n\nAt around 8pm last night I took 30mg of Saphris, 100mg extra of Lamictal, and 2.5mg extra of Klonopin and almost kept going until my mom took all my pills. I wimped out and told her what I was doing as my boyfriend was threatening to call 911 and we don't have money for an ambulance.  I think my brother broke his finger trying to restrain me (i thought he was tyring to harm me) as I lept towards my mom to get my pills back.  I'm desperate I just want to die, now I have no way to do it that I'd be happy with.\n\nNothing makes anything better, absolutely nothing, I can't see myself living anymore.  No, no, no way.  I have freaking responsibilities, who cares?  Everyone would be better off with me dead, yeah I'd leave behind my debt but it'd be better than them yelling at me all the time, me breaking down to them and making them miserable.  I can't go on like this, I can't, I can't, I can't.\n\nI'm exhausted, all that extra medication barely did anything, I drank coffee afterwards in hopes I could stay up and study for my final today.  WEll I got a lot of work done but only after I took a \"nap\" for 30 minutes where I woke up to snoozing every five minutes, the medication feels like it has completely worn off and I'm back to wanting to die again, seriously, what is the point of living when you're in so much never ending pain and you don't want to be an adult with responsibliites and go on and life is too much??????", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25fmid", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "somethingsodistant", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1400009475.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25fmid/i_cant_go_on_i_cant_im_done_finished/", "name": "t3_25fmid", "created": 1399997819.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25fmid/i_cant_go_on_i_cant_im_done_finished/", "author_flair_text": null, "title": "I can't go on, I can't, I'm done, finished", "created_utc": 1399969019.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgpldw", "gilded": 0, "author": "My_timemachine_broke", "parent_id": "t3_25fmid", "approved_by": null, "body": "Life as an adult though seems like less responsibility to me only because it's more doing things that you want to do as opposed to just for others.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life as an adult though seems like less responsibility to me only because it&amp;#39;s more doing things that you want to do as opposed to just for others.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25fmid", "score_hidden": false, "name": "t1_chgpldw", "created": 1400001385.0, "author_flair_text": null, "created_utc": 1399972585.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgpeoi", "gilded": 0, "author": "Simalacrum", "parent_id": "t3_25fmid", "approved_by": null, "body": "\"Everyone would be better off with me dead\"\n\nThat is absolutely, absolutely not true.\n\nDeath isn't something people do alone; death leaves a vast and gaping hole in the lives of all those around you. It is something I never want to inflict on those around me. I implore you to think about that carefully: your death would, inevitably, have a devastating effect on your boyfriend, your family and all those around you.\n\nNow I'm sure you and you're psychiatrist have been over this already, but think about what is causing all this pain for you. Is it the anxiety of your degree? Then think about it: you have one exam left. After that, pass or fail, its over.\n\nRegarding other life commitments... I might be just a random dude on the Internet, but it sounds to me like you need to set some priorities straight here. Right now, your suicidal thoughts and trying to solve them should be your priority over everything else.\n\nLife has a tendency of being surprisingly unpredictable. Just because you've been in pain for months on end, doesn't mean you can predict that this is what'll be happening for the rest of your life, too. In fact, I can almost guarantee that it won't be continuing for the rest of your life.\n\nI know that the stress and anxiety of life can be crippling; I'm currently facing a situation in which I won't be able to graduate. Heck, I know I'm not going to graduate. 4 years of effort and misery, trudging through a university course I'm not even interested in, 4 years of anxiety, constantly thinking I'm going to fail, and now I'm finally going to genuinely fall at the last hurdle. Frankly I should have dropped out in my first year.\n\nBut you know what? That failure is ok. Whatever happens, *whatever* happens, I know that, with lots of little steps by little steps, I can recover. And so can you.\n\nLittle steps. I believe in you. I imagine so does those around you.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Everyone would be better off with me dead&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That is absolutely, absolutely not true.&lt;/p&gt;\n\n&lt;p&gt;Death isn&amp;#39;t something people do alone; death leaves a vast and gaping hole in the lives of all those around you. It is something I never want to inflict on those around me. I implore you to think about that carefully: your death would, inevitably, have a devastating effect on your boyfriend, your family and all those around you.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m sure you and you&amp;#39;re psychiatrist have been over this already, but think about what is causing all this pain for you. Is it the anxiety of your degree? Then think about it: you have one exam left. After that, pass or fail, its over.&lt;/p&gt;\n\n&lt;p&gt;Regarding other life commitments... I might be just a random dude on the Internet, but it sounds to me like you need to set some priorities straight here. Right now, your suicidal thoughts and trying to solve them should be your priority over everything else.&lt;/p&gt;\n\n&lt;p&gt;Life has a tendency of being surprisingly unpredictable. Just because you&amp;#39;ve been in pain for months on end, doesn&amp;#39;t mean you can predict that this is what&amp;#39;ll be happening for the rest of your life, too. In fact, I can almost guarantee that it won&amp;#39;t be continuing for the rest of your life.&lt;/p&gt;\n\n&lt;p&gt;I know that the stress and anxiety of life can be crippling; I&amp;#39;m currently facing a situation in which I won&amp;#39;t be able to graduate. Heck, I know I&amp;#39;m not going to graduate. 4 years of effort and misery, trudging through a university course I&amp;#39;m not even interested in, 4 years of anxiety, constantly thinking I&amp;#39;m going to fail, and now I&amp;#39;m finally going to genuinely fall at the last hurdle. Frankly I should have dropped out in my first year.&lt;/p&gt;\n\n&lt;p&gt;But you know what? That failure is ok. Whatever happens, &lt;em&gt;whatever&lt;/em&gt; happens, I know that, with lots of little steps by little steps, I can recover. And so can you.&lt;/p&gt;\n\n&lt;p&gt;Little steps. I believe in you. I imagine so does those around you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25fmid", "score_hidden": false, "name": "t1_chgpeoi", "created": 1400000161.0, "author_flair_text": null, "created_utc": 1399971361.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]