[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hate myself. I&amp;#39;ve done this to myself. I am a pointless lazy slug. I have a depressed girlfriend and I can&amp;#39;t even make her happy. Who am I joking I can&amp;#39;t even help myself. I lie all the time. To everybody. My family, friends, classmates, even her. My life has no point. I never get anything done. Nobody even wants to talk to me because I&amp;#39;m so pathetic. Nobody wants to help me. My mother just yells at me to get my things done. I have eleven things right now which I have to do or else I won&amp;#39;t be passing this grade. Everybody had so high expectations when I transferred to this school because I came from the second best school in the country, but I&amp;#39;ve disappointed everybody. My old classmates think I&amp;#39;m dumb and pathetic to not transfer to a fancy school. I have no friends. Everyone hates me. I&amp;#39;m a coward. And I&amp;#39;m so lazy. I just can&amp;#39;t do it anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hate myself. I've done this to myself. I am a pointless lazy slug. I have a depressed girlfriend and I can't even make her happy. Who am I joking I can't even help myself. I lie all the time. To everybody. My family, friends, classmates, even her. My life has no point. I never get anything done. Nobody even wants to talk to me because I'm so pathetic. Nobody wants to help me. My mother just yells at me to get my things done. I have eleven things right now which I have to do or else I won't be passing this grade. Everybody had so high expectations when I transferred to this school because I came from the second best school in the country, but I've disappointed everybody. My old classmates think I'm dumb and pathetic to not transfer to a fancy school. I have no friends. Everyone hates me. I'm a coward. And I'm so lazy. I just can't do it anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24mgop", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Commander_Shepard_N7", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24mgop/i_cant_just_even_do_it_anymore/", "name": "t3_24mgop", "created": 1399157720.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24mgop/i_cant_just_even_do_it_anymore/", "author_flair_text": null, "title": "I can't just even do it anymore", "created_utc": 1399128920.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8lsiw", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24mgop", "approved_by": null, "body": "I'm sorry you're feeling so low. Honestly, it sounds to me like people have had high expectations for you your entire life. You've met those expectations and possibly exceeded them, but it hasn't made you happy. It's tough shouldering so much responsibility.\n\nBut where's the time for you? What makes YOU happy?  When's the last time you thought of yourself?  People claim that depression and suicide is selfish, but perhaps some aren't selfish enough.\n\nTake some time off, even if it's just an hour. Do what you can to survive the rest of the school year and if you get an opportunity to do something fun, take it. You owe it to yourself.\n\nThings will be alright in the end. Just hang in there. Please.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re feeling so low. Honestly, it sounds to me like people have had high expectations for you your entire life. You&amp;#39;ve met those expectations and possibly exceeded them, but it hasn&amp;#39;t made you happy. It&amp;#39;s tough shouldering so much responsibility.&lt;/p&gt;\n\n&lt;p&gt;But where&amp;#39;s the time for you? What makes YOU happy?  When&amp;#39;s the last time you thought of yourself?  People claim that depression and suicide is selfish, but perhaps some aren&amp;#39;t selfish enough.&lt;/p&gt;\n\n&lt;p&gt;Take some time off, even if it&amp;#39;s just an hour. Do what you can to survive the rest of the school year and if you get an opportunity to do something fun, take it. You owe it to yourself.&lt;/p&gt;\n\n&lt;p&gt;Things will be alright in the end. Just hang in there. Please.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mgop", "score_hidden": false, "name": "t1_ch8lsiw", "created": 1399164757.0, "author_flair_text": null, "created_utc": 1399135957.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]