[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Am I retarded or something? Seriously, I just can&amp;#39;t cope with normal, day-to-day tasks other people take for granted.&lt;/p&gt;\n\n&lt;p&gt;A good example would be school. For some reason I can&amp;#39;t just hunker down and work. It&amp;#39;s gotten so bad that I don&amp;#39;t even go to class any more, because what&amp;#39;s the point if I haven&amp;#39;t done the work? I drive the 40 miles to school, but I just sit in the parking lot and freak out. Or email. I have a personal email account, that should be enough. I can&amp;#39;t keep track of my personal email account plus my school email account plus blackboard plus whatever other stupid &amp;quot;e-learning&amp;quot; program I need for each class. That&amp;#39;s bit me in the ass multiple times, but I just don&amp;#39;t learn.&lt;/p&gt;\n\n&lt;p&gt;Seriously, it seems like I&amp;#39;m the only person who has trouble with this stuff. It&amp;#39;s like I just don&amp;#39;t fit. I have no problem actually learning/thinking/reasoning, I retain all sorts of random trivia, I notice things other people don&amp;#39;t, and I&amp;#39;m way into scientific shit other people don&amp;#39;t care about. It&amp;#39;s just the day-to-day tasks I can&amp;#39;t cope with. I don&amp;#39;t know what it is, but I just can&amp;#39;t survive in the world. It&amp;#39;s fucking ridiculous and I&amp;#39;m tired of failing so miserably at everything when the stuff I&amp;#39;m failing at is honestly really simple stuff.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t often get urges for violence, but I want to go crazy and break shit. It&amp;#39;s all my own fault, too, which just amplifies how infuriating it all is. I&amp;#39;m just barely hanging on and failing this intro-level class is probably going to push me over the edge if I don&amp;#39;t cool down first.&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s really nothing wrong with my life except my own maladaptive self. Other people were born into destitution, other people have been raped, beaten, what have you. I&amp;#39;m just defective.&lt;/p&gt;\n\n&lt;p&gt;I should have just killed myself the first time I failed out of college. Instead I decided to keep trying, and look where that got me. I think I might be done. I&amp;#39;m gonna reach out to my professor, and if I really can&amp;#39;t rescue my grade this time I&amp;#39;ll just park my car somewhere out in the countryside and run a garden hose from the exhaust to the window.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Am I retarded or something? Seriously, I just can't cope with normal, day-to-day tasks other people take for granted.\n\nA good example would be school. For some reason I can't just hunker down and work. It's gotten so bad that I don't even go to class any more, because what's the point if I haven't done the work? I drive the 40 miles to school, but I just sit in the parking lot and freak out. Or email. I have a personal email account, that should be enough. I can't keep track of my personal email account plus my school email account plus blackboard plus whatever other stupid \"e-learning\" program I need for each class. That's bit me in the ass multiple times, but I just don't learn.\n\nSeriously, it seems like I'm the only person who has trouble with this stuff. It's like I just don't fit. I have no problem actually learning/thinking/reasoning, I retain all sorts of random trivia, I notice things other people don't, and I'm way into scientific shit other people don't care about. It's just the day-to-day tasks I can't cope with. I don't know what it is, but I just can't survive in the world. It's fucking ridiculous and I'm tired of failing so miserably at everything when the stuff I'm failing at is honestly really simple stuff.\n\nI don't often get urges for violence, but I want to go crazy and break shit. It's all my own fault, too, which just amplifies how infuriating it all is. I'm just barely hanging on and failing this intro-level class is probably going to push me over the edge if I don't cool down first.\n\nSo there's really nothing wrong with my life except my own maladaptive self. Other people were born into destitution, other people have been raped, beaten, what have you. I'm just defective.\n\nI should have just killed myself the first time I failed out of college. Instead I decided to keep trying, and look where that got me. I think I might be done. I'm gonna reach out to my professor, and if I really can't rescue my grade this time I'll just park my car somewhere out in the countryside and run a garden hose from the exhaust to the window.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24e7nl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "dprssthrowaway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398887813.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24e7nl/i_cant_do_things_other_people_find_easy/", "name": "t3_24e7nl", "created": 1398916348.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24e7nl/i_cant_do_things_other_people_find_easy/", "author_flair_text": null, "title": "I can't do things other people find easy.", "created_utc": 1398887548.0, "ups": 3, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6an9p", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch6ahrb", "approved_by": null, "body": "I don't just mean about the depression though. Try talking through exactly how you're feeling and what's been going on. Tell them that you want to change things and you are working towards that but it's going to take a little time to be able to do that. I know it's a lot for me to ask you to do this, it's got to be one of the hardest things a person could do, but there's always a chance it could help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t just mean about the depression though. Try talking through exactly how you&amp;#39;re feeling and what&amp;#39;s been going on. Tell them that you want to change things and you are working towards that but it&amp;#39;s going to take a little time to be able to do that. I know it&amp;#39;s a lot for me to ask you to do this, it&amp;#39;s got to be one of the hardest things a person could do, but there&amp;#39;s always a chance it could help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch6an9p", "created": 1398920346.0, "author_flair_text": null, "created_utc": 1398891546.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6ahrb", "gilded": 0, "author": "dprssthrowaway", "parent_id": "t1_ch6adp5", "approved_by": null, "body": "They're fully aware that I'm depressed. I really have tried a ton of stuff to combat depression, it's just that none of it's worked for me.\n\nedit: the fucked up thing is that if I could take a cumulative final for this class I'd probably ace it and pass the class since I know most everything in the syllabus already. But homework is weighted more heavily than the final, which really fucks me over. It's like torture, really. By the time I've pulled myself out of my slump it's too late to do anything about it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re fully aware that I&amp;#39;m depressed. I really have tried a ton of stuff to combat depression, it&amp;#39;s just that none of it&amp;#39;s worked for me.&lt;/p&gt;\n\n&lt;p&gt;edit: the fucked up thing is that if I could take a cumulative final for this class I&amp;#39;d probably ace it and pass the class since I know most everything in the syllabus already. But homework is weighted more heavily than the final, which really fucks me over. It&amp;#39;s like torture, really. By the time I&amp;#39;ve pulled myself out of my slump it&amp;#39;s too late to do anything about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch6ahrb", "created": 1398920042.0, "author_flair_text": null, "created_utc": 1398891242.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6adp5", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch6a950", "approved_by": null, "body": "I know it's difficult, but have you tried explaining the whole situation to them? Obviously I can't say for sure if it will work, and it won't be an easy thing at all to do, but it's worth at least considering.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s difficult, but have you tried explaining the whole situation to them? Obviously I can&amp;#39;t say for sure if it will work, and it won&amp;#39;t be an easy thing at all to do, but it&amp;#39;s worth at least considering.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch6adp5", "created": 1398919824.0, "author_flair_text": null, "created_utc": 1398891024.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6a950", "gilded": 0, "author": "dprssthrowaway", "parent_id": "t1_ch6a28n", "approved_by": null, "body": "Well I've been relying on my parents for a long time now, and I just don't know if they're gonna let me for much longer. That's my problem.\n\nI don't know of anywhere I could go where I really could get away from everything. There's nowhere I can go where I could be truly isolated and also not starve.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;ve been relying on my parents for a long time now, and I just don&amp;#39;t know if they&amp;#39;re gonna let me for much longer. That&amp;#39;s my problem.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know of anywhere I could go where I really could get away from everything. There&amp;#39;s nowhere I can go where I could be truly isolated and also not starve.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch6a950", "created": 1398919581.0, "author_flair_text": null, "created_utc": 1398890781.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6a28n", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch69ylh", "approved_by": null, "body": "Well if that's the case don't see it as leeching off them, it's just a temporary thing until you are able to get back on your feet. Take the year out and use it to sort out what you want from life and work how how you are going to achieve that. And then, when you have money again, you can repay your parents for all they've done for you. It's a problem yeah, but it doesn't have to be permanent.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if that&amp;#39;s the case don&amp;#39;t see it as leeching off them, it&amp;#39;s just a temporary thing until you are able to get back on your feet. Take the year out and use it to sort out what you want from life and work how how you are going to achieve that. And then, when you have money again, you can repay your parents for all they&amp;#39;ve done for you. It&amp;#39;s a problem yeah, but it doesn&amp;#39;t have to be permanent.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch6a28n", "created": 1398919218.0, "author_flair_text": null, "created_utc": 1398890418.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch69ylh", "gilded": 0, "author": "dprssthrowaway", "parent_id": "t1_ch69hlf", "approved_by": null, "body": "I guess I understand that way of looking at it, and I guess it is true. I used to be on top of things, but it;s like because I was depressed I never really had the chance to grow up. The problem is that after this I'm gonna get kicked out of community college, and I really don't know if I'm gonna get any more chances.\n\nI'd love to take a year away from everything to sort myself out and just live in the woods or something, but that's not realistic and I still need to eat. I can't leech off my parents for much longer, that's another thing that makes me hate myself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I understand that way of looking at it, and I guess it is true. I used to be on top of things, but it;s like because I was depressed I never really had the chance to grow up. The problem is that after this I&amp;#39;m gonna get kicked out of community college, and I really don&amp;#39;t know if I&amp;#39;m gonna get any more chances.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love to take a year away from everything to sort myself out and just live in the woods or something, but that&amp;#39;s not realistic and I still need to eat. I can&amp;#39;t leech off my parents for much longer, that&amp;#39;s another thing that makes me hate myself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch69ylh", "created": 1398919021.0, "author_flair_text": null, "created_utc": 1398890221.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch69hlf", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch696ob", "approved_by": null, "body": "Sorry to hear that your meds aren't working, but there are always other ones you can try. I know that's easy for me to say since i'm not in your position, but I know people who it's taken months to find out what works well for them. Having depression is no more your fault than having any other disease. And as for everything else it's the depression causing you to push everything back, to lose track of where you are and to feel like there is no way out of this. That is something I've experienced and it really does suck, but that doesn't make it your fault. Sorry about the email thing, but I'm assuming there has to be some tool out there that combines multiple accounts so you only have to check one place, I can look if you like. I know money and classes and jobs seem like big things, and they are, but the most important thing to sort out is your mental health. Once you are able to get that under control you are much better equipped to sort out everything else.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear that your meds aren&amp;#39;t working, but there are always other ones you can try. I know that&amp;#39;s easy for me to say since i&amp;#39;m not in your position, but I know people who it&amp;#39;s taken months to find out what works well for them. Having depression is no more your fault than having any other disease. And as for everything else it&amp;#39;s the depression causing you to push everything back, to lose track of where you are and to feel like there is no way out of this. That is something I&amp;#39;ve experienced and it really does suck, but that doesn&amp;#39;t make it your fault. Sorry about the email thing, but I&amp;#39;m assuming there has to be some tool out there that combines multiple accounts so you only have to check one place, I can look if you like. I know money and classes and jobs seem like big things, and they are, but the most important thing to sort out is your mental health. Once you are able to get that under control you are much better equipped to sort out everything else.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch69hlf", "created": 1398918118.0, "author_flair_text": null, "created_utc": 1398889318.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch696ob", "gilded": 0, "author": "dprssthrowaway", "parent_id": "t1_ch68xs9", "approved_by": null, "body": "Oh, I've been diagnosed as depressed. None of the meds have worked. Lexapro got close.\n\nYes, all of this really is my fault. All of my problems aside from the depression itself were caused by me pushing responsibilities off into the future and not really caring if it got done. But even if I really didn't deserve it, even if none of it were my fault, I don't think it would make that much of a difference.\n\nI just found out that my professor emailed me back on a different account than the one I emailed her on the same day I sent the email. Three weeks ago.\n\nI'm just done. I've tried to hack it for 5 or 6 years now, but I'm getting worse. It's the slow downward spiral that I really can't stand to watch. I owe my parents money. I keep failing my classes. I can't get a job. Days go by without notice, every week is worse than the last.\n\nI used to be scared of suicidal ideation, but now I'm not. And I guess on some level that does scare me, but not as much as it probably should.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I&amp;#39;ve been diagnosed as depressed. None of the meds have worked. Lexapro got close.&lt;/p&gt;\n\n&lt;p&gt;Yes, all of this really is my fault. All of my problems aside from the depression itself were caused by me pushing responsibilities off into the future and not really caring if it got done. But even if I really didn&amp;#39;t deserve it, even if none of it were my fault, I don&amp;#39;t think it would make that much of a difference.&lt;/p&gt;\n\n&lt;p&gt;I just found out that my professor emailed me back on a different account than the one I emailed her on the same day I sent the email. Three weeks ago.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just done. I&amp;#39;ve tried to hack it for 5 or 6 years now, but I&amp;#39;m getting worse. It&amp;#39;s the slow downward spiral that I really can&amp;#39;t stand to watch. I owe my parents money. I keep failing my classes. I can&amp;#39;t get a job. Days go by without notice, every week is worse than the last.&lt;/p&gt;\n\n&lt;p&gt;I used to be scared of suicidal ideation, but now I&amp;#39;m not. And I guess on some level that does scare me, but not as much as it probably should.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch696ob", "created": 1398917524.0, "author_flair_text": null, "created_utc": 1398888724.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch68xs9", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24e7nl", "approved_by": null, "body": "I've experienced very similar things, struggling to cope with things you know how you should do. Now I know this isn't the place for diagnoses but it is a common symptom of depression to feel this way. I don'y know if you have anyone to talk to there, but these things are much easier to deal with if you have someone to talk to about it, I can help you out there if you want. But please remember what's happening to you isn't your fault and you can change it, it's just difficult sometimes to figure out how.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve experienced very similar things, struggling to cope with things you know how you should do. Now I know this isn&amp;#39;t the place for diagnoses but it is a common symptom of depression to feel this way. I don&amp;#39;y know if you have anyone to talk to there, but these things are much easier to deal with if you have someone to talk to about it, I can help you out there if you want. But please remember what&amp;#39;s happening to you isn&amp;#39;t your fault and you can change it, it&amp;#39;s just difficult sometimes to figure out how.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7nl", "score_hidden": false, "name": "t1_ch68xs9", "created": 1398917041.0, "author_flair_text": null, "created_utc": 1398888241.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]