[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I tried talking to a friend a month ago. He was really supportive and actually made me feel like i could make it through this for once. But when i told him at first he didn&amp;#39;t know how to react so he had asked his mom. This is where problems arose. His mom relayed this to my parents who grilled me for information i really didn&amp;#39;t feel like talking about. They started treating me like i was fucking five. I eventually ended up lying to them and making them think i got better. After this i felt so much worse and i didn&amp;#39;t really feel like talking anymore. I still don&amp;#39;t feel like talking. I really don&amp;#39;t know why I&amp;#39;m even here. Its not that i don&amp;#39;t trust my friend anymore, it wasn&amp;#39;t his fault. Im just burnt out on talking about it. I don&amp;#39;t know what to do anymore. I could easily talk to him but i just can&amp;#39;t find the drive to do so. I have no idea how to approach this anymore i just kind of want to let it end already.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I tried talking to a friend a month ago. He was really supportive and actually made me feel like i could make it through this for once. But when i told him at first he didn't know how to react so he had asked his mom. This is where problems arose. His mom relayed this to my parents who grilled me for information i really didn't feel like talking about. They started treating me like i was fucking five. I eventually ended up lying to them and making them think i got better. After this i felt so much worse and i didn't really feel like talking anymore. I still don't feel like talking. I really don't know why I'm even here. Its not that i don't trust my friend anymore, it wasn't his fault. Im just burnt out on talking about it. I don't know what to do anymore. I could easily talk to him but i just can't find the drive to do so. I have no idea how to approach this anymore i just kind of want to let it end already.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24f6v8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "dingledogs", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24f6v8/i_dont_even_know_anymore/", "name": "t3_24f6v8", "created": 1398938265.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24f6v8/i_dont_even_know_anymore/", "author_flair_text": null, "title": "I don't even know anymore.", "created_utc": 1398909465.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7ep2s", "gilded": 0, "author": "sofar1776", "parent_id": "t1_ch6l3hp", "approved_by": null, "body": "Talk to the school nurse. She will be able to refer you to appropriate help. You might have a counselor before a principal. Depending on local laws, the counselor could be required. I live in a smaller town, but there are therapists in the area. There might be one in the next town over from you or something like that. Just don't try to carry it all alone. Let people help you, and you might be surprised how much they can do. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to the school nurse. She will be able to refer you to appropriate help. You might have a counselor before a principal. Depending on local laws, the counselor could be required. I live in a smaller town, but there are therapists in the area. There might be one in the next town over from you or something like that. Just don&amp;#39;t try to carry it all alone. Let people help you, and you might be surprised how much they can do. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f6v8", "score_hidden": false, "name": "t1_ch7ep2s", "created": 1399025663.0, "author_flair_text": null, "created_utc": 1398996863.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6l3hp", "gilded": 0, "author": "dingledogs", "parent_id": "t1_ch6ksck", "approved_by": null, "body": "I haven't talked to a counselor or a professional for a couple of reasons. As far as i know the small town i live in doesn't have anyone who could be considered a psychiatrist. I can't drive to another city because I'm a shitty driver and i never got mu license. As far as i know my school doesn't have a counselor i mean we're missing a principal and a superintendent for fuck sake i wouldn't expect them to prioritize a counselor over that. I really am just stick talking to friends right now but i don't even want to make an effort to do that. I'm just really confused on what to do right now.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t talked to a counselor or a professional for a couple of reasons. As far as i know the small town i live in doesn&amp;#39;t have anyone who could be considered a psychiatrist. I can&amp;#39;t drive to another city because I&amp;#39;m a shitty driver and i never got mu license. As far as i know my school doesn&amp;#39;t have a counselor i mean we&amp;#39;re missing a principal and a superintendent for fuck sake i wouldn&amp;#39;t expect them to prioritize a counselor over that. I really am just stick talking to friends right now but i don&amp;#39;t even want to make an effort to do that. I&amp;#39;m just really confused on what to do right now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f6v8", "score_hidden": false, "name": "t1_ch6l3hp", "created": 1398943237.0, "author_flair_text": null, "created_utc": 1398914437.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6ksck", "gilded": 0, "author": "sofar1776", "parent_id": "t3_24f6v8", "approved_by": null, "body": "You are here for someone to talk to. Maybe someone who can come up with a helpful idea or two. I am willing to try. First, I will ask you not to give up . You sound like you have been depressed for a while, the burnt out feeling and the lack of drive is what I am basing the guess on. Ending it all is a huge step, and it isn't necessarily the right one. Have you spoken to a counselor? If you are still in school, there should be one available. If you are out of school, look in your local phone book for a free clinic. Depression can be treated. There are many things that can help, and professionals to help figure out the right choice. Please give it a try. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are here for someone to talk to. Maybe someone who can come up with a helpful idea or two. I am willing to try. First, I will ask you not to give up . You sound like you have been depressed for a while, the burnt out feeling and the lack of drive is what I am basing the guess on. Ending it all is a huge step, and it isn&amp;#39;t necessarily the right one. Have you spoken to a counselor? If you are still in school, there should be one available. If you are out of school, look in your local phone book for a free clinic. Depression can be treated. There are many things that can help, and professionals to help figure out the right choice. Please give it a try. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f6v8", "score_hidden": false, "name": "t1_ch6ksck", "created": 1398942527.0, "author_flair_text": null, "created_utc": 1398913727.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6l7kn", "gilded": 0, "author": "dingledogs", "parent_id": "t1_ch6kt4g", "approved_by": null, "body": "I know he dis it because he cared. I don't blame him at all. He didn't even mention a name when he told her she figured it out on her own or saw the name on his phone or something. Theres no bad blood between us but i just don't want to talk right now i guess.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know he dis it because he cared. I don&amp;#39;t blame him at all. He didn&amp;#39;t even mention a name when he told her she figured it out on her own or saw the name on his phone or something. Theres no bad blood between us but i just don&amp;#39;t want to talk right now i guess.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f6v8", "score_hidden": false, "name": "t1_ch6l7kn", "created": 1398943496.0, "author_flair_text": null, "created_utc": 1398914696.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6kt4g", "gilded": 0, "author": "sunflower0123", "parent_id": "t3_24f6v8", "approved_by": null, "body": "I think your friend went to his mum for advice because he really cares about you.\n\nIt sounds like your parents care about you too but I am sorry to hear you feel like they are treating you as if you are a child. You're definitely not a child.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your friend went to his mum for advice because he really cares about you.&lt;/p&gt;\n\n&lt;p&gt;It sounds like your parents care about you too but I am sorry to hear you feel like they are treating you as if you are a child. You&amp;#39;re definitely not a child.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f6v8", "score_hidden": false, "name": "t1_ch6kt4g", "created": 1398942576.0, "author_flair_text": null, "created_utc": 1398913776.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]