[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, reddit. I&amp;#39;m on a throwaway as you can see.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been depressed ever since Friday, it started off with my dad and my friend at the supermarket. He was joking around, again, using the same old jokes, again. Same material, again, was always hilarious. My friend laughing with him and there&amp;#39;s me, standing there, frowning. What they were laughing at wasn&amp;#39;t funny at all, it was old as a motherfucker. I can tell my dad constantly to stop it and he&amp;#39;ll just tell me to lighten the fuck up and learn to take a joke. The problem is I already have, it just gets fairly annoying if it&amp;#39;s repeated &lt;strong&gt;every week&lt;/strong&gt; for &lt;strong&gt;5 years&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Then there was Saturday, at my brother&amp;#39;s apartment with his pregnant  girlfriend. My dad and I are assembling their crib, which my brother procrastinated on because he felt it was unfair that he had to assemble the crib &lt;strong&gt;and&lt;/strong&gt; put in the AC. A few minutes after we began, I looked at the instructions and thought Huh, this looks easy, I can do this. So I ask him for the &amp;quot;special tool&amp;quot; that came with it so I could use it. He refuses to give it to me. I ask again more assertively, he says No. I blurt out &amp;quot;Are you FUCKING kidding me?!&amp;quot; He yells HEY, HEY like he&amp;#39;s scolding a five year old who&amp;#39;s about to eat dirt. I sat down and just refused to do it anymore. When they come back, my brother makes sexist remarks about women, how we have bad memory (his gf was planning on ordering food over the phone), and all we do is talk and don&amp;#39;t make up our minds fast like men do. Us, being females, felt annoyed, disrespected, and just plain bad.&lt;/p&gt;\n\n&lt;p&gt;Sunday, college decision letter came in the mail. A rejection, saying my High School credentials weren&amp;#39;t acceptable enough and it was impossible to accept me. My body shut down right there, I stopped eating dinner and retreated into my room, angry/depressed/lonely/lost. I tried watching Tangled and Frozen to make me feel better, which they didn&amp;#39;t. My dad, all he does is say he&amp;#39;s sorry and walks away.&lt;/p&gt;\n\n&lt;p&gt;Monday, today. I go to lunch with my mother and lay out a plan: community college for 1 year then transfer to the college that rejected me, which is what the college wants me to do. Fine, I can do that. One problem: one car, one dad who doesn&amp;#39;t want to take me. When he got home and read the letter himself, he told me he was excited because I could get financial aid and go to college immediately. Then, still in his excitement, he said &amp;quot;You could take the bus!&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;bus&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That ruined my whole day, after feeling good and refreshed from lunch, he drops that on me and it crushes me. It hurt even more after Googleing the directions by bus and comparing it to by drive. &lt;em&gt;2 hours by bus, 26 minutes by car.&lt;/em&gt; My crushed body falls apart. My dad disrespects me so much, saying he would rather risk me getting stranded at the college for 2 hours by bus instead of the safer, quicker, cheapest route by car.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty much finished. My dad vents to me about his work, which I couldn&amp;#39;t give less than a fuck about. He jokes around all the time about me in public, which hurts my feelings but of course that&amp;#39;s my fault and I should learn to take a joke and lighten up. I feel like I&amp;#39;m only here because he wanted someone he can go to and talk to for free and put down so he can feel im-fucking-portant and right all the time. I can&amp;#39;t stand up for myself because then he&amp;#39;ll yell at me, and he uses his yelling to make me cry so I can retreat into my room and he can be left alone so he can go on Facebook and talk to his wife who lives in another country.&lt;/p&gt;\n\n&lt;p&gt;Everyone says it&amp;#39;s my fault because he&amp;#39;s my dad who gets me whatever I want and therefore he deserves my respect. I don&amp;#39;t care if he buys me a yacht, a $140k car, or my own gaming desktop. He buys me stuff like an entitled parent, the philosophy &amp;quot;I&amp;#39;ll buy them a new toy so they can stop their tantrum.&amp;quot; I&amp;#39;m twenty-one years old and he treats me like I&amp;#39;m 5 and I&amp;#39;m only here because he wants someone he can vent to for free.&lt;/p&gt;\n\n&lt;p&gt;With that being said, I often question why I was put here. Why am I here? What&amp;#39;s my purpose? I&amp;#39;ve been being used by everyone I come in contact with in my life. My dad uses me to vent and put down, my old best friend (no longer in contact) used me to get her obsession with making me feel bad out. I feel like I&amp;#39;m here for other people&amp;#39;s entertainment and letting out all their shit. I feel like to other people, I am a trash can they can kick around, pour shit in, and ignore like I&amp;#39;m nothing.&lt;/p&gt;\n\n&lt;p&gt;What do I do? I cannot for the life of me get a job, I don&amp;#39;t have my license (severe driving phobia), I cannot get a car, I&amp;#39;m just stuck in this small town full of absolutely nothing at least 25 miles away from the people I care about the most. I can&amp;#39;t move in with my mom because I&amp;#39;d die of cigarette smoke suffocation, I can&amp;#39;t live with my brother because he&amp;#39;s a jerk (we&amp;#39;re not on speaking terms and he doesn&amp;#39;t even have a spare bed), and I can&amp;#39;t live with my friend because their parent&amp;#39;s won&amp;#39;t allow it. I&amp;#39;m stuck and I cannot get out. I feel like I&amp;#39;m gonna die in here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, reddit. I'm on a throwaway as you can see.\n\nI've been depressed ever since Friday, it started off with my dad and my friend at the supermarket. He was joking around, again, using the same old jokes, again. Same material, again, was always hilarious. My friend laughing with him and there's me, standing there, frowning. What they were laughing at wasn't funny at all, it was old as a motherfucker. I can tell my dad constantly to stop it and he'll just tell me to lighten the fuck up and learn to take a joke. The problem is I already have, it just gets fairly annoying if it's repeated **every week** for **5 years**.\n\nThen there was Saturday, at my brother's apartment with his pregnant  girlfriend. My dad and I are assembling their crib, which my brother procrastinated on because he felt it was unfair that he had to assemble the crib **and** put in the AC. A few minutes after we began, I looked at the instructions and thought Huh, this looks easy, I can do this. So I ask him for the \"special tool\" that came with it so I could use it. He refuses to give it to me. I ask again more assertively, he says No. I blurt out \"Are you FUCKING kidding me?!\" He yells HEY, HEY like he's scolding a five year old who's about to eat dirt. I sat down and just refused to do it anymore. When they come back, my brother makes sexist remarks about women, how we have bad memory (his gf was planning on ordering food over the phone), and all we do is talk and don't make up our minds fast like men do. Us, being females, felt annoyed, disrespected, and just plain bad.\n\nSunday, college decision letter came in the mail. A rejection, saying my High School credentials weren't acceptable enough and it was impossible to accept me. My body shut down right there, I stopped eating dinner and retreated into my room, angry/depressed/lonely/lost. I tried watching Tangled and Frozen to make me feel better, which they didn't. My dad, all he does is say he's sorry and walks away.\n\nMonday, today. I go to lunch with my mother and lay out a plan: community college for 1 year then transfer to the college that rejected me, which is what the college wants me to do. Fine, I can do that. One problem: one car, one dad who doesn't want to take me. When he got home and read the letter himself, he told me he was excited because I could get financial aid and go to college immediately. Then, still in his excitement, he said \"You could take the bus!\"\n\n&gt; *bus*\n\nThat ruined my whole day, after feeling good and refreshed from lunch, he drops that on me and it crushes me. It hurt even more after Googleing the directions by bus and comparing it to by drive. *2 hours by bus, 26 minutes by car.* My crushed body falls apart. My dad disrespects me so much, saying he would rather risk me getting stranded at the college for 2 hours by bus instead of the safer, quicker, cheapest route by car.\n\nI'm pretty much finished. My dad vents to me about his work, which I couldn't give less than a fuck about. He jokes around all the time about me in public, which hurts my feelings but of course that's my fault and I should learn to take a joke and lighten up. I feel like I'm only here because he wanted someone he can go to and talk to for free and put down so he can feel im-fucking-portant and right all the time. I can't stand up for myself because then he'll yell at me, and he uses his yelling to make me cry so I can retreat into my room and he can be left alone so he can go on Facebook and talk to his wife who lives in another country.\n\nEveryone says it's my fault because he's my dad who gets me whatever I want and therefore he deserves my respect. I don't care if he buys me a yacht, a $140k car, or my own gaming desktop. He buys me stuff like an entitled parent, the philosophy \"I'll buy them a new toy so they can stop their tantrum.\" I'm twenty-one years old and he treats me like I'm 5 and I'm only here because he wants someone he can vent to for free.\n\nWith that being said, I often question why I was put here. Why am I here? What's my purpose? I've been being used by everyone I come in contact with in my life. My dad uses me to vent and put down, my old best friend (no longer in contact) used me to get her obsession with making me feel bad out. I feel like I'm here for other people's entertainment and letting out all their shit. I feel like to other people, I am a trash can they can kick around, pour shit in, and ignore like I'm nothing.\n\nWhat do I do? I cannot for the life of me get a job, I don't have my license (severe driving phobia), I cannot get a car, I'm just stuck in this small town full of absolutely nothing at least 25 miles away from the people I care about the most. I can't move in with my mom because I'd die of cigarette smoke suffocation, I can't live with my brother because he's a jerk (we're not on speaking terms and he doesn't even have a spare bed), and I can't live with my friend because their parent's won't allow it. I'm stuck and I cannot get out. I feel like I'm gonna die in here.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25ejwo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iwanttoknowwhy1", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25ejwo/i_dont_know_why_i_am_alive_i_wish_i_wasnt_born/", "name": "t3_25ejwo", "created": 1399966816.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25ejwo/i_dont_know_why_i_am_alive_i_wish_i_wasnt_born/", "author_flair_text": null, "title": "I don't know why I am alive, I wish I wasn't born.", "created_utc": 1399938016.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgfi4g", "gilded": 0, "author": "NapoleonBlownapart87", "parent_id": "t3_25ejwo", "approved_by": null, "body": "First and foremost, I just want to say that I'm sorry. I know I'm not necessarily at fault for any of the things you're currently feeling - but I want you to know that having read every word of what you wrote above that I empathize with your situation. It certainly sounds like you had a challenging weekend and that stinks.\n\n\nNow as for the questions that you asked - if you find out the answer to those definitely let me know :). The question of why you, me, any of us are \"here\", or wherever we happen to be, has been pondered for centuries and will be pondered for centuries more. But at the same time, I think this uncertainty around why any of us are here is the ultimate empowerment. YOU can decide why you were put here, and you can decide to write your own story.\n\n\nFirst of all I admire your passion and drive to go to college. Now you certainly hit a bump in the road, but you were not left without options. I know a number of people who started off going to Community College who are actually quite happy that they started there - it afforded them the opportunity to try different areas of study as a means to find the right path. I can tell just from the way you were able to write the paragraphs above that you are a talented writer; you can convey complex ideas and emotions succinctly and effectively. I have no doubt that you can flourish at a community college and then move on to the college you want to go to.\n\n\nIt certainly sounds like it will be tough logistically, but perhaps you can use that time on the bus. I have a 60+ minute commute to and from work everyday, and I use it as a time to think, to decompress, and to just do whatever it is that I want to do. Sometimes I read or study (although be careful because if you do that for too long you might get sick), or listen to music, or sometimes to just relax and take sometime to myself. Maybe that's just time for iwanttoknowwhy1 to ponder her thoughts.\n\n\n\nAs for your brother and father - my response is... \"eh\". Don't get me wrong, I know they are fixtures in your life, but I encourage you to remember that their views of you, of women, of anything really, are in no way indicative of who you are or your worth. A lioness does not concern herself with the opinions of sheep. You are in control and you have the opportunity to show both of them, all of them, that you are in control and you can make the most of this life that you were given.\n\n\nI wish you the best of luck in your endeavors - and I look forward to the day when you're successful, passionate, and above all else, happy. You'll kick your feet up after another successful day and you'll look back on this day, on these thoughts, and these people, and you'll realize how far you've come.... and perhaps, you might smile and chuckle to yourself as you say, \"oh..... this is why I'm here.\"", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First and foremost, I just want to say that I&amp;#39;m sorry. I know I&amp;#39;m not necessarily at fault for any of the things you&amp;#39;re currently feeling - but I want you to know that having read every word of what you wrote above that I empathize with your situation. It certainly sounds like you had a challenging weekend and that stinks.&lt;/p&gt;\n\n&lt;p&gt;Now as for the questions that you asked - if you find out the answer to those definitely let me know :). The question of why you, me, any of us are &amp;quot;here&amp;quot;, or wherever we happen to be, has been pondered for centuries and will be pondered for centuries more. But at the same time, I think this uncertainty around why any of us are here is the ultimate empowerment. YOU can decide why you were put here, and you can decide to write your own story.&lt;/p&gt;\n\n&lt;p&gt;First of all I admire your passion and drive to go to college. Now you certainly hit a bump in the road, but you were not left without options. I know a number of people who started off going to Community College who are actually quite happy that they started there - it afforded them the opportunity to try different areas of study as a means to find the right path. I can tell just from the way you were able to write the paragraphs above that you are a talented writer; you can convey complex ideas and emotions succinctly and effectively. I have no doubt that you can flourish at a community college and then move on to the college you want to go to.&lt;/p&gt;\n\n&lt;p&gt;It certainly sounds like it will be tough logistically, but perhaps you can use that time on the bus. I have a 60+ minute commute to and from work everyday, and I use it as a time to think, to decompress, and to just do whatever it is that I want to do. Sometimes I read or study (although be careful because if you do that for too long you might get sick), or listen to music, or sometimes to just relax and take sometime to myself. Maybe that&amp;#39;s just time for iwanttoknowwhy1 to ponder her thoughts.&lt;/p&gt;\n\n&lt;p&gt;As for your brother and father - my response is... &amp;quot;eh&amp;quot;. Don&amp;#39;t get me wrong, I know they are fixtures in your life, but I encourage you to remember that their views of you, of women, of anything really, are in no way indicative of who you are or your worth. A lioness does not concern herself with the opinions of sheep. You are in control and you have the opportunity to show both of them, all of them, that you are in control and you can make the most of this life that you were given.&lt;/p&gt;\n\n&lt;p&gt;I wish you the best of luck in your endeavors - and I look forward to the day when you&amp;#39;re successful, passionate, and above all else, happy. You&amp;#39;ll kick your feet up after another successful day and you&amp;#39;ll look back on this day, on these thoughts, and these people, and you&amp;#39;ll realize how far you&amp;#39;ve come.... and perhaps, you might smile and chuckle to yourself as you say, &amp;quot;oh..... this is why I&amp;#39;m here.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ejwo", "score_hidden": false, "name": "t1_chgfi4g", "created": 1399970598.0, "author_flair_text": null, "created_utc": 1399941798.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgok07", "gilded": 0, "author": "ignorethename", "parent_id": "t3_25ejwo", "approved_by": null, "body": "Get a room for yourself at the college, or better still join a female dormitory. Make female friends. You need them.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a room for yourself at the college, or better still join a female dormitory. Make female friends. You need them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ejwo", "score_hidden": false, "name": "t1_chgok07", "created": 1399995321.0, "author_flair_text": null, "created_utc": 1399966521.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]