[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m quite depressed at the moment, so any effort to make this post enjoyable to read will be futile. Please read everything, it gets worse. as it goes on.&lt;/p&gt;\n\n&lt;p&gt;I am 15 years old, I have many issues in my life, &lt;/p&gt;\n\n&lt;p&gt;I am an alien&lt;/p&gt;\n\n&lt;p&gt;My only friends are the video game nerds at my school, aside from that I have nothing in common with anyone else, I&amp;#39;m often described as a &amp;quot;weirdo&amp;quot;, and that&amp;#39;s because I have nothing to say to anyone, the only thing I&amp;#39;m interested in is heavy metal, role playing games/strategy games and philosophy/science, while everyone at my school&amp;#39;s into fucking cod or top 20 charts music, and who the fuck in high school even knows what fucking philosophy means? The minute I begin to raise a deep and interesting question about the human fucking life people kinda look at their toes and just nod while chanting &amp;quot;yeah&amp;quot; or &amp;quot;emm interesting&amp;quot; before walking to group of far more entertaining people who are all talking about fucking football or something. NOBODY else enjoys anything I like, even my few friends who play video games gravitate towards first persons shooters, I dislike fps&amp;#39; greatly. &lt;/p&gt;\n\n&lt;p&gt;My home life is far fucking worse, I&amp;#39;m pretty sure my dad is depressed over me. I can&amp;#39;t leave my bedroom, I hate leaving it, I&amp;#39;m not sure why, but I just don&amp;#39;t, I brush my teeth in my bedroom and spit into an empty cup, I often have to drag myself out of my room to avoid just pissing into a piss bottle even when I don&amp;#39;t feel depressed, and the only reason I do drag myself out to piss in a toilet, is because my dad caught me with about 20 piss bottles all hidden in my room, and he lost his sanity, he said if he ever found a piss bottle in my room again, he would smash my computer to bits, &lt;/p&gt;\n\n&lt;p&gt;Same deal with showering, I&amp;#39;m more than happy to just not shower anymore and just walk through life as living cesspit, but my dad shouts at me if I don&amp;#39;t, and it breaks my fucking heart to hear my dad shout at me, so I instead use all of my will to pull myself to take a shower, and at that, I only shower 4/7 days a week.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m convinced my dad loves my brother far more than he loves me, and the reasons above are probably why, but also, my brother is sportsman, and is one of the &amp;quot;cool&amp;quot; kids at our school, he listens to gangstar rap, he boxes and plays football, he&amp;#39;s the one making my fucking dad proud. I mean get decent grades, I&amp;#39;m best set for all my subjects, I&amp;#39;m also a school prefect and constantly win awards from the headmaster himself for: getting highest marks, being extremely respectful to teachers and other &amp;quot;good student&amp;quot; awards, but aside from that, I pay no attention to my physical appearance, I&amp;#39;m a loner and I&amp;#39;m a disgustingly big nerd who has serious personal hygiene issues.  &lt;/p&gt;\n\n&lt;p&gt;The only things that drag me out of depression is gaming, monster energy and chocolate. Gaming keeps me distracted from how much I feel detached from this world, Monster stops me feeling depressed I suppose and chocolate is a temporally fix, kinda like smoking I think. And sadly my dad constantly keeps fucking going on at me for liking these things, every time I come home with 4 pack of monster energies, or a chocolate bar I get smacked with &amp;quot;You&amp;#39;re going to fucking kill yourself of energy drinks! Or, your ruining your body!&amp;quot; And when I&amp;#39;m playing video games &amp;quot;Why don&amp;#39;t you fucking go outside, and make some friends&amp;quot; or &amp;quot;You need to exercise more, so go outside&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Sigh...&lt;/p&gt;\n\n&lt;p&gt;My dad often likes to insult me a lot, I went through a phase where I literally thought I was the most intelligent man on this Earth because of a few fucking achievements, and I suppose I must&amp;#39;ve really hurt my dad, I would often insult him for being shallow and being religious. When that phase passed I learned that I was a fucking arrogant horrible asshole, I stopped doing it, but now whenever I make a mistake, or do something badly, my dad really takes it as his opportunity to ruin my day, he&amp;#39;ll call me a &amp;quot;retard&amp;quot;, &amp;quot;idiot&amp;quot; &amp;quot;thick-cunt&amp;quot; over and over, angrily and if I ask him to stop, he won&amp;#39;t listen at all. All of my self esteem is based on intelligence, so when he calls me those names it sends me into an angry rage where I either hit and bite myself brutally, or just cry into a pool of my own tears wanting to kill myself badly, (I kinda feel like this now to be honest). &lt;/p&gt;\n\n&lt;p&gt;And top of all this fucking off, I&amp;#39;m also transgendered. And my life style makes me feel so fucking unfeminine, not to mention I&amp;#39;m physically well built, so I&amp;#39;ll probably never look like a women in my entire fucking life. &lt;/p&gt;\n\n&lt;p&gt;I wish I could kill myself, but find a knife sharp enough, or finding chemicals strong enough just... force me out of it, I just had a fucking shotgun, I would be dead by now, but no, it&amp;#39;s not as easy as that, I&amp;#39;ll have to fucking find another way of killing myself instead.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t read through my post to see if it makes sense I&amp;#39;m sorry, but I feel dead at the moment.&lt;/p&gt;\n\n&lt;p&gt;sigh...........................................................................&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm quite depressed at the moment, so any effort to make this post enjoyable to read will be futile. Please read everything, it gets worse. as it goes on.\n\nI am 15 years old, I have many issues in my life, \n\nI am an alien\n\nMy only friends are the video game nerds at my school, aside from that I have nothing in common with anyone else, I'm often described as a \"weirdo\", and that's because I have nothing to say to anyone, the only thing I'm interested in is heavy metal, role playing games/strategy games and philosophy/science, while everyone at my school's into fucking cod or top 20 charts music, and who the fuck in high school even knows what fucking philosophy means? The minute I begin to raise a deep and interesting question about the human fucking life people kinda look at their toes and just nod while chanting \"yeah\" or \"emm interesting\" before walking to group of far more entertaining people who are all talking about fucking football or something. NOBODY else enjoys anything I like, even my few friends who play video games gravitate towards first persons shooters, I dislike fps' greatly. \n\nMy home life is far fucking worse, I'm pretty sure my dad is depressed over me. I can't leave my bedroom, I hate leaving it, I'm not sure why, but I just don't, I brush my teeth in my bedroom and spit into an empty cup, I often have to drag myself out of my room to avoid just pissing into a piss bottle even when I don't feel depressed, and the only reason I do drag myself out to piss in a toilet, is because my dad caught me with about 20 piss bottles all hidden in my room, and he lost his sanity, he said if he ever found a piss bottle in my room again, he would smash my computer to bits, \n\nSame deal with showering, I'm more than happy to just not shower anymore and just walk through life as living cesspit, but my dad shouts at me if I don't, and it breaks my fucking heart to hear my dad shout at me, so I instead use all of my will to pull myself to take a shower, and at that, I only shower 4/7 days a week.  \n\nI'm convinced my dad loves my brother far more than he loves me, and the reasons above are probably why, but also, my brother is sportsman, and is one of the \"cool\" kids at our school, he listens to gangstar rap, he boxes and plays football, he's the one making my fucking dad proud. I mean get decent grades, I'm best set for all my subjects, I'm also a school prefect and constantly win awards from the headmaster himself for: getting highest marks, being extremely respectful to teachers and other \"good student\" awards, but aside from that, I pay no attention to my physical appearance, I'm a loner and I'm a disgustingly big nerd who has serious personal hygiene issues.  \n\nThe only things that drag me out of depression is gaming, monster energy and chocolate. Gaming keeps me distracted from how much I feel detached from this world, Monster stops me feeling depressed I suppose and chocolate is a temporally fix, kinda like smoking I think. And sadly my dad constantly keeps fucking going on at me for liking these things, every time I come home with 4 pack of monster energies, or a chocolate bar I get smacked with \"You're going to fucking kill yourself of energy drinks! Or, your ruining your body!\" And when I'm playing video games \"Why don't you fucking go outside, and make some friends\" or \"You need to exercise more, so go outside\". \n\nSigh...\n\nMy dad often likes to insult me a lot, I went through a phase where I literally thought I was the most intelligent man on this Earth because of a few fucking achievements, and I suppose I must've really hurt my dad, I would often insult him for being shallow and being religious. When that phase passed I learned that I was a fucking arrogant horrible asshole, I stopped doing it, but now whenever I make a mistake, or do something badly, my dad really takes it as his opportunity to ruin my day, he'll call me a \"retard\", \"idiot\" \"thick-cunt\" over and over, angrily and if I ask him to stop, he won't listen at all. All of my self esteem is based on intelligence, so when he calls me those names it sends me into an angry rage where I either hit and bite myself brutally, or just cry into a pool of my own tears wanting to kill myself badly, (I kinda feel like this now to be honest). \n\nAnd top of all this fucking off, I'm also transgendered. And my life style makes me feel so fucking unfeminine, not to mention I'm physically well built, so I'll probably never look like a women in my entire fucking life. \n\nI wish I could kill myself, but find a knife sharp enough, or finding chemicals strong enough just... force me out of it, I just had a fucking shotgun, I would be dead by now, but no, it's not as easy as that, I'll have to fucking find another way of killing myself instead.\n\nI haven't read through my post to see if it makes sense I'm sorry, but I feel dead at the moment.\n\n\n\n\n\n\n\n\n\n\n\nsigh...........................................................................", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24rwkk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Thrownintothedirt", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399302145.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24rwkk/i_dont_know_why_i_have_not_ended_myself_yet/", "name": "t3_24rwkk", "created": 1399327163.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24rwkk/i_dont_know_why_i_have_not_ended_myself_yet/", "author_flair_text": null, "title": "I don't know why I have not ended myself yet", "created_utc": 1399298363.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha2dda", "gilded": 0, "author": "mikmaqmastermind", "parent_id": "t3_24rwkk", "approved_by": null, "body": "Listen bud, although we have different issues we're not much different. I'm 27 years of age now, am graduating this month majoring in biology. I was sexually abused as a child on many occasions, introduced to drugs and alcohol at age 9. I was lucky enough to have a normal enough adolescence, however there were times when I thought nobody was like me because I listened to old school heavy metal, lots of classical music and just old music that nobody listened to. And I didn't care if people thought I was weird, I learned to take my weirdness and own it, don't be ashamed of it. On top if that my brother committed suicide when I was 21, and my father OD'd on prescription drugs 4 years later while I was still in school. That fucked me in the head so much, suicide had crossed my mind so many times, dropping out of school and running away to a third world country also crossed my mind. But I'm still here, graduating, joining the airforce as a pilot. I got nothing but good things coming my way now. So even though our problems may be different, we're much of the same. I'm not sure if this helps but my advise if you'll accept it is; fuck everybody else, you are an individual of this planet, there are many like you, and although you may have not met them, this is a big world with many great things to see. It's worth to stay alive and experience what this world has to offer.\n\nHope ya'll be okay bud. \n\nP.S I also gamed a lot growing up, and still do. I love RPG's", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listen bud, although we have different issues we&amp;#39;re not much different. I&amp;#39;m 27 years of age now, am graduating this month majoring in biology. I was sexually abused as a child on many occasions, introduced to drugs and alcohol at age 9. I was lucky enough to have a normal enough adolescence, however there were times when I thought nobody was like me because I listened to old school heavy metal, lots of classical music and just old music that nobody listened to. And I didn&amp;#39;t care if people thought I was weird, I learned to take my weirdness and own it, don&amp;#39;t be ashamed of it. On top if that my brother committed suicide when I was 21, and my father OD&amp;#39;d on prescription drugs 4 years later while I was still in school. That fucked me in the head so much, suicide had crossed my mind so many times, dropping out of school and running away to a third world country also crossed my mind. But I&amp;#39;m still here, graduating, joining the airforce as a pilot. I got nothing but good things coming my way now. So even though our problems may be different, we&amp;#39;re much of the same. I&amp;#39;m not sure if this helps but my advise if you&amp;#39;ll accept it is; fuck everybody else, you are an individual of this planet, there are many like you, and although you may have not met them, this is a big world with many great things to see. It&amp;#39;s worth to stay alive and experience what this world has to offer.&lt;/p&gt;\n\n&lt;p&gt;Hope ya&amp;#39;ll be okay bud. &lt;/p&gt;\n\n&lt;p&gt;P.S I also gamed a lot growing up, and still do. I love RPG&amp;#39;s&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rwkk", "score_hidden": false, "name": "t1_cha2dda", "created": 1399329834.0, "author_flair_text": null, "created_utc": 1399301034.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]