[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been thinking about suicide for the past few months. People around don&amp;#39;t listen and have very little empathy. The people around me are negative about everything I consider trying, which is why I no longer try. It has gone to the point where I will go into fits of crying/rage. I don&amp;#39;t release my rage so it&amp;#39;s building to a point where I feel like committing serious violence (stabbing/choking/beating) those around me. Each time I try to talk to them I fell closer to hurting someone. It&amp;#39;s either I hurt one of them or myself to prevent me hurting them. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 21 no job/ nothing going in life. Used to get bullied about my weight and personality. Never had a sex or gf (I&amp;#39;m the friend you &amp;quot;forget&amp;quot; to invite if girls will be around). One time a girl approached me out of thin air just to give me a rejection letter and laugh(stuff like this happened a lot). skipped prom/Graduation and worked.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t this life if for me, if i could give away my time I would. I don&amp;#39;t think I will make it past 23.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been thinking about suicide for the past few months. People around don't listen and have very little empathy. The people around me are negative about everything I consider trying, which is why I no longer try. It has gone to the point where I will go into fits of crying/rage. I don't release my rage so it's building to a point where I feel like committing serious violence (stabbing/choking/beating) those around me. Each time I try to talk to them I fell closer to hurting someone. It's either I hurt one of them or myself to prevent me hurting them. \n\nI'm 21 no job/ nothing going in life. Used to get bullied about my weight and personality. Never had a sex or gf (I'm the friend you \"forget\" to invite if girls will be around). One time a girl approached me out of thin air just to give me a rejection letter and laugh(stuff like this happened a lot). skipped prom/Graduation and worked.\n\nI don't this life if for me, if i could give away my time I would. I don't think I will make it past 23.\n\n  \n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ohsj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ScrubberDucks", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ohsj/i_dont_care_about_anyone_especially_me/", "name": "t3_24ohsj", "created": 1399217029.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ohsj/i_dont_care_about_anyone_especially_me/", "author_flair_text": null, "title": "I don't care about anyone. Especially me.", "created_utc": 1399188229.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9491l", "gilded": 0, "author": "ScrubberDucks", "parent_id": "t3_24ohsj", "approved_by": null, "body": "To give an example. \nA few days ago I tried to talk about myself with my sister and her response to what I said was \"get over it\". A day later her boyfriend says the same thing I said and she gives him a thoughtful emotional response in front of me. I Left the room quickly (pissed off) but almost returned with a baseball bat. I dream about killing those around me on a regular basis. Help!! I'm falling to the violent side.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To give an example. \nA few days ago I tried to talk about myself with my sister and her response to what I said was &amp;quot;get over it&amp;quot;. A day later her boyfriend says the same thing I said and she gives him a thoughtful emotional response in front of me. I Left the room quickly (pissed off) but almost returned with a baseball bat. I dream about killing those around me on a regular basis. Help!! I&amp;#39;m falling to the violent side.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ohsj", "score_hidden": false, "name": "t1_ch9491l", "created": 1399217756.0, "author_flair_text": null, "created_utc": 1399188956.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]