[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I copy &amp;amp; pasted this from my post on &lt;a href=\"/r/teenagers\"&gt;/r/teenagers&lt;/a&gt; if anyone wants to know whats going on with me right now..&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, I don&amp;#39;t know where to begin, but I guess i&amp;#39;ll start with talking about who I am. So I was raised in a very typical family with good values and morals. I live in a nice house, and my parents have high expectations of me &amp;amp; my brother to go to university and be successful in life. I&amp;#39;ve been an average student my entire life, up until this year.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in grade 11, and I started smoking marijuana this year. It started with once a week, but I slowly started blazing more and more, until I found myself smoking weed daily. Today is the day I realized how much of an issue it was, when I casually went to blaze with a few friends before first block. I do this quite frequently, and go to classes high every day.&lt;/p&gt;\n\n&lt;p&gt;Today, however, we decided to use a friend of mine&amp;#39;s bong, and I got extremely baked. While I was walking back to class, through the hallway, I started getting pretty worried that I probably shouldn&amp;#39;t be going to class this baked, and then a friend of mine appeared. I was extremely relieved to see my friend walk down the hall, so I instantly went up to them (by the way im late for class) literally 5 feet away from my class and I whispered &amp;quot;How do I look?&amp;quot; My friend looks up and instantly says &amp;quot;Infineks, you look fucked.&amp;quot; So I quickly decide I can&amp;#39;t go to class, and head to the washroom. I wash my hands to try and remove the smell of weed just in case. I spend a bit of time just pondering everything, looking in the mirror at how high I look.&lt;/p&gt;\n\n&lt;p&gt;After I&amp;#39;m done in the washroom I go to walk back outside and go to the smoke pit to see if anyone&amp;#39;s there, and on the way I run into one of my friends who I blazed with. I asked him if he wanted to skip with me because I was way to high to go to class, so he said yeah.&lt;/p&gt;\n\n&lt;p&gt;We passed by the pit, and no one was there, so we decided to walk down to the gas station. On the way there, out of nowhere, a truck pulled over on the side of the road &amp;amp; rolled its window down. Inside the vehicle was my best friend and his dad, who knows my parents very well. I said &amp;quot;hey uh.. we&amp;#39;re just going down to uh-&amp;quot; then I paused and looked over at them both. My friend said &amp;quot;Bye infineks&amp;quot; and then they drove away. I was extremely worried from that, as it was extremely obvious I had been smoking marijuana.\nAfter that I started freaking out quite a bit, and everything in my life was being rapidly evaluated in my head. Why was I doing everything I was doing, for what purpose was I smoking marijuana and skipping class so frequently? Why was I ruining my life?&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what it really boiled down to, was that I was ruining my life. I started panicking, and thoughts were bouncing around my head at millions of miles per hour. I can&amp;#39;t remember much of what I thought about, but it was insane how much I thought about, and how deep I thought. I&amp;#39;m curious how my brain would look in an MRI during that. Anyways, eventually me and my friend got back from petro and just chilled in an alley, but he soon left to go to next block, I didn&amp;#39;t because I was freaking out. I texted my best friend saying he should come share a cigar with me, and I also asked him what his dad said. He said his dad said &amp;quot;oh was he going to go smoke a joint?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;While I was sitting there alone, I started freaking out. It felt like a snake had wrapped itself around my body, and was trying to crush me because I was panicking so much, and I was constantly thinking what I should do with my life. I was constantly worried about how I could explain what happened to people, as I had thought about essentially everything ever from my perspective at the time. I almost felt enlightened, but in a very wrong way.&lt;/p&gt;\n\n&lt;p&gt;I would get lost in thoughts, thinking about thoughts, and eventually I almost got completely lost from reality, unsure of what the original &amp;quot;thinker&amp;quot; was, as I was always in thoughts thinking about different thoughts thinking about thoughts, etc, etc, etc. but the most I knew at any given moment during this event, was that I was in an alley, and that I was baked.&lt;/p&gt;\n\n&lt;p&gt;But then my best friend came, and he tried to calm me down a little bit. My friend was always asking to go to class, but I can&amp;#39;t remember why he wouldn&amp;#39;t, and he&amp;#39;d always be talking to his gf about something. Eventually we went back to the school and I managed to calm down over time.&lt;/p&gt;\n\n&lt;p&gt;Right now i&amp;#39;m at home, on my computer, and I don&amp;#39;t know what to do. I&amp;#39;m so unbelievably overwhelmed by everything right now, and I don&amp;#39;t know why I should be alive, or even bother to remain alive. After whatever happened today it doesn&amp;#39;t make sense why I would stay alive in this difficult universe with no reason. I need a reason to live, and right now i&amp;#39;m lost. I also got grounded for skipping class today, but there&amp;#39;s no sign that my parents know that I was high or anything today from my friends dad..&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do right now, I&amp;#39;m unbelievably overwhelmed, and I have no idea who to talk to. Part of why I&amp;#39;m overwhelmed is that I have so much to say, and so much to explain with everything, that I have no idea how I would ever explain any of it in a million years. Like i&amp;#39;m speechless, I don&amp;#39;t know what to say.\nAnyways sorry for the long read, thank you so much if you bothered to read it, sorry if it&amp;#39;s insanely boring, but I just need some help.&lt;/p&gt;\n\n&lt;p&gt;Also- My mom just came in, right when I finished writing that pretty much. My english teacher called home about how I skipped first block. My mom went on a huge rant about how I need to try harder at school and everything, as I&amp;#39;m failing english, biology, and German (although im dropping out of german). I just feel dead. I still want to perceive the universe, and have a sentient mind to think about &lt;/p&gt;\n\n&lt;p&gt;things, but I really just want to die right now. I have no idea how to deal with what I&amp;#39;ve done to myself.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading all of this shit, if you did.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion:&lt;/strong&gt; I have no idea why I should continue to live right now. I have no idea how I should kill myself. I really want to continue to live, and I really want to be able to experience all the beauty in life, but this is so overwhelming and I just really can&amp;#39;t be alive anymore.. I just need some help right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I copy &amp; pasted this from my post on /r/teenagers if anyone wants to know whats going on with me right now..\n\n\"So, I don't know where to begin, but I guess i'll start with talking about who I am. So I was raised in a very typical family with good values and morals. I live in a nice house, and my parents have high expectations of me &amp; my brother to go to university and be successful in life. I've been an average student my entire life, up until this year.\n\nI'm in grade 11, and I started smoking marijuana this year. It started with once a week, but I slowly started blazing more and more, until I found myself smoking weed daily. Today is the day I realized how much of an issue it was, when I casually went to blaze with a few friends before first block. I do this quite frequently, and go to classes high every day.\n\nToday, however, we decided to use a friend of mine's bong, and I got extremely baked. While I was walking back to class, through the hallway, I started getting pretty worried that I probably shouldn't be going to class this baked, and then a friend of mine appeared. I was extremely relieved to see my friend walk down the hall, so I instantly went up to them (by the way im late for class) literally 5 feet away from my class and I whispered \"How do I look?\" My friend looks up and instantly says \"Infineks, you look fucked.\" So I quickly decide I can't go to class, and head to the washroom. I wash my hands to try and remove the smell of weed just in case. I spend a bit of time just pondering everything, looking in the mirror at how high I look.\n\nAfter I'm done in the washroom I go to walk back outside and go to the smoke pit to see if anyone's there, and on the way I run into one of my friends who I blazed with. I asked him if he wanted to skip with me because I was way to high to go to class, so he said yeah.\n\nWe passed by the pit, and no one was there, so we decided to walk down to the gas station. On the way there, out of nowhere, a truck pulled over on the side of the road &amp; rolled its window down. Inside the vehicle was my best friend and his dad, who knows my parents very well. I said \"hey uh.. we're just going down to uh-\" then I paused and looked over at them both. My friend said \"Bye infineks\" and then they drove away. I was extremely worried from that, as it was extremely obvious I had been smoking marijuana.\nAfter that I started freaking out quite a bit, and everything in my life was being rapidly evaluated in my head. Why was I doing everything I was doing, for what purpose was I smoking marijuana and skipping class so frequently? Why was I ruining my life?\n\nThat's what it really boiled down to, was that I was ruining my life. I started panicking, and thoughts were bouncing around my head at millions of miles per hour. I can't remember much of what I thought about, but it was insane how much I thought about, and how deep I thought. I'm curious how my brain would look in an MRI during that. Anyways, eventually me and my friend got back from petro and just chilled in an alley, but he soon left to go to next block, I didn't because I was freaking out. I texted my best friend saying he should come share a cigar with me, and I also asked him what his dad said. He said his dad said \"oh was he going to go smoke a joint?\"\n\nWhile I was sitting there alone, I started freaking out. It felt like a snake had wrapped itself around my body, and was trying to crush me because I was panicking so much, and I was constantly thinking what I should do with my life. I was constantly worried about how I could explain what happened to people, as I had thought about essentially everything ever from my perspective at the time. I almost felt enlightened, but in a very wrong way.\n\nI would get lost in thoughts, thinking about thoughts, and eventually I almost got completely lost from reality, unsure of what the original \"thinker\" was, as I was always in thoughts thinking about different thoughts thinking about thoughts, etc, etc, etc. but the most I knew at any given moment during this event, was that I was in an alley, and that I was baked.\n\nBut then my best friend came, and he tried to calm me down a little bit. My friend was always asking to go to class, but I can't remember why he wouldn't, and he'd always be talking to his gf about something. Eventually we went back to the school and I managed to calm down over time.\n\nRight now i'm at home, on my computer, and I don't know what to do. I'm so unbelievably overwhelmed by everything right now, and I don't know why I should be alive, or even bother to remain alive. After whatever happened today it doesn't make sense why I would stay alive in this difficult universe with no reason. I need a reason to live, and right now i'm lost. I also got grounded for skipping class today, but there's no sign that my parents know that I was high or anything today from my friends dad..\n\nI don't know what to do right now, I'm unbelievably overwhelmed, and I have no idea who to talk to. Part of why I'm overwhelmed is that I have so much to say, and so much to explain with everything, that I have no idea how I would ever explain any of it in a million years. Like i'm speechless, I don't know what to say.\nAnyways sorry for the long read, thank you so much if you bothered to read it, sorry if it's insanely boring, but I just need some help.\n\nAlso- My mom just came in, right when I finished writing that pretty much. My english teacher called home about how I skipped first block. My mom went on a huge rant about how I need to try harder at school and everything, as I'm failing english, biology, and German (although im dropping out of german). I just feel dead. I still want to perceive the universe, and have a sentient mind to think about \n\nthings, but I really just want to die right now. I have no idea how to deal with what I've done to myself.\n\nThanks for reading all of this shit, if you did.\"\n\n**Conclusion:** I have no idea why I should continue to live right now. I have no idea how I should kill myself. I really want to continue to live, and I really want to be able to experience all the beauty in life, but this is so overwhelming and I just really can't be alive anymore.. I just need some help right now.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2490ip", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "infineks", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2490ip/i_dont_know_why_i_should_stay_alive_right_now/", "name": "t3_2490ip", "created": 1398772779.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2490ip/i_dont_know_why_i_should_stay_alive_right_now/", "author_flair_text": null, "title": "I don't know why I should stay alive right now", "created_utc": 1398743979.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4upd3", "gilded": 0, "author": "AlwaysTodash", "parent_id": "t3_2490ip", "approved_by": null, "body": "If it's just this experience that's making you want to end it, then I think you might be overreacting. You haven't ruined your life, people make mistakes, it's bound to happen. In a month or two you might not even remember today. I would definitely suggest just waiting this situation out, and see how it ends up. \n\nAnd if there's more stuff on your mind, you're welcome to PM me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s just this experience that&amp;#39;s making you want to end it, then I think you might be overreacting. You haven&amp;#39;t ruined your life, people make mistakes, it&amp;#39;s bound to happen. In a month or two you might not even remember today. I would definitely suggest just waiting this situation out, and see how it ends up. &lt;/p&gt;\n\n&lt;p&gt;And if there&amp;#39;s more stuff on your mind, you&amp;#39;re welcome to PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2490ip", "score_hidden": false, "name": "t1_ch4upd3", "created": 1398755049.0, "author_flair_text": null, "created_utc": 1398751449.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]