[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit r/SuicideWatch. I appreciate you being there.&lt;/p&gt;\n\n&lt;p&gt;I am not fully familiar with SW norms, but I promise that I read the sidebar. I am only writing here because I do not know what to do.&lt;/p&gt;\n\n&lt;p&gt;I have struggled with suicidal thoughts since high school. I&amp;#39;m a few years out of college, but I can&amp;#39;t seem to make it stop. Whenever something goes wrong, my very first thought is to hurt myself. Usually to physically injure myself, or jump from a high place nearby. I feel that way now, though I don&amp;#39;t think I will do it.&lt;/p&gt;\n\n&lt;p&gt;I am always embarrassed about this, because I never actually jump. I feel like things like SuicideWatch are just for &amp;quot;real risk cases&amp;quot; and that I am just a chump for always feeling this way but never doing anything major, like breaking any bones.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t ramble. I just need some help. Is this normal? Do I need to do anything to stop feeling this way? Not to bring this up all of a sudden at the end, but it just seems like I can&amp;#39;t handle the balance between work and life. I stay too late at work, upset the SO, and that alone is enough for me to dream all evening about jumping out a window. Is there anything a guy like me can do to just... Calm down? And hopefully stop this feeling from coming back next time?&lt;/p&gt;\n\n&lt;p&gt;Thank you again. I am sorry for the roundabout, rambling message.&lt;/p&gt;\n\n&lt;p&gt;Edit: Spelling...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi Reddit r/SuicideWatch. I appreciate you being there.\n\nI am not fully familiar with SW norms, but I promise that I read the sidebar. I am only writing here because I do not know what to do.\n\nI have struggled with suicidal thoughts since high school. I'm a few years out of college, but I can't seem to make it stop. Whenever something goes wrong, my very first thought is to hurt myself. Usually to physically injure myself, or jump from a high place nearby. I feel that way now, though I don't think I will do it.\n\nI am always embarrassed about this, because I never actually jump. I feel like things like SuicideWatch are just for \"real risk cases\" and that I am just a chump for always feeling this way but never doing anything major, like breaking any bones.\n\nI won't ramble. I just need some help. Is this normal? Do I need to do anything to stop feeling this way? Not to bring this up all of a sudden at the end, but it just seems like I can't handle the balance between work and life. I stay too late at work, upset the SO, and that alone is enough for me to dream all evening about jumping out a window. Is there anything a guy like me can do to just... Calm down? And hopefully stop this feeling from coming back next time?\n\nThank you again. I am sorry for the roundabout, rambling message.\n\nEdit: Spelling...\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256mw1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "0CaptMyCapt", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/256mw1/i_dont_have_a_plan_but_i_dont_know_what_to_do/", "name": "t3_256mw1", "created": 1399721992.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/256mw1/i_dont_have_a_plan_but_i_dont_know_what_to_do/", "author_flair_text": null, "title": "I don't have a plan, but I don't know what to do.", "created_utc": 1399693192.0, "ups": 4, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che8osi", "gilded": 0, "author": "roast_spud", "parent_id": "t3_256mw1", "approved_by": null, "body": "Hey buddy,\n\nThis is a safe place to talk about those thoughts - it makes no difference how close you might get to doing anything, or whether it's just little whispers in the back of your head.  Some people here have been standing on the rooftop, or sitting in the bath or genuinely on the brink.. Others are barely functioning after years (or decades) of major depression.\n\nI know a little about how it feels to be the 'worker' in a relationship, and having the SO who always wants you home; 'switching off' work as soon as you walk in the door. That's not something I can do, and I have the sense that I would love to just escape from the burden of being the high point of someone's day. (My SO struggle with anxiety and depression, so I am the default optimistic-support-it'll-get-better person). \n\nIn terms of your thought patterns, I wonder do you have anything you do for pleasure?  Like, something that rewards you for the daily grind of existence?  Anything you loved to do as a kid?  For me, going rockclimbing once a week makes me feel free and alive and it's just *mine*. \n\nNormal, not normal.. No such thing.  Only you'll know when the thought to jump becomes an *urge* to jump.  When it scares you because it feels like the best choice you have.  If you're there already, you need to go to the nearest person you trust and say \"I need some HELP\".\n\nHappy to talk some more if you need it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey buddy,&lt;/p&gt;\n\n&lt;p&gt;This is a safe place to talk about those thoughts - it makes no difference how close you might get to doing anything, or whether it&amp;#39;s just little whispers in the back of your head.  Some people here have been standing on the rooftop, or sitting in the bath or genuinely on the brink.. Others are barely functioning after years (or decades) of major depression.&lt;/p&gt;\n\n&lt;p&gt;I know a little about how it feels to be the &amp;#39;worker&amp;#39; in a relationship, and having the SO who always wants you home; &amp;#39;switching off&amp;#39; work as soon as you walk in the door. That&amp;#39;s not something I can do, and I have the sense that I would love to just escape from the burden of being the high point of someone&amp;#39;s day. (My SO struggle with anxiety and depression, so I am the default optimistic-support-it&amp;#39;ll-get-better person). &lt;/p&gt;\n\n&lt;p&gt;In terms of your thought patterns, I wonder do you have anything you do for pleasure?  Like, something that rewards you for the daily grind of existence?  Anything you loved to do as a kid?  For me, going rockclimbing once a week makes me feel free and alive and it&amp;#39;s just &lt;em&gt;mine&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Normal, not normal.. No such thing.  Only you&amp;#39;ll know when the thought to jump becomes an &lt;em&gt;urge&lt;/em&gt; to jump.  When it scares you because it feels like the best choice you have.  If you&amp;#39;re there already, you need to go to the nearest person you trust and say &amp;quot;I need some HELP&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Happy to talk some more if you need it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256mw1", "score_hidden": false, "name": "t1_che8osi", "created": 1399725549.0, "author_flair_text": null, "created_utc": 1399696749.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chh4490", "gilded": 0, "author": "k11111", "parent_id": "t3_256mw1", "approved_by": null, "body": "I also deal with those cyclical, obsessive suicidal thoughts when I become overwhelmed with anxiety or depression. I don't know if it will help you, but something that helped take my mind off of it was something called \"square breathing\". If I began to feel like I was disappointing someone, and that guilt feeling would rush up, I would try sitting somewhere quiet, breathing in for four seconds, holding it for four, letting it out for four seconds, and again holding for four. It was enough for me to center my thoughts and not become overwhelmed. \n\nAgain, I don't know if that will help you, but it certainly helped keep those thoughts at bay, and at least focus on the problem at hand with a little more focus. I hope you feel better, and if you need to every just rant or talk to anyone, you can always PM me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also deal with those cyclical, obsessive suicidal thoughts when I become overwhelmed with anxiety or depression. I don&amp;#39;t know if it will help you, but something that helped take my mind off of it was something called &amp;quot;square breathing&amp;quot;. If I began to feel like I was disappointing someone, and that guilt feeling would rush up, I would try sitting somewhere quiet, breathing in for four seconds, holding it for four, letting it out for four seconds, and again holding for four. It was enough for me to center my thoughts and not become overwhelmed. &lt;/p&gt;\n\n&lt;p&gt;Again, I don&amp;#39;t know if that will help you, but it certainly helped keep those thoughts at bay, and at least focus on the problem at hand with a little more focus. I hope you feel better, and if you need to every just rant or talk to anyone, you can always PM me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256mw1", "score_hidden": false, "name": "t1_chh4490", "created": 1400040693.0, "author_flair_text": null, "created_utc": 1400011893.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]