[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend (used to be girlfriend) has recently been expressing though of suicide to me. She still talks to me as she has an extremely difficult time trusting anyone at all. I&amp;#39;m the one person she feels she can talk to. But more and more frequently her thoughts turn dark as we talk. She has expressed that she feels worthless, unattractive and too average at everything to be worth anyone else&amp;#39;s time. I fight these statements tooth and nail, she is actually very pretty and extremely smart. A lot of these issues stem, at least I beleive from her being adopted. She seems to think that nobody should care for her since her birth parents didn&amp;#39;t, and no matter what I say she will not accept that her friends and parents (including myself) love her and would be devastated without her. I have run out of avenues to explore in attempts to help her. We texted tonight and her thoughts seemed focus on suicide and how she didn&amp;#39;t feel like living. She has reached the point of giving up. I broke her trust and told her parents everything she told me because I feared she may act on it. She needs a psychiatrist  but she is in a state of mind where she won&amp;#39;t get help because her mind wants her in pain. I don&amp;#39;t know what to do to help her, she won&amp;#39;t listen to things I tell her and I&amp;#39;m leaving for the Army at the end of May. I can&amp;#39;t be here to save her or offer help for much longer and I just need advice please :/&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My friend (used to be girlfriend) has recently been expressing though of suicide to me. She still talks to me as she has an extremely difficult time trusting anyone at all. I'm the one person she feels she can talk to. But more and more frequently her thoughts turn dark as we talk. She has expressed that she feels worthless, unattractive and too average at everything to be worth anyone else's time. I fight these statements tooth and nail, she is actually very pretty and extremely smart. A lot of these issues stem, at least I beleive from her being adopted. She seems to think that nobody should care for her since her birth parents didn't, and no matter what I say she will not accept that her friends and parents (including myself) love her and would be devastated without her. I have run out of avenues to explore in attempts to help her. We texted tonight and her thoughts seemed focus on suicide and how she didn't feel like living. She has reached the point of giving up. I broke her trust and told her parents everything she told me because I feared she may act on it. She needs a psychiatrist  but she is in a state of mind where she won't get help because her mind wants her in pain. I don't know what to do to help her, she won't listen to things I tell her and I'm leaving for the Army at the end of May. I can't be here to save her or offer help for much longer and I just need advice please :/", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248ufr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Chompskie", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248ufr/i_dont_know_how_to_help_my_friend/", "name": "t3_248ufr", "created": 1398768565.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248ufr/i_dont_know_how_to_help_my_friend/", "author_flair_text": null, "title": "I don't know how to help my friend", "created_utc": 1398739765.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5cevz", "gilded": 0, "author": "Chompskie", "parent_id": "t1_ch4xdxd", "approved_by": null, "body": "I hope so, she is doing a little better right now but her trust for me is mostly gone. I talked with her parents and I feel much better knowing they are going to try and find her some counseling.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope so, she is doing a little better right now but her trust for me is mostly gone. I talked with her parents and I feel much better knowing they are going to try and find her some counseling.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248ufr", "score_hidden": false, "name": "t1_ch5cevz", "created": 1398807135.0, "author_flair_text": null, "created_utc": 1398803535.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4xdxd", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_248ufr", "approved_by": null, "body": "It sounds like you did the right thing.  You did what you could to get her help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you did the right thing.  You did what you could to get her help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248ufr", "score_hidden": false, "name": "t1_ch4xdxd", "created": 1398769309.0, "author_flair_text": null, "created_utc": 1398765709.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]