[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sit here typing this, knowing that in 24 hours I&amp;#39;m going to kill myself. I don&amp;#39;t really want to die - I don&amp;#39;t believe anyone really wants to die but rather the stress, pain, despair, become just too much. That&amp;#39;s the case for me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried so hard to hold on. I have. I have tried to reach out for help, I have been to the ER two weeks ago for suicidal ideation. I was released. I came home because my college kicked me off campus. I couldn&amp;#39;t take finals because of this. I have been battling my college about my finals, my missed work. I have straight up told them that I know the law regarding the ADA (Americans with Disabilities Act), and reminded them the college officially accepted my illnesses two years ago when I provided documentation. I&amp;#39;ve tried to be strong through this, I have. I cannot keep battling a college that is dismissing my illness, saying that I should have told my professors earlier in the semester. I should have taken a medical leave if I knew this was happening. I did not tell a single soul, I did not post it on the internet, no one knew my true emotions until a week before finals. I went this this past semester missing classes, not getting out of bed for entire days, yet I had everyone fooled. My family didn&amp;#39;t know. My friends didn&amp;#39;t know. I lied to myself, I lied to others. I thought &amp;quot;I can do this...&amp;quot; but I couldn&amp;#39;t. Depression does that to a person, and I tried to fight it so bad but I felt utterly defeated. Does someone honestly expect a depressed suicidal to fight this BS nonsense my college is doing? &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t do it anymore. I have already written my suicide note, I wrote it over a week ago. It&amp;#39;s been sitting, waiting. I&amp;#39;ve considered so many ways to go, so many outs to this miserable life. Yesterday I stood on a bridge, I stood there and stared at the water. I took note of the current, the strength, where the perfect spot to jump would be. I stood and looked, cried a bit, I was so close to jumping - but I knew it wasn&amp;#39;t the time, it was too impulsive, I needed to wait. I walked away.&lt;/p&gt;\n\n&lt;p&gt;I have carefully considered the options, what would likely cause my death. I&amp;#39;ve researched this thoroughly, because if I&amp;#39;m going to do this, I&amp;#39;m actually going to do this. I&amp;#39;m not risking messing it up by some careless mistake. I&amp;#39;ve read through pages upon pages, looked at statistics, everything. So, I&amp;#39;ve collected the required items. It wasn&amp;#39;t that difficult. In 24 hours I hope that finally I can relieve myself from this horrible life.&lt;/p&gt;\n\n&lt;p&gt;I have cried a lot, really a lot these past two weeks. I&amp;#39;ve seen medical professionals. I&amp;#39;ve talked to my family, my friends, my doctors. I&amp;#39;ve told them I wanted to kill myself. I told them this multiple times. I didn&amp;#39;t tip toe around the issue. I flat out said &amp;quot;I want to kill myself&amp;quot; and &amp;quot;I&amp;#39;m suicidal&amp;quot; and further &amp;quot;I have a plan, I have multiple plans&amp;quot;. This isn&amp;#39;t something new, this should be expected. Everyone has known for two weeks now.&lt;/p&gt;\n\n&lt;p&gt;My mind has been torn apart over the years and years. My body has been ripped apart by myself - self harm has created thousands upon thousands of scars all over my body. I&amp;#39;ve messed my organs up from years of starvation, bulimia, previous overdoses, alcohol binges, and prescriptions medications.&lt;/p&gt;\n\n&lt;p&gt;I have heart problems. I have lung problems. My GI system can never be fully healed. My eating disorder has destroyed my stomach and intestines. I developed allergies and intolerances. My intestines don&amp;#39;t work on their own. My esophagus has been torn open from my bulimia, even though I no longer am bulimic, the damage cannot be repaired. My liver has put up with alcohol binges, with chronic prescription meds, and with multiple overdoses that never actually killed me. &lt;/p&gt;\n\n&lt;p&gt;My mind has been through so much emotionally and physically. Multiple head/brain injuries have caused problems that I do not have time to explain. Mental illness has destroyed my life and mind. I&amp;#39;ve been up too high and down too low. I truly believe if anyone else were to have lived my life, well they would have killed themselves years ago. I truly think if anyone I knew popped into my head for a day they would go insane. I don&amp;#39;t know how I&amp;#39;ve held it together for so long.&lt;/p&gt;\n\n&lt;p&gt;I have 24 hours from now - I will die Monday morning. While the biological instinct in my body wants to survive and thus causes a small part of me wanting to survive, to live, it&amp;#39;s likely going to lose. I have 24 hours to figure out if life is truly worth living. If not, I&amp;#39;ll see what death brings. Something? Nothing? It doesn&amp;#39;t matter. I&amp;#39;ll be gone, just dead and gone. I&amp;#39;ve got 24 hours...I think this is the most relieving thing that&amp;#39;s happened in my life. Knowing that I will die is soothing, peaceful, in a sickening way of course. If I can&amp;#39;t find something to live for in 24 hours, I will never find it in a lifetime. Let&amp;#39;s see how this goes.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I sit here typing this, knowing that in 24 hours I'm going to kill myself. I don't really want to die - I don't believe anyone really wants to die but rather the stress, pain, despair, become just too much. That's the case for me.\n\nI've tried so hard to hold on. I have. I have tried to reach out for help, I have been to the ER two weeks ago for suicidal ideation. I was released. I came home because my college kicked me off campus. I couldn't take finals because of this. I have been battling my college about my finals, my missed work. I have straight up told them that I know the law regarding the ADA (Americans with Disabilities Act), and reminded them the college officially accepted my illnesses two years ago when I provided documentation. I've tried to be strong through this, I have. I cannot keep battling a college that is dismissing my illness, saying that I should have told my professors earlier in the semester. I should have taken a medical leave if I knew this was happening. I did not tell a single soul, I did not post it on the internet, no one knew my true emotions until a week before finals. I went this this past semester missing classes, not getting out of bed for entire days, yet I had everyone fooled. My family didn't know. My friends didn't know. I lied to myself, I lied to others. I thought \"I can do this...\" but I couldn't. Depression does that to a person, and I tried to fight it so bad but I felt utterly defeated. Does someone honestly expect a depressed suicidal to fight this BS nonsense my college is doing? \n\nI can't do it anymore. I have already written my suicide note, I wrote it over a week ago. It's been sitting, waiting. I've considered so many ways to go, so many outs to this miserable life. Yesterday I stood on a bridge, I stood there and stared at the water. I took note of the current, the strength, where the perfect spot to jump would be. I stood and looked, cried a bit, I was so close to jumping - but I knew it wasn't the time, it was too impulsive, I needed to wait. I walked away.\n\nI have carefully considered the options, what would likely cause my death. I've researched this thoroughly, because if I'm going to do this, I'm actually going to do this. I'm not risking messing it up by some careless mistake. I've read through pages upon pages, looked at statistics, everything. So, I've collected the required items. It wasn't that difficult. In 24 hours I hope that finally I can relieve myself from this horrible life.\n\nI have cried a lot, really a lot these past two weeks. I've seen medical professionals. I've talked to my family, my friends, my doctors. I've told them I wanted to kill myself. I told them this multiple times. I didn't tip toe around the issue. I flat out said \"I want to kill myself\" and \"I'm suicidal\" and further \"I have a plan, I have multiple plans\". This isn't something new, this should be expected. Everyone has known for two weeks now.\n\nMy mind has been torn apart over the years and years. My body has been ripped apart by myself - self harm has created thousands upon thousands of scars all over my body. I've messed my organs up from years of starvation, bulimia, previous overdoses, alcohol binges, and prescriptions medications.\n\nI have heart problems. I have lung problems. My GI system can never be fully healed. My eating disorder has destroyed my stomach and intestines. I developed allergies and intolerances. My intestines don't work on their own. My esophagus has been torn open from my bulimia, even though I no longer am bulimic, the damage cannot be repaired. My liver has put up with alcohol binges, with chronic prescription meds, and with multiple overdoses that never actually killed me. \n\nMy mind has been through so much emotionally and physically. Multiple head/brain injuries have caused problems that I do not have time to explain. Mental illness has destroyed my life and mind. I've been up too high and down too low. I truly believe if anyone else were to have lived my life, well they would have killed themselves years ago. I truly think if anyone I knew popped into my head for a day they would go insane. I don't know how I've held it together for so long.\n\nI have 24 hours from now - I will die Monday morning. While the biological instinct in my body wants to survive and thus causes a small part of me wanting to survive, to live, it's likely going to lose. I have 24 hours to figure out if life is truly worth living. If not, I'll see what death brings. Something? Nothing? It doesn't matter. I'll be gone, just dead and gone. I've got 24 hours...I think this is the most relieving thing that's happened in my life. Knowing that I will die is soothing, peaceful, in a sickening way of course. If I can't find something to live for in 24 hours, I will never find it in a lifetime. Let's see how this goes.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259ctv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ilostmymindlongago", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259ctv/i_dont_think_i_can_hold_on_much_longer_ive_given/", "name": "t3_259ctv", "created": 1399811291.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259ctv/i_dont_think_i_can_hold_on_much_longer_ive_given/", "author_flair_text": null, "title": "I don't think I can hold on much longer. I've given myself 24 hours to live.", "created_utc": 1399782491.0, "ups": 8, "num_comments": 19, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf01s5", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_chezln5", "approved_by": null, "body": "Many people couldn't begin to understand how a suicidal person is logical or rational. Suicide, after all, seems completely illogical - dying goes against everything both psychological and biological that makes us human.  There's a small group of people that exist for reasons unknown. I think the common perception both in the public and medical field is that anyone who's suicidal can in no way be thinking rationally, or \"competently\". \n\nI also recognize that my suicide would cause pain to those around me, I do. I had friends in high school who killed themselves, impulsively. It hurt me, emotionally. It hurt as I had to listen to my friend talk to me while she was dying, refusing to tell me where she was and having to just listen to her fade. It hurt finding out that another friend killed herself when it was obvious she had a change of heart - she overdosed, collapsed outside in broad daylight trying to seek help but she was dead by the time EMS got to her body. It hurt immensely when yet another friend killed herself and I had to read an email from her family - her sister - about how my friend had a change of heart at the last second but because her door was barricaded she died by the time the fire department broke into her room. I'm no stranger to feeling the pain associated with suicide. While I can never correctly imagine the pain that would result from my suicide, I do know that the pain lessens over time. It's never gone, the person is not forgotten, but over time the tears will slow, the pain will diminish, and the people grieving will move on.\n\nDespite this, despite what I just said, the majority of the population still cannot believe that suicide can be completely logical, thought out, and so forth. Which is quite sad actually. If I were to choose to live and have no plan of how, I would be considered to be thinking logically. Yet because I am choosing to die, even though I have a secure plan, I am not thinking logically.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many people couldn&amp;#39;t begin to understand how a suicidal person is logical or rational. Suicide, after all, seems completely illogical - dying goes against everything both psychological and biological that makes us human.  There&amp;#39;s a small group of people that exist for reasons unknown. I think the common perception both in the public and medical field is that anyone who&amp;#39;s suicidal can in no way be thinking rationally, or &amp;quot;competently&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I also recognize that my suicide would cause pain to those around me, I do. I had friends in high school who killed themselves, impulsively. It hurt me, emotionally. It hurt as I had to listen to my friend talk to me while she was dying, refusing to tell me where she was and having to just listen to her fade. It hurt finding out that another friend killed herself when it was obvious she had a change of heart - she overdosed, collapsed outside in broad daylight trying to seek help but she was dead by the time EMS got to her body. It hurt immensely when yet another friend killed herself and I had to read an email from her family - her sister - about how my friend had a change of heart at the last second but because her door was barricaded she died by the time the fire department broke into her room. I&amp;#39;m no stranger to feeling the pain associated with suicide. While I can never correctly imagine the pain that would result from my suicide, I do know that the pain lessens over time. It&amp;#39;s never gone, the person is not forgotten, but over time the tears will slow, the pain will diminish, and the people grieving will move on.&lt;/p&gt;\n\n&lt;p&gt;Despite this, despite what I just said, the majority of the population still cannot believe that suicide can be completely logical, thought out, and so forth. Which is quite sad actually. If I were to choose to live and have no plan of how, I would be considered to be thinking logically. Yet because I am choosing to die, even though I have a secure plan, I am not thinking logically.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf01s5", "created": 1399815885.0, "author_flair_text": null, "created_utc": 1399787085.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chezln5", "gilded": 0, "author": "[deleted]", "parent_id": "t3_259ctv", "approved_by": null, "body": "I felt the same way in college, multiple times. I dropped out of an Ivy because of it -- to the point where I lived in my single dorm and pissed in bottles -- and took an entire semester's worth of zeroes at another college because I couldn't admit to the administration that I had a problem, let alone fight them over it. I can't imagine how brave you had to be to do that. I didn't have the energy. I didn't have the will.\n\nHell, even today I don't have the energy or the will. Whatever you decide, I respect you, and will try to remember you if I continue on. There are people out there just like you, who know the hows and the whys of painless exit, and are planned and ready for suicide, but are hoping for something to sway their minds, mine included. I won't pretend to know your pain, but I am in pain. In the grand scheme of things, maybe we can reduce the overall pain of the world.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I felt the same way in college, multiple times. I dropped out of an Ivy because of it -- to the point where I lived in my single dorm and pissed in bottles -- and took an entire semester&amp;#39;s worth of zeroes at another college because I couldn&amp;#39;t admit to the administration that I had a problem, let alone fight them over it. I can&amp;#39;t imagine how brave you had to be to do that. I didn&amp;#39;t have the energy. I didn&amp;#39;t have the will.&lt;/p&gt;\n\n&lt;p&gt;Hell, even today I don&amp;#39;t have the energy or the will. Whatever you decide, I respect you, and will try to remember you if I continue on. There are people out there just like you, who know the hows and the whys of painless exit, and are planned and ready for suicide, but are hoping for something to sway their minds, mine included. I won&amp;#39;t pretend to know your pain, but I am in pain. In the grand scheme of things, maybe we can reduce the overall pain of the world.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chezln5", "created": 1399814268.0, "author_flair_text": null, "created_utc": 1399785468.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf4qa4", "gilded": 0, "author": "whisperofstars", "parent_id": "t3_259ctv", "approved_by": null, "body": "Even though the things each one of us go through are not the same magnitude, the feeling of getting overwhelmed to the point we feel like we can not take it anymore is the same. In the past I, myself, wanted to end it. And I am not sure that in the future I will not. Yet until now what has kept me from ending it is the immense wonder I get from sceneries of life. \n\nEver since I was I child, nature has given me thousands of questions to wonder. The unique ways of living of millions of creatures thriving with a strong instinct to live. From micro scale to macro, each living organism is a truly wonderful sight. And when I gaze up in the night sky, marvelous stars are there to see and listen. Those stars have seen the every single generation of mankind who looked up at them and asked themselves what life is and if it is worth living. \n\nYou are not alone, this is the struggle of us, humans. Each bit of life is worth everything. You are worth EVERYTHING.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even though the things each one of us go through are not the same magnitude, the feeling of getting overwhelmed to the point we feel like we can not take it anymore is the same. In the past I, myself, wanted to end it. And I am not sure that in the future I will not. Yet until now what has kept me from ending it is the immense wonder I get from sceneries of life. &lt;/p&gt;\n\n&lt;p&gt;Ever since I was I child, nature has given me thousands of questions to wonder. The unique ways of living of millions of creatures thriving with a strong instinct to live. From micro scale to macro, each living organism is a truly wonderful sight. And when I gaze up in the night sky, marvelous stars are there to see and listen. Those stars have seen the every single generation of mankind who looked up at them and asked themselves what life is and if it is worth living. &lt;/p&gt;\n\n&lt;p&gt;You are not alone, this is the struggle of us, humans. Each bit of life is worth everything. You are worth EVERYTHING.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf4qa4", "created": 1399842162.0, "author_flair_text": null, "created_utc": 1399813362.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_chf1lss", "children": ["chf1p69"], "name": "t1_chf1p69", "id": "chf1p69"}}], "after": null, "before": null}}, "saved": false, "id": "chf1lss", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_chf1ey2", "approved_by": null, "body": "There's no significance as to Monday. I considered Tuesday, as it would have been the day years back when my last overdose was. Five years to the day on Tuesday. I then realized how absolutely cliche that would be, taking my life on the day I decided to begin recovering.\n\nI considered mother's day as well as my family's birthdays. Monday places my death technically after Mother's day as well as avoiding any birthdays or other significant events.\n\nIn terms of why now, at this very time, this very day...well it's not entirely complicated. I have thought about this over the past two weeks. I've denied any impulsive desires to kill myself. I've been arguing with my college to no avail, something which held me back. I'm just at the point of \"I'm done, I am truly and utterly done\". There's only so much I can do, feeling suicidal, and I'm emotionally exhausted. \n\nI've got a plan, I have the means, and I've got a time. I know that fulfills the three important questions that anyone working with suicidal patients asks. I've been through the long lists of questions and assessments. I know what people are looking for, which means I know what to hide or avoid saying to prevent people around me from catching on. \n\nIt really boils down to the point of emotional exhaustion. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no significance as to Monday. I considered Tuesday, as it would have been the day years back when my last overdose was. Five years to the day on Tuesday. I then realized how absolutely cliche that would be, taking my life on the day I decided to begin recovering.&lt;/p&gt;\n\n&lt;p&gt;I considered mother&amp;#39;s day as well as my family&amp;#39;s birthdays. Monday places my death technically after Mother&amp;#39;s day as well as avoiding any birthdays or other significant events.&lt;/p&gt;\n\n&lt;p&gt;In terms of why now, at this very time, this very day...well it&amp;#39;s not entirely complicated. I have thought about this over the past two weeks. I&amp;#39;ve denied any impulsive desires to kill myself. I&amp;#39;ve been arguing with my college to no avail, something which held me back. I&amp;#39;m just at the point of &amp;quot;I&amp;#39;m done, I am truly and utterly done&amp;quot;. There&amp;#39;s only so much I can do, feeling suicidal, and I&amp;#39;m emotionally exhausted. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a plan, I have the means, and I&amp;#39;ve got a time. I know that fulfills the three important questions that anyone working with suicidal patients asks. I&amp;#39;ve been through the long lists of questions and assessments. I know what people are looking for, which means I know what to hide or avoid saying to prevent people around me from catching on. &lt;/p&gt;\n\n&lt;p&gt;It really boils down to the point of emotional exhaustion. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf1lss", "created": 1399822812.0, "author_flair_text": null, "created_utc": 1399794012.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chf1ey2", "gilded": 0, "author": "givingpie", "parent_id": "t1_chf1avj", "approved_by": null, "body": "Why this Monday, though? Why now? Do you really want to taint Mother's Day for your family forever?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why this Monday, though? Why now? Do you really want to taint Mother&amp;#39;s Day for your family forever?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf1ey2", "created": 1399821797.0, "author_flair_text": null, "created_utc": 1399792997.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf1avj", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_chf1255", "approved_by": null, "body": "I think that's a rather surface issue. Of course I know that a part of me is hurt by the lack of my family's response. I also know that this thinking is highly incorrect. If I attempt to see things objectively, I can understand that my family members do notice and validate my suicidal thoughts. I also can understand they have been through so much with me, multiple doctors, medication trials, hospital visits. It's no doubt they're exhausted, physically and emotionally. It's no doubt that I see them as distant even though they are standing next to me. I know they recognize that my words and feelings are the truth, and I think they may know me too well. I have talked about suicide often, for years. Initially anyone's response to \"I'm going to kill myself\" is strong, sound the alarms, red lights flashing, that sort of thing. My family has grown to know that I will often have fleeting thoughts of suicide, and that if I have strong thoughts I will seek help. \n\nThe problem lies in what I said before, if I really want to die I will actually do it. Since I am planning on actually dying Monday morning, I'm not going to go search for help. I will say my good-byes, I will have my final conversations, but they will just be that. Conversations. There will be no cryptic messages that I hope they pick up. I will be subtle but caring as this will be their last memory. Now that I've decided to kill myself Monday morning, unless I somehow find a reason to keep living, I won't be purposefully dropping hints about my death. I want to die, I won't be interrupted or stopped. \n\nPerhaps I am somewhat unique in this aspect. I am hoping for something to change my decision but it won't be because someone is holding me back. This thing that would change me decision would have to be mine alone, I would make the choice to back out. I won't be living just because someone gets the idea to call the police or EMS. While the likelihood of this happening is incredibly low, it won't stop me from killing myself. Hospitalization and even more medication won't cure me. I'll get out having not found the reason or reasons to be alive and will again go about planning to kill myself. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s a rather surface issue. Of course I know that a part of me is hurt by the lack of my family&amp;#39;s response. I also know that this thinking is highly incorrect. If I attempt to see things objectively, I can understand that my family members do notice and validate my suicidal thoughts. I also can understand they have been through so much with me, multiple doctors, medication trials, hospital visits. It&amp;#39;s no doubt they&amp;#39;re exhausted, physically and emotionally. It&amp;#39;s no doubt that I see them as distant even though they are standing next to me. I know they recognize that my words and feelings are the truth, and I think they may know me too well. I have talked about suicide often, for years. Initially anyone&amp;#39;s response to &amp;quot;I&amp;#39;m going to kill myself&amp;quot; is strong, sound the alarms, red lights flashing, that sort of thing. My family has grown to know that I will often have fleeting thoughts of suicide, and that if I have strong thoughts I will seek help. &lt;/p&gt;\n\n&lt;p&gt;The problem lies in what I said before, if I really want to die I will actually do it. Since I am planning on actually dying Monday morning, I&amp;#39;m not going to go search for help. I will say my good-byes, I will have my final conversations, but they will just be that. Conversations. There will be no cryptic messages that I hope they pick up. I will be subtle but caring as this will be their last memory. Now that I&amp;#39;ve decided to kill myself Monday morning, unless I somehow find a reason to keep living, I won&amp;#39;t be purposefully dropping hints about my death. I want to die, I won&amp;#39;t be interrupted or stopped. &lt;/p&gt;\n\n&lt;p&gt;Perhaps I am somewhat unique in this aspect. I am hoping for something to change my decision but it won&amp;#39;t be because someone is holding me back. This thing that would change me decision would have to be mine alone, I would make the choice to back out. I won&amp;#39;t be living just because someone gets the idea to call the police or EMS. While the likelihood of this happening is incredibly low, it won&amp;#39;t stop me from killing myself. Hospitalization and even more medication won&amp;#39;t cure me. I&amp;#39;ll get out having not found the reason or reasons to be alive and will again go about planning to kill myself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf1avj", "created": 1399821215.0, "author_flair_text": null, "created_utc": 1399792415.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf1255", "gilded": 0, "author": "givingpie", "parent_id": "t1_chf0wnm", "approved_by": null, "body": "It sounds like you don't feel like your suicidal thoughts are being validated by your family. Is this how you feel?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you don&amp;#39;t feel like your suicidal thoughts are being validated by your family. Is this how you feel?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf1255", "created": 1399820065.0, "author_flair_text": null, "created_utc": 1399791265.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf0wnm", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_chf0fas", "approved_by": null, "body": "My friends do not know my feelings tonight. Since we met in college, we're spread across many states with varying distances. I've distanced myself from using Facebook and texting. On some level it was intentional, I know full well a few of my friends wouldn't think twice about calling 911 and sound so panicked that I have three different districts of police and EMS outside my house. Another part of me has been taking time to carefully construct what I'm going to say to them tomorrow - I will call them but I won't have them in a panic. \n\nI've told my family multiple times I will kill myself. While they understand that on some level I'm being serious, another level I don't think they quite believe me. Denial I suppose which is only natural. They care and love me deeply, yet my family has been with me through so much that I think their thinking borders on, \"well you haven't killed yourself yet\". That sounds rather crude, there's a better way to put that to words I'm sure. \n\nI have told family and doctors when I've sought help for suicidal feelings, \"If I really wanted to die, I would be dead and not here\". I've expressed that many times to multiple people. It's the truth. If after today I decide to go through and commit suicide, I will just do it. There will be no nonsense \"suicidal gesture\". I have experienced suicidal feelings before. If I want help, I will seek it. I don't have to do a half-way suicide attempt to feel the need to \"deserve\" help. If I want to die, I will die. There's no question.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My friends do not know my feelings tonight. Since we met in college, we&amp;#39;re spread across many states with varying distances. I&amp;#39;ve distanced myself from using Facebook and texting. On some level it was intentional, I know full well a few of my friends wouldn&amp;#39;t think twice about calling 911 and sound so panicked that I have three different districts of police and EMS outside my house. Another part of me has been taking time to carefully construct what I&amp;#39;m going to say to them tomorrow - I will call them but I won&amp;#39;t have them in a panic. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve told my family multiple times I will kill myself. While they understand that on some level I&amp;#39;m being serious, another level I don&amp;#39;t think they quite believe me. Denial I suppose which is only natural. They care and love me deeply, yet my family has been with me through so much that I think their thinking borders on, &amp;quot;well you haven&amp;#39;t killed yourself yet&amp;quot;. That sounds rather crude, there&amp;#39;s a better way to put that to words I&amp;#39;m sure. &lt;/p&gt;\n\n&lt;p&gt;I have told family and doctors when I&amp;#39;ve sought help for suicidal feelings, &amp;quot;If I really wanted to die, I would be dead and not here&amp;quot;. I&amp;#39;ve expressed that many times to multiple people. It&amp;#39;s the truth. If after today I decide to go through and commit suicide, I will just do it. There will be no nonsense &amp;quot;suicidal gesture&amp;quot;. I have experienced suicidal feelings before. If I want help, I will seek it. I don&amp;#39;t have to do a half-way suicide attempt to feel the need to &amp;quot;deserve&amp;quot; help. If I want to die, I will die. There&amp;#39;s no question.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf0wnm", "created": 1399819382.0, "author_flair_text": null, "created_utc": 1399790582.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf0fas", "gilded": 0, "author": "givingpie", "parent_id": "t1_chf0ab8", "approved_by": null, "body": "It saddens me that you're so resolute. I mean, you want to visit the place of your tombstone... I just wish that you decide to stay with us.\n\nTell me about your family and friends. Do they know what's going through your mind tonight?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It saddens me that you&amp;#39;re so resolute. I mean, you want to visit the place of your tombstone... I just wish that you decide to stay with us.&lt;/p&gt;\n\n&lt;p&gt;Tell me about your family and friends. Do they know what&amp;#39;s going through your mind tonight?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf0fas", "created": 1399817355.0, "author_flair_text": null, "created_utc": 1399788555.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf0ab8", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_chezrpt", "approved_by": null, "body": "At the moment I'm on my computer, which is the most obvious point. I'm switching between watching Netflix and Amazon Prime. I will sleep tonight later. I'll wake up and live out my last day. I will clean up all my mess - put away things in order, do my laundry, make sure I leave my personal things easy to be accessed/boxed up/whatever my family decides after my death. I will take a long shower, and finally get dressed in my final outfit. I will go out for the last time during the day. I'll treat myself to frozen yogurt, iced coffee, and my favorite salad at Panera Bread. I'll take a long walk out in the country, breathe in the smells, look at the world in a different way. I hope that I find that certain thing to keep me alive, if not, I'm perfectly okay with dying. I will visit the graveyard where I want a tombstone to be placed for me - even though I want to be cremated and my ashes spread at sea. I will write in my journal multiple times during the day, I'll further think things over. I will probably end up adding to my suicide note, details that I realized should be added during my last day. I'll say my good-byes to friends and family. I'll say my good-byes to my pets. I'll probably talk to my family and friends just to make sure they have a good \"last memory\" of me. If come Monday morning, I still have not found a reason to stay alive, I will then kill myself. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At the moment I&amp;#39;m on my computer, which is the most obvious point. I&amp;#39;m switching between watching Netflix and Amazon Prime. I will sleep tonight later. I&amp;#39;ll wake up and live out my last day. I will clean up all my mess - put away things in order, do my laundry, make sure I leave my personal things easy to be accessed/boxed up/whatever my family decides after my death. I will take a long shower, and finally get dressed in my final outfit. I will go out for the last time during the day. I&amp;#39;ll treat myself to frozen yogurt, iced coffee, and my favorite salad at Panera Bread. I&amp;#39;ll take a long walk out in the country, breathe in the smells, look at the world in a different way. I hope that I find that certain thing to keep me alive, if not, I&amp;#39;m perfectly okay with dying. I will visit the graveyard where I want a tombstone to be placed for me - even though I want to be cremated and my ashes spread at sea. I will write in my journal multiple times during the day, I&amp;#39;ll further think things over. I will probably end up adding to my suicide note, details that I realized should be added during my last day. I&amp;#39;ll say my good-byes to friends and family. I&amp;#39;ll say my good-byes to my pets. I&amp;#39;ll probably talk to my family and friends just to make sure they have a good &amp;quot;last memory&amp;quot; of me. If come Monday morning, I still have not found a reason to stay alive, I will then kill myself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chf0ab8", "created": 1399816798.0, "author_flair_text": null, "created_utc": 1399787998.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chezrpt", "gilded": 0, "author": "givingpie", "parent_id": "t1_chezoxq", "approved_by": null, "body": "Do you have any plans for today? What are you doing right now?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any plans for today? What are you doing right now?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chezrpt", "created": 1399814868.0, "author_flair_text": null, "created_utc": 1399786068.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chezoxq", "gilded": 0, "author": "ilostmymindlongago", "parent_id": "t1_cheziab", "approved_by": null, "body": "Since I'm fully invested in figuring out life/living in my last day, I would be fine with talking. It's doubtful in my mind that talking to anyone would keep me from taking my life but I'm fine with it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since I&amp;#39;m fully invested in figuring out life/living in my last day, I would be fine with talking. It&amp;#39;s doubtful in my mind that talking to anyone would keep me from taking my life but I&amp;#39;m fine with it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chezoxq", "created": 1399814589.0, "author_flair_text": null, "created_utc": 1399785789.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cheziab", "gilded": 0, "author": "givingpie", "parent_id": "t3_259ctv", "approved_by": null, "body": "I'm sorry. I truly am. Your life has been so difficult and you have been through so much. You're right, anyone who went through all that would be in despair.  \n\nDo you want to talk? Just talk. I promise I won't judge you for anything you say.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry. I truly am. Your life has been so difficult and you have been through so much. You&amp;#39;re right, anyone who went through all that would be in despair.  &lt;/p&gt;\n\n&lt;p&gt;Do you want to talk? Just talk. I promise I won&amp;#39;t judge you for anything you say.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_cheziab", "created": 1399813957.0, "author_flair_text": null, "created_utc": 1399785157.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfeej3", "gilded": 0, "author": "ThereGoesMinky", "parent_id": "t3_259ctv", "approved_by": null, "body": "You seem like a very intelligent, logical person. With that in mind, I have come up with some things to consider that might help you to discover your purpose. It may actually be closer than you think...\n\n\nA lot of people tend to think of purpose as some capital P concept that is intangible. Try thinking closer to home. What experiences have you had to endure that others shouldn't have to go through as well? When your suffering and pain gain purpose, you gain purpose.\n\n\nYou talk about all of the scars you have from self harm, the damage from eating disorders and overdoses. There are so many young people who are in the position you were in at those points in your life. Schools and community centers and crises hotlines and therapy groups actively look for people like you to talk to students and adults who have been where you've been so that they have someone to relate to and don't feel alone in the experience. Lasting purpose is usually something that is externalized: it comes from paying your experiences and knowledge forward to help others. Even as you were writing this post, I see that you took the time to try and help someone else who was feeling depressed. That inclination to diminish suffering in others is purpose.\n\n\nI hope that you continue to take your walks and eat your favorite salad and pass on the knowledge you have gained through your experiences. You bring perspectives and insights that validate both your life and the lives of others. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem like a very intelligent, logical person. With that in mind, I have come up with some things to consider that might help you to discover your purpose. It may actually be closer than you think...&lt;/p&gt;\n\n&lt;p&gt;A lot of people tend to think of purpose as some capital P concept that is intangible. Try thinking closer to home. What experiences have you had to endure that others shouldn&amp;#39;t have to go through as well? When your suffering and pain gain purpose, you gain purpose.&lt;/p&gt;\n\n&lt;p&gt;You talk about all of the scars you have from self harm, the damage from eating disorders and overdoses. There are so many young people who are in the position you were in at those points in your life. Schools and community centers and crises hotlines and therapy groups actively look for people like you to talk to students and adults who have been where you&amp;#39;ve been so that they have someone to relate to and don&amp;#39;t feel alone in the experience. Lasting purpose is usually something that is externalized: it comes from paying your experiences and knowledge forward to help others. Even as you were writing this post, I see that you took the time to try and help someone else who was feeling depressed. That inclination to diminish suffering in others is purpose.&lt;/p&gt;\n\n&lt;p&gt;I hope that you continue to take your walks and eat your favorite salad and pass on the knowledge you have gained through your experiences. You bring perspectives and insights that validate both your life and the lives of others. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chfeej3", "created": 1399869401.0, "author_flair_text": null, "created_utc": 1399840601.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfegza", "gilded": 0, "author": "syndreamer", "parent_id": "t3_259ctv", "approved_by": null, "body": "I'm in the same position, but I don't have 24 hrs. I just know that whenever I step away from the world, I'm just going for a long drive, and whatever can change during that drive will either drive me back to the world or off of it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the same position, but I don&amp;#39;t have 24 hrs. I just know that whenever I step away from the world, I&amp;#39;m just going for a long drive, and whatever can change during that drive will either drive me back to the world or off of it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259ctv", "score_hidden": false, "name": "t1_chfegza", "created": 1399869570.0, "author_flair_text": null, "created_utc": 1399840770.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]