[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I don&amp;#39;t really know what to do, but I just cannot find any good reason to stay alive anymore. I&amp;#39;ve never really been able to enjoy life but only in the last few years have I even entertained the idea of killing myself. None of the things that people seem to find meaning in appeal to me, the fact that I was even born seems really unfair to me now that I have to live with society&amp;#39;s options. Every reason people give me to stay alive just seems vague or superficial. I&amp;#39;m probably not being clear but I just wanted to know if anyone&amp;#39;s been in a similar place and what helped them get out of it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I don't really know what to do, but I just cannot find any good reason to stay alive anymore. I've never really been able to enjoy life but only in the last few years have I even entertained the idea of killing myself. None of the things that people seem to find meaning in appeal to me, the fact that I was even born seems really unfair to me now that I have to live with society's options. Every reason people give me to stay alive just seems vague or superficial. I'm probably not being clear but I just wanted to know if anyone's been in a similar place and what helped them get out of it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bmpg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ismashwindows", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24bmpg/i_dont_see_any_point/", "name": "t3_24bmpg", "created": 1398843931.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24bmpg/i_dont_see_any_point/", "author_flair_text": null, "title": "I don't see any point", "created_utc": 1398815131.0, "ups": 5, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5m6wq", "gilded": 0, "author": "hermes369", "parent_id": "t3_24bmpg", "approved_by": null, "body": "I'm ambivalent at best about this \"happiness\" bullshit. I feel like I have a talent for teaching ballet. It doesn't pay the bills and isn't really providing a present or future that I can take to the bank. Overall, though in spite of how low I am a good portion of the time, I feel like I have some purpose. I have good days and bad: today is especially craptacular.\n\nAnyway, I have a daughter so I'm hanging on for her. My feeling on suicide is that it's redundant. We're going to die eventually. The option is available, of course. I would recommend against it. The kinds of people that believe they can maintain some kind of visible happiness all the fucking time are usually selling something. Please stick around; for the conversation if nothing else. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m ambivalent at best about this &amp;quot;happiness&amp;quot; bullshit. I feel like I have a talent for teaching ballet. It doesn&amp;#39;t pay the bills and isn&amp;#39;t really providing a present or future that I can take to the bank. Overall, though in spite of how low I am a good portion of the time, I feel like I have some purpose. I have good days and bad: today is especially craptacular.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I have a daughter so I&amp;#39;m hanging on for her. My feeling on suicide is that it&amp;#39;s redundant. We&amp;#39;re going to die eventually. The option is available, of course. I would recommend against it. The kinds of people that believe they can maintain some kind of visible happiness all the fucking time are usually selling something. Please stick around; for the conversation if nothing else. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bmpg", "score_hidden": false, "name": "t1_ch5m6wq", "created": 1398852538.0, "author_flair_text": null, "created_utc": 1398823738.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5izwn", "gilded": 0, "author": "themaccattack1983", "parent_id": "t3_24bmpg", "approved_by": null, "body": "I'm sorry that you feel this way. Your comment reminds me of an interview that Chris Martin from Coldplay did on BBC Radio 1 only this week. He discussed how he struggled to enjoy the life he had and how it caused him to lose that which he really cared about, because he never really understood how to appreciate it. To hear that from somebody who seemingly has it all, and has spent his career writing about all of these emotions, I found it quite eye-opening to discover that underneath all of this he could still struggle in such a way. So you see, this problem can happen to us all, regardless of our position in life. He claimed that he found a form of relaxation and mediation that helped him become more at ease with himself (which admittedly is not for everyone)\n\nThe key thing to take from that (in my mind anyway) was that it was about coming to terms with himself. Learning to be himself and be happy. Other people's reasons for living don't need to suit you, after all they're not you. One man may get out of bed to work a 60 hour week and enjoy it, another may see that as their own personal hell. What I'm saying is that the your reasons for living will come from what makes you happy. If you are yet to discover those things, then you have a lifetime to do this. \n\nSociety does present certain pathways and 'options' for us, but your life is your own and there are always ways to find happiness within this - no matter how small. If there is something that you think you might enjoy, try it (within reason). Most of us will feel this way to some degree within our lives, it is how we learn to bring the things we love into each day that determines the overall enjoyment that we experience.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry that you feel this way. Your comment reminds me of an interview that Chris Martin from Coldplay did on BBC Radio 1 only this week. He discussed how he struggled to enjoy the life he had and how it caused him to lose that which he really cared about, because he never really understood how to appreciate it. To hear that from somebody who seemingly has it all, and has spent his career writing about all of these emotions, I found it quite eye-opening to discover that underneath all of this he could still struggle in such a way. So you see, this problem can happen to us all, regardless of our position in life. He claimed that he found a form of relaxation and mediation that helped him become more at ease with himself (which admittedly is not for everyone)&lt;/p&gt;\n\n&lt;p&gt;The key thing to take from that (in my mind anyway) was that it was about coming to terms with himself. Learning to be himself and be happy. Other people&amp;#39;s reasons for living don&amp;#39;t need to suit you, after all they&amp;#39;re not you. One man may get out of bed to work a 60 hour week and enjoy it, another may see that as their own personal hell. What I&amp;#39;m saying is that the your reasons for living will come from what makes you happy. If you are yet to discover those things, then you have a lifetime to do this. &lt;/p&gt;\n\n&lt;p&gt;Society does present certain pathways and &amp;#39;options&amp;#39; for us, but your life is your own and there are always ways to find happiness within this - no matter how small. If there is something that you think you might enjoy, try it (within reason). Most of us will feel this way to some degree within our lives, it is how we learn to bring the things we love into each day that determines the overall enjoyment that we experience.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bmpg", "score_hidden": false, "name": "t1_ch5izwn", "created": 1398820748.0, "author_flair_text": null, "created_utc": 1398817148.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5ikfl", "gilded": 0, "author": "Scraps20", "parent_id": "t3_24bmpg", "approved_by": null, "body": "Hey man life is tough tbh but you gotta find a way and there is always a way pm me if you wish", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man life is tough tbh but you gotta find a way and there is always a way pm me if you wish&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bmpg", "score_hidden": false, "name": "t1_ch5ikfl", "created": 1398819810.0, "author_flair_text": null, "created_utc": 1398816210.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]