[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I do not feel that I am suffering or in pain. I am not sure that I even feel depressed or sad, really. I feel exhausted. I feel bored. The idea of being alive for several more decades seems brutal. There are things I think I would like to accomplish, but I have no motivation. I don&amp;#39;t really feel excited about anything, or particularly interested in anything. Everything is a chore. I have thought, for years, of killing myself. I have not done it because I do not want to be an immense burden on everyone who would be impacted by it. I understand that it would torture my family and friends. And yet, carrying on for the sole purpose of not wanting to inconvenience anyone seems impossible. I feel that I need to pack all of my things up first, so that someone else does not have to do it. I would have to plan things out so thoroughly. I would have to lie to my roommates about moving out. I don&amp;#39;t have the energy for all of that. I only have enough energy to drive to a police station or a hospital or something and slit my wrists in my car. It&amp;#39;s a piece of shit car, anyway. Who would take care of my cats, though? I don&amp;#39;t want to see a therapist. I don&amp;#39;t want to take medication. I don&amp;#39;t want to talk to anyone I know about it. I don&amp;#39;t want to fucking do anything. I want to cease to exist. Life is a burden. I know that a lot of people would call me selfish. I know that I have a &amp;quot;good life.&amp;quot; And yet, everything seems meaningless/pointless/fruitless. I feel so fucked. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I do not feel that I am suffering or in pain. I am not sure that I even feel depressed or sad, really. I feel exhausted. I feel bored. The idea of being alive for several more decades seems brutal. There are things I think I would like to accomplish, but I have no motivation. I don't really feel excited about anything, or particularly interested in anything. Everything is a chore. I have thought, for years, of killing myself. I have not done it because I do not want to be an immense burden on everyone who would be impacted by it. I understand that it would torture my family and friends. And yet, carrying on for the sole purpose of not wanting to inconvenience anyone seems impossible. I feel that I need to pack all of my things up first, so that someone else does not have to do it. I would have to plan things out so thoroughly. I would have to lie to my roommates about moving out. I don't have the energy for all of that. I only have enough energy to drive to a police station or a hospital or something and slit my wrists in my car. It's a piece of shit car, anyway. Who would take care of my cats, though? I don't want to see a therapist. I don't want to take medication. I don't want to talk to anyone I know about it. I don't want to fucking do anything. I want to cease to exist. Life is a burden. I know that a lot of people would call me selfish. I know that I have a \"good life.\" And yet, everything seems meaningless/pointless/fruitless. I feel so fucked. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24nzpg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "suicidalapathy", "media": null, "score": 19, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 9, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24nzpg/i_do_not_enjoy_being_alive/", "name": "t3_24nzpg", "created": 1399199070.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24nzpg/i_do_not_enjoy_being_alive/", "author_flair_text": null, "title": "I do not enjoy being alive.", "created_utc": 1399170270.0, "ups": 28, "num_comments": 25, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch97q6n", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch90qk1", "approved_by": null, "body": "I have a bachelor's degree in psychology and worked in a psychologists' office for several years. I do have a psychologist, but I have this problem where, after seeing a therapist several times, I start to develop concerns about what they think of me. I feel less comfortable sharing after I have established a relationship with them. I think the biggest barrier to my seeking help is the feeling of stigmatization, which is ridiculous considering my background. I just feel that I cannot overcome it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a bachelor&amp;#39;s degree in psychology and worked in a psychologists&amp;#39; office for several years. I do have a psychologist, but I have this problem where, after seeing a therapist several times, I start to develop concerns about what they think of me. I feel less comfortable sharing after I have established a relationship with them. I think the biggest barrier to my seeking help is the feeling of stigmatization, which is ridiculous considering my background. I just feel that I cannot overcome it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97q6n", "created": 1399238774.0, "author_flair_text": null, "created_utc": 1399209974.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch90qk1", "gilded": 0, "author": "celesteajax", "parent_id": "t1_ch906ep", "approved_by": null, "body": "Something I learned recently is that while some people are born with a chemical imbalance that predispositions them to have depression as a young adult, others develop the chemical imbalance during childhood. So working with a therapist can be helpful if you're not looking to try medicine. I agree with you that continuing to exist for the sake of others' is no way to live, that's why seeing a therapist might be helpful. You might learn new things about yourself that could make life worth living. Please feel free to PM me.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something I learned recently is that while some people are born with a chemical imbalance that predispositions them to have depression as a young adult, others develop the chemical imbalance during childhood. So working with a therapist can be helpful if you&amp;#39;re not looking to try medicine. I agree with you that continuing to exist for the sake of others&amp;#39; is no way to live, that&amp;#39;s why seeing a therapist might be helpful. You might learn new things about yourself that could make life worth living. Please feel free to PM me.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch90qk1", "created": 1399205018.0, "author_flair_text": null, "created_utc": 1399176218.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch906ep", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch8zvmu", "approved_by": null, "body": "Yeah, the hardest part is the idea that I should continue to exist because, if I do not, it will hurt other people. I am a musician, and as much fun as it can be, it's not worth living for. I am not sure if I feel a lack of purpose because of something mechanically wrong with me as a human, or if it is more extraneous than that. I do not always feel that I want to kill myself, but it is frequent enough. And when I do, it seems inevitable. It seems true.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, the hardest part is the idea that I should continue to exist because, if I do not, it will hurt other people. I am a musician, and as much fun as it can be, it&amp;#39;s not worth living for. I am not sure if I feel a lack of purpose because of something mechanically wrong with me as a human, or if it is more extraneous than that. I do not always feel that I want to kill myself, but it is frequent enough. And when I do, it seems inevitable. It seems true.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch906ep", "created": 1399203407.0, "author_flair_text": null, "created_utc": 1399174607.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch8zvmu", "gilded": 0, "author": "celesteajax", "parent_id": "t3_24nzpg", "approved_by": null, "body": "I'm feeling the same way as you. My psychiatrist keeps telling me to hold onto the idea of how wrecked my mom would be about me killing myself, but she has depression too. I've found music (or any type of creative outlet) really helps, might be worth a shot.  ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m feeling the same way as you. My psychiatrist keeps telling me to hold onto the idea of how wrecked my mom would be about me killing myself, but she has depression too. I&amp;#39;ve found music (or any type of creative outlet) really helps, might be worth a shot.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch8zvmu", "created": 1399202567.0, "author_flair_text": null, "created_utc": 1399173767.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch97qt3", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch91fpn", "approved_by": null, "body": "Oooh. Yes, Moz wrote a lot of words to live by. When I am going through something really tough, I sometimes think about the lyric \"I can laugh about it now, but at the time, it was terrible.\"", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oooh. Yes, Moz wrote a lot of words to live by. When I am going through something really tough, I sometimes think about the lyric &amp;quot;I can laugh about it now, but at the time, it was terrible.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97qt3", "created": 1399238849.0, "author_flair_text": null, "created_utc": 1399210049.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch91fpn", "gilded": 0, "author": "Foobymaster", "parent_id": "t3_24nzpg", "approved_by": null, "body": "I am feeling the same way. I don't exactly want to die though. To quote Morrissey, \"I think about life and I think about death and neither one particularly appeals to me\" I really like this quote because I don't want to be alive but I don't want to die at all.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am feeling the same way. I don&amp;#39;t exactly want to die though. To quote Morrissey, &amp;quot;I think about life and I think about death and neither one particularly appeals to me&amp;quot; I really like this quote because I don&amp;#39;t want to be alive but I don&amp;#39;t want to die at all.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch91fpn", "created": 1399207160.0, "author_flair_text": null, "created_utc": 1399178360.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9dzbc", "gilded": 0, "author": "larsinblack", "parent_id": "t1_ch97rzu", "approved_by": null, "body": "I think that's more related to if you believe in reincarnation. Or if you believe in death being eternal blackness (a ceasing of existence), if the pain (or mental anguish from the boredom) is greater than the fear or that eternal blackness.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s more related to if you believe in reincarnation. Or if you believe in death being eternal blackness (a ceasing of existence), if the pain (or mental anguish from the boredom) is greater than the fear or that eternal blackness.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9dzbc", "created": 1399256333.0, "author_flair_text": null, "created_utc": 1399227533.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch97rzu", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch9425i", "approved_by": null, "body": "Right?! One of the many reasons I don't want to take anti-depressants is because I think I'd be one of those people who starts feeling motivated enough to actually do it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right?! One of the many reasons I don&amp;#39;t want to take anti-depressants is because I think I&amp;#39;d be one of those people who starts feeling motivated enough to actually do it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97rzu", "created": 1399238996.0, "author_flair_text": null, "created_utc": 1399210196.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9425i", "gilded": 0, "author": "kait516", "parent_id": "t3_24nzpg", "approved_by": null, "body": "I feel the same way. I just wish someone would make the decision for me so I wouldn't have to organize killing myself which feels like a chore.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same way. I just wish someone would make the decision for me so I wouldn&amp;#39;t have to organize killing myself which feels like a chore.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9425i", "created": 1399216824.0, "author_flair_text": null, "created_utc": 1399188024.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9imss", "gilded": 0, "author": "YOUARE_GREAT", "parent_id": "t3_24nzpg", "approved_by": null, "body": "This seems like it could be more of a physical or chemical problem than a philosophical one. This is a small example, but when I don't eat for a while, I feel less motivated and don't feel like doing anything. Then I eat and feel some motivation to do things or find new things to do. I surprise myself because what I thought was a lack of motivation was actually a lack of food energy. Maybe there's a physical or chemical imbalance in your body that's causing you to feel this way?\n\nIt seems like if you had more energy, you'd be more \"normal.\"", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems like it could be more of a physical or chemical problem than a philosophical one. This is a small example, but when I don&amp;#39;t eat for a while, I feel less motivated and don&amp;#39;t feel like doing anything. Then I eat and feel some motivation to do things or find new things to do. I surprise myself because what I thought was a lack of motivation was actually a lack of food energy. Maybe there&amp;#39;s a physical or chemical imbalance in your body that&amp;#39;s causing you to feel this way?&lt;/p&gt;\n\n&lt;p&gt;It seems like if you had more energy, you&amp;#39;d be more &amp;quot;normal.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9imss", "created": 1399266603.0, "author_flair_text": null, "created_utc": 1399237803.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9dgvi", "gilded": 0, "author": "larsinblack", "parent_id": "t1_ch97ug2", "approved_by": null, "body": "&gt; I mean, who ISN'T depressed?\n\nMany people are depressed, but most aren't willing to kill themselves over it. The presence of frequent suicidal thought and serious suicidal planning is where it is a full-blown debilitating mental illness.\n\nWhat really sticks out of your post is this:\n\n&gt; I feel exhausted. I feel bored. [...] There are things I think I would like to accomplish, but I have no motivation. [...] Everything is a chore.\n\nThe major depressive symptoms, beside suicidal thought, are: 1) lack of energy, 2) lack of motivation, and 3) not feeling pleasure from activities [...that used to be pleasurable]. This is because the parts of your brain related to those functions have trouble working properly. If you look at a depressive brain in a P.E.T. scan, you'll see these areas are dark, so not receiving enough blood flow or activity. It becomes impossible for someone with depression to perform like a regular person, resulting in devastating consequences to job, family life, relationships with friends.\n\nAre you taking medication? If so, have you recently stopped taking it on a regular basis (or stopped altogether)?\n\n It could be that you may need a stronger dosage, or that the specific medication is not for you and you should try a new one. But I would go see your psychiatrist right away, tell them it's an emergency (because it is). And if you can't see one without a wait, go to the E.R. and tell them your medication isn't working and you're having suicidal thought.", "edited": 1399227508.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I mean, who ISN&amp;#39;T depressed?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Many people are depressed, but most aren&amp;#39;t willing to kill themselves over it. The presence of frequent suicidal thought and serious suicidal planning is where it is a full-blown debilitating mental illness.&lt;/p&gt;\n\n&lt;p&gt;What really sticks out of your post is this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel exhausted. I feel bored. [...] There are things I think I would like to accomplish, but I have no motivation. [...] Everything is a chore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The major depressive symptoms, beside suicidal thought, are: 1) lack of energy, 2) lack of motivation, and 3) not feeling pleasure from activities [...that used to be pleasurable]. This is because the parts of your brain related to those functions have trouble working properly. If you look at a depressive brain in a P.E.T. scan, you&amp;#39;ll see these areas are dark, so not receiving enough blood flow or activity. It becomes impossible for someone with depression to perform like a regular person, resulting in devastating consequences to job, family life, relationships with friends.&lt;/p&gt;\n\n&lt;p&gt;Are you taking medication? If so, have you recently stopped taking it on a regular basis (or stopped altogether)?&lt;/p&gt;\n\n&lt;p&gt;It could be that you may need a stronger dosage, or that the specific medication is not for you and you should try a new one. But I would go see your psychiatrist right away, tell them it&amp;#39;s an emergency (because it is). And if you can&amp;#39;t see one without a wait, go to the E.R. and tell them your medication isn&amp;#39;t working and you&amp;#39;re having suicidal thought.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9dgvi", "created": 1399255114.0, "author_flair_text": null, "created_utc": 1399226314.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch97ug2", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch91vzd", "approved_by": null, "body": "I am college-educated and have a full-time job. I live in a nice apartment in a nice town with nice people. I have been diagnosed with depression and have seen a therapist on and off for the past year. I have a bachelor's degree in psychology and worked in a psychologists' office for several years, and I really don't feel good about paying someone to listen to me. \n\nI think you are right. I think I am in denial about my depression, because I do not always feel SAD, you know? It seems funny to think of depression as a mental illness. It seems similar to thinking of marijuana as a drug. I mean, who ISN'T depressed? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am college-educated and have a full-time job. I live in a nice apartment in a nice town with nice people. I have been diagnosed with depression and have seen a therapist on and off for the past year. I have a bachelor&amp;#39;s degree in psychology and worked in a psychologists&amp;#39; office for several years, and I really don&amp;#39;t feel good about paying someone to listen to me. &lt;/p&gt;\n\n&lt;p&gt;I think you are right. I think I am in denial about my depression, because I do not always feel SAD, you know? It seems funny to think of depression as a mental illness. It seems similar to thinking of marijuana as a drug. I mean, who ISN&amp;#39;T depressed? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97ug2", "created": 1399239289.0, "author_flair_text": null, "created_utc": 1399210489.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch91vzd", "gilded": 0, "author": "larsinblack", "parent_id": "t3_24nzpg", "approved_by": null, "body": "I don't know if your intention is pure, because I think at one point or another, what you're saying is coming from a place of wishing to exit the rat race (aka. money related). Are you a student, working, or unemployed right now? And what is your living arrangement? \n\nBecause from what I gather, you're exhibiting signs of a mental illness (being depression). The truth being that many people have the same outlook on life as you do, but they do not wish death upon themselves. Because even doing the little things like having a meal, or talking to a friend, give them enough pleasure to live for another day. \n\nBut depression, which is a mental illness, takes away your ability to feel pleasure from those activities that used to give you happiness. And so although it may look like what you really want is to cease being here, the more accurate representation could be that your brain is suffering from so much stress/anxiety that you can no longer cope being in your body. The good news about the later one is that once you recognize that you're having difficulty coping, you can take action to start to decrease the stress/anxiety, so that you begin to feel pleasure in your day activities again.\n\nBut depression goes hand in hand with stress. And a core focus for healing from depression is learning to cope with the stress, allocate more time for yourself and activities that make you happy, to do more things that you want and like, and to learn tools that will help you cope with stressful situations, so you can receive more pleasure from life.\n\nAttending a depression therapy group might be an option for you, because you will see ideas and topics come up that make a lot of sense. But from the umbrella of being under that depression, it's hard to see those options clearly, the options that are available for you to start feeling better. It's hard to understand a mental illness looking at it from the inside, and at times it could be very beneficial to get someone else's perspective on the matter.", "edited": 1399180001.0, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if your intention is pure, because I think at one point or another, what you&amp;#39;re saying is coming from a place of wishing to exit the rat race (aka. money related). Are you a student, working, or unemployed right now? And what is your living arrangement? &lt;/p&gt;\n\n&lt;p&gt;Because from what I gather, you&amp;#39;re exhibiting signs of a mental illness (being depression). The truth being that many people have the same outlook on life as you do, but they do not wish death upon themselves. Because even doing the little things like having a meal, or talking to a friend, give them enough pleasure to live for another day. &lt;/p&gt;\n\n&lt;p&gt;But depression, which is a mental illness, takes away your ability to feel pleasure from those activities that used to give you happiness. And so although it may look like what you really want is to cease being here, the more accurate representation could be that your brain is suffering from so much stress/anxiety that you can no longer cope being in your body. The good news about the later one is that once you recognize that you&amp;#39;re having difficulty coping, you can take action to start to decrease the stress/anxiety, so that you begin to feel pleasure in your day activities again.&lt;/p&gt;\n\n&lt;p&gt;But depression goes hand in hand with stress. And a core focus for healing from depression is learning to cope with the stress, allocate more time for yourself and activities that make you happy, to do more things that you want and like, and to learn tools that will help you cope with stressful situations, so you can receive more pleasure from life.&lt;/p&gt;\n\n&lt;p&gt;Attending a depression therapy group might be an option for you, because you will see ideas and topics come up that make a lot of sense. But from the umbrella of being under that depression, it&amp;#39;s hard to see those options clearly, the options that are available for you to start feeling better. It&amp;#39;s hard to understand a mental illness looking at it from the inside, and at times it could be very beneficial to get someone else&amp;#39;s perspective on the matter.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch91vzd", "created": 1399208577.0, "author_flair_text": null, "created_utc": 1399179777.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch97rhg", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch95z5k", "approved_by": null, "body": "No no, a lot of things interest me. I do a lot of things. I keep very busy, but I lack purpose. I like doing a lot of the things I do, but I still don't want to be alive just to do them. I am starting to think I am in denial about my depression. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No no, a lot of things interest me. I do a lot of things. I keep very busy, but I lack purpose. I like doing a lot of the things I do, but I still don&amp;#39;t want to be alive just to do them. I am starting to think I am in denial about my depression. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97rhg", "created": 1399238931.0, "author_flair_text": null, "created_utc": 1399210131.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch95z5k", "gilded": 0, "author": "MistressPanzer", "parent_id": "t1_ch8yzvc", "approved_by": null, "body": "Man I feel you. I really really am feeling you. I am in the same place, although perhaps for different reasons. Does nothing interest you at all?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man I feel you. I really really am feeling you. I am in the same place, although perhaps for different reasons. Does nothing interest you at all?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch95z5k", "created": 1399228794.0, "author_flair_text": null, "created_utc": 1399199994.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9cj9r", "gilded": 0, "author": "stacywolf", "parent_id": "t1_ch9c5u6", "approved_by": null, "body": "Yeah it's kind of what I usually think but then it really depends on the situation of each person so I don't judge or think it is selfish to kill yourself. It's cool to know that there is someone who shares my opinion", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s kind of what I usually think but then it really depends on the situation of each person so I don&amp;#39;t judge or think it is selfish to kill yourself. It&amp;#39;s cool to know that there is someone who shares my opinion&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9cj9r", "created": 1399252936.0, "author_flair_text": null, "created_utc": 1399224136.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9c5u6", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch9bmln", "approved_by": null, "body": "Yeah, I am starting to feel like life is not meant to be fun, but hey, I don't have anything better to do. I mean, is dying really better? It's so hard to say, because death is so uncertain. It seems fair to wait it out, at least. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I am starting to feel like life is not meant to be fun, but hey, I don&amp;#39;t have anything better to do. I mean, is dying really better? It&amp;#39;s so hard to say, because death is so uncertain. It seems fair to wait it out, at least. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9c5u6", "created": 1399252046.0, "author_flair_text": null, "created_utc": 1399223246.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9bmln", "gilded": 0, "author": "stacywolf", "parent_id": "t1_ch9bdg5", "approved_by": null, "body": "I just went all about suicide and ways of suicide with a fried today, and believe me she also was pretty surprised and bummed out although I think she managed pretty well to hide her natural reaction, she just talked to me in a very calm way like that was the most regular subject ever... I think she just doesn't know if I am serious about a possible suicide or something so she tried to act normal...But yeah, most people freak out about stuff like that... I don't anymore... It must be weird to say this but I am really open minded about the whole life/death thing and I don't think that saying \"oh no life is beautiful and amazing, and no one should destroy it\" is actually correct... Just my opinion", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just went all about suicide and ways of suicide with a fried today, and believe me she also was pretty surprised and bummed out although I think she managed pretty well to hide her natural reaction, she just talked to me in a very calm way like that was the most regular subject ever... I think she just doesn&amp;#39;t know if I am serious about a possible suicide or something so she tried to act normal...But yeah, most people freak out about stuff like that... I don&amp;#39;t anymore... It must be weird to say this but I am really open minded about the whole life/death thing and I don&amp;#39;t think that saying &amp;quot;oh no life is beautiful and amazing, and no one should destroy it&amp;quot; is actually correct... Just my opinion&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9bmln", "created": 1399250756.0, "author_flair_text": null, "created_utc": 1399221956.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9bdg5", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch9bbgg", "approved_by": null, "body": "Yeah, I totally get that. I'm afraid to let people in my life know how I really think. My roommate was just talking about how she doesn't like her job and feels like her life is mediocre, and I went on an existential rant about how most people will have mediocre lives and that life isn't meant to be fulfilling, etc. and she was pretty bummed out and surprised by what I said, I think. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I totally get that. I&amp;#39;m afraid to let people in my life know how I really think. My roommate was just talking about how she doesn&amp;#39;t like her job and feels like her life is mediocre, and I went on an existential rant about how most people will have mediocre lives and that life isn&amp;#39;t meant to be fulfilling, etc. and she was pretty bummed out and surprised by what I said, I think. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9bdg5", "created": 1399250117.0, "author_flair_text": null, "created_utc": 1399221317.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9bbgg", "gilded": 0, "author": "stacywolf", "parent_id": "t1_ch97p7i", "approved_by": null, "body": "yeah, sometimes doesn't really matter if it is helpful what the other one has to say, when I told this to a friend of mine the other day, also told her my perspective about life and death and the meaning, she kind of stopped and freaked out, asked me if I smoked or if I was drunk... She never thought that I would say such things but yeah, I just kind of replied to you because I understood that we kind of were experiencing the same so... :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, sometimes doesn&amp;#39;t really matter if it is helpful what the other one has to say, when I told this to a friend of mine the other day, also told her my perspective about life and death and the meaning, she kind of stopped and freaked out, asked me if I smoked or if I was drunk... She never thought that I would say such things but yeah, I just kind of replied to you because I understood that we kind of were experiencing the same so... :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch9bbgg", "created": 1399249975.0, "author_flair_text": null, "created_utc": 1399221175.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch97p7i", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch95v11", "approved_by": null, "body": "Yeah, I read your other post and realized we're on the same page, but felt like I didn't have anything meaningful to contribute to your post so I didn't comment. I'm glad you reached out to me. ", "edited": 1399210549.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I read your other post and realized we&amp;#39;re on the same page, but felt like I didn&amp;#39;t have anything meaningful to contribute to your post so I didn&amp;#39;t comment. I&amp;#39;m glad you reached out to me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch97p7i", "created": 1399238656.0, "author_flair_text": null, "created_utc": 1399209856.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch95v11", "gilded": 0, "author": "stacywolf", "parent_id": "t1_ch8yzvc", "approved_by": null, "body": "Hey, I kind of know how you feel, and at this point the only thing taht is keeping me alive is because I am worried with what will happened to my mother and also if I don't actually have a successful death and end up crippled, which is maybe even worse and another weight for my mother.\nI also don't find anything really that worth to live for. I try sleeping as much as I can just not to be \"awake\" but even that isn't working anymore...\nSorry if I didn't comment anything that would be cheerful or positive and didn't say to keep going, I just kind of decided to talk to you to see if there is anyone who feels like me about life and what it will be for each person... Because the future is kind of predictable! Don't lecture me about crap like dreams and goals.\nKeep in touch ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I kind of know how you feel, and at this point the only thing taht is keeping me alive is because I am worried with what will happened to my mother and also if I don&amp;#39;t actually have a successful death and end up crippled, which is maybe even worse and another weight for my mother.\nI also don&amp;#39;t find anything really that worth to live for. I try sleeping as much as I can just not to be &amp;quot;awake&amp;quot; but even that isn&amp;#39;t working anymore...\nSorry if I didn&amp;#39;t comment anything that would be cheerful or positive and didn&amp;#39;t say to keep going, I just kind of decided to talk to you to see if there is anyone who feels like me about life and what it will be for each person... Because the future is kind of predictable! Don&amp;#39;t lecture me about crap like dreams and goals.\nKeep in touch &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch95v11", "created": 1399227962.0, "author_flair_text": null, "created_utc": 1399199162.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch8yzvc", "gilded": 0, "author": "suicidalapathy", "parent_id": "t1_ch8yvz2", "approved_by": null, "body": "Yes, but are those things to live for? I appreciate your comment. I don't think that a shower or a nap are going to save my life. I feel sort of obligated to live, do you know what I mean? It isn't enough. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, but are those things to live for? I appreciate your comment. I don&amp;#39;t think that a shower or a nap are going to save my life. I feel sort of obligated to live, do you know what I mean? It isn&amp;#39;t enough. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch8yzvc", "created": 1399200130.0, "author_flair_text": null, "created_utc": 1399171330.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "saved": false, "id": "ch8yvz2", "gilded": 0, "author": "sunflower0123", "parent_id": "t3_24nzpg", "approved_by": null, "body": "I'm sorry you are feeling this way. Here's a hug. *hug*\n\nWhat do you enjoy doing? I personally love taking a hot shower or a nice nap. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you are feeling this way. Here&amp;#39;s a hug. &lt;em&gt;hug&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;What do you enjoy doing? I personally love taking a hot shower or a nice nap. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nzpg", "score_hidden": false, "name": "t1_ch8yvz2", "created": 1399199832.0, "author_flair_text": null, "created_utc": 1399171032.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]