[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m planning on killing myself on my birthday this year.(July 6) I don&amp;#39;t want to die and I deff don&amp;#39;t want to kill myself but I&amp;#39;ve realized it would be selfish of me to continue. I&amp;#39;ve known I should do it since thanksgiving. Now I think suicide is as wrong and pointless as the next guy, but there&amp;#39;s times when it&amp;#39;s warranted and there&amp;#39;s no doubt in my mind that my suicide will be warranted.&lt;/p&gt;\n\n&lt;p&gt;I have this rare type of chronic pain that causes injuries to never heal and turn into horrible nerve damage and pain. It&amp;#39;s called RSD(reflex sympathetic dystrophy) or more common CRPS(chronic regional pain syndrome). It causes horrible burning, hot, tingly pain that I describe as feeling like your arm got torched with fire until all the skin is off, than putting salt, vinegar and ice into the wound. The spot where the pain is also gets extremely sensitive to the touch which makes the pain even worse. Even rubbing a feather over it or my sheets running across it while sleeping will cause so much pain I end up crying. Imagine not being able to hug your SO or nieces and nephew or cat or whatever is special to you because if the person touches you in that spot you end up in excruciating pain. There&amp;#39;s a thing called the McGill pain scale, it&amp;#39;s basically a scale of rating pain that was started at McGill university. Guess which is at top and considered the worst. RSD is known for causing pain that makes you commit suicide because of how horrible it is. A few months ago a girl I had met through a RSD support group killed herself because she couldn&amp;#39;t live with it any more. Unfortunately there is no cure for RSD, it can go into remission but always has a chance of coming back. I got it when I was 13, I&amp;#39;m 21 now and during this time I&amp;#39;ve only been in remission once for about 8 months before it came back. &lt;/p&gt;\n\n&lt;p&gt;Because of the RSD I have to take pain medicine, I took the medicine for years so it started not working(my body built up a tolerance) and I ended up not able to get out of bed because the pain was so bad. My doctor eventually prescribed me fentanyl patches, which I&amp;#39;ve heard has a horrible withdraw so I&amp;#39;m afraid if I go into remission how I&amp;#39;m going to get off of it and how bad it&amp;#39;s going to be. At this point in time I&amp;#39;m living off of my parents and husband because I can&amp;#39;t work with this pain. I&amp;#39;m holding my husband back from his full potential, not only could he get a wife that doesn&amp;#39;t have a disability but one that also didn&amp;#39;t keep him from reaching his full potential. I can see they&amp;#39;re getting frustrated with me and that they would be happier if I wasn&amp;#39;t here.&lt;/p&gt;\n\n&lt;p&gt;I chose to wait till my birthday because as of now the two things that keep my depression from worsening are my husband and my nieces and nephew; my brother and his wife are expecting a baby that will be born in June. I would like to meet her and get to spend some time with her being happy before I have to go. Also waiting a few months to do it gives me time to get things figured out before I do it like where to do it so nobody finds me, how to do, I&amp;#39;ll be able to give most of my things to charity and enjoy some time with my loved ones before I do it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried talking about this with my husband two or three times but he either ignores me or says &amp;quot;you better not&amp;quot; and that&amp;#39;s it. I&amp;#39;m not sure if he thinks I&amp;#39;m trying to get attention or he is more fed up with disease than I thought and also realizes this is the best option. I looked into the dying with dignity foundation but you need 15k to do it so I guess 50 dollars on dime nitrous will have to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm planning on killing myself on my birthday this year.(July 6) I don't want to die and I deff don't want to kill myself but I've realized it would be selfish of me to continue. I've known I should do it since thanksgiving. Now I think suicide is as wrong and pointless as the next guy, but there's times when it's warranted and there's no doubt in my mind that my suicide will be warranted.\n\nI have this rare type of chronic pain that causes injuries to never heal and turn into horrible nerve damage and pain. It's called RSD(reflex sympathetic dystrophy) or more common CRPS(chronic regional pain syndrome). It causes horrible burning, hot, tingly pain that I describe as feeling like your arm got torched with fire until all the skin is off, than putting salt, vinegar and ice into the wound. The spot where the pain is also gets extremely sensitive to the touch which makes the pain even worse. Even rubbing a feather over it or my sheets running across it while sleeping will cause so much pain I end up crying. Imagine not being able to hug your SO or nieces and nephew or cat or whatever is special to you because if the person touches you in that spot you end up in excruciating pain. There's a thing called the McGill pain scale, it's basically a scale of rating pain that was started at McGill university. Guess which is at top and considered the worst. RSD is known for causing pain that makes you commit suicide because of how horrible it is. A few months ago a girl I had met through a RSD support group killed herself because she couldn't live with it any more. Unfortunately there is no cure for RSD, it can go into remission but always has a chance of coming back. I got it when I was 13, I'm 21 now and during this time I've only been in remission once for about 8 months before it came back. \n\nBecause of the RSD I have to take pain medicine, I took the medicine for years so it started not working(my body built up a tolerance) and I ended up not able to get out of bed because the pain was so bad. My doctor eventually prescribed me fentanyl patches, which I've heard has a horrible withdraw so I'm afraid if I go into remission how I'm going to get off of it and how bad it's going to be. At this point in time I'm living off of my parents and husband because I can't work with this pain. I'm holding my husband back from his full potential, not only could he get a wife that doesn't have a disability but one that also didn't keep him from reaching his full potential. I can see they're getting frustrated with me and that they would be happier if I wasn't here.\n\nI chose to wait till my birthday because as of now the two things that keep my depression from worsening are my husband and my nieces and nephew; my brother and his wife are expecting a baby that will be born in June. I would like to meet her and get to spend some time with her being happy before I have to go. Also waiting a few months to do it gives me time to get things figured out before I do it like where to do it so nobody finds me, how to do, I'll be able to give most of my things to charity and enjoy some time with my loved ones before I do it.\n\nI've tried talking about this with my husband two or three times but he either ignores me or says \"you better not\" and that's it. I'm not sure if he thinks I'm trying to get attention or he is more fed up with disease than I thought and also realizes this is the best option. I looked into the dying with dignity foundation but you need 15k to do it so I guess 50 dollars on dime nitrous will have to do.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2498q3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "RSDsuicide", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2498q3/i_dont_want_to_do_it_but_i_know_i_have_to/", "name": "t3_2498q3", "created": 1398779637.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2498q3/i_dont_want_to_do_it_but_i_know_i_have_to/", "author_flair_text": null, "title": "I don't want to do it but I know I have to.", "created_utc": 1398750837.0, "ups": 4, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4v8ib", "gilded": 0, "author": "TH0RSDEMON", "parent_id": "t3_2498q3", "approved_by": null, "body": "Maybe he cares, or dosent know how to handle the situation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe he cares, or dosent know how to handle the situation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2498q3", "score_hidden": false, "name": "t1_ch4v8ib", "created": 1398757202.0, "author_flair_text": null, "created_utc": 1398753602.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4z80z", "gilded": 0, "author": "Unicorn-Princess", "parent_id": "t3_2498q3", "approved_by": null, "body": "I'm so sorry this is happening to you.  Having not experienced this condition myself, I can only imagine the torture you must be going through, and which I could just give you a hug and make it all better.  Unfortunately i can;t but I can offer a sympathetic ear.  I understand how much your husbands response sucks to hear having heard a similar thing myself from a significant other before.  I suspect he's just scared, in denial and doesn't know how to cope with what you're saying but that doesn't make his response any better for you.  I don't know what I can say to change your mind or make things better for you, and for that, I am truly sorry.  I wish I could.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry this is happening to you.  Having not experienced this condition myself, I can only imagine the torture you must be going through, and which I could just give you a hug and make it all better.  Unfortunately i can;t but I can offer a sympathetic ear.  I understand how much your husbands response sucks to hear having heard a similar thing myself from a significant other before.  I suspect he&amp;#39;s just scared, in denial and doesn&amp;#39;t know how to cope with what you&amp;#39;re saying but that doesn&amp;#39;t make his response any better for you.  I don&amp;#39;t know what I can say to change your mind or make things better for you, and for that, I am truly sorry.  I wish I could.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2498q3", "score_hidden": false, "name": "t1_ch4z80z", "created": 1398803695.0, "author_flair_text": null, "created_utc": 1398774895.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]