[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really know where to start. I guess you could say I&amp;#39;m just sad. I&amp;#39;m sad and feel like I&amp;#39;m dead and that nothing matters so I may as well be dead anyway. Sometimes, I&amp;#39;ll have just an amazing day. Nothing will go wrong, and that&amp;#39;s enough for me to be happy and forget that everything is bullshit. I&amp;#39;ll have a day like that and then I&amp;#39;ll come home and be content, and then something small will happen and I&amp;#39;ll be sad again. I&amp;#39;ll be taking out the trash and then when I can&amp;#39;t find a garbage bag to put in the can I just start crying and losing it and I end up just sitting and staring at the fridge, with no idea what to think or any idea where to go. I&amp;#39;ll sulk off to some room and sink down into myself as I sit on the floor and feel the carpet, and I&amp;#39;ll be there for hours because i just can&amp;#39;t will myself to get up. Any time I&amp;#39;m not sad it&amp;#39;ll be because I&amp;#39;m counting. I count constantly in my head and try to make the numbers make sense because nothing else seems to make sense nowadays. I&amp;#39;ll count from the time I wake up and just not stop until I lay down to sleep that night. Around 27,000 is where I usually stop and if I don&amp;#39;t get something close to that then I get mad. I don&amp;#39;t know why, I know it doesn&amp;#39;t make sense but I just do. Sometimes, throughout the day, I&amp;#39;ll stop my continuous sequential counting and just do something else. I&amp;#39;ll count the number of words on a page. I&amp;#39;ll see the room numbers in my school and try to make them work. \n(I see 2311, I think 2x3=6, 1+1=2, 6-2=4, and there are 4 digits in the number, so it&amp;#39;s fine. Then I see 2203 and I can&amp;#39;t make it work. I can&amp;#39;t and it makes me mad and I&amp;#39;ll stop and stare at it in the hall or crouch down and cry because I can&amp;#39;t get the stupid fucking number to make any sense and it&amp;#39;s all stupid and I end up running away and being upset.)\nAnd the nightmares. Oh, boy the nightmares. They&amp;#39;re usually fine if I count. That&amp;#39;s part of the reason I do it. It&amp;#39;s because if I don&amp;#39;t do it then the nightmares will be back and I&amp;#39;ll get even less sleep than I normally do. I&amp;#39;ve recently (about the past two weeks) started wetting the bed because of them and some nights I just won&amp;#39;t sleep. I don&amp;#39;t want to see my nightmares again. I don&amp;#39;t want to see my shameful face in the mirror as I look down and see my pants are soaked. Some nights, I would rather die than sleep, and so I stay up. And read, or eat, or exercise, or count or just sit or anything. I&amp;#39;ll go two or three days without sleeping because I&amp;#39;m too big of a fucking puss to just lie down. I hate myself. I don&amp;#39;t cry all the time though. Sometimes I get mad. Throw things, hit things, cut myself, whatever I can to get any of it out. I have 12 really deep cuts on my shoulder and every time I see them I feel angry and sad for myself, then make more, then stop the bleeding and feel a helluva lot better. \nSuicide crossed my mind before, but not until now have I thought about it every day. At least 5 or 6 times a day I&amp;#39;ll be sitting, and walk over to the kitchen knives, stare at them and just think. Almost wish. Or I&amp;#39;ll be on the second floor of my school and lean over the balcony (about 60 feet up) and almost leap over. There were two times where I really came close to doing the latter, but once I was stopped by one of my friends saying hey and then me walking to class with them, and the other time the only thing stopping me was the thought that a bunch of assholes would probably end up looking at me after I was dead and taking pictures or some shit. I don&amp;#39;t want that. Or maybe I do? I don&amp;#39;t know. I didn&amp;#39;t jump.\nI don&amp;#39;t know what to do. I want to be normal. I want to have fun. I want to want to live.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't really know where to start. I guess you could say I'm just sad. I'm sad and feel like I'm dead and that nothing matters so I may as well be dead anyway. Sometimes, I'll have just an amazing day. Nothing will go wrong, and that's enough for me to be happy and forget that everything is bullshit. I'll have a day like that and then I'll come home and be content, and then something small will happen and I'll be sad again. I'll be taking out the trash and then when I can't find a garbage bag to put in the can I just start crying and losing it and I end up just sitting and staring at the fridge, with no idea what to think or any idea where to go. I'll sulk off to some room and sink down into myself as I sit on the floor and feel the carpet, and I'll be there for hours because i just can't will myself to get up. Any time I'm not sad it'll be because I'm counting. I count constantly in my head and try to make the numbers make sense because nothing else seems to make sense nowadays. I'll count from the time I wake up and just not stop until I lay down to sleep that night. Around 27,000 is where I usually stop and if I don't get something close to that then I get mad. I don't know why, I know it doesn't make sense but I just do. Sometimes, throughout the day, I'll stop my continuous sequential counting and just do something else. I'll count the number of words on a page. I'll see the room numbers in my school and try to make them work. \n(I see 2311, I think 2x3=6, 1+1=2, 6-2=4, and there are 4 digits in the number, so it's fine. Then I see 2203 and I can't make it work. I can't and it makes me mad and I'll stop and stare at it in the hall or crouch down and cry because I can't get the stupid fucking number to make any sense and it's all stupid and I end up running away and being upset.)\nAnd the nightmares. Oh, boy the nightmares. They're usually fine if I count. That's part of the reason I do it. It's because if I don't do it then the nightmares will be back and I'll get even less sleep than I normally do. I've recently (about the past two weeks) started wetting the bed because of them and some nights I just won't sleep. I don't want to see my nightmares again. I don't want to see my shameful face in the mirror as I look down and see my pants are soaked. Some nights, I would rather die than sleep, and so I stay up. And read, or eat, or exercise, or count or just sit or anything. I'll go two or three days without sleeping because I'm too big of a fucking puss to just lie down. I hate myself. I don't cry all the time though. Sometimes I get mad. Throw things, hit things, cut myself, whatever I can to get any of it out. I have 12 really deep cuts on my shoulder and every time I see them I feel angry and sad for myself, then make more, then stop the bleeding and feel a helluva lot better. \nSuicide crossed my mind before, but not until now have I thought about it every day. At least 5 or 6 times a day I'll be sitting, and walk over to the kitchen knives, stare at them and just think. Almost wish. Or I'll be on the second floor of my school and lean over the balcony (about 60 feet up) and almost leap over. There were two times where I really came close to doing the latter, but once I was stopped by one of my friends saying hey and then me walking to class with them, and the other time the only thing stopping me was the thought that a bunch of assholes would probably end up looking at me after I was dead and taking pictures or some shit. I don't want that. Or maybe I do? I don't know. I didn't jump.\nI don't know what to do. I want to be normal. I want to have fun. I want to want to live.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248xug", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "suicidalthrowaway435", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248xug/i_dont_know_whats_wrong_with_me/", "name": "t3_248xug", "created": 1398770893.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248xug/i_dont_know_whats_wrong_with_me/", "author_flair_text": null, "title": "I don't know what's wrong with me.", "created_utc": 1398742093.0, "ups": 8, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4ys8e", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_248xug", "approved_by": null, "body": "Hi Suicidalthrowaway, nice to meet you.\n\nAs you said, there are days that are amazing and days that aren't. This is life. There is nothing you can do to change that, really. There are days you'll never forget, and days you'll wish to forget.\n\nI wonder, did you talk to anyone about this habit you have with the numbers? You should ask a doctor. \n\nAnd your nightmares. Nightmares are just what they are. Nightmares. You don't have to care about them, and you don't have to be scared. I've got some tips for you, I hope they could help you.\nWhen you awake from a nightmare, start writing them on a diary, or whatever, and do this constantly.\n\n[More about why this later]\n\nWhen I was young (9-10-11-12-13-14 years old) I suffered of nightmares. Each day, I would be dreaming myself watching my house getting violated by thugs, that right after entering my house would harm my parents.\n\nI started to get seriously worried about these dreams. I mean, it is ok to have nightmares for a person, but it is not okay to have them every day.\n\nSo basically, I started to write a diary of all these nightmares, and take notes of some patterns that happened in my dreams. For example, I would take note of a scenery changing, or something weird going, like the day becoming night and so on. \n\nDoing this day by day, made me able to recognize the fact that I was dreaming. In fact, I do not have the ability to shape my dreams constantly, but I do have the ability to know that if something bad is going to happen there will be two things happening:\n\n- my subconscious will just protract the idea that I'm safe inside the enviroment, and will shape it to be \"safe\" (for example, one thing that happened to me was that I dreamed an armada of monsters coming to me - and I was with a friend that told me he had no more ammo - I said him - do not worry, that's my dream, I can do whatever I want inside there - and changed his weapon and gave him so much ammo - but yes, I was not lucid while I was doing that. I mean, I've had a lucid dream only one time, the other times, like this one, dreams are just semi-lucid)\n\n- Know that if something bad is going to happen, you can just wake up. I will feel a strange \"weight\" on my head when there is something bad that is going to happen in my dream, so I will just wake up. I would feel like this \"weight\" is just my counscious part alerting me that there is something bad that is going to happen. And I just wake up. &gt; this is something related to the fact that I'm basically aware of my surroundings, and that's why I told you to write that diary. \n\nA third thing, an ability I seem to be having that I think everyone out there can develop, is that when I go to sleep, I know perfectly the moment when my mind is losing conscience, and I see images of stuff basically projecting themselves in front of my eyes. It is hard to explain, but in this initial stage, I usually experience and see disturbing faces and so on. I will just wake up, and start closing my eyes again and starting to sleep again. It will take a bit, but I won't be concerned anymore about these \"horror\" faces.\n\nFor your suicidal thoughts, just know one thing: out there, there will be always someone willing to help you. Start talking with someone of what you feel. I promise you, your burden will be alleviated.", "edited": 1398773394.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi Suicidalthrowaway, nice to meet you.&lt;/p&gt;\n\n&lt;p&gt;As you said, there are days that are amazing and days that aren&amp;#39;t. This is life. There is nothing you can do to change that, really. There are days you&amp;#39;ll never forget, and days you&amp;#39;ll wish to forget.&lt;/p&gt;\n\n&lt;p&gt;I wonder, did you talk to anyone about this habit you have with the numbers? You should ask a doctor. &lt;/p&gt;\n\n&lt;p&gt;And your nightmares. Nightmares are just what they are. Nightmares. You don&amp;#39;t have to care about them, and you don&amp;#39;t have to be scared. I&amp;#39;ve got some tips for you, I hope they could help you.\nWhen you awake from a nightmare, start writing them on a diary, or whatever, and do this constantly.&lt;/p&gt;\n\n&lt;p&gt;[More about why this later]&lt;/p&gt;\n\n&lt;p&gt;When I was young (9-10-11-12-13-14 years old) I suffered of nightmares. Each day, I would be dreaming myself watching my house getting violated by thugs, that right after entering my house would harm my parents.&lt;/p&gt;\n\n&lt;p&gt;I started to get seriously worried about these dreams. I mean, it is ok to have nightmares for a person, but it is not okay to have them every day.&lt;/p&gt;\n\n&lt;p&gt;So basically, I started to write a diary of all these nightmares, and take notes of some patterns that happened in my dreams. For example, I would take note of a scenery changing, or something weird going, like the day becoming night and so on. &lt;/p&gt;\n\n&lt;p&gt;Doing this day by day, made me able to recognize the fact that I was dreaming. In fact, I do not have the ability to shape my dreams constantly, but I do have the ability to know that if something bad is going to happen there will be two things happening:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;my subconscious will just protract the idea that I&amp;#39;m safe inside the enviroment, and will shape it to be &amp;quot;safe&amp;quot; (for example, one thing that happened to me was that I dreamed an armada of monsters coming to me - and I was with a friend that told me he had no more ammo - I said him - do not worry, that&amp;#39;s my dream, I can do whatever I want inside there - and changed his weapon and gave him so much ammo - but yes, I was not lucid while I was doing that. I mean, I&amp;#39;ve had a lucid dream only one time, the other times, like this one, dreams are just semi-lucid)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Know that if something bad is going to happen, you can just wake up. I will feel a strange &amp;quot;weight&amp;quot; on my head when there is something bad that is going to happen in my dream, so I will just wake up. I would feel like this &amp;quot;weight&amp;quot; is just my counscious part alerting me that there is something bad that is going to happen. And I just wake up. &amp;gt; this is something related to the fact that I&amp;#39;m basically aware of my surroundings, and that&amp;#39;s why I told you to write that diary. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;A third thing, an ability I seem to be having that I think everyone out there can develop, is that when I go to sleep, I know perfectly the moment when my mind is losing conscience, and I see images of stuff basically projecting themselves in front of my eyes. It is hard to explain, but in this initial stage, I usually experience and see disturbing faces and so on. I will just wake up, and start closing my eyes again and starting to sleep again. It will take a bit, but I won&amp;#39;t be concerned anymore about these &amp;quot;horror&amp;quot; faces.&lt;/p&gt;\n\n&lt;p&gt;For your suicidal thoughts, just know one thing: out there, there will be always someone willing to help you. Start talking with someone of what you feel. I promise you, your burden will be alleviated.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248xug", "score_hidden": false, "name": "t1_ch4ys8e", "created": 1398776795.0, "author_flair_text": null, "created_utc": 1398773195.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]