[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to ever offend anyone in this post. I&amp;#39;m sorry if the title was offensive or caused an emotion to any of you. I love every human being I&amp;#39;ve ever met up to this point and respect every single one of your opinions. I just wanted a small disclaimer before typing this.&lt;/p&gt;\n\n&lt;p&gt;I am 17, male, a dropout, possibly autistic, and would be considered spoiled beyond belief online. I have no motivation to do anything because I have something wrong with my brain. Before I type my next sentence you&amp;#39;re probably thinking I&amp;#39;m just faking it or not even trying. I have auras often that require me to go brain dead just to avoid having a seizure afterwards. See, now your opinion has probably changed because I have real symptoms of something more severe. Now you&amp;#39;re probably thinking I&amp;#39;m a dramatic teen for complaining about problems that you may have had that were worse and I&amp;#39;m trying to make you feel guilty for that. I never would want someone to feel that way in my life. I&amp;#39;m not trying to prove anything to anyone, I just want my brain to function like it did when I was growing up. When I was a kid I was maybe the  smartest in school for math and puzzles, now I failed out my final year with single digit grades. My parents hate how I&amp;#39;m turning out, saying that I used to be so smart and how I&amp;#39;ve become a spoiled brat because I can&amp;#39;t finish school that they paid for (private schooling for 3 years). I never want them to feel this way, I don&amp;#39;t want them to waste money at all. I don&amp;#39;t want to fail and I want to pass. They already had a daughter with multiple medical conditions and now they rely on their son to somehow make up for that even though he&amp;#39;s suffering the same thing. They&amp;#39;re mad that they have to pay tons of money to even live in this area and on our medical bills. They&amp;#39;re good people turned bad from.unlucky circumstances. They had a policy of never hitting us, they didn&amp;#39;t have a policy of yelling at us constantly and making sure my sister gets made fun of by her own brother. I thank God himself that she turned out OK.  I&amp;#39;m a pacifist, don&amp;#39;t believe in any sort of punishment (I believe in trying to bring someone back into society like the Nordic system of imprisonment), I am weak, unattractive, have a stupid voice (which can be funny at times don&amp;#39;t get me wrong), and the only thing I&amp;#39;m somewhat skilled at is fixing and building computers which some of my friends are beyond better at doing. I can&amp;#39;t get mad ever, I only feel happiness, sadness, full on depression, and loneliness. I am a furry who has weird fetishes so I fall into a stereotype. I am asexual but only because it&amp;#39;s the closest thing I have to an orientation. I love writing rap and songs but horrible at singing and nearly all instruments except drums (which I&amp;#39;m barely average at). I live in the richest county in the country and have never had to deal with crime or get beaten up at school. I was bullied but it didn&amp;#39;t really affect me as I eventually made friends with most of them (if they weren&amp;#39;t doing it to mess with me behind my back, either way it was for my better). Most people online would call me spoiled or wish my parents would have spanked me so I wouldn&amp;#39;t turn out like this but it wouldn&amp;#39;t work. I swear that it&amp;#39;s a mental condition but  whatever I say I&amp;#39;m gonna get put down for it. This post is all over the place and I&amp;#39;m sorry about that, I just want someone I&amp;#39;ve never met to understand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't want to ever offend anyone in this post. I'm sorry if the title was offensive or caused an emotion to any of you. I love every human being I've ever met up to this point and respect every single one of your opinions. I just wanted a small disclaimer before typing this.\n\n\nI am 17, male, a dropout, possibly autistic, and would be considered spoiled beyond belief online. I have no motivation to do anything because I have something wrong with my brain. Before I type my next sentence you're probably thinking I'm just faking it or not even trying. I have auras often that require me to go brain dead just to avoid having a seizure afterwards. See, now your opinion has probably changed because I have real symptoms of something more severe. Now you're probably thinking I'm a dramatic teen for complaining about problems that you may have had that were worse and I'm trying to make you feel guilty for that. I never would want someone to feel that way in my life. I'm not trying to prove anything to anyone, I just want my brain to function like it did when I was growing up. When I was a kid I was maybe the  smartest in school for math and puzzles, now I failed out my final year with single digit grades. My parents hate how I'm turning out, saying that I used to be so smart and how I've become a spoiled brat because I can't finish school that they paid for (private schooling for 3 years). I never want them to feel this way, I don't want them to waste money at all. I don't want to fail and I want to pass. They already had a daughter with multiple medical conditions and now they rely on their son to somehow make up for that even though he's suffering the same thing. They're mad that they have to pay tons of money to even live in this area and on our medical bills. They're good people turned bad from.unlucky circumstances. They had a policy of never hitting us, they didn't have a policy of yelling at us constantly and making sure my sister gets made fun of by her own brother. I thank God himself that she turned out OK.  I'm a pacifist, don't believe in any sort of punishment (I believe in trying to bring someone back into society like the Nordic system of imprisonment), I am weak, unattractive, have a stupid voice (which can be funny at times don't get me wrong), and the only thing I'm somewhat skilled at is fixing and building computers which some of my friends are beyond better at doing. I can't get mad ever, I only feel happiness, sadness, full on depression, and loneliness. I am a furry who has weird fetishes so I fall into a stereotype. I am asexual but only because it's the closest thing I have to an orientation. I love writing rap and songs but horrible at singing and nearly all instruments except drums (which I'm barely average at). I live in the richest county in the country and have never had to deal with crime or get beaten up at school. I was bullied but it didn't really affect me as I eventually made friends with most of them (if they weren't doing it to mess with me behind my back, either way it was for my better). Most people online would call me spoiled or wish my parents would have spanked me so I wouldn't turn out like this but it wouldn't work. I swear that it's a mental condition but  whatever I say I'm gonna get put down for it. This post is all over the place and I'm sorry about that, I just want someone I've never met to understand.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ny3r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ny3r/i_dont_want_to_live_in_a_world_where_tough_love/", "name": "t3_24ny3r", "created": 1399197730.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ny3r/i_dont_want_to_live_in_a_world_where_tough_love/", "author_flair_text": null, "title": "I don't want to live in a world where tough love is accepted. You can believe it, I just can", "created_utc": 1399168930.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9plrc", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch946w3", "approved_by": null, "body": "You understood perfectly. Just thanks for being someone that truly does understand. I'm gonna try to sleep now, just wait until tomorrow", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You understood perfectly. Just thanks for being someone that truly does understand. I&amp;#39;m gonna try to sleep now, just wait until tomorrow&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ny3r", "score_hidden": false, "name": "t1_ch9plrc", "created": 1399283179.0, "author_flair_text": null, "created_utc": 1399254379.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch946w3", "gilded": 0, "author": "_oreo", "parent_id": "t3_24ny3r", "approved_by": null, "body": "Hey there. I get where you're coming from. There are a ton of people in this world who think they can tell others how they feel, and how they should respond to the feelings they have. I'm sure you've heard people say stuff to you like, \"Just deal with it\" and other stuff like that, but the reality is that it's never that easy. \n\nWe are all born with some disposition, some worse than others. There are no levels of wealth or privilege that separate happiness from sadness. The wealthiest man in the world can be as sad as the poorest one, that's for sure. \n\nIt's alright that some people are better than you at stuff you do, that's how everything is. You don't have to be the best at anything, you've only gotta be as good as you want to be. I'm sure you feel bored sometimes by your lack of motivation, and that you get a lot of your lonely and unhappy feelings during those times where it seems like there is nothing in life worth doing. \n\nBut understand that you shouldn't have to do anything you don't want to in your life, and don't let anyone tell you otherwise. You should also look to figure out the stuff that you wanna do with yourself. Life is an opportunity, not a burden. It's not selfish to regard all of the time in your life as \"you time\" if you see fit. That's the whole point of life, is to seek pleasure for yourself. You don't have to feel like you should live up to other people's standards if you know they are garbage.\n\nSorry if this didn't really get to the point of your post, I'm just giving what I can. I hope it helps. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there. I get where you&amp;#39;re coming from. There are a ton of people in this world who think they can tell others how they feel, and how they should respond to the feelings they have. I&amp;#39;m sure you&amp;#39;ve heard people say stuff to you like, &amp;quot;Just deal with it&amp;quot; and other stuff like that, but the reality is that it&amp;#39;s never that easy. &lt;/p&gt;\n\n&lt;p&gt;We are all born with some disposition, some worse than others. There are no levels of wealth or privilege that separate happiness from sadness. The wealthiest man in the world can be as sad as the poorest one, that&amp;#39;s for sure. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s alright that some people are better than you at stuff you do, that&amp;#39;s how everything is. You don&amp;#39;t have to be the best at anything, you&amp;#39;ve only gotta be as good as you want to be. I&amp;#39;m sure you feel bored sometimes by your lack of motivation, and that you get a lot of your lonely and unhappy feelings during those times where it seems like there is nothing in life worth doing. &lt;/p&gt;\n\n&lt;p&gt;But understand that you shouldn&amp;#39;t have to do anything you don&amp;#39;t want to in your life, and don&amp;#39;t let anyone tell you otherwise. You should also look to figure out the stuff that you wanna do with yourself. Life is an opportunity, not a burden. It&amp;#39;s not selfish to regard all of the time in your life as &amp;quot;you time&amp;quot; if you see fit. That&amp;#39;s the whole point of life, is to seek pleasure for yourself. You don&amp;#39;t have to feel like you should live up to other people&amp;#39;s standards if you know they are garbage.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this didn&amp;#39;t really get to the point of your post, I&amp;#39;m just giving what I can. I hope it helps. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ny3r", "score_hidden": false, "name": "t1_ch946w3", "created": 1399192263.0, "author_flair_text": null, "created_utc": 1399188663.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9vwej", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24ny3r", "approved_by": null, "body": "Just to close, I have been helped at least for tonight. Just seeing this account is currently reminding me of last night and I'm at least trying to forget that. I'm not dead ATM, just need delete this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to close, I have been helped at least for tonight. Just seeing this account is currently reminding me of last night and I&amp;#39;m at least trying to forget that. I&amp;#39;m not dead ATM, just need delete this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ny3r", "score_hidden": false, "name": "t1_ch9vwej", "created": 1399300900.0, "author_flair_text": null, "created_utc": 1399272100.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]