[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve dealt with many people pretending to like me/me being socially awkward and close friends leaving me, usually after years, with no explanation. I&amp;#39;m not one of those people that goes &amp;quot;I banged her boyfriend but it&amp;#39;s no big deal!&amp;quot; I mean, I honestly don&amp;#39;t know why they disappeared. I am really a kind person who would do anything for anyone but no longer to the point of being a pushover. &lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m a pretty tough person and just kept falling off the horse and getting back up. Oh, that sucked, but I&amp;#39;ll make new friends. But I&amp;#39;m almost 29 and I&amp;#39;m just exhausted from it and am no longer able to trust anyone because it happens way more often than not. I&amp;#39;m also wary of the few people who are in my life because I&amp;#39;m afraid they&amp;#39;ll disappear too.&lt;/p&gt;\n\n&lt;p&gt;I moved hours away (by plane) from my family, thinking I&amp;#39;d have a new start and would be happier. That did not happen. I made friends but they turned out to be assholes that I do not want to associate with. So I feel lonely but I&amp;#39;m too afraid to trust again to make more friends. It&amp;#39;s a conundrum.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also had depression, anxiety, and obsessive compulsive disorder for many years. I&amp;#39;ve been on enough pills to choke a horse and gag a maggot and yeah they work for a bit but the shit always comes back. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have the job that I want and that I worked hard for for years. I&amp;#39;m applying for it but I don&amp;#39;t know if it&amp;#39;ll work. I&amp;#39;ve been applying for years. &lt;/p&gt;\n\n&lt;p&gt;If I&amp;#39;ve had bad luck with friends, I&amp;#39;ve had worse luck with relationships. Again, it&amp;#39;s a conundrum because I really couldn&amp;#39;t trust an SO but I know I want children and part of me has always wanted an SO.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been to so many social workers/psychiatrists/psychologists and none have been too helpful. I can&amp;#39;t talk to anyone in my life about this stuff because a) I basically have no friends and b) I don&amp;#39;t want to freak my family out.&lt;/p&gt;\n\n&lt;p&gt;So basically I feel like at 28 years old, I&amp;#39;ve experienced good stuff but I just can&amp;#39;t deal with the bad anymore. I know people say things will get better and yes they may but they never stay that way for long and is a life living alone with no friends and family very far away really the way to live? Seems depressing as hell to me. And I can&amp;#39;t move back to where my family is because the cold winter depresses me further. And I don&amp;#39;t want to move in general at the moment because I keep state-hopping and just don&amp;#39;t know where I want to go and it&amp;#39;s costing a lot of money to do so, which I don&amp;#39;t have much of.&lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;ve always felt dumb, but I feel even dumber than usual lately like I can&amp;#39;t do anything right or remember what I need to or understand things.&lt;/p&gt;\n\n&lt;p&gt;So I don&amp;#39;t know if anyone can relate to any part of that but I figured I&amp;#39;d try. Thank you for reading this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've dealt with many people pretending to like me/me being socially awkward and close friends leaving me, usually after years, with no explanation. I'm not one of those people that goes \"I banged her boyfriend but it's no big deal!\" I mean, I honestly don't know why they disappeared. I am really a kind person who would do anything for anyone but no longer to the point of being a pushover. \n\nSo I'm a pretty tough person and just kept falling off the horse and getting back up. Oh, that sucked, but I'll make new friends. But I'm almost 29 and I'm just exhausted from it and am no longer able to trust anyone because it happens way more often than not. I'm also wary of the few people who are in my life because I'm afraid they'll disappear too.\n\nI moved hours away (by plane) from my family, thinking I'd have a new start and would be happier. That did not happen. I made friends but they turned out to be assholes that I do not want to associate with. So I feel lonely but I'm too afraid to trust again to make more friends. It's a conundrum.\n\nI've also had depression, anxiety, and obsessive compulsive disorder for many years. I've been on enough pills to choke a horse and gag a maggot and yeah they work for a bit but the shit always comes back. \n\nI don't have the job that I want and that I worked hard for for years. I'm applying for it but I don't know if it'll work. I've been applying for years. \n\nIf I've had bad luck with friends, I've had worse luck with relationships. Again, it's a conundrum because I really couldn't trust an SO but I know I want children and part of me has always wanted an SO.\n\nI've been to so many social workers/psychiatrists/psychologists and none have been too helpful. I can't talk to anyone in my life about this stuff because a) I basically have no friends and b) I don't want to freak my family out.\n\nSo basically I feel like at 28 years old, I've experienced good stuff but I just can't deal with the bad anymore. I know people say things will get better and yes they may but they never stay that way for long and is a life living alone with no friends and family very far away really the way to live? Seems depressing as hell to me. And I can't move back to where my family is because the cold winter depresses me further. And I don't want to move in general at the moment because I keep state-hopping and just don't know where I want to go and it's costing a lot of money to do so, which I don't have much of.\n\nAlso, I've always felt dumb, but I feel even dumber than usual lately like I can't do anything right or remember what I need to or understand things.\n\nSo I don't know if anyone can relate to any part of that but I figured I'd try. Thank you for reading this.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242w1a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayyallzes", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242w1a/i_dont_have_the_balls_to_kill_myself_but_i_dont/", "name": "t3_242w1a", "created": 1398598553.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242w1a/i_dont_have_the_balls_to_kill_myself_but_i_dont/", "author_flair_text": null, "title": "I don't have the balls to kill myself but I don't want to be alive either, if that makes any sense.", "created_utc": 1398569753.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch321le", "gilded": 0, "author": "BN91", "parent_id": "t3_242w1a", "approved_by": null, "body": "sounds like your stuck in a rut. your having a low in your life. and the saying that things get better is very cliche and id hate to hear that shit. but people say it for a reason. its usually true. as for your trust issue, id say not every person you meet can be bad, right? you can not judge every new person you meet based the negative people you have known in your past. Also, dont kill yourself. dont ever let that be an option. we all die eventually there is no need to rush it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sounds like your stuck in a rut. your having a low in your life. and the saying that things get better is very cliche and id hate to hear that shit. but people say it for a reason. its usually true. as for your trust issue, id say not every person you meet can be bad, right? you can not judge every new person you meet based the negative people you have known in your past. Also, dont kill yourself. dont ever let that be an option. we all die eventually there is no need to rush it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w1a", "score_hidden": false, "name": "t1_ch321le", "created": 1398573788.0, "author_flair_text": null, "created_utc": 1398570188.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]