[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t motivate myself. I always end up failing things even though I shouldn&amp;#39;t. People are always telling me how smart I am, but all the intelligence in the world couldn&amp;#39;t help me figure my life out. I keep looking for something that I love, a reason to get up in the morning, a realistic possible future for myself beyond my nonexistant current self, but no matter what everything bores me after a while. I can&amp;#39;t just do the same thing over and over again or I&amp;#39;ll go crazy. I&amp;#39;m graduating at the end of the month, and come next month my mother is making me go to a tech school to get a degree in computer science like she has, but I don&amp;#39;t know if I want to do that. She&amp;#39;s not giving me a choice though. It&amp;#39;s do as she says or move out of the house, which I&amp;#39;m in no position to do. I just want to find something that makes me happy, but I&amp;#39;m starting to doubt I can. What&amp;#39;s worse is that I oftentimes fantasize about hurting people, like stabbing or burning them, although I never actually have. It&amp;#39;s not directed towards anyone, I just imagine things like how nice a knife would feel cutting into someone&amp;#39;s skin. I feel like I&amp;#39;m sick. Just a miserable, sick bastard. I feel like someday soon I&amp;#39;m going to end up hurting either myself or someone else. My closest friend just got engaged, so I don&amp;#39;t want to do anything before the wedding for her sake. Afterwards, though, I&amp;#39;m either ending it all or running. I need some help, advice. If this doesn&amp;#39;t get better, then why bother? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't motivate myself. I always end up failing things even though I shouldn't. People are always telling me how smart I am, but all the intelligence in the world couldn't help me figure my life out. I keep looking for something that I love, a reason to get up in the morning, a realistic possible future for myself beyond my nonexistant current self, but no matter what everything bores me after a while. I can't just do the same thing over and over again or I'll go crazy. I'm graduating at the end of the month, and come next month my mother is making me go to a tech school to get a degree in computer science like she has, but I don't know if I want to do that. She's not giving me a choice though. It's do as she says or move out of the house, which I'm in no position to do. I just want to find something that makes me happy, but I'm starting to doubt I can. What's worse is that I oftentimes fantasize about hurting people, like stabbing or burning them, although I never actually have. It's not directed towards anyone, I just imagine things like how nice a knife would feel cutting into someone's skin. I feel like I'm sick. Just a miserable, sick bastard. I feel like someday soon I'm going to end up hurting either myself or someone else. My closest friend just got engaged, so I don't want to do anything before the wedding for her sake. Afterwards, though, I'm either ending it all or running. I need some help, advice. If this doesn't get better, then why bother? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24xerf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "MissingMyself", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24xerf/i_dont_know_how_log_i_can_keep_this_up/", "name": "t3_24xerf", "created": 1399466338.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24xerf/i_dont_know_how_log_i_can_keep_this_up/", "author_flair_text": null, "title": "I don't know how log I can keep this up.", "created_utc": 1399437538.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]