[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been depressed for as long as I can remember, which isn&amp;#39;t very long because I&amp;#39;m constantly high on weed to block out the pain. I&amp;#39;m transsexual (2-ish months on hormones now, mtf), and transition has definitely helped. I&amp;#39;ve got two supportive roommates and my best friend who I skype pretty often. My family on the other hand, has known for 3 years now and they still can&amp;#39;t bring themselves to stop throwing &amp;quot;him&amp;quot;, &amp;quot;he&amp;quot;, &amp;quot;his&amp;quot;, and &amp;quot;(my male name)&amp;quot; in my face. My dad is the worst, every time I bring it up he throws a shit-fit and yells things like, &amp;quot;you really think a man would ever want to nail someone like you?&amp;quot;  or, &amp;quot;You have wider shoulders than your brother! You think anyone will buy this shit?&amp;quot; or my personal favorite, &amp;quot;No one will ever hire a tranny! I wouldn&amp;#39;t!&amp;quot; etc. etc.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s only half my issues, I can&amp;#39;t bring myself to focus on my work. Sometimes I think I have ADD (I&amp;#39;ve never been tested) and sometimes I think I&amp;#39;m just lazy. But I&amp;#39;ve never gone into a school year thinking, &amp;quot;I&amp;#39;m not going to do my work&amp;quot;. I finished high school (with terrible gpa) with fine arts honors. But now I&amp;#39;m failing out of college because I got behind on my work and it just seems hopeless. I&amp;#39;ve never had an actual job and I don&amp;#39;t where to even begin. The fucked up part is that I only even went to college to make my dad proud. Now I&amp;#39;m dreading the day that I get kicked out because I&amp;#39;ll have to tell him. half my brain is telling me I don&amp;#39;t give two shits what he thinks of me, and the other half admires him for his success (because he is very successful.) and genuinely wants to go somewhere in life.&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s overwhelming. It&amp;#39;s hard to even put words to how I feel. I just want it to stop. To go to sleep one last time. And I would in a heartbeat, if not for the people it would devastate. It would absolutely destroy my family and friends. I&amp;#39;ve thought about it every day for the past year, I could make it look like a murder, or an accident, or I could just disappear. I&amp;#39;ve got specific plans for each of those scenarios.&lt;/p&gt;\n\n&lt;p&gt;I just feel hopeless.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been depressed for as long as I can remember, which isn't very long because I'm constantly high on weed to block out the pain. I'm transsexual (2-ish months on hormones now, mtf), and transition has definitely helped. I've got two supportive roommates and my best friend who I skype pretty often. My family on the other hand, has known for 3 years now and they still can't bring themselves to stop throwing \"him\", \"he\", \"his\", and \"(my male name)\" in my face. My dad is the worst, every time I bring it up he throws a shit-fit and yells things like, \"you really think a man would ever want to nail someone like you?\"  or, \"You have wider shoulders than your brother! You think anyone will buy this shit?\" or my personal favorite, \"No one will ever hire a tranny! I wouldn't!\" etc. etc.\n\nBut that's only half my issues, I can't bring myself to focus on my work. Sometimes I think I have ADD (I've never been tested) and sometimes I think I'm just lazy. But I've never gone into a school year thinking, \"I'm not going to do my work\". I finished high school (with terrible gpa) with fine arts honors. But now I'm failing out of college because I got behind on my work and it just seems hopeless. I've never had an actual job and I don't where to even begin. The fucked up part is that I only even went to college to make my dad proud. Now I'm dreading the day that I get kicked out because I'll have to tell him. half my brain is telling me I don't give two shits what he thinks of me, and the other half admires him for his success (because he is very successful.) and genuinely wants to go somewhere in life.\n\nBut it's overwhelming. It's hard to even put words to how I feel. I just want it to stop. To go to sleep one last time. And I would in a heartbeat, if not for the people it would devastate. It would absolutely destroy my family and friends. I've thought about it every day for the past year, I could make it look like a murder, or an accident, or I could just disappear. I've got specific plans for each of those scenarios.\n\nI just feel hopeless.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24agqn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "zyx-cba", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24agqn/i_feel_like_a_failure/", "name": "t3_24agqn", "created": 1398819754.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24agqn/i_feel_like_a_failure/", "author_flair_text": null, "title": "I feel like a failure.", "created_utc": 1398790954.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]