[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in my teens and i&amp;#39;m a highschool dropout.  My parents pulled me out of school when i was 11 so that they could homeschool me.  I never did the work, and eventually my parents gave up on me and let me do whatever I want.  I was always a stubborn when I was young.  My parents had to basically tear me out of bed in the morning, dress me and force me to go to school.  I had no social issues, I never got in fights with other kids, was never bullied.  I just hated going to school.  Asking me if I wanted to skip school forever was a dream come true.  &lt;/p&gt;\n\n&lt;p&gt;I wish I had put my problems into perspective at the time.  I wish I could put my problems into perspective right now.  I&amp;#39;m just too damn deep into this lifestyle and I feel completely trapped.  Everyone has given up on me, it&amp;#39;s as if they&amp;#39;re completely oblivious to my issues.&lt;/p&gt;\n\n&lt;p&gt;The worst part is the crushing loneliness that I experience.  When I left school I also opted out of my social life, I never kept the relationships with my friends going.  Eventually they burned out.  I can&amp;#39;t even remember the last time I heard anything from my friends.   I&amp;#39;m not exaggerating when I say I have literally zero friends.  I&amp;#39;m completely normal, I can hold a conversation, I love to talk.  It&amp;#39;s maddening that I have no one to talk to.&lt;/p&gt;\n\n&lt;p&gt;So usually what I&amp;#39;ll do it chat with people online.  At least I can get some kind of fulfillment out of talking to someone.  Playing videogames with people is fun, at least you share a common interest.\nI&amp;#39;ll get to the point - this is what made me write this shit.  I formed somewhat of a romantic relationship with someone, over the course of months.  We started off as friends, we played some videogames together and eventually it got flirty.  I loved the attention and I liked talking to him a lot.  I found myself forgetting about my problems when I talked to him, and this was very comforting.  &lt;/p&gt;\n\n&lt;p&gt;He got back together with his ex, and I felt so terrible I had to remove him.  Obviously we weren&amp;#39;t e-dating or something but I felt a romantic attraction to him that I couldn&amp;#39;t shake.  I was too jealous to deal with it, so I told him how I felt and I said goodbye.  The person who comforted me is now gone, and I can&amp;#39;t be friends with him anymore.&lt;/p&gt;\n\n&lt;p&gt;This sounds so stupid when you put it into perspective with basically any other human being on the planet, but this is my life.  I am hopeless, and I can&amp;#39;t even fool myself anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm in my teens and i'm a highschool dropout.  My parents pulled me out of school when i was 11 so that they could homeschool me.  I never did the work, and eventually my parents gave up on me and let me do whatever I want.  I was always a stubborn when I was young.  My parents had to basically tear me out of bed in the morning, dress me and force me to go to school.  I had no social issues, I never got in fights with other kids, was never bullied.  I just hated going to school.  Asking me if I wanted to skip school forever was a dream come true.  \n\nI wish I had put my problems into perspective at the time.  I wish I could put my problems into perspective right now.  I'm just too damn deep into this lifestyle and I feel completely trapped.  Everyone has given up on me, it's as if they're completely oblivious to my issues.\n\nThe worst part is the crushing loneliness that I experience.  When I left school I also opted out of my social life, I never kept the relationships with my friends going.  Eventually they burned out.  I can't even remember the last time I heard anything from my friends.   I'm not exaggerating when I say I have literally zero friends.  I'm completely normal, I can hold a conversation, I love to talk.  It's maddening that I have no one to talk to.\n\nSo usually what I'll do it chat with people online.  At least I can get some kind of fulfillment out of talking to someone.  Playing videogames with people is fun, at least you share a common interest.\nI'll get to the point - this is what made me write this shit.  I formed somewhat of a romantic relationship with someone, over the course of months.  We started off as friends, we played some videogames together and eventually it got flirty.  I loved the attention and I liked talking to him a lot.  I found myself forgetting about my problems when I talked to him, and this was very comforting.  \n\nHe got back together with his ex, and I felt so terrible I had to remove him.  Obviously we weren't e-dating or something but I felt a romantic attraction to him that I couldn't shake.  I was too jealous to deal with it, so I told him how I felt and I said goodbye.  The person who comforted me is now gone, and I can't be friends with him anymore.\n\nThis sounds so stupid when you put it into perspective with basically any other human being on the planet, but this is my life.  I am hopeless, and I can't even fool myself anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ffzw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "irreverend_", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ffzw/i_feel_so_lonely/", "name": "t3_24ffzw", "created": 1398944492.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ffzw/i_feel_so_lonely/", "author_flair_text": null, "title": "I feel so lonely", "created_utc": 1398915692.0, "ups": 1, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7664p", "gilded": 0, "author": "Soletrador", "parent_id": "t3_24ffzw", "approved_by": null, "body": "You still here?\n\nAnswer me please!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You still here?&lt;/p&gt;\n\n&lt;p&gt;Answer me please!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch7664p", "created": 1398981093.0, "author_flair_text": null, "created_utc": 1398977493.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6n61s", "gilded": 0, "author": "iFuturePresident", "parent_id": "t1_ch6msb4", "approved_by": null, "body": "Well, then it's time to be progressive. Lay out a plan to start moving out: apply for a job, go to school, whatever you feel benefits your future. You can do this, and it's not that daunting of a challenge. I know what it's like living in a small town, it's almost encumbering...you don't get the same opportunities that some people in cities get. There are opportunities, however, and you should take advantage of them. I'm here to support you and I've never met you; I'm sure you have people that are more than willing to assist you with your ambitions. \n\nAlso, if you don't have a diploma, I encourage you to actively pursue your GED. Getting certified opens many doors. You can google the closest adult education center to you, they will assist you in the process.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, then it&amp;#39;s time to be progressive. Lay out a plan to start moving out: apply for a job, go to school, whatever you feel benefits your future. You can do this, and it&amp;#39;s not that daunting of a challenge. I know what it&amp;#39;s like living in a small town, it&amp;#39;s almost encumbering...you don&amp;#39;t get the same opportunities that some people in cities get. There are opportunities, however, and you should take advantage of them. I&amp;#39;m here to support you and I&amp;#39;ve never met you; I&amp;#39;m sure you have people that are more than willing to assist you with your ambitions. &lt;/p&gt;\n\n&lt;p&gt;Also, if you don&amp;#39;t have a diploma, I encourage you to actively pursue your GED. Getting certified opens many doors. You can google the closest adult education center to you, they will assist you in the process.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch6n61s", "created": 1398922987.0, "author_flair_text": null, "created_utc": 1398919387.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6msb4", "gilded": 0, "author": "irreverend_", "parent_id": "t1_ch6mj6q", "approved_by": null, "body": "If I wait it out I'm going to be thirty and living with my parents.  I don't want to be that guy, and I'm on my path to being exactly that.  I need to make a change right now but I'm too comfortable to even think about it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I wait it out I&amp;#39;m going to be thirty and living with my parents.  I don&amp;#39;t want to be that guy, and I&amp;#39;m on my path to being exactly that.  I need to make a change right now but I&amp;#39;m too comfortable to even think about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch6msb4", "created": 1398947206.0, "author_flair_text": null, "created_utc": 1398918406.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch6mj6q", "gilded": 0, "author": "iFuturePresident", "parent_id": "t1_ch6m9bs", "approved_by": null, "body": "I live in a small town, in Kentucky. I dropped out when I was sixteen, and I've been in your position many times. I used to think that not having a car would somehow lead me to a terrible future lol...Things get irrational when you think too much. I wasn't into church, either. You said you like gaming, and that's how I got close to many of my friends now. I met my best friend a couple years ago -- when I was seventeen -- at a McDonald's. Sometimes people just come into your life. At least give it time?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in a small town, in Kentucky. I dropped out when I was sixteen, and I&amp;#39;ve been in your position many times. I used to think that not having a car would somehow lead me to a terrible future lol...Things get irrational when you think too much. I wasn&amp;#39;t into church, either. You said you like gaming, and that&amp;#39;s how I got close to many of my friends now. I met my best friend a couple years ago -- when I was seventeen -- at a McDonald&amp;#39;s. Sometimes people just come into your life. At least give it time?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch6mj6q", "created": 1398946586.0, "author_flair_text": null, "created_utc": 1398917786.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6m9bs", "gilded": 0, "author": "irreverend_", "parent_id": "t1_ch6m21q", "approved_by": null, "body": "I've tried going to groups in churches, but I found the environment too preachy, and the age group of the kids was mostly around the age of twelve.  There was nothing there for me.\n\nI live in a very small town, there's hardly any activity around here.  I wish it was that simple though.  Thank you for the advice. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried going to groups in churches, but I found the environment too preachy, and the age group of the kids was mostly around the age of twelve.  There was nothing there for me.&lt;/p&gt;\n\n&lt;p&gt;I live in a very small town, there&amp;#39;s hardly any activity around here.  I wish it was that simple though.  Thank you for the advice. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch6m9bs", "created": 1398945933.0, "author_flair_text": null, "created_utc": 1398917133.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch6m21q", "gilded": 0, "author": "iFuturePresident", "parent_id": "t3_24ffzw", "approved_by": null, "body": "You don't seem very introverted. I feel like you just need to amplify the crowd you frequent. Try joining local groups -- I don't know if you're religious, I'm not, but I know churches provide a easy way to introduce yourself with a wider audience. Breakups suck -- you become familiar with someone to the point they become a part of your world, when they leave, they leave that world ruined. I'm sure you're very desirable, and you WILL find someone else, I promise. Live and learn...you have the potential to change all of your problems.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t seem very introverted. I feel like you just need to amplify the crowd you frequent. Try joining local groups -- I don&amp;#39;t know if you&amp;#39;re religious, I&amp;#39;m not, but I know churches provide a easy way to introduce yourself with a wider audience. Breakups suck -- you become familiar with someone to the point they become a part of your world, when they leave, they leave that world ruined. I&amp;#39;m sure you&amp;#39;re very desirable, and you WILL find someone else, I promise. Live and learn...you have the potential to change all of your problems.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ffzw", "score_hidden": false, "name": "t1_ch6m21q", "created": 1398945466.0, "author_flair_text": null, "created_utc": 1398916666.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]