[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How do I make it through the day? I always start to feel motivated and then everything turns around and I feel like I can&amp;#39;t go on. I feel completely worthless and no one likes to be around me. I&amp;#39;m still in love with this girl and she doesn&amp;#39;t love me. She knows how I feel and she travelled 700 miles just to see me after I moved. I&amp;#39;ve been crying for a month straight after I saw her. I don&amp;#39;t get anything done at work I just sit there sobbing at my desk. I talked to her this weekend to say I feel like I can&amp;#39;t talk to her anymore because it just triggers everything when I do, and that I need to accept how she feels and move on and we talked for awhile and she finally explained why she doesn&amp;#39;t feel the same way. It&amp;#39;s because I freeze up around people and she never felt comfortable around me because I can&amp;#39;t talk. No one ever feels comfortable around me. I just blank when I&amp;#39;m around other people. If this girl can&amp;#39;t feel anything for me then no one will. She&amp;#39;s said so much over the course of our friendship about how great of a person I am. But she said she feels like she has to carry everything when we&amp;#39;re together. I&amp;#39;m a worthless, spineless, indecisive creep and the only girl who ever came close to loving me doesn&amp;#39;t even think of me as a man. She doesnt even think of me at all. Why am I so fucking damaged?&lt;/p&gt;\n\n&lt;p&gt;I started seeing a therapist and it&amp;#39;s been bullshit so far. I want to throw in the towel. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "How do I make it through the day? I always start to feel motivated and then everything turns around and I feel like I can't go on. I feel completely worthless and no one likes to be around me. I'm still in love with this girl and she doesn't love me. She knows how I feel and she travelled 700 miles just to see me after I moved. I've been crying for a month straight after I saw her. I don't get anything done at work I just sit there sobbing at my desk. I talked to her this weekend to say I feel like I can't talk to her anymore because it just triggers everything when I do, and that I need to accept how she feels and move on and we talked for awhile and she finally explained why she doesn't feel the same way. It's because I freeze up around people and she never felt comfortable around me because I can't talk. No one ever feels comfortable around me. I just blank when I'm around other people. If this girl can't feel anything for me then no one will. She's said so much over the course of our friendship about how great of a person I am. But she said she feels like she has to carry everything when we're together. I'm a worthless, spineless, indecisive creep and the only girl who ever came close to loving me doesn't even think of me as a man. She doesnt even think of me at all. Why am I so fucking damaged?\n\nI started seeing a therapist and it's been bullshit so far. I want to throw in the towel. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2474fj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "want_to_quit_", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2474fj/i_feel_so_worthless_and_i_want_to_throw_in_the/", "name": "t3_2474fj", "created": 1398731782.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2474fj/i_feel_so_worthless_and_i_want_to_throw_in_the/", "author_flair_text": null, "title": "I feel so worthless and I want to throw in the towel", "created_utc": 1398702982.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4bz3f", "gilded": 0, "author": "Leovinus_Jones", "parent_id": "t1_ch49dl3", "approved_by": null, "body": "In a way, you've summed it up well; \n\nOn one hand, you have a potential for improvement which will require patience. This can only make things better, not worse. The only thing you have to lose is time.\n\nOn the other hand, you have the immediate and final solution of death. You don't want to kill youself. You want to live a life which is happy and full of the amazing things you know are out there. You want to be free from pain. \nDeath *will* solve those problems, in the same way buying a jumbo jet will solve your problem not having enough in-flight peanuts. \n\nOne day, you are going to die. Whether that's by your own hand or some other external cause. What's a few more days? A few weeks? \nWhat's the risk in trying a new shrink? It won't get worse.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a way, you&amp;#39;ve summed it up well; &lt;/p&gt;\n\n&lt;p&gt;On one hand, you have a potential for improvement which will require patience. This can only make things better, not worse. The only thing you have to lose is time.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, you have the immediate and final solution of death. You don&amp;#39;t want to kill youself. You want to live a life which is happy and full of the amazing things you know are out there. You want to be free from pain. \nDeath &lt;em&gt;will&lt;/em&gt; solve those problems, in the same way buying a jumbo jet will solve your problem not having enough in-flight peanuts. &lt;/p&gt;\n\n&lt;p&gt;One day, you are going to die. Whether that&amp;#39;s by your own hand or some other external cause. What&amp;#39;s a few more days? A few weeks? \nWhat&amp;#39;s the risk in trying a new shrink? It won&amp;#39;t get worse.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2474fj", "score_hidden": false, "name": "t1_ch4bz3f", "created": 1398714412.0, "author_flair_text": null, "created_utc": 1398710812.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch49dl3", "gilded": 0, "author": "want_to_quit_", "parent_id": "t1_ch48wfo", "approved_by": null, "body": "New therapist or if I stick with this one, either way it's going to take time. I barely made it through the weekend and I don't know how I'm going to make it through the week. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;New therapist or if I stick with this one, either way it&amp;#39;s going to take time. I barely made it through the weekend and I don&amp;#39;t know how I&amp;#39;m going to make it through the week. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2474fj", "score_hidden": false, "name": "t1_ch49dl3", "created": 1398709142.0, "author_flair_text": null, "created_utc": 1398705542.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch48wfo", "gilded": 0, "author": "Leovinus_Jones", "parent_id": "t3_2474fj", "approved_by": null, "body": "If your therapist isn't a good match for you, they are obliged (when asked by you, the patient) to switch you to someone different.\n\nIt happens, and often you might need to switch things up to find someone whose method of counselling works for you. Ask, give the next person a try, and go from there.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your therapist isn&amp;#39;t a good match for you, they are obliged (when asked by you, the patient) to switch you to someone different.&lt;/p&gt;\n\n&lt;p&gt;It happens, and often you might need to switch things up to find someone whose method of counselling works for you. Ask, give the next person a try, and go from there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2474fj", "score_hidden": false, "name": "t1_ch48wfo", "created": 1398708172.0, "author_flair_text": null, "created_utc": 1398704572.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]