[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know where to turn at this point. I am a 27 year old female, I have been unemployed for the last 7 months and even though I apply for everything I&amp;#39;m even vaguely qualified for I get no calls. Last year I moved 6 hours away from my hometown and all my friends and family to stay in a relationship that&amp;#39;s now falling apart (mostly because I&amp;#39;m so depressed and anxious about my lack of money/employment). I just feel like I&amp;#39;m drowning and there&amp;#39;s an anvil on my chest that I can&amp;#39;t push off. I&amp;#39;m ready to just take every pill I can scrounge up and let myself fall away. &lt;/p&gt;\n\n&lt;p&gt;I wish I was brave enough to finally kill myself soon and end all this hurt (my depression has lately manifested itself as physical pain and near-constant nausea/headaches) and anxiety. The only thing that keeps me going every day is my dog -- I worry about what would happen to him if I was gone and if he would miss me. I feel like my parents can&amp;#39;t stand how much of a waste I&amp;#39;ve become, and if I disappeared it wouldn&amp;#39;t really be noticed. Or it would be a blessing for them because they wouldn&amp;#39;t have to worry about me anymore. The bills keep piling up and I have no way to pay them. My relationship is a disaster, and basically the only reason I still have a place to live is because he feels sorry for me and knows I can&amp;#39;t afford rent anywhere else that will let me keep my dog. &lt;/p&gt;\n\n&lt;p&gt;Help? Maybe? Please? I have so many thoughts racing through my head and I really just want some peace. I&amp;#39;ve been very depressed/anxious and at times suicidal for years -- but I really feel like this is the end.&lt;/p&gt;\n\n&lt;p&gt;I cannot see a doctor, I applied for health insurance assistance but I am still waiting to see if I got approved or not. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know where to turn at this point. I am a 27 year old female, I have been unemployed for the last 7 months and even though I apply for everything I'm even vaguely qualified for I get no calls. Last year I moved 6 hours away from my hometown and all my friends and family to stay in a relationship that's now falling apart (mostly because I'm so depressed and anxious about my lack of money/employment). I just feel like I'm drowning and there's an anvil on my chest that I can't push off. I'm ready to just take every pill I can scrounge up and let myself fall away. \n\nI wish I was brave enough to finally kill myself soon and end all this hurt (my depression has lately manifested itself as physical pain and near-constant nausea/headaches) and anxiety. The only thing that keeps me going every day is my dog -- I worry about what would happen to him if I was gone and if he would miss me. I feel like my parents can't stand how much of a waste I've become, and if I disappeared it wouldn't really be noticed. Or it would be a blessing for them because they wouldn't have to worry about me anymore. The bills keep piling up and I have no way to pay them. My relationship is a disaster, and basically the only reason I still have a place to live is because he feels sorry for me and knows I can't afford rent anywhere else that will let me keep my dog. \n\nHelp? Maybe? Please? I have so many thoughts racing through my head and I really just want some peace. I've been very depressed/anxious and at times suicidal for years -- but I really feel like this is the end.\n\nI cannot see a doctor, I applied for health insurance assistance but I am still waiting to see if I got approved or not. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24igig", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "FastDog0105", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24igig/i_feel_like_im_drowning/", "name": "t3_24igig", "created": 1399028301.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24igig/i_feel_like_im_drowning/", "author_flair_text": null, "title": "I feel like I'm drowning", "created_utc": 1398999501.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7jg9g", "gilded": 0, "author": "FerrousFlux", "parent_id": "t3_24igig", "approved_by": null, "body": "This is not the end. You are 27. You have a life ahead of you and then some. Find what gives you peace. For sure your pet is one which is great. You have someone who sees you as a friend, so go for walks with him. \n\nI would try volunteering, maybe at a local dog shelter or soup kitchen? Keeping yourself occupied in a positive community driven way will help you keep your focus away from the negativity in your life.\n\nFor now, maybe write down one or two goals a day. And try to meet progress in those goals, taking small steps to alleviate your situation will make a world of difference. Ending a life isn't brave and you know it. What is brave is fighting through these trials of yours and reclaiming your life. Best of luck", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not the end. You are 27. You have a life ahead of you and then some. Find what gives you peace. For sure your pet is one which is great. You have someone who sees you as a friend, so go for walks with him. &lt;/p&gt;\n\n&lt;p&gt;I would try volunteering, maybe at a local dog shelter or soup kitchen? Keeping yourself occupied in a positive community driven way will help you keep your focus away from the negativity in your life.&lt;/p&gt;\n\n&lt;p&gt;For now, maybe write down one or two goals a day. And try to meet progress in those goals, taking small steps to alleviate your situation will make a world of difference. Ending a life isn&amp;#39;t brave and you know it. What is brave is fighting through these trials of yours and reclaiming your life. Best of luck&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24igig", "score_hidden": false, "name": "t1_ch7jg9g", "created": 1399038138.0, "author_flair_text": null, "created_utc": 1399009338.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]