[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;i thought i had made it past this dark stage of my life, but its back with a vengeance in the past year. i fantasize about ending it all constantly. &lt;/p&gt;\n\n&lt;p&gt;my social anxiety is crippling. even picking up the phone to call the doctor makes me have a panic attack. i cant even pay for it anyways. my insurance covers nothing of consequence. i have ADD as well, but i can&amp;#39;t afford the medication at $180/month, and I feel constant anxiety at the stigma folks on stimulants get.&lt;/p&gt;\n\n&lt;p&gt;i am way too old to still be jobless. im in college but this past semester i feel like the wheels fell off. i had such anxiety about going to class. i fucked up and missed a math test and was force to drop halfway through. i had a professor who destroyed any and all confidence i had in the one thing i enjoyed, my art. i&amp;#39;m such an oversensitive little fuck that i let her destroy me. i am pathetic.&lt;/p&gt;\n\n&lt;p&gt;im such a fuckup i can&amp;#39;t even coherently explain how helpless and alone i feel. &lt;/p&gt;\n\n&lt;p&gt;i try to confess that i feel like hurting myself to my boyfriend or my mom, and they just get angry. i feel like i am such a burden. i just keep it to myself now. the only thing i am good at is disappointing everyone who loves me. &lt;/p&gt;\n\n&lt;p&gt;i dont know how to articulate to them that this isn&amp;#39;t just a matter of me snapping out of it. i&amp;#39;m tired of being yelled at for being depressed and anxious and unable to focus. im tired of my parents and SO acting like i WANT to be this way, that its because of my sleep schedule, my eating habits, my &amp;#39;attitude&amp;#39;. i dont know how to articulate that i physically freeze when i try to call the doctor. i feel like i need to be committed somewhere, honestly. &lt;/p&gt;\n\n&lt;p&gt;i would give anything to not be this way. every waking moment is pure hell. i am simultaneously in pure agony and anxiety all moments of the day, yet feel absolutely nothing. it tears me apart that they believe this is something i chose, that its &amp;#39;not really that bad&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;it IS that bad. this is killing me. and NOBODY fucking comprehends it -- and even if they do for a split second, they&amp;#39;re angry at me for feeling this way. not understanding, loving, or supportive. i am scared to say anything anymore for fear of those angry reactions. &lt;/p&gt;\n\n&lt;p&gt;i cant take another bout of finally working up the courage to tell my boyfriend how i feel, only to watch him get angry and tell me to leave and to &amp;#39;do whatever i want&amp;#39;. it hurts so badly.&lt;/p&gt;\n\n&lt;p&gt;i fantasize about stabbing myself repeatedly in the gut with a sharp knife out of pure hatred for my own pathetic existence. about driving my car into the river and sinking to the bottom and just disappearing. &lt;/p&gt;\n\n&lt;p&gt;i dont know what to do anymore. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "i thought i had made it past this dark stage of my life, but its back with a vengeance in the past year. i fantasize about ending it all constantly. \n\nmy social anxiety is crippling. even picking up the phone to call the doctor makes me have a panic attack. i cant even pay for it anyways. my insurance covers nothing of consequence. i have ADD as well, but i can't afford the medication at $180/month, and I feel constant anxiety at the stigma folks on stimulants get.\n\ni am way too old to still be jobless. im in college but this past semester i feel like the wheels fell off. i had such anxiety about going to class. i fucked up and missed a math test and was force to drop halfway through. i had a professor who destroyed any and all confidence i had in the one thing i enjoyed, my art. i'm such an oversensitive little fuck that i let her destroy me. i am pathetic.\n\nim such a fuckup i can't even coherently explain how helpless and alone i feel. \n\ni try to confess that i feel like hurting myself to my boyfriend or my mom, and they just get angry. i feel like i am such a burden. i just keep it to myself now. the only thing i am good at is disappointing everyone who loves me. \n\ni dont know how to articulate to them that this isn't just a matter of me snapping out of it. i'm tired of being yelled at for being depressed and anxious and unable to focus. im tired of my parents and SO acting like i WANT to be this way, that its because of my sleep schedule, my eating habits, my 'attitude'. i dont know how to articulate that i physically freeze when i try to call the doctor. i feel like i need to be committed somewhere, honestly. \n\ni would give anything to not be this way. every waking moment is pure hell. i am simultaneously in pure agony and anxiety all moments of the day, yet feel absolutely nothing. it tears me apart that they believe this is something i chose, that its 'not really that bad'. \n\nit IS that bad. this is killing me. and NOBODY fucking comprehends it -- and even if they do for a split second, they're angry at me for feeling this way. not understanding, loving, or supportive. i am scared to say anything anymore for fear of those angry reactions. \n\ni cant take another bout of finally working up the courage to tell my boyfriend how i feel, only to watch him get angry and tell me to leave and to 'do whatever i want'. it hurts so badly.\n\ni fantasize about stabbing myself repeatedly in the gut with a sharp knife out of pure hatred for my own pathetic existence. about driving my car into the river and sinking to the bottom and just disappearing. \n\ni dont know what to do anymore. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24xnu9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "helpless-throwaway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399502304.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24xnu9/i_feel_utterly_helpless_and_isolated_no_one_wants/", "name": "t3_24xnu9", "created": 1399475428.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24xnu9/i_feel_utterly_helpless_and_isolated_no_one_wants/", "author_flair_text": null, "title": "i feel utterly helpless and isolated. no one wants to listen to how much i hurt.", "created_utc": 1399446628.0, "ups": 2, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbo3hx", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24xnu9", "approved_by": null, "body": "I know what you mean.\n\nIt has literally been a herculean act to get myself together. And let me tell you, I really did need the time to myself, to figure out how to just live and cope with myself. I made art and music and stuff, and talked to a lot of other people on these support reddits. That helped a lot.\n\nI understand how shitty it is. I truly do. And it *is* that shitty. It's like an oversensitivity in your brain, it's like everything is perpetually adding up. I understand how horrible that is. It took a *lot* of time on my own, sitting under trees, stuff like that. It was very very difficult. But speaking to others on reddit has helped me a lot. I feel like I get somewhere every time I do.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean.&lt;/p&gt;\n\n&lt;p&gt;It has literally been a herculean act to get myself together. And let me tell you, I really did need the time to myself, to figure out how to just live and cope with myself. I made art and music and stuff, and talked to a lot of other people on these support reddits. That helped a lot.&lt;/p&gt;\n\n&lt;p&gt;I understand how shitty it is. I truly do. And it &lt;em&gt;is&lt;/em&gt; that shitty. It&amp;#39;s like an oversensitivity in your brain, it&amp;#39;s like everything is perpetually adding up. I understand how horrible that is. It took a &lt;em&gt;lot&lt;/em&gt; of time on my own, sitting under trees, stuff like that. It was very very difficult. But speaking to others on reddit has helped me a lot. I feel like I get somewhere every time I do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chbo3hx", "created": 1399475745.0, "author_flair_text": null, "created_utc": 1399446945.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbo69p", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24xnu9", "approved_by": null, "body": "I understand what you mean... I have experienced what it's like to be alone with what you feel, with no one who understands the deep hell you are walking (crawling?) through.\n\nFor me, this is what metal and metalcore music is about, it's what gave me the strength to get through some of my worst places. Without bands like Asking Alexandria, Meshuggah, Pierce the Veil, Chiodos and Pantera I don't know if I would still be alive today. (I forgot to mention Nine Inch Nails! and the Smashing Pumpkins!)\n\nI had to find people and feelings of intensity that felt like the way I felt, even Avenged Sevenfold helped me (many people do not think very highly of them :( ). Metal for me is about those feelings of no one understanding you at all, being at the bottom of everything and in so much pain, just needing to feel, and metal is what helps me feel and scream through that pain.\n\nAnother favorite of mine is Bring me the Horizon. Holy hell they are incredible.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand what you mean... I have experienced what it&amp;#39;s like to be alone with what you feel, with no one who understands the deep hell you are walking (crawling?) through.&lt;/p&gt;\n\n&lt;p&gt;For me, this is what metal and metalcore music is about, it&amp;#39;s what gave me the strength to get through some of my worst places. Without bands like Asking Alexandria, Meshuggah, Pierce the Veil, Chiodos and Pantera I don&amp;#39;t know if I would still be alive today. (I forgot to mention Nine Inch Nails! and the Smashing Pumpkins!)&lt;/p&gt;\n\n&lt;p&gt;I had to find people and feelings of intensity that felt like the way I felt, even Avenged Sevenfold helped me (many people do not think very highly of them :( ). Metal for me is about those feelings of no one understanding you at all, being at the bottom of everything and in so much pain, just needing to feel, and metal is what helps me feel and scream through that pain.&lt;/p&gt;\n\n&lt;p&gt;Another favorite of mine is Bring me the Horizon. Holy hell they are incredible.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chbo69p", "created": 1399476114.0, "author_flair_text": null, "created_utc": 1399447314.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbrsud", "gilded": 0, "author": "reverienoire", "parent_id": "t3_24xnu9", "approved_by": null, "body": "i understand so so so much.\n\nFUCK anxiety. it is a disease and it can be devastating and it absolutely infuriates me that the people in your immediate life misunderstand it to such a degree that their ignorance damages you. why can't people take the time and effort and care to read about it or ask a professional or SOMETHING. anything!\n\nyou deserve much, much better and i hope they get it together so you can get the support and understanding you need. anxiety wrecks lives and no one anywhere ever has ever said to themselves \"golly, i'd love to worry myself to exhaustion and feel like a wind up toy cranked so tight it's poised to break and have my brain go haywire and make everything soulcrushingly difficult... that would be awesome and cool!\"\n\ni hope hope hope you catch a break just long enough for you to make that call to the doctor. or i hope you can find someone who is willing to help you call. fuck, i'd do it if i could. you need help and i hope you get it sooner than later. i'm sorry it's not happening now, my heart aches for you. no one deserves to suffer so.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i understand so so so much.&lt;/p&gt;\n\n&lt;p&gt;FUCK anxiety. it is a disease and it can be devastating and it absolutely infuriates me that the people in your immediate life misunderstand it to such a degree that their ignorance damages you. why can&amp;#39;t people take the time and effort and care to read about it or ask a professional or SOMETHING. anything!&lt;/p&gt;\n\n&lt;p&gt;you deserve much, much better and i hope they get it together so you can get the support and understanding you need. anxiety wrecks lives and no one anywhere ever has ever said to themselves &amp;quot;golly, i&amp;#39;d love to worry myself to exhaustion and feel like a wind up toy cranked so tight it&amp;#39;s poised to break and have my brain go haywire and make everything soulcrushingly difficult... that would be awesome and cool!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;i hope hope hope you catch a break just long enough for you to make that call to the doctor. or i hope you can find someone who is willing to help you call. fuck, i&amp;#39;d do it if i could. you need help and i hope you get it sooner than later. i&amp;#39;m sorry it&amp;#39;s not happening now, my heart aches for you. no one deserves to suffer so.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chbrsud", "created": 1399495806.0, "author_flair_text": null, "created_utc": 1399467006.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbwsbz", "gilded": 0, "author": "galumph_triumph", "parent_id": "t3_24xnu9", "approved_by": null, "body": "The rage you feel will consume you and destroy you. Let this hate inside you die. \n\n\nMany of us are here to listen and to empathize. You should be reaching out to every person who responded to this post. You aren't alone, even when you feel you might be. Your experience is not unique; many have walked this path before, and a lot of them have triumphed.\n\n\nI started healing by listening to VNV Nation. Their music literally saved my life. Please take a few minutes to listen to those words, because they're far more effective than anything I could ever say. Songs like Standing, Homeward, Suffer, Where There Is Light.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The rage you feel will consume you and destroy you. Let this hate inside you die. &lt;/p&gt;\n\n&lt;p&gt;Many of us are here to listen and to empathize. You should be reaching out to every person who responded to this post. You aren&amp;#39;t alone, even when you feel you might be. Your experience is not unique; many have walked this path before, and a lot of them have triumphed.&lt;/p&gt;\n\n&lt;p&gt;I started healing by listening to VNV Nation. Their music literally saved my life. Please take a few minutes to listen to those words, because they&amp;#39;re far more effective than anything I could ever say. Songs like Standing, Homeward, Suffer, Where There Is Light.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chbwsbz", "created": 1399507973.0, "author_flair_text": null, "created_utc": 1399479173.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc0mmd", "gilded": 0, "author": "traceme25", "parent_id": "t3_24xnu9", "approved_by": null, "body": "My son has ADHD and has insurance and has a hard time getting his meds because everyone he sees thinks he just wants to get high. He is 26 years old has many tattoos and people just think bad things when they see him.  It sucks so bad. The one thing he does have going for him is that he gets social security money for his adhd.  \n\n\nHe can't hold down a job because of his adhd.  A lot of people with ADD can't work, especially because of the anxiety!\n\n\nMany people don't know you can get social security if you have medical proof of it.  It will help you pay for the meds you need.\n\nHave you thought about trying to get SS?  PM me if you want to talk. I know a lot about it and can help you!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My son has ADHD and has insurance and has a hard time getting his meds because everyone he sees thinks he just wants to get high. He is 26 years old has many tattoos and people just think bad things when they see him.  It sucks so bad. The one thing he does have going for him is that he gets social security money for his adhd.  &lt;/p&gt;\n\n&lt;p&gt;He can&amp;#39;t hold down a job because of his adhd.  A lot of people with ADD can&amp;#39;t work, especially because of the anxiety!&lt;/p&gt;\n\n&lt;p&gt;Many people don&amp;#39;t know you can get social security if you have medical proof of it.  It will help you pay for the meds you need.&lt;/p&gt;\n\n&lt;p&gt;Have you thought about trying to get SS?  PM me if you want to talk. I know a lot about it and can help you!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chc0mmd", "created": 1399515672.0, "author_flair_text": null, "created_utc": 1399486872.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chchwd8", "gilded": 0, "author": "helpless-throwaway", "parent_id": "t3_24xnu9", "approved_by": null, "body": "thank you to all of you who took the time to send a reply, a pm, etc. it means so much to hear other people understand and want to help. i really, truly appreciate it from the bottom of my heart. so many of you gave such great advice that i'm itching to try -- today was much better than many days have been in a long time. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you to all of you who took the time to send a reply, a pm, etc. it means so much to hear other people understand and want to help. i really, truly appreciate it from the bottom of my heart. so many of you gave such great advice that i&amp;#39;m itching to try -- today was much better than many days have been in a long time. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xnu9", "score_hidden": false, "name": "t1_chchwd8", "created": 1399553730.0, "author_flair_text": null, "created_utc": 1399524930.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]