[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a phenomenal job in this shitty economy. I have a great set of friends. I just got back from trips with my friends to different places.&lt;/p&gt;\n\n&lt;p&gt;but i&amp;#39;m messing it up. my manager said this week that i was doing a really bad job and should find a new team. just messed up my best friend&amp;#39;s phone. i hate what i do. i hate my job. i hate being me. i can&amp;#39;t lose weight. i&amp;#39;m stuck in this cycle with a guy that i can&amp;#39;t get out of. everything just feels like it&amp;#39;s going wrong. i quit my favorite sport months ago. sold off the last part today.&lt;/p&gt;\n\n&lt;p&gt;i just know i can&amp;#39;t go on mother&amp;#39;s day. i love my mom a lot and that&amp;#39;s not fair. i just wish i could go and have no one bat an eye. i can&amp;#39;t stop thinking about what if i just drove my car off something. if i could just take a ton of pills and never wake up. i don&amp;#39;t want something that would leave me half-dead or another person being like I IMMEDIATELY REGRETTED TRYING. i just want to go. but i don&amp;#39;t want to hurt people. i don&amp;#39;t even know what i&amp;#39;m going here or why.&lt;/p&gt;\n\n&lt;p&gt;i just wish i could go without anyone caring.&lt;/p&gt;\n\n&lt;p&gt;i just feel like i&amp;#39;m constantly distracting myself with games and texts and friends and work from the fact that nothing matters and i don&amp;#39;t matter and i should be gone..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a phenomenal job in this shitty economy. I have a great set of friends. I just got back from trips with my friends to different places.\n\nbut i'm messing it up. my manager said this week that i was doing a really bad job and should find a new team. just messed up my best friend's phone. i hate what i do. i hate my job. i hate being me. i can't lose weight. i'm stuck in this cycle with a guy that i can't get out of. everything just feels like it's going wrong. i quit my favorite sport months ago. sold off the last part today.\n\ni just know i can't go on mother's day. i love my mom a lot and that's not fair. i just wish i could go and have no one bat an eye. i can't stop thinking about what if i just drove my car off something. if i could just take a ton of pills and never wake up. i don't want something that would leave me half-dead or another person being like I IMMEDIATELY REGRETTED TRYING. i just want to go. but i don't want to hurt people. i don't even know what i'm going here or why.\n\ni just wish i could go without anyone caring.\n\ni just feel like i'm constantly distracting myself with games and texts and friends and work from the fact that nothing matters and i don't matter and i should be gone..", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259mmr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ijustwannabegone", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399793851.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259mmr/i_feel_like_im_messing_everything_up/", "name": "t3_259mmr", "created": 1399822268.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259mmr/i_feel_like_im_messing_everything_up/", "author_flair_text": null, "title": "I feel like I'm messing everything up.", "created_utc": 1399793468.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf2qzd", "gilded": 0, "author": "forgettingher", "parent_id": "t3_259mmr", "approved_by": null, "body": "Hey, ijustwannabegone, how are you feelin' right now? I know sometimes it can be hard to see the light at the end of the tunnel, especially when you've got a laundry list of things that you may feel aren't right in your life. But have you tried listing out some positives? You've got friends to distract yourself with, so I'm sure you're a great person people love to be around. Tell me more about yourself! \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, ijustwannabegone, how are you feelin&amp;#39; right now? I know sometimes it can be hard to see the light at the end of the tunnel, especially when you&amp;#39;ve got a laundry list of things that you may feel aren&amp;#39;t right in your life. But have you tried listing out some positives? You&amp;#39;ve got friends to distract yourself with, so I&amp;#39;m sure you&amp;#39;re a great person people love to be around. Tell me more about yourself! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259mmr", "score_hidden": false, "name": "t1_chf2qzd", "created": 1399829977.0, "author_flair_text": null, "created_utc": 1399801177.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]