[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first ever reddit post...\nOver the past three days my fiance told me he doesn&amp;#39;t know if he wants us to be together anymore. My heart is broken, but it&amp;#39;s so much more than that. Over the past 4 years I&amp;#39;ve lost all of my friends but 1, they all stopped talking to me at the same time. My dad is dying of severe crohns disease, and my entire family with the exception of my parents hate me because I admitted to being sexually abused by a cousin as a child. I&amp;#39;ve had to drop out of college because I kept failing classes (No motivation to go) and I moved back in with my parents. I&amp;#39;m an only child and my fiance was my support...my building block. I&amp;#39;ve been depressed for months but now I have nothing left, even if he stays with me...I don&amp;#39;t know if I&amp;#39;ll ever be able to trust him the way I used to. I&amp;#39;m sitting here at just past midnight thinking about my dads cabinet full of pills and the knives in the kitchen. I don&amp;#39;t see a reason for my being here anymore...my future, my goals....I&amp;#39;ve failed. If this is the life I&amp;#39;ve got to look forward too....then I don&amp;#39;t think I want to live it. I&amp;#39;d check myself into an ER on suicide watch but I&amp;#39;ve got no insurance and can&amp;#39;t afford the bill.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is my first ever reddit post...\nOver the past three days my fiance told me he doesn't know if he wants us to be together anymore. My heart is broken, but it's so much more than that. Over the past 4 years I've lost all of my friends but 1, they all stopped talking to me at the same time. My dad is dying of severe crohns disease, and my entire family with the exception of my parents hate me because I admitted to being sexually abused by a cousin as a child. I've had to drop out of college because I kept failing classes (No motivation to go) and I moved back in with my parents. I'm an only child and my fiance was my support...my building block. I've been depressed for months but now I have nothing left, even if he stays with me...I don't know if I'll ever be able to trust him the way I used to. I'm sitting here at just past midnight thinking about my dads cabinet full of pills and the knives in the kitchen. I don't see a reason for my being here anymore...my future, my goals....I've failed. If this is the life I've got to look forward too....then I don't think I want to live it. I'd check myself into an ER on suicide watch but I've got no insurance and can't afford the bill.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242ys4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "rebelangelic", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242ys4/i_feel_like_ive_got_nothing_left/", "name": "t3_242ys4", "created": 1398600807.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242ys4/i_feel_like_ive_got_nothing_left/", "author_flair_text": null, "title": "I feel like I've got nothing left", "created_utc": 1398572007.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch385c0", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t3_242ys4", "approved_by": null, "body": "Hey\n\nWhat you're going through sounds really terrible, I have lost a lot of my friends and recently my girlfriend dumped me for another guy. I can be your friend if you want :)\n\nI think you can make your life better. Talk to your fiance, talk about why he doesn't want to be together any more. Communication plays a big part in relationships. Just make sure not to beg him or guilt trip him, that may just end in him getting back with you because he feels like he needs to, and that makes a bad relationship.\n\nI think suicide is a thing that needs a lot of consideration. It's not something that should be done on a whim, not something that should be done with a few hours of thought, especially when you are in an emotional state.\n\nGive yourself a week to think about it. If you are not completely sure then, give yourself another week, maybe even a month. If your fiance does leave you, you may be feeling really down, but you always have the opportunity to get back up. I think you can do it, you sound like a strong person, even if you don't think so.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey&lt;/p&gt;\n\n&lt;p&gt;What you&amp;#39;re going through sounds really terrible, I have lost a lot of my friends and recently my girlfriend dumped me for another guy. I can be your friend if you want :)&lt;/p&gt;\n\n&lt;p&gt;I think you can make your life better. Talk to your fiance, talk about why he doesn&amp;#39;t want to be together any more. Communication plays a big part in relationships. Just make sure not to beg him or guilt trip him, that may just end in him getting back with you because he feels like he needs to, and that makes a bad relationship.&lt;/p&gt;\n\n&lt;p&gt;I think suicide is a thing that needs a lot of consideration. It&amp;#39;s not something that should be done on a whim, not something that should be done with a few hours of thought, especially when you are in an emotional state.&lt;/p&gt;\n\n&lt;p&gt;Give yourself a week to think about it. If you are not completely sure then, give yourself another week, maybe even a month. If your fiance does leave you, you may be feeling really down, but you always have the opportunity to get back up. I think you can do it, you sound like a strong person, even if you don&amp;#39;t think so.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242ys4", "score_hidden": false, "name": "t1_ch385c0", "created": 1398601131.0, "author_flair_text": null, "created_utc": 1398597531.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]