[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an ugly guy with social anxiety, depression and a shitty life that&amp;#39;s led me to this post.&lt;/p&gt;\n\n&lt;p&gt;I feel like suicide is right for me, people look at me like I should do it. I don&amp;#39;t want to though, I try to hold on every day and nothing improves. I&amp;#39;m surviving and that&amp;#39;s pathetic, I&amp;#39;ve become pathetic. &lt;/p&gt;\n\n&lt;p&gt;I try to meet people and socialize but anxiety stops me from being myself and really, I have no personality and am pretty stupid. &lt;/p&gt;\n\n&lt;p&gt;I would commit suicide if it weren&amp;#39;t for two things: 1) My dad and 2) The Afterlife&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t imagine the pain I&amp;#39;d put my dad through and if he found me dead it would destroy him. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to risk hell or the possibility of doing this all over again (if reincarnation is true). I saw a video about suicide and the afterlife, saying that suicides have to do it again and if they don&amp;#39;t will be gifted in their next life. If all that&amp;#39;s bullshit, I don&amp;#39;t wanna risk the emptiness of death. I&amp;#39;m a pussy about this I guess. &lt;/p&gt;\n\n&lt;p&gt;So what would you do? I feel hopeless and will never be respected by others, treated as an equal, dated by an attractive girl, etc. I can&amp;#39;t live a normal life like this...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm an ugly guy with social anxiety, depression and a shitty life that's led me to this post.\n\n I feel like suicide is right for me, people look at me like I should do it. I don't want to though, I try to hold on every day and nothing improves. I'm surviving and that's pathetic, I've become pathetic. \n\nI try to meet people and socialize but anxiety stops me from being myself and really, I have no personality and am pretty stupid. \n\nI would commit suicide if it weren't for two things: 1) My dad and 2) The Afterlife\n\nI can't imagine the pain I'd put my dad through and if he found me dead it would destroy him. \n\nI don't want to risk hell or the possibility of doing this all over again (if reincarnation is true). I saw a video about suicide and the afterlife, saying that suicides have to do it again and if they don't will be gifted in their next life. If all that's bullshit, I don't wanna risk the emptiness of death. I'm a pussy about this I guess. \n\nSo what would you do? I feel hopeless and will never be respected by others, treated as an equal, dated by an attractive girl, etc. I can't live a normal life like this...", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24mpcz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lastaccountaboutit", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24mpcz/i_feel_like_suicide_is_my_only_choice_i_dont_want/", "name": "t3_24mpcz", "created": 1399164473.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24mpcz/i_feel_like_suicide_is_my_only_choice_i_dont_want/", "author_flair_text": null, "title": "I feel like suicide is my only choice, I don't want to die but I'm hopeless.", "created_utc": 1399135673.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8lzkf", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24mpcz", "approved_by": null, "body": "I'm sorry you're feeling so low. It sounds like you're pretty hard on yourself. Remember that we're all our own worst judges.  Try and get help. Therapy can do wonders for people who are depressed. \n\nDabble in some self improvement too. Take it from me; I was overweight for years. I lost the excess weight and began grooming myself. I became more confident and life got a little better. Your's can too. Who knows what you can accomplish?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re feeling so low. It sounds like you&amp;#39;re pretty hard on yourself. Remember that we&amp;#39;re all our own worst judges.  Try and get help. Therapy can do wonders for people who are depressed. &lt;/p&gt;\n\n&lt;p&gt;Dabble in some self improvement too. Take it from me; I was overweight for years. I lost the excess weight and began grooming myself. I became more confident and life got a little better. Your&amp;#39;s can too. Who knows what you can accomplish?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mpcz", "score_hidden": false, "name": "t1_ch8lzkf", "created": 1399165270.0, "author_flair_text": null, "created_utc": 1399136470.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]