[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like I&amp;#39;ve been successful. Really, I do. I&amp;#39;m an Eagle Scout. I&amp;#39;m Assistant Scoutmaster. One of my friends in Scouting apparently thought I did well enough that he should call me mentor. I&amp;#39;m in National Honor Society. I&amp;#39;m an IB Diploma Candidate. I&amp;#39;m mostly on track to graduate high school on the &amp;quot;Distinguished&amp;quot; Plan. I&amp;#39;ve gotten into 4 colleges, and the ones that rejected me reject most people anyway, like UChicago and Johns Hopkins. One of these schools even offered me a $25,000 scholarship.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t find the willpower to do my homework, though. From freshman year, maybe even before, my grades have been more or less declining. I thought maybe I had ADHD; I tried to get a diagnosis, but I didn&amp;#39;t want to push it lest I get slapped with a nasty drug-seeking behavior tag. I don&amp;#39;t know what it is, I just can&amp;#39;t do homework. My classes used to be interesting, but all year they&amp;#39;ve just been so dull. I&amp;#39;ve even shown up high a couple times. In my junior year, I started abusing prescription stimulants, mainly Focalin and Vyvanse. This year, I started doing meth, and I&amp;#39;ve tried coke a couple times, but I think I&amp;#39;ve got a tolerance from regular meth use. Meth was great at first; I used to get a lot more work done, but now all it does is keep me up way too late, which leads to me feeling like shit the next day.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a lot of cognitive dissonance here. My dad thinks I&amp;#39;m a disappointment because I could have been a contender. If I had tried harder, I could have gotten a full ride to a school I wouldn&amp;#39;t want to attend. I&amp;#39;ve apparently fallen into a bad crowd because I&amp;#39;m a teenager who enjoys spending time with his friends and driving his car too fast. He refuses to consider the possibility that these kinds of comments might be the reason my brother empties out the liquor cabinet when he&amp;#39;s home. I haven&amp;#39;t told him about my own vices, or that I&amp;#39;m gay, or that after our latest conversation I thought about how to hang myself in my room, or at the very least pouring myself a strong drink from my own stash.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not even sure what I hope to get out of posting this. Odds are it will probably end up caught by the spam filter again, and I won&amp;#39;t care enough to message the mods or talk to my counselor about this. I guess I just thought it was important to tell someone that I thought about committing suicide tonight. I think I&amp;#39;m going to go through with that strong drink.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I feel like I've been successful. Really, I do. I'm an Eagle Scout. I'm Assistant Scoutmaster. One of my friends in Scouting apparently thought I did well enough that he should call me mentor. I'm in National Honor Society. I'm an IB Diploma Candidate. I'm mostly on track to graduate high school on the \"Distinguished\" Plan. I've gotten into 4 colleges, and the ones that rejected me reject most people anyway, like UChicago and Johns Hopkins. One of these schools even offered me a $25,000 scholarship.\n\nI can't find the willpower to do my homework, though. From freshman year, maybe even before, my grades have been more or less declining. I thought maybe I had ADHD; I tried to get a diagnosis, but I didn't want to push it lest I get slapped with a nasty drug-seeking behavior tag. I don't know what it is, I just can't do homework. My classes used to be interesting, but all year they've just been so dull. I've even shown up high a couple times. In my junior year, I started abusing prescription stimulants, mainly Focalin and Vyvanse. This year, I started doing meth, and I've tried coke a couple times, but I think I've got a tolerance from regular meth use. Meth was great at first; I used to get a lot more work done, but now all it does is keep me up way too late, which leads to me feeling like shit the next day.\n\nI've got a lot of cognitive dissonance here. My dad thinks I'm a disappointment because I could have been a contender. If I had tried harder, I could have gotten a full ride to a school I wouldn't want to attend. I've apparently fallen into a bad crowd because I'm a teenager who enjoys spending time with his friends and driving his car too fast. He refuses to consider the possibility that these kinds of comments might be the reason my brother empties out the liquor cabinet when he's home. I haven't told him about my own vices, or that I'm gay, or that after our latest conversation I thought about how to hang myself in my room, or at the very least pouring myself a strong drink from my own stash.\n\nI'm not even sure what I hope to get out of posting this. Odds are it will probably end up caught by the spam filter again, and I won't care enough to message the mods or talk to my counselor about this. I guess I just thought it was important to tell someone that I thought about committing suicide tonight. I think I'm going to go through with that strong drink.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xa46", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thejensenfeel", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xa46/i_feel_like_a_successful_failure_but_not_like/", "name": "t3_23xa46", "created": 1398426847.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xa46/i_feel_like_a_successful_failure_but_not_like/", "author_flair_text": null, "title": "I feel like a successful failure, but not like Apollo 13. Maybe failed success would be more accurate.", "created_utc": 1398398047.0, "ups": 2, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1ih1i", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch1ib0p", "approved_by": null, "body": "I think it's very important that you speak honestly and truthfully about your drug use with your psychiatrist.  Brain chemistry is a very tricky thing, and it makes a psychiatrists job all the more difficult to treat your depression if he doesn't know precisely what sorts of substances your using and how often.  A lot of drugs can CAUSE depression, so getting clean is the best route to undertake.  I also don't need to remind someone as intelligent as you are that you're playing a dangerous game by experimenting with these drugs.\nI'd be honest with your mother, too.  Tell her that right now your main concern is your mental health, not your grades.  I know school seems like a very big deal, and it is, but not at the price of your life.  Do you think you'll be able to keep this up through the stresses of university?  You need to focus on getting healthy before you can start to focus on schoolwork.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s very important that you speak honestly and truthfully about your drug use with your psychiatrist.  Brain chemistry is a very tricky thing, and it makes a psychiatrists job all the more difficult to treat your depression if he doesn&amp;#39;t know precisely what sorts of substances your using and how often.  A lot of drugs can CAUSE depression, so getting clean is the best route to undertake.  I also don&amp;#39;t need to remind someone as intelligent as you are that you&amp;#39;re playing a dangerous game by experimenting with these drugs.\nI&amp;#39;d be honest with your mother, too.  Tell her that right now your main concern is your mental health, not your grades.  I know school seems like a very big deal, and it is, but not at the price of your life.  Do you think you&amp;#39;ll be able to keep this up through the stresses of university?  You need to focus on getting healthy before you can start to focus on schoolwork.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xa46", "score_hidden": false, "name": "t1_ch1ih1i", "created": 1398406669.0, "author_flair_text": null, "created_utc": 1398403069.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1ib0p", "gilded": 0, "author": "thejensenfeel", "parent_id": "t1_ch1i4gc", "approved_by": null, "body": "No. I've only mentioned that I've used marijuana and LSD. IIRC, I mentioned LSD towards the end of the appointment, and it wasn't brought up since. I'm not worried about that, though, but perhaps I should be more concerned with the overall pattern of experimenting with drugs. I haven't dropped acid since summer, but between then and now, I've also tried MDMA and ketamine, and I've taken up smoking cigars (again, I'm not really concerned since I only smoke like once* a month). I also started meth this winter, and cocaine just this week.\n\nHonestly, I feel like he's focusing on my grades because my mom is focusing on my grades. When I came home from my last appointment, she asked if we talked about my grades, and I said that we just talked about where I was going to college. I wonder how she would react if I said, \"No, we talked about why I shouldn't kill myself.\"\n\n*Edit: or twice", "edited": 1398402858.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. I&amp;#39;ve only mentioned that I&amp;#39;ve used marijuana and LSD. IIRC, I mentioned LSD towards the end of the appointment, and it wasn&amp;#39;t brought up since. I&amp;#39;m not worried about that, though, but perhaps I should be more concerned with the overall pattern of experimenting with drugs. I haven&amp;#39;t dropped acid since summer, but between then and now, I&amp;#39;ve also tried MDMA and ketamine, and I&amp;#39;ve taken up smoking cigars (again, I&amp;#39;m not really concerned since I only smoke like once* a month). I also started meth this winter, and cocaine just this week.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I feel like he&amp;#39;s focusing on my grades because my mom is focusing on my grades. When I came home from my last appointment, she asked if we talked about my grades, and I said that we just talked about where I was going to college. I wonder how she would react if I said, &amp;quot;No, we talked about why I shouldn&amp;#39;t kill myself.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;*Edit: or twice&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xa46", "score_hidden": false, "name": "t1_ch1ib0p", "created": 1398431359.0, "author_flair_text": null, "created_utc": 1398402559.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1i4gc", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch1i1sf", "approved_by": null, "body": "I think that having thoughts of suicide constitutes a psychiatric emergency.  You can call your physicians number and state that you're having issues and you need to be seen sooner than your scheduled appointment.  It's important that you're honest with your psychiatrist about how you feel--tell your doctor that you feel that he or she is only focusing on your grades and not your mental health, which should be his or her top priority.  Have you told your psychiatrist that you're abusing stimulants?  ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that having thoughts of suicide constitutes a psychiatric emergency.  You can call your physicians number and state that you&amp;#39;re having issues and you need to be seen sooner than your scheduled appointment.  It&amp;#39;s important that you&amp;#39;re honest with your psychiatrist about how you feel--tell your doctor that you feel that he or she is only focusing on your grades and not your mental health, which should be his or her top priority.  Have you told your psychiatrist that you&amp;#39;re abusing stimulants?  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xa46", "score_hidden": false, "name": "t1_ch1i4gc", "created": 1398430821.0, "author_flair_text": null, "created_utc": 1398402021.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1i1sf", "gilded": 0, "author": "thejensenfeel", "parent_id": "t1_ch1hdj1", "approved_by": null, "body": "You know, I just had an appointment with my psychologist Wednesday. Every time I go to see him, I don't feel as bad, or worse, I do, but we spend the whole hour talking about how to improve my grades instead of how to improve my mental health, and I can never work it up enough to tell him, which is really a waste of my parents' money considering that's exactly how I'm supposed to use my appointments. I used to just fork over my journal and let him read it, but I haven't done that lately. Similarly, there are a lot of times I want to quit meth, but every time I go, I suddenly don't want to quit, so I don't show him the journal entry all about how much I want to quit, and I often just delete the entry since it's all on my iPad. In fact, it usually feels like I only spend maybe 3 days of the month sincerely wanting to quit; the rest of the time I'm either apathetic towards the prospect of quitting, or opposed to it. I guess next time I should actually come clean and start to get clean, but my next appointment isn't for another two weeks.\n\nOf course, the latter part may just be because I actually wanted to quit Focalin. I'd usually write about quitting during a comedown, and Focalin comedowns were always the worst.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, I just had an appointment with my psychologist Wednesday. Every time I go to see him, I don&amp;#39;t feel as bad, or worse, I do, but we spend the whole hour talking about how to improve my grades instead of how to improve my mental health, and I can never work it up enough to tell him, which is really a waste of my parents&amp;#39; money considering that&amp;#39;s exactly how I&amp;#39;m supposed to use my appointments. I used to just fork over my journal and let him read it, but I haven&amp;#39;t done that lately. Similarly, there are a lot of times I want to quit meth, but every time I go, I suddenly don&amp;#39;t want to quit, so I don&amp;#39;t show him the journal entry all about how much I want to quit, and I often just delete the entry since it&amp;#39;s all on my iPad. In fact, it usually feels like I only spend maybe 3 days of the month sincerely wanting to quit; the rest of the time I&amp;#39;m either apathetic towards the prospect of quitting, or opposed to it. I guess next time I should actually come clean and start to get clean, but my next appointment isn&amp;#39;t for another two weeks.&lt;/p&gt;\n\n&lt;p&gt;Of course, the latter part may just be because I actually wanted to quit Focalin. I&amp;#39;d usually write about quitting during a comedown, and Focalin comedowns were always the worst.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xa46", "score_hidden": false, "name": "t1_ch1i1sf", "created": 1398430599.0, "author_flair_text": null, "created_utc": 1398401799.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1hdj1", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23xa46", "approved_by": null, "body": "It sounds to me like you have a lot of symptoms of clinical depression.  Your lack of interest in your schoolwork, your feelings of low self-worth, and your use of stimulants to change your mood.  Please consider talking to a mental health professional about your suicidal feelings, because by any objective measure, you are very much a contender.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like you have a lot of symptoms of clinical depression.  Your lack of interest in your schoolwork, your feelings of low self-worth, and your use of stimulants to change your mood.  Please consider talking to a mental health professional about your suicidal feelings, because by any objective measure, you are very much a contender.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xa46", "score_hidden": false, "name": "t1_ch1hdj1", "created": 1398428721.0, "author_flair_text": null, "created_utc": 1398399921.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]