[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Things are falling apart. They have been for years, but they&amp;#39;re accelerating now, and I don&amp;#39;t have the energy or the desire to turn them around as quickly as they need to be.&lt;/p&gt;\n\n&lt;p&gt;I am supposed to graduate from Columbia in a couple of weeks. I say &amp;quot;supposed to&amp;quot; because it&amp;#39;s not clear whether I&amp;#39;m going to pass my required classes yet. In fact, it&amp;#39;s pretty unlikely given the state of mind I&amp;#39;ve been stuck in.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve just lost the energy to do anything. And not doing anything is keeping me depressed. I&amp;#39;ve been sleeping for around 16 hours a day, and have become almost completely confined to my room/bed, when everyone I know is reveling in the last few weeks of classes. Any time I force myself to go outside and socialize doesn&amp;#39;t feel happy; it feels like distraction from how dismal my situation truly is. So I&amp;#39;ve stopped going outside. It&amp;#39;s easier to pretend to feel fine through Facebook and text messages anyway.&lt;/p&gt;\n\n&lt;p&gt;Therapy and medication haven&amp;#39;t worked. The doctors are fine (I&amp;#39;ve been seeing two at a time for a year), but I get the impression that their idea of helping me with my problems has been to distract me from feeling suicidal until I graduate. Any time I express how angry I am at myself for ruining my life that had been perfectly on track up until two years ago, they tell me &amp;quot;Just get to graduation, and worry about figuring out why you&amp;#39;re feeling this way later.&amp;quot; So I&amp;#39;ve stopped going to see them. And I&amp;#39;ve stopped taking the medication. There&amp;#39;s been no change for the worse, but bad has been my resting pulse for longer than I can remember.&lt;/p&gt;\n\n&lt;p&gt;It feels like I have an attention span and energy that is severely limited. I&amp;#39;ve repeatedly told my parents and multiple therapists, I just feel dumber. They don&amp;#39;t believe me. Things that I know I could have learned a few years ago are simply beyond my grasp now. There was a time when I could have seen myself at the top of my class, as I was in high school. My grades reflected that in my first two years of college, but have since taken a dive to the point where I might fail every class I&amp;#39;ve taken this semester.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;ve found out that a number of my friends are magna cum laude, and one received a Fulbright scholarship. These were people whose grades I could compete with for the first two years of education. Now I&amp;#39;m a shut-in and a failure while they&amp;#39;re set up to do amazing things. A couple of them still invite me to hang out, but I&amp;#39;m too ashamed to respond.&lt;/p&gt;\n\n&lt;p&gt;It feels like there&amp;#39;s this asshole in my life who&amp;#39;s holding me back, and keeps me from ever doing anything that could make me feel good about myself, but that person is me. I want that person to suffer and die for what he&amp;#39;s done to such a promising individual. (Did I mention I was voted &amp;quot;most likely to succeed&amp;quot; in high school? What a joke.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Things are falling apart. They have been for years, but they're accelerating now, and I don't have the energy or the desire to turn them around as quickly as they need to be.\n\nI am supposed to graduate from Columbia in a couple of weeks. I say \"supposed to\" because it's not clear whether I'm going to pass my required classes yet. In fact, it's pretty unlikely given the state of mind I've been stuck in.\n\nI've just lost the energy to do anything. And not doing anything is keeping me depressed. I've been sleeping for around 16 hours a day, and have become almost completely confined to my room/bed, when everyone I know is reveling in the last few weeks of classes. Any time I force myself to go outside and socialize doesn't feel happy; it feels like distraction from how dismal my situation truly is. So I've stopped going outside. It's easier to pretend to feel fine through Facebook and text messages anyway.\n\nTherapy and medication haven't worked. The doctors are fine (I've been seeing two at a time for a year), but I get the impression that their idea of helping me with my problems has been to distract me from feeling suicidal until I graduate. Any time I express how angry I am at myself for ruining my life that had been perfectly on track up until two years ago, they tell me \"Just get to graduation, and worry about figuring out why you're feeling this way later.\" So I've stopped going to see them. And I've stopped taking the medication. There's been no change for the worse, but bad has been my resting pulse for longer than I can remember.\n\nIt feels like I have an attention span and energy that is severely limited. I've repeatedly told my parents and multiple therapists, I just feel dumber. They don't believe me. Things that I know I could have learned a few years ago are simply beyond my grasp now. There was a time when I could have seen myself at the top of my class, as I was in high school. My grades reflected that in my first two years of college, but have since taken a dive to the point where I might fail every class I've taken this semester.\n\nNow I've found out that a number of my friends are magna cum laude, and one received a Fulbright scholarship. These were people whose grades I could compete with for the first two years of education. Now I'm a shut-in and a failure while they're set up to do amazing things. A couple of them still invite me to hang out, but I'm too ashamed to respond.\n\nIt feels like there's this asshole in my life who's holding me back, and keeps me from ever doing anything that could make me feel good about myself, but that person is me. I want that person to suffer and die for what he's done to such a promising individual. (Did I mention I was voted \"most likely to succeed\" in high school? What a joke.)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24utx9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "pheasantplucker92", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24utx9/i_give_me_a_couple_weeks_tops/", "name": "t3_24utx9", "created": 1399405022.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24utx9/i_give_me_a_couple_weeks_tops/", "author_flair_text": null, "title": "I give me a couple weeks, tops.", "created_utc": 1399376222.0, "ups": 7, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chavphx", "gilded": 0, "author": "TryToFlyHigh", "parent_id": "t3_24utx9", "approved_by": null, "body": "Don't be mad at the man you see in the mirror. I recognize a lot in the way you describe yourself, and before you dismiss this: English isn't my first language.\n\nI am quite dreamy, please bear with me here. I'll explain me, and hope you can see a bit of you.\n\nSo I am quite dreamy. My thoughts are like a hurricane, always a few blowing around at the same time. When these thoughts align, I propel forth like a rocket. When they don't, I'm 'set back' to being normal. The power of the mind is able to distil whatever the fuck it was that was going on, but any thoughts that were already further get deleted.\n\nNow this is part of my story. I've lived like this my entire life, sometimes I just forget what I was talking about and have to have people remind me.\n\nWhy is this important? Because I am not who I think I am. My mind works, if I want it to work or not. So am I this being, this entity that roams earth? Yes, I am. No matter what my mind does, I call the shots. Sure, biased by my brain all the time, but I still call the shots. I am not what I think. I am not what I do.\n\nI am this person, and my subconscious has a great power over me. It is an entity of its own, it coexists within me.\n\nHave you ever heard about lucid dreaming? It is a state of mind, while sleeping ofcourse, where you are actually aware of the fact that you are dreaming and you have 'full' control. You still don't, there is allways your subconscious. So you control yourself in this dream, but you will probably still meet people.\n\nNow, what will these people answer if you ask them things about yourself? Will they even answer you, or will they shun you? Do you want them to talk to you?\n\nExperience yourself, before you dismiss yourself. There is more to you than what meets the eye. There is more than excellence. There is more than plain sorrow. \n\nDon't defeat yourself, work together with yourself. Find yourself.\n\nI'm terribly sorry about my spelling and all that, I hope this 'story' reached to someplace inside you. That's the message I want to bring across, search yourself for what is not you but influences you. This distinction is vital, vital for accepting who you are.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be mad at the man you see in the mirror. I recognize a lot in the way you describe yourself, and before you dismiss this: English isn&amp;#39;t my first language.&lt;/p&gt;\n\n&lt;p&gt;I am quite dreamy, please bear with me here. I&amp;#39;ll explain me, and hope you can see a bit of you.&lt;/p&gt;\n\n&lt;p&gt;So I am quite dreamy. My thoughts are like a hurricane, always a few blowing around at the same time. When these thoughts align, I propel forth like a rocket. When they don&amp;#39;t, I&amp;#39;m &amp;#39;set back&amp;#39; to being normal. The power of the mind is able to distil whatever the fuck it was that was going on, but any thoughts that were already further get deleted.&lt;/p&gt;\n\n&lt;p&gt;Now this is part of my story. I&amp;#39;ve lived like this my entire life, sometimes I just forget what I was talking about and have to have people remind me.&lt;/p&gt;\n\n&lt;p&gt;Why is this important? Because I am not who I think I am. My mind works, if I want it to work or not. So am I this being, this entity that roams earth? Yes, I am. No matter what my mind does, I call the shots. Sure, biased by my brain all the time, but I still call the shots. I am not what I think. I am not what I do.&lt;/p&gt;\n\n&lt;p&gt;I am this person, and my subconscious has a great power over me. It is an entity of its own, it coexists within me.&lt;/p&gt;\n\n&lt;p&gt;Have you ever heard about lucid dreaming? It is a state of mind, while sleeping ofcourse, where you are actually aware of the fact that you are dreaming and you have &amp;#39;full&amp;#39; control. You still don&amp;#39;t, there is allways your subconscious. So you control yourself in this dream, but you will probably still meet people.&lt;/p&gt;\n\n&lt;p&gt;Now, what will these people answer if you ask them things about yourself? Will they even answer you, or will they shun you? Do you want them to talk to you?&lt;/p&gt;\n\n&lt;p&gt;Experience yourself, before you dismiss yourself. There is more to you than what meets the eye. There is more than excellence. There is more than plain sorrow. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t defeat yourself, work together with yourself. Find yourself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m terribly sorry about my spelling and all that, I hope this &amp;#39;story&amp;#39; reached to someplace inside you. That&amp;#39;s the message I want to bring across, search yourself for what is not you but influences you. This distinction is vital, vital for accepting who you are.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24utx9", "score_hidden": false, "name": "t1_chavphx", "created": 1399408233.0, "author_flair_text": null, "created_utc": 1399379433.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]