[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I could ramble on forever but I&amp;#39;ll save anyone reading the trouble. Peaked as a kid, got fat, is gay, short, small hands, 0 talent, look like a cabbage patch kid, 185 lbs. and 5&amp;#39;7&amp;quot;. Auto-immune disorder called morphea on the smack dab middle of my torso, will most likely disfigure the rest of me including my face as I hit middle-age, no cure, no treatment, nothing known. Whiney, will never be loved by the already small minority of people that could like me, horrible shit genetics will probably cause me to die early anyways. Underbite that came back the same after I underwent 6 1/2 years hardcore orthodontiocs, thus a lisp, pig nose, bug eyes, low set eyebrows, small forehead that forces me to wear bangs otherwise I look like a f***ing downer. Poofy hair that I can&amp;#39;t cut because I&amp;#39;m fucking ugly. And best of all have never had any sort of drive to accomplish anything since I can remember. Twin sister has drive, worked hard in IB classes, is in college. I can&amp;#39;t even bring myself to go into public. There&amp;#39;s no fix because I will literally always be me. Now mother dearest is mad at me because I refuse to go in for a psyche consultation because I have given up. If she asks me to leave I will, I will not threaten suicide. I&amp;#39;ll probably wait a few years longer until I am alone so I can hide myself when I do it. I&amp;#39;m done feeling so incredibly embarrassed. Not only am I ridiculous-looking, a faggot, and a waste of space, but yet people probably acknowledge how fucking pathetic it is I can&amp;#39;t move on. What is there to move on from? Myself? I can&amp;#39;t run away from being me. I do not blame &amp;quot;the world&amp;quot;, &amp;quot;society&amp;quot;, or &amp;quot;fitting in&amp;quot;, or any of that garbage. I blame my parents for having me and I guess just myself for existing. I absolutely 100% cannot stand looking, feeling, and BEING like this for the rest of my life. I&amp;#39;ve spent nights vomiting because I hate myself so much. There is no cure, there is no fake-it-&amp;#39;till-you-feel-it, there is only nothingness now.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I could ramble on forever but I'll save anyone reading the trouble. Peaked as a kid, got fat, is gay, short, small hands, 0 talent, look like a cabbage patch kid, 185 lbs. and 5'7\". Auto-immune disorder called morphea on the smack dab middle of my torso, will most likely disfigure the rest of me including my face as I hit middle-age, no cure, no treatment, nothing known. Whiney, will never be loved by the already small minority of people that could like me, horrible shit genetics will probably cause me to die early anyways. Underbite that came back the same after I underwent 6 1/2 years hardcore orthodontiocs, thus a lisp, pig nose, bug eyes, low set eyebrows, small forehead that forces me to wear bangs otherwise I look like a f***ing downer. Poofy hair that I can't cut because I'm fucking ugly. And best of all have never had any sort of drive to accomplish anything since I can remember. Twin sister has drive, worked hard in IB classes, is in college. I can't even bring myself to go into public. There's no fix because I will literally always be me. Now mother dearest is mad at me because I refuse to go in for a psyche consultation because I have given up. If she asks me to leave I will, I will not threaten suicide. I'll probably wait a few years longer until I am alone so I can hide myself when I do it. I'm done feeling so incredibly embarrassed. Not only am I ridiculous-looking, a faggot, and a waste of space, but yet people probably acknowledge how fucking pathetic it is I can't move on. What is there to move on from? Myself? I can't run away from being me. I do not blame \"the world\", \"society\", or \"fitting in\", or any of that garbage. I blame my parents for having me and I guess just myself for existing. I absolutely 100% cannot stand looking, feeling, and BEING like this for the rest of my life. I've spent nights vomiting because I hate myself so much. There is no cure, there is no fake-it-'till-you-feel-it, there is only nothingness now.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25c4e5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "getcrushed", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25c4e5/i_give_up_i_guess/", "name": "t3_25c4e5", "created": 1399899447.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25c4e5/i_give_up_i_guess/", "author_flair_text": null, "title": "I give up I guess.", "created_utc": 1399870647.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfqesh", "gilded": 0, "author": "Follow214", "parent_id": "t3_25c4e5", "approved_by": null, "body": "Hey, would you like to talk?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, would you like to talk?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c4e5", "score_hidden": false, "name": "t1_chfqesh", "created": 1399900020.0, "author_flair_text": null, "created_utc": 1399871220.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]