[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After much consideration and apathy a couple months ago (see &lt;a href=\"http://www.reddit.com/r/SuicideWatch/comments/1yp0cn/getting_close/\"&gt;this post&lt;/a&gt;) I attempted suicide and ended up in the ER, then hospitalized for 72 hours and put on medications. This just left me with medical debt and shame. Nothing has been the same since then. Nothing has gotten better. &lt;/p&gt;\n\n&lt;p&gt;Before, back in February, I was months away from graduation (my last 6 credits)and staying afloat in a job. After I got released from the hospital, I worked out ways to make up work with my professors and go back to work, and it seemed like maybe there was a way back from all of it; that I hadn&amp;#39;t screwed everything up for good. I worked my ass off to make up for missed work at work and in one of my classes. I even went and have been going to counseling. While I have blindly trudged on and focused on things like work, I have been even more miserable than usual at times (see &lt;a href=\"http://www.reddit.com/r/SuicideWatch/comments/21hn4z/soon/\"&gt;this post&lt;/a&gt;) and now I&amp;#39;ve just gotten to the point of total apathy again. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m completely overwhelmed right now. I ignored the due date for a big semester project for the class I have actually been going to and now I can&amp;#39;t possibly complete it, not that I had the motivation in the first place. I&amp;#39;ll probably fail. The other class: I completely blew off and procrastinated following up with the professor past the one time after the hospital that I met with him, and the semester ends next week so it&amp;#39;s probably too late to arrange anything now.  The class also is only offered in spring, so there&amp;#39;s no chance of retaking it next semester. My work contract ends after next week. While I&amp;#39;ve already singlehandedly delivered and deployed a large scale web application in the past month, recent additions in testing have proved to be more than I can handle so I&amp;#39;m leaving everything a mess for my successors. Another failure there. I have been avoiding work and don&amp;#39;t know if I&amp;#39;ll be able to finish this last week or so.&lt;/p&gt;\n\n&lt;p&gt;All that awaits me is unemployment and having failed the perfectly good opportunities I was given to make up my classes. Plus the unknown and growing sum of medical debt and 30k in student loans that I will need to start paying off. I don&amp;#39;t really care about anything anymore. I see no point in the future and the present is worth escaping.&lt;/p&gt;\n\n&lt;p&gt;I give up.&lt;/p&gt;\n\n&lt;p&gt;I wanted to be known as someone who never complained. In death I wanted to be remembered as someone who didn&amp;#39;t complain or seek attention or help even though I was so desperate I needed to die. As if there were some prize for that or something. Now I am only pathetic. &lt;/p&gt;\n\n&lt;p&gt;I feel like a don&amp;#39;t really have the right anymore to be taken seriously since I&amp;#39;ve been so close before and either failed or didn&amp;#39;t follow through. I&amp;#39;ve continually fucked up dying. I had wanted to avoid doing anything for awhile because in May there are family and friend birthdays that I don&amp;#39;t want to ruin. I&amp;#39;m going to try and consider waiting until June but I don&amp;#39;t know anymore. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve appreciated all of your input in the past, so thank you for that and thank you for reading this post.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After much consideration and apathy a couple months ago (see [this post](http://www.reddit.com/r/SuicideWatch/comments/1yp0cn/getting_close/)) I attempted suicide and ended up in the ER, then hospitalized for 72 hours and put on medications. This just left me with medical debt and shame. Nothing has been the same since then. Nothing has gotten better. \n\nBefore, back in February, I was months away from graduation (my last 6 credits)and staying afloat in a job. After I got released from the hospital, I worked out ways to make up work with my professors and go back to work, and it seemed like maybe there was a way back from all of it; that I hadn't screwed everything up for good. I worked my ass off to make up for missed work at work and in one of my classes. I even went and have been going to counseling. While I have blindly trudged on and focused on things like work, I have been even more miserable than usual at times (see [this post](http://www.reddit.com/r/SuicideWatch/comments/21hn4z/soon/)) and now I've just gotten to the point of total apathy again. \n\n\nI'm completely overwhelmed right now. I ignored the due date for a big semester project for the class I have actually been going to and now I can't possibly complete it, not that I had the motivation in the first place. I'll probably fail. The other class: I completely blew off and procrastinated following up with the professor past the one time after the hospital that I met with him, and the semester ends next week so it's probably too late to arrange anything now.  The class also is only offered in spring, so there's no chance of retaking it next semester. My work contract ends after next week. While I've already singlehandedly delivered and deployed a large scale web application in the past month, recent additions in testing have proved to be more than I can handle so I'm leaving everything a mess for my successors. Another failure there. I have been avoiding work and don't know if I'll be able to finish this last week or so.\n\nAll that awaits me is unemployment and having failed the perfectly good opportunities I was given to make up my classes. Plus the unknown and growing sum of medical debt and 30k in student loans that I will need to start paying off. I don't really care about anything anymore. I see no point in the future and the present is worth escaping.\n\nI give up.\n\nI wanted to be known as someone who never complained. In death I wanted to be remembered as someone who didn't complain or seek attention or help even though I was so desperate I needed to die. As if there were some prize for that or something. Now I am only pathetic. \n\nI feel like a don't really have the right anymore to be taken seriously since I've been so close before and either failed or didn't follow through. I've continually fucked up dying. I had wanted to avoid doing anything for awhile because in May there are family and friend birthdays that I don't want to ruin. I'm going to try and consider waiting until June but I don't know anymore. \n\nI've appreciated all of your input in the past, so thank you for that and thank you for reading this post.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24azjf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "silent_sin", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24azjf/i_give_up/", "name": "t3_24azjf", "created": 1398830386.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24azjf/i_give_up/", "author_flair_text": null, "title": "I give up.", "created_utc": 1398801586.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5g6jr", "gilded": 0, "author": "silent_sin", "parent_id": "t1_ch5c2fa", "approved_by": null, "body": "Thank you for your reply. Sorry to hear that you've been in the same sort of a situation. It is stressful. Before I do anything I think I'll try to figure out this week whether taking some time off, ridding stress, and putting off these last classes is a valid option. I don't know what's involved in getting unemployment but I would assume I'm ineligible since I have been receiving financial aid and also my parents (illegally) claim me as a dependent. I'll have to look into it.\n\nI appreciate the encouragement and willingness to talk to me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply. Sorry to hear that you&amp;#39;ve been in the same sort of a situation. It is stressful. Before I do anything I think I&amp;#39;ll try to figure out this week whether taking some time off, ridding stress, and putting off these last classes is a valid option. I don&amp;#39;t know what&amp;#39;s involved in getting unemployment but I would assume I&amp;#39;m ineligible since I have been receiving financial aid and also my parents (illegally) claim me as a dependent. I&amp;#39;ll have to look into it.&lt;/p&gt;\n\n&lt;p&gt;I appreciate the encouragement and willingness to talk to me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24azjf", "score_hidden": false, "name": "t1_ch5g6jr", "created": 1398839918.0, "author_flair_text": null, "created_utc": 1398811118.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5c2fa", "gilded": 0, "author": "The0egg", "parent_id": "t3_24azjf", "approved_by": null, "body": "Hello! Sorry to hear about your recent issues with class and work. \n\nI find myself in a similar situation. Last month I had hit a pretty low point in my academic and personal life. I actually discovered this sub-reddit after feeling compelled to end my own life. \n\nFrom what you've said here, it sounds like dealing with a lot of stress. Stress often leads to apathy (for me) which just perpetuates and build up the stress. You might want to take some time off (like months off) and recover and figure where your stress is coming from and how to be rid of it. \n\nAs far as your financial and academic situation, hopefully you can get some unemployment (which I've used myself and it rules). And for the school thing, you can likely give your semester another go. I'm going to fail pretty much all my classes this semester, but after talking to an adviser, I was able to relieve the burden of that failure. \n\nI hope you find a way to help yourself get better. I will try to reply if you comment. You can also send me a private message if you want to talk to someone. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello! Sorry to hear about your recent issues with class and work. &lt;/p&gt;\n\n&lt;p&gt;I find myself in a similar situation. Last month I had hit a pretty low point in my academic and personal life. I actually discovered this sub-reddit after feeling compelled to end my own life. &lt;/p&gt;\n\n&lt;p&gt;From what you&amp;#39;ve said here, it sounds like dealing with a lot of stress. Stress often leads to apathy (for me) which just perpetuates and build up the stress. You might want to take some time off (like months off) and recover and figure where your stress is coming from and how to be rid of it. &lt;/p&gt;\n\n&lt;p&gt;As far as your financial and academic situation, hopefully you can get some unemployment (which I&amp;#39;ve used myself and it rules). And for the school thing, you can likely give your semester another go. I&amp;#39;m going to fail pretty much all my classes this semester, but after talking to an adviser, I was able to relieve the burden of that failure. &lt;/p&gt;\n\n&lt;p&gt;I hope you find a way to help yourself get better. I will try to reply if you comment. You can also send me a private message if you want to talk to someone. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24azjf", "score_hidden": false, "name": "t1_ch5c2fa", "created": 1398831664.0, "author_flair_text": null, "created_utc": 1398802864.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7gjed", "gilded": 0, "author": "Hopeless_profx", "parent_id": "t3_24azjf", "approved_by": null, "body": "Please don't give up.\n\nThere's no easy way around it, but if it's school that you're most concerned with, please do what you can to go speak to a department director or even a TA during their office hours.\n\nIt seems frightening, and definitely uncomfortable at first, but I've found that this helps tremendously and they really are very insightful and encouraging. \n\nI was struggling this last year and finally decided to approach a department director after emailing to set up a meeting. She wound up being so supportive and I left feeling a hundred times better. It encouraged me to go speak to another department director and TAs as well. They are the ones that can guide you towards making changes. All it takes is some initial outreach from you.\n\nJust know that you are not alone. And it definitely is not worth taking your life over. School is stressful. Being on financial aid while struggling with academic is also stressful. The thought of disappointing your parents (and feeling like a failure overall) is numbing. But we can get through it! It will take some longer than others, but if we take proactive measures, chances are you'll wind up in a better place.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t give up.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no easy way around it, but if it&amp;#39;s school that you&amp;#39;re most concerned with, please do what you can to go speak to a department director or even a TA during their office hours.&lt;/p&gt;\n\n&lt;p&gt;It seems frightening, and definitely uncomfortable at first, but I&amp;#39;ve found that this helps tremendously and they really are very insightful and encouraging. &lt;/p&gt;\n\n&lt;p&gt;I was struggling this last year and finally decided to approach a department director after emailing to set up a meeting. She wound up being so supportive and I left feeling a hundred times better. It encouraged me to go speak to another department director and TAs as well. They are the ones that can guide you towards making changes. All it takes is some initial outreach from you.&lt;/p&gt;\n\n&lt;p&gt;Just know that you are not alone. And it definitely is not worth taking your life over. School is stressful. Being on financial aid while struggling with academic is also stressful. The thought of disappointing your parents (and feeling like a failure overall) is numbing. But we can get through it! It will take some longer than others, but if we take proactive measures, chances are you&amp;#39;ll wind up in a better place.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24azjf", "score_hidden": false, "name": "t1_ch7gjed", "created": 1399029944.0, "author_flair_text": null, "created_utc": 1399001144.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]