[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It is just past 4:00 a.m. I can not sleep as I spent all of my day Saturday doing that waisting time until I have to go back to school and see my so called &amp;quot;friend&amp;quot; again.&lt;/p&gt;\n\n&lt;p&gt;She really hurt me this time. She was mad Friday, I understand that, her mother walked out when she was just little, but she was old enough to remember. Her mother said she would return, yet sometimes people lie just to make their lives easier. But after trying to get her to understand the situation I&amp;#39;m in, she just doesn&amp;#39;t care, and now I know. ( &lt;a href=\"http://i.imgur.com/zAUTjUe\"&gt;http://i.imgur.com/zAUTjUe&lt;/a&gt; )&lt;/p&gt;\n\n&lt;p&gt;I have always been the person you could talk to. Nobody ever realised it, but I was the person that was always there for you.I will talk to you about anything you want. I will give you relationship advice, life advice, anything you will think of, I was always there.&lt;/p&gt;\n\n&lt;p&gt;Yet I have now noticed that no one is there to talk to me. Nobody ever asked how my day has been or how I&amp;#39;m doing with school. It breaks my heart that I put as much effort as I can into people that don&amp;#39;t care about me.&lt;/p&gt;\n\n&lt;p&gt;This friend of mine.I told her that under no circumstance would I ever lie to her. I promised myself that I would never lie even if it kill me. The first thing she asked me was &amp;quot;Do you like me?&amp;quot; I said yes, and she pushed that aside like it meant nothing. She doesn&amp;#39;t seem care how I feel. My only friend in the entire world doesn&amp;#39;t give a single fuck about how I feel.&lt;/p&gt;\n\n&lt;p&gt;I have put my heart, my entire soul into making people happy, and they do nothing except punch me and expect more in return.&lt;/p&gt;\n\n&lt;p&gt;I am about the graduate from high school. On the 11th of June, I will walk down a stage where people will cheer and be happy for me that I have completed something in my life.&lt;/p&gt;\n\n&lt;p&gt;If after being congratulated and being around family doesn&amp;#39;t make me feel better, I&amp;#39;m afraid of what I will do.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t thought of a plan yet, which I guess is a good thing. There is no real way for me to leave this world without hurting someone I care about.&lt;/p&gt;\n\n&lt;p&gt;Have you ever been able to not cry? To just sit there on the verge of years, yet nothing happens. It feels like your emotions are being bottled up. And my bottle isn&amp;#39;t far from breaking. The constant anxiety I have. From the minute I wake up to the minute I fall asleep, constant, constant, constant anxiety. &lt;/p&gt;\n\n&lt;p&gt;Every day it is the same thing. Eat cereal, FUCKING ANXIETY, go to school, FUCKING ANXIETY, homework, FUCKING ANXIETY. Every single thing I have ever done has been full of fear and anxiety. I&amp;#39;m tired of it and I would do anything to make it stop. Medication doesn&amp;#39;t seem to help. Therapy doesn&amp;#39;t help. Nothing I can do will stop this pain I am feeling.&lt;/p&gt;\n\n&lt;p&gt;There is still so much I want to do in the time left on my life. I planned to adopt a girl from an orphanage. I wanted to make her feel like the princess she deserves to be. I want her to know that I care and will always be there for her. I have been figuring out how I can adopt someone. It almost brings me to tears knowing that there are children people just give away and didn&amp;#39;t give two shits about. It breaks my heart knowing that these children, who are even my age (17) have never had a family.&lt;/p&gt;\n\n&lt;p&gt;I was looking through people that could be adopted and one person caught my eye more than all of them. A girl the same age as me. She had a blue streak in her hair. As I read the bio of this girl, I was shocked. She was a straight A student, she played volleyball, she had a great talent for music. I found it unbelievable that she was never adopted. As I kept reading, I saw that one word. THERAPY. That is why she was never chosen. I was so close to just ending it there because I was so mad.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I&amp;#39;m going to do after high school. My parents are moving and I told them I would not go. I don&amp;#39;t have enough money for a place to stay and I&amp;#39;m unable to get a job. I am afraid to end up homeless. To beg for money and once again be thrown away like I&amp;#39;m a piece of trash. I won&amp;#39;t be able to control my actions if that happens.&lt;/p&gt;\n\n&lt;p&gt;My so called friend won&amp;#39;t even let me stay at her house for a night, and I have nobody else to turn to.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been typing for an hour now so I guess I should get to the point. As I&amp;#39;m sure you&amp;#39;re tired of listening to me talk just like everyone else.&lt;/p&gt;\n\n&lt;p&gt;I have just wanted that one single person...\nThat one person that I can talk to when I&amp;#39;m feeling down...\nThat one person that will truly want to be my friend...\nThat one person that will listen...\nThat one person that I can love and be happy with...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to try and sleep now. Maybe when I come back, I&amp;#39;ll have someone to talk to about... anything really.&lt;/p&gt;\n\n&lt;p&gt;I hope you have a good day.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Spelling, punctuation, etc.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It is just past 4:00 a.m. I can not sleep as I spent all of my day Saturday doing that waisting time until I have to go back to school and see my so called \"friend\" again.\n\nShe really hurt me this time. She was mad Friday, I understand that, her mother walked out when she was just little, but she was old enough to remember. Her mother said she would return, yet sometimes people lie just to make their lives easier. But after trying to get her to understand the situation I'm in, she just doesn't care, and now I know. ( http://i.imgur.com/zAUTjUe )\n\nI have always been the person you could talk to. Nobody ever realised it, but I was the person that was always there for you.I will talk to you about anything you want. I will give you relationship advice, life advice, anything you will think of, I was always there.\n\nYet I have now noticed that no one is there to talk to me. Nobody ever asked how my day has been or how I'm doing with school. It breaks my heart that I put as much effort as I can into people that don't care about me.\n\nThis friend of mine.I told her that under no circumstance would I ever lie to her. I promised myself that I would never lie even if it kill me. The first thing she asked me was \"Do you like me?\" I said yes, and she pushed that aside like it meant nothing. She doesn't seem care how I feel. My only friend in the entire world doesn't give a single fuck about how I feel.\n\nI have put my heart, my entire soul into making people happy, and they do nothing except punch me and expect more in return.\n\nI am about the graduate from high school. On the 11th of June, I will walk down a stage where people will cheer and be happy for me that I have completed something in my life.\n\nIf after being congratulated and being around family doesn't make me feel better, I'm afraid of what I will do.\n\nI haven't thought of a plan yet, which I guess is a good thing. There is no real way for me to leave this world without hurting someone I care about.\n\nHave you ever been able to not cry? To just sit there on the verge of years, yet nothing happens. It feels like your emotions are being bottled up. And my bottle isn't far from breaking. The constant anxiety I have. From the minute I wake up to the minute I fall asleep, constant, constant, constant anxiety. \n\nEvery day it is the same thing. Eat cereal, FUCKING ANXIETY, go to school, FUCKING ANXIETY, homework, FUCKING ANXIETY. Every single thing I have ever done has been full of fear and anxiety. I'm tired of it and I would do anything to make it stop. Medication doesn't seem to help. Therapy doesn't help. Nothing I can do will stop this pain I am feeling.\n\nThere is still so much I want to do in the time left on my life. I planned to adopt a girl from an orphanage. I wanted to make her feel like the princess she deserves to be. I want her to know that I care and will always be there for her. I have been figuring out how I can adopt someone. It almost brings me to tears knowing that there are children people just give away and didn't give two shits about. It breaks my heart knowing that these children, who are even my age (17) have never had a family.\n\nI was looking through people that could be adopted and one person caught my eye more than all of them. A girl the same age as me. She had a blue streak in her hair. As I read the bio of this girl, I was shocked. She was a straight A student, she played volleyball, she had a great talent for music. I found it unbelievable that she was never adopted. As I kept reading, I saw that one word. THERAPY. That is why she was never chosen. I was so close to just ending it there because I was so mad.\n\nI don't know what I'm going to do after high school. My parents are moving and I told them I would not go. I don't have enough money for a place to stay and I'm unable to get a job. I am afraid to end up homeless. To beg for money and once again be thrown away like I'm a piece of trash. I won't be able to control my actions if that happens.\n\nMy so called friend won't even let me stay at her house for a night, and I have nobody else to turn to.\n\nI've been typing for an hour now so I guess I should get to the point. As I'm sure you're tired of listening to me talk just like everyone else.\n\nI have just wanted that one single person...\nThat one person that I can talk to when I'm feeling down...\nThat one person that will truly want to be my friend...\nThat one person that will listen...\nThat one person that I can love and be happy with...\n\nI'm going to try and sleep now. Maybe when I come back, I'll have someone to talk to about... anything really.\n\nI hope you have a good day.\n\nEDIT: Spelling, punctuation, etc.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259xhm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nweref", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399854972.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259xhm/i_have_just_wanted_that_one_single_person/", "name": "t3_259xhm", "created": 1399839742.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259xhm/i_have_just_wanted_that_one_single_person/", "author_flair_text": null, "title": "I have just wanted that one single person...", "created_utc": 1399810942.0, "ups": 1, "num_comments": 10, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfd8k6", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chfa1pz", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chfd8k6", "created": 1399866508.0, "author_flair_text": null, "created_utc": 1399837708.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfa1pz", "gilded": 0, "author": "nweref", "parent_id": "t1_chf5a8f", "approved_by": null, "body": "Currently I am part of a group to get help clean up my school (and by group it's mostly me). It gets lonely walking around seeing everyone have fun with their friends, but I know what I'm doing helps, even if it's not that much, so it still keeps my spirits high(er). It's nice to know that you believe I can do what I really want. That encourages me more than you know.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Currently I am part of a group to get help clean up my school (and by group it&amp;#39;s mostly me). It gets lonely walking around seeing everyone have fun with their friends, but I know what I&amp;#39;m doing helps, even if it&amp;#39;s not that much, so it still keeps my spirits high(er). It&amp;#39;s nice to know that you believe I can do what I really want. That encourages me more than you know.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chfa1pz", "created": 1399858297.0, "author_flair_text": null, "created_utc": 1399829497.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf5a8f", "gilded": 0, "author": "[deleted]", "parent_id": "t3_259xhm", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chf5a8f", "created": 1399844446.0, "author_flair_text": null, "created_utc": 1399815646.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfk0mx", "gilded": 0, "author": "nweref", "parent_id": "t1_chf975p", "approved_by": null, "body": "You're the only person that has ever told me that I am a good person. Thank you for that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re the only person that has ever told me that I am a good person. Thank you for that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chfk0mx", "created": 1399883834.0, "author_flair_text": null, "created_utc": 1399855034.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf975p", "gilded": 0, "author": "throway8420", "parent_id": "t1_chf926u", "approved_by": null, "body": "All I see in your post is what a good person you are.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All I see in your post is what a good person you are.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chf975p", "created": 1399855978.0, "author_flair_text": null, "created_utc": 1399827178.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chf926u", "gilded": 0, "author": "nweref", "parent_id": "t1_chf4bje", "approved_by": null, "body": "Thanks I'm glad to know that some people try to see that I'm not that bad of a person.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks I&amp;#39;m glad to know that some people try to see that I&amp;#39;m not that bad of a person.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chf926u", "created": 1399855609.0, "author_flair_text": null, "created_utc": 1399826809.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf4bje", "gilded": 0, "author": "throway8420", "parent_id": "t3_259xhm", "approved_by": null, "body": "You seem like such a kind- hearted guy OP. The world needs more people like you in it. ", "edited": 1399812907.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem like such a kind- hearted guy OP. The world needs more people like you in it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chf4bje", "created": 1399840224.0, "author_flair_text": null, "created_utc": 1399811424.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfoerw", "gilded": 0, "author": "socrateshaditright", "parent_id": "t3_259xhm", "approved_by": null, "body": "Hi there. You seem like such a kind person, I don't understand how people can be so cruel and not realize that the people who are kindest usually need the most help. I feel like you a lot of the time. I really hope that today was a better day for you. I'm more than willing to talk about anything at all, if you want, you can just pm me. I know that this life is really hard, but I implore you to consider sticking around for a bit. Talk to me, talk to other anonymous strangers on the internet, just get your feelings out there. I hope you have a pleasant evening. I'm rooting for you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. You seem like such a kind person, I don&amp;#39;t understand how people can be so cruel and not realize that the people who are kindest usually need the most help. I feel like you a lot of the time. I really hope that today was a better day for you. I&amp;#39;m more than willing to talk about anything at all, if you want, you can just pm me. I know that this life is really hard, but I implore you to consider sticking around for a bit. Talk to me, talk to other anonymous strangers on the internet, just get your feelings out there. I hope you have a pleasant evening. I&amp;#39;m rooting for you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259xhm", "score_hidden": false, "name": "t1_chfoerw", "created": 1399894399.0, "author_flair_text": null, "created_utc": 1399865599.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]