[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have noticed that more people tend to react with disgust rather than compassion.  Why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have noticed that more people tend to react with disgust rather than compassion.  Why?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2449s4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Christinestine", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2449s4/i_have_a_genuine_curiosity_how_is_it_socially/", "name": "t3_2449s4", "created": 1398650117.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2449s4/i_have_a_genuine_curiosity_how_is_it_socially/", "author_flair_text": null, "title": "I have a genuine curiosity: How is it socially acceptable for people to turn the other way when a person exhibits suicidal tendencies?", "created_utc": 1398621317.0, "ups": 9, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3ic1c", "gilded": 0, "author": "EeLitaret", "parent_id": "t1_ch3i14q", "approved_by": null, "body": "And there is love in this world, because you and me are here right now and I offer nothing but love and kindness to those who need it. I feel lonely and lost and unloved too, but at least I know that people like me exist out there, and people like me love. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And there is love in this world, because you and me are here right now and I offer nothing but love and kindness to those who need it. I feel lonely and lost and unloved too, but at least I know that people like me exist out there, and people like me love. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3ic1c", "created": 1398631257.0, "author_flair_text": null, "created_utc": 1398627657.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3i8uj", "gilded": 0, "author": "EeLitaret", "parent_id": "t1_ch3i14q", "approved_by": null, "body": "I'm  not the best person to give advice because we're in the same boat, and it sure seems to be sinking fast. I also feel like the world is just chock full of people who hate and hurt others and I feel like even my friends do this to me. But then every so often I have a good day, and I see a heartwarming story on tv, and a stranger might be nice to me at a coffee shop or something, and you realize that just because bad things and bad people exist, it doesn't mean that there aren't good ones. I don't know if you've ever heard the saying \"Be the change you want to see\" but i think that you truly need to take that to heart in this world. Because if every single person was a horrible cheating stealing graverobbing murderer, I am not. I will be compassionate and empathic and understanding and kind and helpful, because that is what I want to see in this world. So I will be that person even if nobody else will. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m  not the best person to give advice because we&amp;#39;re in the same boat, and it sure seems to be sinking fast. I also feel like the world is just chock full of people who hate and hurt others and I feel like even my friends do this to me. But then every so often I have a good day, and I see a heartwarming story on tv, and a stranger might be nice to me at a coffee shop or something, and you realize that just because bad things and bad people exist, it doesn&amp;#39;t mean that there aren&amp;#39;t good ones. I don&amp;#39;t know if you&amp;#39;ve ever heard the saying &amp;quot;Be the change you want to see&amp;quot; but i think that you truly need to take that to heart in this world. Because if every single person was a horrible cheating stealing graverobbing murderer, I am not. I will be compassionate and empathic and understanding and kind and helpful, because that is what I want to see in this world. So I will be that person even if nobody else will. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3i8uj", "created": 1398631062.0, "author_flair_text": null, "created_utc": 1398627462.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch3i14q", "gilded": 0, "author": "Christinestine", "parent_id": "t1_ch3g909", "approved_by": null, "body": "I've asked for input because I have also experienced this.\n\nI have been depressed for as far back as I can remember.  I have called suicide hotline plenty of times and landed myself in the hospital on four separate occasions over wanting to kill myself.  I have seen numerous psychologists, psychiatrists, and counselors and I still have never found any proper support.  \n\nA year ago my best friend decided to take 30 of her prescription pills in an attempt to kill herself and she ended up in the ICU for days on end, completely out of consciousness, having thousands of seizures being in the hospital for a week.  After all of this occurred her own family wouldn't even show up to the hospital to show her any sort of support.  In fact, they would call her yelling at her about her suicide attempt and she claims that they were upset that they would have to pay off all of her student loans for her if she were to have died.  They still call her every so often to basically tell her that she needs to help them pay off bills, although she is an adult and has not lived with her parents for the past four years.\n\nNone of our \"friends\" were very supportive through either of our suicidal ideation.  All a person needs when they feel this way is compassion and understanding, but I'm starting to believe that there is absolutely no love left in this world.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve asked for input because I have also experienced this.&lt;/p&gt;\n\n&lt;p&gt;I have been depressed for as far back as I can remember.  I have called suicide hotline plenty of times and landed myself in the hospital on four separate occasions over wanting to kill myself.  I have seen numerous psychologists, psychiatrists, and counselors and I still have never found any proper support.  &lt;/p&gt;\n\n&lt;p&gt;A year ago my best friend decided to take 30 of her prescription pills in an attempt to kill herself and she ended up in the ICU for days on end, completely out of consciousness, having thousands of seizures being in the hospital for a week.  After all of this occurred her own family wouldn&amp;#39;t even show up to the hospital to show her any sort of support.  In fact, they would call her yelling at her about her suicide attempt and she claims that they were upset that they would have to pay off all of her student loans for her if she were to have died.  They still call her every so often to basically tell her that she needs to help them pay off bills, although she is an adult and has not lived with her parents for the past four years.&lt;/p&gt;\n\n&lt;p&gt;None of our &amp;quot;friends&amp;quot; were very supportive through either of our suicidal ideation.  All a person needs when they feel this way is compassion and understanding, but I&amp;#39;m starting to believe that there is absolutely no love left in this world.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3i14q", "created": 1398630582.0, "author_flair_text": null, "created_utc": 1398626982.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch3g909", "gilded": 0, "author": "EeLitaret", "parent_id": "t3_2449s4", "approved_by": null, "body": "Because they can't understand someone wanting to kill themselves. I know I didn't before I became depressed. Now I just want my heart to stop hurting so badly all the time, and when I can't do anything about it, ending it all becomes a very viable option ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because they can&amp;#39;t understand someone wanting to kill themselves. I know I didn&amp;#39;t before I became depressed. Now I just want my heart to stop hurting so badly all the time, and when I can&amp;#39;t do anything about it, ending it all becomes a very viable option &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3g909", "created": 1398626505.0, "author_flair_text": null, "created_utc": 1398622905.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3l2sh", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_2449s4", "approved_by": null, "body": "I'll post my own opinion, but I may be wrong. It is based merely on a subjective point of view, so take it for what it is. Just my thoughts on the issue. \n\nThere are a variety of reasons suicide is seriously despised in our society. \n\nFirst: The life-culture. People tend to think that every life, no matter what you are currently living or feeling, is worth living. It doesn't matter if it's a twisted caricature of what living for my own \"point of view\" means, because society perceivies a human to be living just because he can breathe.\n\nSecond: Religious point of view. Life-values get embedded on your own mind depending on what your religion is, and so they define the bondaries of your own empathy applied to the reality out there. \n\nThird: Egoism. People could start despising you and start telling you that just by thinking that you are basically committing the purest act of evil that will ultimately lead your close parents-friends to despair, and so they will start despising you\n\nForth: lack of empathy. People are likely to scorn weakness, especially when it comes from another human being. That's why people are afraid to talk of their own issue.\n\nFifth: they never experienced the dark emotions that a suicidal mind has, and so they can't understand. I listed four reasons before this one, and I have to admit that according to me, this one is THE reason. The other 4 are just an added-bonus. \n\n\n", "edited": 1398634013.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll post my own opinion, but I may be wrong. It is based merely on a subjective point of view, so take it for what it is. Just my thoughts on the issue. &lt;/p&gt;\n\n&lt;p&gt;There are a variety of reasons suicide is seriously despised in our society. &lt;/p&gt;\n\n&lt;p&gt;First: The life-culture. People tend to think that every life, no matter what you are currently living or feeling, is worth living. It doesn&amp;#39;t matter if it&amp;#39;s a twisted caricature of what living for my own &amp;quot;point of view&amp;quot; means, because society perceivies a human to be living just because he can breathe.&lt;/p&gt;\n\n&lt;p&gt;Second: Religious point of view. Life-values get embedded on your own mind depending on what your religion is, and so they define the bondaries of your own empathy applied to the reality out there. &lt;/p&gt;\n\n&lt;p&gt;Third: Egoism. People could start despising you and start telling you that just by thinking that you are basically committing the purest act of evil that will ultimately lead your close parents-friends to despair, and so they will start despising you&lt;/p&gt;\n\n&lt;p&gt;Forth: lack of empathy. People are likely to scorn weakness, especially when it comes from another human being. That&amp;#39;s why people are afraid to talk of their own issue.&lt;/p&gt;\n\n&lt;p&gt;Fifth: they never experienced the dark emotions that a suicidal mind has, and so they can&amp;#39;t understand. I listed four reasons before this one, and I have to admit that according to me, this one is THE reason. The other 4 are just an added-bonus. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3l2sh", "created": 1398637401.0, "author_flair_text": null, "created_utc": 1398633801.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3qf0a", "gilded": 0, "author": "RoseMadderX", "parent_id": "t3_2449s4", "approved_by": null, "body": "Someone in my high school whose brother committed suicide reacted this way. It could be because the people you are talking about have experienced the after effects of it and it hurt them so much. Not that it gives them an excuse or anything. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone in my high school whose brother committed suicide reacted this way. It could be because the people you are talking about have experienced the after effects of it and it hurt them so much. Not that it gives them an excuse or anything. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2449s4", "score_hidden": false, "name": "t1_ch3qf0a", "created": 1398649727.0, "author_flair_text": null, "created_utc": 1398646127.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]