[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not a day goes by that I don&amp;#39;t think about how much better EVERYTHING would fucking be if I just died. \nI wouldn&amp;#39;t have to worry about anything \nI wouldn&amp;#39;t have to worry about what to do as a college major or the fact that I had to drop one of my classes because I was failing and that if my final comes back in and i didn&amp;#39;t do good enough then I fail that class and have to pay bright futures back and my dad would be SO pissed if he found out that I dropped out of one class and failed another. \nI also recently decided to switch jobs back to my old job and I found out that it was SUCH a fucking mistake. I want my old job back so bad but I can&amp;#39;t get it. \nAnd last but not least when I was working at my old job my relationship with my SO was not doing so well, then I switched to my other job and everything was fine. well, from working bak at my old job, all of those memories have come flooding back and every feeling about our relationship at that time. \nNot to mention we work opposite hours now! I NEVER FUCKING get to see my SO. one works 10-5 and I work 5-C so there&amp;#39;s about an hour or two at night that we get to see each other &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m under so much stress and I don&amp;#39;t know what to do. \nI also need to move out of my house soon because the relationship I have with my parent has completly fallen apart. So I have nobody to talk to about this because I don&amp;#39;t want to stress my SO at all &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t stop thinking that if I died then maybe everything would be okay and I wouldn&amp;#39;t be disappointing anybody and I wouldn&amp;#39;t be so damn stressed anymore. &lt;/p&gt;\n\n&lt;p&gt;I live in a constant state of stress. I feel like if rather die. \nIf it wasn&amp;#39;t for my SO trying to hold me together, I don&amp;#39;t fucking know what I&amp;#39;d do..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Not a day goes by that I don't think about how much better EVERYTHING would fucking be if I just died. \nI wouldn't have to worry about anything \nI wouldn't have to worry about what to do as a college major or the fact that I had to drop one of my classes because I was failing and that if my final comes back in and i didn't do good enough then I fail that class and have to pay bright futures back and my dad would be SO pissed if he found out that I dropped out of one class and failed another. \nI also recently decided to switch jobs back to my old job and I found out that it was SUCH a fucking mistake. I want my old job back so bad but I can't get it. \nAnd last but not least when I was working at my old job my relationship with my SO was not doing so well, then I switched to my other job and everything was fine. well, from working bak at my old job, all of those memories have come flooding back and every feeling about our relationship at that time. \nNot to mention we work opposite hours now! I NEVER FUCKING get to see my SO. one works 10-5 and I work 5-C so there's about an hour or two at night that we get to see each other \n\nI'm under so much stress and I don't know what to do. \nI also need to move out of my house soon because the relationship I have with my parent has completly fallen apart. So I have nobody to talk to about this because I don't want to stress my SO at all \n\nI can't stop thinking that if I died then maybe everything would be okay and I wouldn't be disappointing anybody and I wouldn't be so damn stressed anymore. \n\nI live in a constant state of stress. I feel like if rather die. \nIf it wasn't for my SO trying to hold me together, I don't fucking know what I'd do..\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243rqr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Invalidusrnam", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243rqr/i_hate_my_life_and_im_beyond_knowing_what_to_do/", "name": "t3_243rqr", "created": 1398636716.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243rqr/i_hate_my_life_and_im_beyond_knowing_what_to_do/", "author_flair_text": null, "title": "I hate my life and I'm beyond knowing what to do..", "created_utc": 1398607916.0, "ups": 9, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3arp6", "gilded": 0, "author": "PapaBear12", "parent_id": "t3_243rqr", "approved_by": null, "body": "Believe it or not, you're not alone on the school situation. I'm in my last semester of college, and I may have landed my dream job. But it may not even matter because I might fail a class and thus not be able to graduate. I know a lot of people in similar situations to you and I on this regard, believe me. You're not alone. I know that doesn't make it better, but trust me as someone who's been through 4 years of college - don't worry about it. There will be chances to make up the classes you failed while still graduating on time. Talk to your professors. They may be sympathetic to your situation.\n\nIt sounds like, despite your challenges, you and your SO are really good together. That's great. Congrats on finding someone so awesome. Would it be possible to find a new job? One that works better in relation to your SO's schedule.\n\nWhenever you feel like the stress is too much, try this. Close your eyes for a minute, take a deep breath (maybe a few), and count to ten. Take things one step at a time. PM me or hit me up here if you want to talk. We can work through this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Believe it or not, you&amp;#39;re not alone on the school situation. I&amp;#39;m in my last semester of college, and I may have landed my dream job. But it may not even matter because I might fail a class and thus not be able to graduate. I know a lot of people in similar situations to you and I on this regard, believe me. You&amp;#39;re not alone. I know that doesn&amp;#39;t make it better, but trust me as someone who&amp;#39;s been through 4 years of college - don&amp;#39;t worry about it. There will be chances to make up the classes you failed while still graduating on time. Talk to your professors. They may be sympathetic to your situation.&lt;/p&gt;\n\n&lt;p&gt;It sounds like, despite your challenges, you and your SO are really good together. That&amp;#39;s great. Congrats on finding someone so awesome. Would it be possible to find a new job? One that works better in relation to your SO&amp;#39;s schedule.&lt;/p&gt;\n\n&lt;p&gt;Whenever you feel like the stress is too much, try this. Close your eyes for a minute, take a deep breath (maybe a few), and count to ten. Take things one step at a time. PM me or hit me up here if you want to talk. We can work through this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243rqr", "score_hidden": false, "name": "t1_ch3arp6", "created": 1398637978.0, "author_flair_text": null, "created_utc": 1398609178.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]