[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll keep this short and in list format:&lt;/p&gt;\n\n&lt;p&gt;Me: Male/25 Years Old/Northern USA&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; I hate gay people. I think homosexuals should be exterminated or placed in death camps. *&lt;/li&gt;\n&lt;li&gt; &lt;em&gt;I&amp;#39;m gay&lt;/em&gt;. My sexual deviancy alone is likely the reason for most of my misery. I used to accept myself for my sexuality, until I realized the truth. I am a monster. I&amp;#39;m not necessarily religious, I wasn&amp;#39;t raised in an ultra-conservative family. That isn&amp;#39;t the source of this. The source is the simple matter that all homosexuals are mentally disturbed individuals who live their life for the sole purpose of sodomy and transmitting AIDS. Seriously, it&amp;#39;s the fucking truth. There are no homosexuals that do not live this way. *&lt;/li&gt;\n&lt;li&gt; I have no contact with the outside world, besides the internet, my job, and books. I haven&amp;#39;t had a vacation in nearly four years, or a regular 2-day weekend, so there&amp;#39;s no time for any possible human interaction. I just sit on the couch all day, or work out in my basement all day and ignore the fact that I spend my Friday nights alone or working. I live by myself, but I look at that as a positive thing. I would give my soul for a vacation, but those horrible goons won&amp;#39;t let me. I&amp;#39;d probably just waste it being miserable anyway, so I don&amp;#39;t bother pleading.&lt;/li&gt;\n&lt;li&gt; My job requires me to deal with unpleasant strangers all day. I think this makes me think most people are unpleasant. Any time I reach out to people, I just get hurt. Therefore, I don&amp;#39;t bother anymore. Most of my co-workers are old women I have nothing in common with. I like my job, but I don&amp;#39;t belong there.&lt;/li&gt;\n&lt;li&gt; People always used to tell me I smiled too much, as if I was always up to something. People used to like me. People used to want to be my friend, want to get to know me. People used to like my sense of humor, even. Nobody talks to me anymore. Nobody tells me I smile too much anymore. I was never Mr. Popular, by any means, but I was never completely cut-off from the outside as I am now.&lt;/li&gt;\n&lt;li&gt; My phone hasn&amp;#39;t rang since July of last year (unless you count telemarketers), my last text was from December, and it was a wrong number. I haven&amp;#39;t talked to my last friend since 2008. I haven&amp;#39;t had any friends since. I&amp;#39;ve deleted all my social networking profiles since I don&amp;#39;t really see the point anymore.&lt;/li&gt;\n&lt;li&gt; I came out to my parents while drunk in 2009. Big mistake. I&amp;#39;m their only child. Guess I ruined the genetic line. I&amp;#39;m reminded of it nearly every day now.&lt;/li&gt;\n&lt;li&gt; It&amp;#39;s not that I really want to commit suicide, it&amp;#39;s that there really is no other choice. I&amp;#39;ve destroyed my relationship with my family and friends. My job is dead-end. I&amp;#39;m making decent money and saving well, but there&amp;#39;s no point to any of it.&lt;/li&gt;\n&lt;li&gt; I had one boyfriend for two years. We broke up a year-and-a-half ago. I&amp;#39;m still not quite over it. I still have one-way conversations with him before I go to bed as if he is still there listening.&lt;/li&gt;\n&lt;li&gt; I wish I was a normal human. I would give anything for a wife, kids, a happy family, and I would give my life to make them happy. I cannot have any of that because I am a bad person.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I&amp;#39;ve felt this way for about 4-5 years. I&amp;#39;ve not been happy with my life in about ten years. They say things get better, and time heals all wounds. I know that&amp;#39;s simply not true.&lt;/p&gt;\n\n&lt;p&gt;I almost died at birth. I wasn&amp;#39;t breathing when I came out, and I was hospitalized for nearly a month. I was meant to die. That&amp;#39;s all that means. I am a mistake. My life is just limbo, and I&amp;#39;m just waiting for death.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t plan to see my 26th birthday. My suicide note is already written (I&amp;#39;ve been revising it since 2009, actually).&lt;/p&gt;\n\n&lt;p&gt;I do not take any medication whatsoever. I have never been to a therapist, etc. From what I&amp;#39;ve seen, it doesn&amp;#39;t really do anything. Most of it seems explainable through the placebo effect, anyway. Spending $1500 a session for someone to listen to me while I talk seems to be even more depressing than the actual need for a therapist in the first place.&lt;/p&gt;\n\n&lt;p&gt;My final day as planned:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; Wake early. Drink good coffee. Lots of cream and sugar. Coffee and cigarettes are the only thing that makes waking up worth it. I won&amp;#39;t think about work. I won&amp;#39;t think about my to-do list. I will smile at every opportunity and breathe in the morning air.&lt;/li&gt;\n&lt;li&gt; Listen to my favorite jazz albums.&lt;/li&gt;\n&lt;li&gt; Read a few of my favorite short stories.&lt;/li&gt;\n&lt;li&gt; Watch my favorite Twilight Zone episodes.&lt;/li&gt;\n&lt;li&gt; Empty my savings account and give it to my co-workers and family. I&amp;#39;ve saved a lot of money even at my age, and I know its hokey to say it, but it &lt;em&gt;really&lt;/em&gt; does not help with being happy. Prime example right here. I was happier when I was a poor teenager with no job. It doesn&amp;#39;t seem to matter how much you save, it is no consolation. It gives comfort in times of need or distress, but that&amp;#39;s all.&lt;/li&gt;\n&lt;li&gt; Cook myself a good, pricey, ridiculously gluttonous and delicious dinner.&lt;/li&gt;\n&lt;li&gt; Walk around the block. Go bird-watching, maybe.&lt;/li&gt;\n&lt;li&gt; I will not allow myself any trouble. No worries for me. It will be a new day, and things will be alright. I won&amp;#39;t be myself any longer. I will be a better person. I will do things to make myself happy, and it will be okay for a single day.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;pre&gt;&lt;code&gt;* This is not a troll post. Numbers 1 and 2 are my honest opinion. I know I surely can&amp;#39;t be alone in those feelings.\n&lt;/code&gt;&lt;/pre&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll keep this short and in list format:\n\nMe: Male/25 Years Old/Northern USA\n\n1.  I hate gay people. I think homosexuals should be exterminated or placed in death camps. *\n2.  *I'm gay*. My sexual deviancy alone is likely the reason for most of my misery. I used to accept myself for my sexuality, until I realized the truth. I am a monster. I'm not necessarily religious, I wasn't raised in an ultra-conservative family. That isn't the source of this. The source is the simple matter that all homosexuals are mentally disturbed individuals who live their life for the sole purpose of sodomy and transmitting AIDS. Seriously, it's the fucking truth. There are no homosexuals that do not live this way. *\n3.  I have no contact with the outside world, besides the internet, my job, and books. I haven't had a vacation in nearly four years, or a regular 2-day weekend, so there's no time for any possible human interaction. I just sit on the couch all day, or work out in my basement all day and ignore the fact that I spend my Friday nights alone or working. I live by myself, but I look at that as a positive thing. I would give my soul for a vacation, but those horrible goons won't let me. I'd probably just waste it being miserable anyway, so I don't bother pleading.\n4.  My job requires me to deal with unpleasant strangers all day. I think this makes me think most people are unpleasant. Any time I reach out to people, I just get hurt. Therefore, I don't bother anymore. Most of my co-workers are old women I have nothing in common with. I like my job, but I don't belong there.\n5.  People always used to tell me I smiled too much, as if I was always up to something. People used to like me. People used to want to be my friend, want to get to know me. People used to like my sense of humor, even. Nobody talks to me anymore. Nobody tells me I smile too much anymore. I was never Mr. Popular, by any means, but I was never completely cut-off from the outside as I am now.\n6.  My phone hasn't rang since July of last year (unless you count telemarketers), my last text was from December, and it was a wrong number. I haven't talked to my last friend since 2008. I haven't had any friends since. I've deleted all my social networking profiles since I don't really see the point anymore.\n7.  I came out to my parents while drunk in 2009. Big mistake. I'm their only child. Guess I ruined the genetic line. I'm reminded of it nearly every day now.\n8.  It's not that I really want to commit suicide, it's that there really is no other choice. I've destroyed my relationship with my family and friends. My job is dead-end. I'm making decent money and saving well, but there's no point to any of it.\n9.  I had one boyfriend for two years. We broke up a year-and-a-half ago. I'm still not quite over it. I still have one-way conversations with him before I go to bed as if he is still there listening.\n10.  I wish I was a normal human. I would give anything for a wife, kids, a happy family, and I would give my life to make them happy. I cannot have any of that because I am a bad person.\n\nI've felt this way for about 4-5 years. I've not been happy with my life in about ten years. They say things get better, and time heals all wounds. I know that's simply not true.\n\nI almost died at birth. I wasn't breathing when I came out, and I was hospitalized for nearly a month. I was meant to die. That's all that means. I am a mistake. My life is just limbo, and I'm just waiting for death.\n\nI don't plan to see my 26th birthday. My suicide note is already written (I've been revising it since 2009, actually).\n\nI do not take any medication whatsoever. I have never been to a therapist, etc. From what I've seen, it doesn't really do anything. Most of it seems explainable through the placebo effect, anyway. Spending $1500 a session for someone to listen to me while I talk seems to be even more depressing than the actual need for a therapist in the first place.\n\nMy final day as planned:\n\n1.  Wake early. Drink good coffee. Lots of cream and sugar. Coffee and cigarettes are the only thing that makes waking up worth it. I won't think about work. I won't think about my to-do list. I will smile at every opportunity and breathe in the morning air.\n2.  Listen to my favorite jazz albums.\n3.  Read a few of my favorite short stories.\n4.  Watch my favorite Twilight Zone episodes.\n5.  Empty my savings account and give it to my co-workers and family. I've saved a lot of money even at my age, and I know its hokey to say it, but it *really* does not help with being happy. Prime example right here. I was happier when I was a poor teenager with no job. It doesn't seem to matter how much you save, it is no consolation. It gives comfort in times of need or distress, but that's all.\n6.  Cook myself a good, pricey, ridiculously gluttonous and delicious dinner.\n7.  Walk around the block. Go bird-watching, maybe.\n8.  I will not allow myself any trouble. No worries for me. It will be a new day, and things will be alright. I won't be myself any longer. I will be a better person. I will do things to make myself happy, and it will be okay for a single day.\n\n    * This is not a troll post. Numbers 1 and 2 are my honest opinion. I know I surely can't be alone in those feelings.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240hjq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SWThrowaway2014", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240hjq/i_hate_the_person_i_have_become/", "name": "t3_240hjq", "created": 1398519523.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240hjq/i_hate_the_person_i_have_become/", "author_flair_text": null, "title": "I hate the person I have become", "created_utc": 1398490723.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2egi7", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_240hjq", "approved_by": null, "body": "&gt;My phone hasn't rang since July of last year (unless you count telemarketers)\n\nMake friends with weird internet people.\n\n&gt;I came out to my parents while drunk in 2009.\n\nIt's amazing how many of the people of suicidewatch would be better off if it were culturally acceptable to tell your parents to fuck off and just never have contact with them again.\n\n&gt;I had one boyfriend for two years. We broke up a year-and-a-half ago. I'm still not quite over it. I still have one-way conversations with him before I go to bed as if he is still there listening.\n\nActually kind of sweet. \n\n&gt;I wish I was a normal human. I would give anything for a wife, kids, a happy family, and I would give my life to make them happy. I cannot have any of that because I am a bad person.\n\nI classify anyone with some sense of right and wrong as potentially good, and just accept that sometimes they won't live up to their potential.\n\nYour sense of right and wrong has been tarnished by your culture but you do not qualify as evil. Preliminary precision guessing shows that you are also disappointingly normal. I am sorry, but you will have to try harder to be judged negatively.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My phone hasn&amp;#39;t rang since July of last year (unless you count telemarketers)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Make friends with weird internet people.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I came out to my parents while drunk in 2009.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s amazing how many of the people of suicidewatch would be better off if it were culturally acceptable to tell your parents to fuck off and just never have contact with them again.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I had one boyfriend for two years. We broke up a year-and-a-half ago. I&amp;#39;m still not quite over it. I still have one-way conversations with him before I go to bed as if he is still there listening.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually kind of sweet. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I wish I was a normal human. I would give anything for a wife, kids, a happy family, and I would give my life to make them happy. I cannot have any of that because I am a bad person.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I classify anyone with some sense of right and wrong as potentially good, and just accept that sometimes they won&amp;#39;t live up to their potential.&lt;/p&gt;\n\n&lt;p&gt;Your sense of right and wrong has been tarnished by your culture but you do not qualify as evil. Preliminary precision guessing shows that you are also disappointingly normal. I am sorry, but you will have to try harder to be judged negatively.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240hjq", "score_hidden": false, "name": "t1_ch2egi7", "created": 1398495561.0, "author_flair_text": null, "created_utc": 1398491961.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]