[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been having suicidal thoughts almost every day since about two months into this school year. The transition into high school was really rough for me and my grades went to shit because I just gave up on doing projects and now my parents treat me like a failure. The thing is only recently have I actually began planning how I&amp;#39;m going to do it and I fear that I will go through with it soon. I want to go tell an adult and get help but I fear that I will get involuntarily institutionalized which would prevent me from doing anything I&amp;#39;ve ever wanted to do with my life. I&amp;#39;ve been depressed because I can&amp;#39;t perform any of my hobbies due to my parents refusing to invest just a small amount in anything I want to do like guitar lessons or astronomy which I would understand if they didn&amp;#39;t spend so much money on my sister. I&amp;#39;ve always been the pariah in my family because I&amp;#39;m really awkward and have social anxiety which prevents me from talking to people well and as a result my dad treats me like a freak. Running is the only thing that makes me happy anymore but every time I run I get extreme knee and ankle pain so now I have nothing to do that makes me happy.   I can&amp;#39;t tell either of my parents because my dad hates me and my mom can&amp;#39;t keep her mouth shut so all of her friends would know about it and then they would look at me like a freak too. I just don&amp;#39;t know what to do anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been having suicidal thoughts almost every day since about two months into this school year. The transition into high school was really rough for me and my grades went to shit because I just gave up on doing projects and now my parents treat me like a failure. The thing is only recently have I actually began planning how I'm going to do it and I fear that I will go through with it soon. I want to go tell an adult and get help but I fear that I will get involuntarily institutionalized which would prevent me from doing anything I've ever wanted to do with my life. I've been depressed because I can't perform any of my hobbies due to my parents refusing to invest just a small amount in anything I want to do like guitar lessons or astronomy which I would understand if they didn't spend so much money on my sister. I've always been the pariah in my family because I'm really awkward and have social anxiety which prevents me from talking to people well and as a result my dad treats me like a freak. Running is the only thing that makes me happy anymore but every time I run I get extreme knee and ankle pain so now I have nothing to do that makes me happy.   I can't tell either of my parents because my dad hates me and my mom can't keep her mouth shut so all of her friends would know about it and then they would look at me like a freak too. I just don't know what to do anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250iu5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Wasteaway_", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250iu5/i_have_no_idea_what_to_do/", "name": "t3_250iu5", "created": 1399550187.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250iu5/i_have_no_idea_what_to_do/", "author_flair_text": null, "title": "I have no idea what to do", "created_utc": 1399521387.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chci6pd", "gilded": 0, "author": "Schmulander", "parent_id": "t3_250iu5", "approved_by": null, "body": "I enjoy just looking up at the stars when it's clear. It's easy and free and finding constellations and such. Takes my mind off things, have a cigar, scotch whatever. Looking up and appreciating where you are on this earth and knowing that you are here for a reason. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I enjoy just looking up at the stars when it&amp;#39;s clear. It&amp;#39;s easy and free and finding constellations and such. Takes my mind off things, have a cigar, scotch whatever. Looking up and appreciating where you are on this earth and knowing that you are here for a reason. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250iu5", "score_hidden": false, "name": "t1_chci6pd", "created": 1399554637.0, "author_flair_text": null, "created_utc": 1399525837.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che136r", "gilded": 0, "author": "mylifeasanimposter", "parent_id": "t3_250iu5", "approved_by": null, "body": "You are not alone. Social anxiety is nothing to be ashamed of, your dad is wrong, you aren't a freak and no one has a right to make you feel that way.\n\nWith regard to the guitar lessons and astronomy, teach yourself for free, take a MOOC or youtube lessons. When you get a feel for it, you can get an after school job and pay for your own lessons/invest in your own equipment.\n \nIf your parents make you feel bad or don't support you, take that out of the equation. Depend on yourself to perform your hobbies.. then no one can take that source of happiness away from you.\n\nYou are not alone x", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not alone. Social anxiety is nothing to be ashamed of, your dad is wrong, you aren&amp;#39;t a freak and no one has a right to make you feel that way.&lt;/p&gt;\n\n&lt;p&gt;With regard to the guitar lessons and astronomy, teach yourself for free, take a MOOC or youtube lessons. When you get a feel for it, you can get an after school job and pay for your own lessons/invest in your own equipment.&lt;/p&gt;\n\n&lt;p&gt;If your parents make you feel bad or don&amp;#39;t support you, take that out of the equation. Depend on yourself to perform your hobbies.. then no one can take that source of happiness away from you.&lt;/p&gt;\n\n&lt;p&gt;You are not alone x&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250iu5", "score_hidden": false, "name": "t1_che136r", "created": 1399704785.0, "author_flair_text": null, "created_utc": 1399675985.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]