[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been depressed since I was in the seventh grade.. Only 12 years old. Because of daily bullying from my &amp;quot;best friend&amp;quot; every day since fourth grade, I already felt like I wasn&amp;#39;t good enough by mid grade 5. By middle school I was used to people treating me like trash and by ninth grade, I was very suicidal. I cut myself for the first time in a bathroom stall at school and since then, I was hooked. I spent all my time thinking about suicide and I thought of ways to kill myself. I even wrote several suicide letter and I always revised them because I didn&amp;#39;t want to leave anything out. &lt;/p&gt;\n\n&lt;p&gt;Finally my family moved to a different state, and I left all those people who bullied me behind. Unfortunately my memory is really good and even now, I can remember specifically what many people said to me and what they did. And at my new school, people were so friendly to me   and one of the popular guys at school asked me to homecoming. I was basically transparent and everyone I met could tell I was extremely insecure and I had numerous people ask me what I was so insecure. I made some good friends there and overall got a little bit happier, but underneath it all, I was still so insecure and hated myself.&lt;/p&gt;\n\n&lt;p&gt;I had always read that college was supposed to be the best four years of your life. Well when I went to college with high expectations and thought I would finally leave my self-loathing behind and find myself. All my good friends went to the other side of the country for college and they all got in serious relationships, scored internships, got really involved, have high gpas + are preparing for med school/law school, etc. And there&amp;#39;s me: I went to college, I was on my own for the first time and so lonely and depressed. I lost my virginity to a frat guy who kept pressuring me and calling me a bitch and insulting me until I gave in. When I did, he treated me like girls are treated in vulgar porn scenes. I got even more depressed and slept with three more guys within the next few months, and one of them treated me like shit as well. I even cried while he just laughed. I know some girls are okay with sleeping around (and that&amp;#39;s fine), but for me, it makes me feel like shit. Every day I think about this and I can&amp;#39;t believe I let guys treat me as badly as they treated me. I realized that my whole life, I&amp;#39;ve only had one guy who has liked me for me... Everyone else was people who have never spoken to me and most of them lose interest once they actually know me. This is disheartening.. it&amp;#39;s like my true self is unattractive. I lost all ability to focus and can&amp;#39;t even study.. Whenever I actually attended class, my brain was all foggy and I couldn&amp;#39;t bring myself to listen. I failed almost all my freshman year courses, and got kicked out. But I appealed, got back in, and ended up getting kicked out again at the end of this year. I have a total of 19 credits after 2 years at college, and now I have no school and I owe 20k in student loans. I had a job but lost it because I couldn&amp;#39;t control my anger at work one day and caused a scene. I finally got a job the other day as a door-to-door marketer, but that is the WORST job ever, I am depressed as fuck and I have to act happy, KNOWING that I&amp;#39;m annoying the fuck out of other people. &lt;/p&gt;\n\n&lt;p&gt;Idk when I think about it I just don&amp;#39;t really see a future for myself... I don&amp;#39;t see myself getting anywhere in life and I really don&amp;#39;t know why I bother to keep myself alive... I&amp;#39;ve hated myself for so long I just don&amp;#39;t know if I can ever like myself again...Why live when I don&amp;#39;t?&lt;/p&gt;\n\n&lt;p&gt;People always ask me how I sleep so long (14+hrs a day) and it&amp;#39;s because when I wake up, I think about everything that makes me sad and I go back to sleep to rid of those thoughts. People ask me why I have no motivation to study and it&amp;#39;s because I don&amp;#39;t care about myself or my future. I&amp;#39;m 20k in debt, I &amp;#39;m basically jobless, educationless, friendless. I&amp;#39;m so thankful I still have my parents, and I know they love me...They&amp;#39;ve made sacrifices just for me.. But they&amp;#39;re so disappointed in me and I&amp;#39;ve overheard them talking about it.. It makes me even more depressed..Idk... I just can&amp;#39;t take this anymore, I feel like I&amp;#39;m at rock bottom. There have been many times before when I felt I was at rock bottom, but this is true rock bottom... I just want to die.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been depressed since I was in the seventh grade.. Only 12 years old. Because of daily bullying from my \"best friend\" every day since fourth grade, I already felt like I wasn't good enough by mid grade 5. By middle school I was used to people treating me like trash and by ninth grade, I was very suicidal. I cut myself for the first time in a bathroom stall at school and since then, I was hooked. I spent all my time thinking about suicide and I thought of ways to kill myself. I even wrote several suicide letter and I always revised them because I didn't want to leave anything out. \n\nFinally my family moved to a different state, and I left all those people who bullied me behind. Unfortunately my memory is really good and even now, I can remember specifically what many people said to me and what they did. And at my new school, people were so friendly to me   and one of the popular guys at school asked me to homecoming. I was basically transparent and everyone I met could tell I was extremely insecure and I had numerous people ask me what I was so insecure. I made some good friends there and overall got a little bit happier, but underneath it all, I was still so insecure and hated myself.\n\nI had always read that college was supposed to be the best four years of your life. Well when I went to college with high expectations and thought I would finally leave my self-loathing behind and find myself. All my good friends went to the other side of the country for college and they all got in serious relationships, scored internships, got really involved, have high gpas + are preparing for med school/law school, etc. And there's me: I went to college, I was on my own for the first time and so lonely and depressed. I lost my virginity to a frat guy who kept pressuring me and calling me a bitch and insulting me until I gave in. When I did, he treated me like girls are treated in vulgar porn scenes. I got even more depressed and slept with three more guys within the next few months, and one of them treated me like shit as well. I even cried while he just laughed. I know some girls are okay with sleeping around (and that's fine), but for me, it makes me feel like shit. Every day I think about this and I can't believe I let guys treat me as badly as they treated me. I realized that my whole life, I've only had one guy who has liked me for me... Everyone else was people who have never spoken to me and most of them lose interest once they actually know me. This is disheartening.. it's like my true self is unattractive. I lost all ability to focus and can't even study.. Whenever I actually attended class, my brain was all foggy and I couldn't bring myself to listen. I failed almost all my freshman year courses, and got kicked out. But I appealed, got back in, and ended up getting kicked out again at the end of this year. I have a total of 19 credits after 2 years at college, and now I have no school and I owe 20k in student loans. I had a job but lost it because I couldn't control my anger at work one day and caused a scene. I finally got a job the other day as a door-to-door marketer, but that is the WORST job ever, I am depressed as fuck and I have to act happy, KNOWING that I'm annoying the fuck out of other people. \n\nIdk when I think about it I just don't really see a future for myself... I don't see myself getting anywhere in life and I really don't know why I bother to keep myself alive... I've hated myself for so long I just don't know if I can ever like myself again...Why live when I don't?\n\nPeople always ask me how I sleep so long (14+hrs a day) and it's because when I wake up, I think about everything that makes me sad and I go back to sleep to rid of those thoughts. People ask me why I have no motivation to study and it's because I don't care about myself or my future. I'm 20k in debt, I 'm basically jobless, educationless, friendless. I'm so thankful I still have my parents, and I know they love me...They've made sacrifices just for me.. But they're so disappointed in me and I've overheard them talking about it.. It makes me even more depressed..Idk... I just can't take this anymore, I feel like I'm at rock bottom. There have been many times before when I felt I was at rock bottom, but this is true rock bottom... I just want to die.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250wq5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "toosadtolive", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250wq5/i_hate_myself_sooooo_much_is_it_possible_to_ever/", "name": "t3_250wq5", "created": 1399563269.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250wq5/i_hate_myself_sooooo_much_is_it_possible_to_ever/", "author_flair_text": null, "title": "I hate myself sooooo much.. Is it possible to ever get out of this? Or should I just die now", "created_utc": 1399534469.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chckiez", "gilded": 0, "author": "dmulally", "parent_id": "t3_250wq5", "approved_by": null, "body": "I'm sorry you feel this way. Are there any things in your life that you look forward to or enjoy doing? Do you have anyone to talk to?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you feel this way. Are there any things in your life that you look forward to or enjoy doing? Do you have anyone to talk to?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250wq5", "score_hidden": false, "name": "t1_chckiez", "created": 1399564373.0, "author_flair_text": null, "created_utc": 1399535573.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcptoe", "gilded": 0, "author": "sortinglife", "parent_id": "t3_250wq5", "approved_by": null, "body": "&gt; I'm so thankful I still have my parents, and I know they love me...\n\nAsk them what they want *you* to do. Do that and be happy about it. \n\nThere are many free educational platforms online you can explore and basically make up for the feeling of \"educationless\", e.g.\n\n**Nandtotetris**\n\n**Khan Academy**\n\n**Zooniverse**\n\n\n&gt; There have been many times before when I felt I was at rock bottom, but this is true rock bottom... I just want to die.\n\nRead other SW postings, and reply to them trying to resolve their issue, it may help in giving you perspective about your own situation. \n\nPM me anytime. ", "edited": 1399992175.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m so thankful I still have my parents, and I know they love me...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ask them what they want &lt;em&gt;you&lt;/em&gt; to do. Do that and be happy about it. &lt;/p&gt;\n\n&lt;p&gt;There are many free educational platforms online you can explore and basically make up for the feeling of &amp;quot;educationless&amp;quot;, e.g.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nandtotetris&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Khan Academy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Zooniverse&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There have been many times before when I felt I was at rock bottom, but this is true rock bottom... I just want to die.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Read other SW postings, and reply to them trying to resolve their issue, it may help in giving you perspective about your own situation. &lt;/p&gt;\n\n&lt;p&gt;PM me anytime. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250wq5", "score_hidden": false, "name": "t1_chcptoe", "created": 1399587777.0, "author_flair_text": null, "created_utc": 1399558977.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chckq3a", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_250wq5", "approved_by": null, "body": "You need a hug, and a guy who actually cares about you, and $20,000.\n\nI have the first one, possibly the second one (I am not really the best at caring about people but I'll try). Not so much on the third. You have permission to internet-stalk me; if you find my real name you may have my number.\n\nEDIT: Actually, just ask.", "edited": 1399537687.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need a hug, and a guy who actually cares about you, and $20,000.&lt;/p&gt;\n\n&lt;p&gt;I have the first one, possibly the second one (I am not really the best at caring about people but I&amp;#39;ll try). Not so much on the third. You have permission to internet-stalk me; if you find my real name you may have my number.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Actually, just ask.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250wq5", "score_hidden": false, "name": "t1_chckq3a", "created": 1399565589.0, "author_flair_text": null, "created_utc": 1399536789.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]