[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s incredible, each day is becoming way worse than the previous day. How is this even possible? I fuck up so much , it has to be one crazy visual spectacle when observed from the outside. I am practically done, only thing left is go to a wrong part of town, do some drugs and get random sex because living the straight life has just been a fucking disaster. Absolutely no potential,  I can&amp;#39;t even visualize a happy ending.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's incredible, each day is becoming way worse than the previous day. How is this even possible? I fuck up so much , it has to be one crazy visual spectacle when observed from the outside. I am practically done, only thing left is go to a wrong part of town, do some drugs and get random sex because living the straight life has just been a fucking disaster. Absolutely no potential,  I can't even visualize a happy ending.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2559cj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "dezzy02", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2559cj/i_have_turned_fucking_up_into_an_artform/", "name": "t3_2559cj", "created": 1399687223.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2559cj/i_have_turned_fucking_up_into_an_artform/", "author_flair_text": null, "title": "I have turned fucking up into an artform", "created_utc": 1399658423.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdu59i", "gilded": 0, "author": "meaurits", "parent_id": "t3_2559cj", "approved_by": null, "body": "If you mess up socially, there are always people to talk to; people who will understand and want to help and sympathize. If you mess up financially, depending on what country you're from there will be a safety net. The only way I can think of really fucking up is yourself so please have some patience and dare to get out there. My favorite teacher always said \"if you do something wrong 1000 times but succeed once, that's progression.\" You don't have to visualise an ending. Maybe if you are scared for your future because of what has happened, you could try living for the moment. Be more compulsive in a stupid way. I mean if people told you to do something fun, dont stagger on your idea of fun and what to do; walk out there and do what they do for fun. Do to a clup, try to play an instrument or just run for a while. Don't even think about it and as sober as you get, try to enjoy the moment. Theye will always be someone and something for you, no matter how much you mess up.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you mess up socially, there are always people to talk to; people who will understand and want to help and sympathize. If you mess up financially, depending on what country you&amp;#39;re from there will be a safety net. The only way I can think of really fucking up is yourself so please have some patience and dare to get out there. My favorite teacher always said &amp;quot;if you do something wrong 1000 times but succeed once, that&amp;#39;s progression.&amp;quot; You don&amp;#39;t have to visualise an ending. Maybe if you are scared for your future because of what has happened, you could try living for the moment. Be more compulsive in a stupid way. I mean if people told you to do something fun, dont stagger on your idea of fun and what to do; walk out there and do what they do for fun. Do to a clup, try to play an instrument or just run for a while. Don&amp;#39;t even think about it and as sober as you get, try to enjoy the moment. Theye will always be someone and something for you, no matter how much you mess up.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2559cj", "score_hidden": false, "name": "t1_chdu59i", "created": 1399689374.0, "author_flair_text": null, "created_utc": 1399660574.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]