[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Fuck it. I&amp;#39;m done. I&amp;#39;ve messaged people seeking help and advice. I&amp;#39;ve gone to a counselor, I&amp;#39;ve taken my prescriptions, I&amp;#39;ve told my fiance..&lt;/p&gt;\n\n&lt;p&gt;And still this general.. Calm, quiet, unwillingness to talk to me.&lt;/p&gt;\n\n&lt;p&gt;I have cried out to EVERYONE I know. &lt;/p&gt;\n\n&lt;p&gt;I have been HOSPITALIZED TWICE for psychotic episodes and suicide attempts... Still, people generally leave me alone.&lt;/p&gt;\n\n&lt;p&gt;I sit alone in my house all day.. I tell my fiance &amp;quot;I&amp;#39;m feeling really low today..&amp;quot; And I get, &amp;quot;Awe sorry baby, hope you feel better :)&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;WHAT THE FUCK DO I HAVE TO DO TO GET SOMEBODY TO TALK TO ME?! RUN OUT IN TRAFFIC?! CREATE A POST LIKE THIS YELLING AT EVERYONE?! Because believe me.. I freaking tried.. I&amp;#39;ve made posts asking for help. I&amp;#39;ve ranted.. I ranted once and got someone ranting back at me and basically HIJACKED MY POST.&lt;/p&gt;\n\n&lt;p&gt;And by all means, you&amp;#39;ll never catch me yelling at someone about stealing my thunder.. In normal conversation, PLEASE TAKE OVER. I&amp;#39;m the most quiet, passive aggressive, non confrontational, helpful person I know. I&amp;#39;m humble. I don&amp;#39;t like to talk to people about my problems..\nSo when I actually do, you&amp;#39;d think somebody would take me seriously?\nNOPE&lt;/p&gt;\n\n&lt;p&gt;I am trying so hard to keep from crying my fucking eyes out.. But I am so exhausted and tired of not being heard.\nI&amp;#39;m arguing in my head.. Where is the best place to do this? How can I do this without hurting people around me?\nShould I even do it? Will anybody even care?\nThe answer, as everyone has so subtly and quietly shown me, is no.&lt;/p&gt;\n\n&lt;p&gt;Nobody honestly gives a flying shit. I see that now. I see that it may hurt, but it&amp;#39;ll pass.. And people will stop having to roll their eyes at me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m making it sound like I cry wolf a lot, in this post.. I don&amp;#39;t. I&amp;#39;ve told maybe one or two people in my life my intentions.. People know I&amp;#39;m mentally ill. They just don&amp;#39;t want to talk to me about it. People know I&amp;#39;m severely depressed right now.. They just want to &amp;quot;cheer me up&amp;quot; and go about their day. Nobody wants to talk to me. Not even you guys.. And really, I&amp;#39;ve tried. I have a huge graveyard of throwaways just begging for some kind of conversation.. Some kind of help. SOME type of interaction where I think for a moment &amp;quot;Yeah.. I can do this another day.. Thank you ___ for helping me get through it and LISTENING TO ME.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I am sorry for the caps.. I&amp;#39;m just screaming inside my head. I&amp;#39;m screaming. I am screaming so loud inside my mind that it&amp;#39;s hurting my brain.&lt;/p&gt;\n\n&lt;p&gt;I know this will get burried and ignored like all my other accounts. Like all my other outstretched hands it will get knocked away. My family. My TWO friends.. Not even friends. What the fuck, I&amp;#39;ll say it.. I have a fiance and someone from my childhood that I have to beg to talk to.. Or be DD for if I ever want to see them..&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m just going to do it tonight. Maybe tomorrow.. I feel like I have to plan this out a little bit more.. I don&amp;#39;t want to make a mess for anybody. I&amp;#39;m a dramatic writer but a very quiet person.. So I should write some notes. I don&amp;#39;t think so, though.. I don&amp;#39;t think I owe anybody anything. They had their chance.&lt;/p&gt;\n\n&lt;p&gt;I think, if anything, I will just walk. I&amp;#39;ll just keep walking with whatever I choose to use. There are thousands of woods between the fields I could use. It will take a long time for anybody to find me, and thats okay. Maybe it&amp;#39;s best they find my bones as opposed to a messier alternative. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;ve made up my mind. I&amp;#39;m done ranting, and I accept that I&amp;#39;m just supposed to add to the awareness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Fuck it. I'm done. I've messaged people seeking help and advice. I've gone to a counselor, I've taken my prescriptions, I've told my fiance..\n\nAnd still this general.. Calm, quiet, unwillingness to talk to me.\n\nI have cried out to EVERYONE I know. \n\nI have been HOSPITALIZED TWICE for psychotic episodes and suicide attempts... Still, people generally leave me alone.\n\nI sit alone in my house all day.. I tell my fiance \"I'm feeling really low today..\" And I get, \"Awe sorry baby, hope you feel better :)\" \n\nWHAT THE FUCK DO I HAVE TO DO TO GET SOMEBODY TO TALK TO ME?! RUN OUT IN TRAFFIC?! CREATE A POST LIKE THIS YELLING AT EVERYONE?! Because believe me.. I freaking tried.. I've made posts asking for help. I've ranted.. I ranted once and got someone ranting back at me and basically HIJACKED MY POST.\n\nAnd by all means, you'll never catch me yelling at someone about stealing my thunder.. In normal conversation, PLEASE TAKE OVER. I'm the most quiet, passive aggressive, non confrontational, helpful person I know. I'm humble. I don't like to talk to people about my problems..\nSo when I actually do, you'd think somebody would take me seriously?\nNOPE\n\nI am trying so hard to keep from crying my fucking eyes out.. But I am so exhausted and tired of not being heard.\nI'm arguing in my head.. Where is the best place to do this? How can I do this without hurting people around me?\nShould I even do it? Will anybody even care?\nThe answer, as everyone has so subtly and quietly shown me, is no.\n\nNobody honestly gives a flying shit. I see that now. I see that it may hurt, but it'll pass.. And people will stop having to roll their eyes at me. \n\nI'm making it sound like I cry wolf a lot, in this post.. I don't. I've told maybe one or two people in my life my intentions.. People know I'm mentally ill. They just don't want to talk to me about it. People know I'm severely depressed right now.. They just want to \"cheer me up\" and go about their day. Nobody wants to talk to me. Not even you guys.. And really, I've tried. I have a huge graveyard of throwaways just begging for some kind of conversation.. Some kind of help. SOME type of interaction where I think for a moment \"Yeah.. I can do this another day.. Thank you ___ for helping me get through it and LISTENING TO ME.\"\n\nI am sorry for the caps.. I'm just screaming inside my head. I'm screaming. I am screaming so loud inside my mind that it's hurting my brain.\n\nI know this will get burried and ignored like all my other accounts. Like all my other outstretched hands it will get knocked away. My family. My TWO friends.. Not even friends. What the fuck, I'll say it.. I have a fiance and someone from my childhood that I have to beg to talk to.. Or be DD for if I ever want to see them..\n\nSo I'm just going to do it tonight. Maybe tomorrow.. I feel like I have to plan this out a little bit more.. I don't want to make a mess for anybody. I'm a dramatic writer but a very quiet person.. So I should write some notes. I don't think so, though.. I don't think I owe anybody anything. They had their chance.\n\nI think, if anything, I will just walk. I'll just keep walking with whatever I choose to use. There are thousands of woods between the fields I could use. It will take a long time for anybody to find me, and thats okay. Maybe it's best they find my bones as opposed to a messier alternative. \n\nBut I've made up my mind. I'm done ranting, and I accept that I'm just supposed to add to the awareness.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zasj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "WOWnobodyACTLLYcares", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zasj/i_have_never_felt_so_ignored_and_failed_by/", "name": "t3_24zasj", "created": 1399522361.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zasj/i_have_never_felt_so_ignored_and_failed_by/", "author_flair_text": null, "title": "I have never felt SO IGNORED and FAILED by everyone around me, including reddit.", "created_utc": 1399493561.0, "ups": 8, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc7bd4", "gilded": 0, "author": "vivadisgrazia", "parent_id": "t3_24zasj", "approved_by": null, "body": "Not feeling heard can be incredibly frustrating and  discouraging. \n\nYou have a very powerful voice in your writing, and given that  you've stated this is very different from your  typical conversational voice, have you considered writing a letter explaining your frustration and disappointment to your fiance and friends? Maybe then they will better understand the seriousness of the situation, and truly understand that you are reaching out for help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not feeling heard can be incredibly frustrating and  discouraging. &lt;/p&gt;\n\n&lt;p&gt;You have a very powerful voice in your writing, and given that  you&amp;#39;ve stated this is very different from your  typical conversational voice, have you considered writing a letter explaining your frustration and disappointment to your fiance and friends? Maybe then they will better understand the seriousness of the situation, and truly understand that you are reaching out for help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zasj", "score_hidden": false, "name": "t1_chc7bd4", "created": 1399528832.0, "author_flair_text": null, "created_utc": 1399500032.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc7f40", "gilded": 0, "author": "daniell61", "parent_id": "t3_24zasj", "approved_by": null, "body": "im here to talk if you need it man.\n\nmaybe one of these days you should just go camping and be out in nature for a day or two with yourself or you and your fiance?\n\ni know what its like to be ignored...it sucks ass.\n\nIF you want to talk. PLEASE PLEASE pm/comment me. im willing to listen/talk :) i have the time dude.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;im here to talk if you need it man.&lt;/p&gt;\n\n&lt;p&gt;maybe one of these days you should just go camping and be out in nature for a day or two with yourself or you and your fiance?&lt;/p&gt;\n\n&lt;p&gt;i know what its like to be ignored...it sucks ass.&lt;/p&gt;\n\n&lt;p&gt;IF you want to talk. PLEASE PLEASE pm/comment me. im willing to listen/talk :) i have the time dude.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zasj", "score_hidden": false, "name": "t1_chc7f40", "created": 1399529060.0, "author_flair_text": null, "created_utc": 1399500260.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc86gh", "gilded": 0, "author": "reverienoire", "parent_id": "t3_24zasj", "approved_by": null, "body": "Talk to us? Talk to me?\n\nI'm sorry to hear that you have no one to turn to in your life right now, and that no one seems to be able to take you seriously and really listen to you and offer more than cheap platitudes. That ALWAYS blows, no matter what the situation. Being heard is important. Having others realize the magnitude of the situation is important. Why can't people get it through their heads that stuff like this is serious and saying something like \"cheer up\" (how condescending, how insensitive!) is dismissive, inappropriate, and making things worse. People really boggle my mind sometimes.\n\nI feel for you, I do. It's hard to fathom how people can be so oblivious. I get that not everyone is equipped to handle stuff like this but you think they'd atleast get you to someone who could! counselors, therapists, support groups, SOMEONE. mental illness is no fucking joke.\n\ni'm angry on your behalf. i'm here to listen. pm me anytime, please.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to us? Talk to me?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry to hear that you have no one to turn to in your life right now, and that no one seems to be able to take you seriously and really listen to you and offer more than cheap platitudes. That ALWAYS blows, no matter what the situation. Being heard is important. Having others realize the magnitude of the situation is important. Why can&amp;#39;t people get it through their heads that stuff like this is serious and saying something like &amp;quot;cheer up&amp;quot; (how condescending, how insensitive!) is dismissive, inappropriate, and making things worse. People really boggle my mind sometimes.&lt;/p&gt;\n\n&lt;p&gt;I feel for you, I do. It&amp;#39;s hard to fathom how people can be so oblivious. I get that not everyone is equipped to handle stuff like this but you think they&amp;#39;d atleast get you to someone who could! counselors, therapists, support groups, SOMEONE. mental illness is no fucking joke.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m angry on your behalf. i&amp;#39;m here to listen. pm me anytime, please.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zasj", "score_hidden": false, "name": "t1_chc86gh", "created": 1399530728.0, "author_flair_text": null, "created_utc": 1399501928.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc8xo1", "gilded": 0, "author": "_Ginger_Snap_", "parent_id": "t3_24zasj", "approved_by": null, "body": "Please message me. I've been there and I totally understand. I'll be here to listen. I know most of the time you just want to bitch out and be heard, and I would love to be that for you. I hear you. Please don't do this. Give it one more shot. Talk to me. Please. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please message me. I&amp;#39;ve been there and I totally understand. I&amp;#39;ll be here to listen. I know most of the time you just want to bitch out and be heard, and I would love to be that for you. I hear you. Please don&amp;#39;t do this. Give it one more shot. Talk to me. Please. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zasj", "score_hidden": false, "name": "t1_chc8xo1", "created": 1399532410.0, "author_flair_text": null, "created_utc": 1399503610.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcarj5", "gilded": 0, "author": "DrewP_Wiener", "parent_id": "t3_24zasj", "approved_by": null, "body": "Hey i see that others have told you to message them (feel free to do the same with me). I had some suicidal thoughts of my own not to long ago and this book ( http://www.amazon.com/No-More-Mr-Nice-Guy/dp/0762415339/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1399507627&amp;sr=1-1&amp;keywords=no+more+mr+nice+guy ) was recommended to me by another redditor and it helped me immensely and from your choice of words it can help you to. It gave me confidence and I enjoy my own company more than I do of others. At first it may seem like it cant help you but give it a try.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey i see that others have told you to message them (feel free to do the same with me). I had some suicidal thoughts of my own not to long ago and this book ( &lt;a href=\"http://www.amazon.com/No-More-Mr-Nice-Guy/dp/0762415339/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1399507627&amp;amp;sr=1-1&amp;amp;keywords=no+more+mr+nice+guy\"&gt;http://www.amazon.com/No-More-Mr-Nice-Guy/dp/0762415339/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1399507627&amp;amp;sr=1-1&amp;amp;keywords=no+more+mr+nice+guy&lt;/a&gt; ) was recommended to me by another redditor and it helped me immensely and from your choice of words it can help you to. It gave me confidence and I enjoy my own company more than I do of others. At first it may seem like it cant help you but give it a try.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zasj", "score_hidden": false, "name": "t1_chcarj5", "created": 1399536558.0, "author_flair_text": null, "created_utc": 1399507758.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]