[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I never once thought this could happen to me.  I was always pretty healthy and then, boom, cancer?  I never took my health for granted either. I have all the classic symptoms listed and they&amp;#39;re worsening. I&amp;#39;m pretty certain it&amp;#39;s an aggressive form. I saw a doctor about this a month before I relocated for my job, he told me to keep him updated out of concern.I intend to commit suicide instead, because I can&amp;#39;t handle watching my body deteriorate from continuous radiation and chemotherapy.  I had just gotten my life back online, when all of the sudden I developed these symptoms.  I&amp;#39;m like, what kind of cruel joke is this?  I know the medical bills and condition will rob me of my recently acquired independence.  I just don&amp;#39;t have the mental fortitude for this, the lifestyle associated with cancer.  And I&amp;#39;m just looking at healthy people in envy(even the fatties. I never thought one day I&amp;#39;d envy them. especially because they trash a potentially healthy body whereas I diet, exercise.)&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s odd is in my sleep paralysis episodes, shortly before I felt the first lump in my armpit, I heard slime-ish,alien creatures bubbling near me. It&amp;#39;s like my body/subconscious knew I had an imposter in it. Weird lol.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see anything inspirational about having cancer. And I&amp;#39;ve always detested those stupid cancer runs, that Susan G. whatever.  I always thought making cancer look inspirational in the media for fake people to fawn over was sickening. I don&amp;#39;t want to be in some stupid Facebook &amp;#39;inspirational&amp;#39; screenshot meme about cancer for idiots to fawn over either.  I&amp;#39;m not even letting my adoptive mom know.  I hate that stupid bitch.  She&amp;#39;d just be saying &amp;#39;I&amp;#39;m so sorry&amp;#39; and &amp;#39;God did this because you can handle it&amp;#39; with a slight smirk and twinkle in her eye.  I was content and happy, then boom nightmare in a blink.  I keep hoping I&amp;#39;ll wake up but this time it&amp;#39;s for real.&lt;/p&gt;\n\n&lt;p&gt;edit: I wish I could be forever but I can&amp;#39;t.  I wonder why God would do/allow this(like he cares lol) but there&amp;#39;s no answer.  I&amp;#39;m fairly certain I&amp;#39;m leaning towards suicide bc it&amp;#39;s never a guarantee cancer can&amp;#39;t worsen.  Cancer is more than a trip to the dentist&amp;#39;s office, complex and unpredictable in it&amp;#39;s ramifications for the body. It&amp;#39;s a mean, 10-dimensional thing I don&amp;#39;t want to deal with. I err towards the side of caution, don&amp;#39;t want to end up in a nightmare.  I don&amp;#39;t think the trees outside have ever looked this beautiful(but the world also isn&amp;#39;t pretty anymore.) but I have to weigh my options accordingly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I never once thought this could happen to me.  I was always pretty healthy and then, boom, cancer?  I never took my health for granted either. I have all the classic symptoms listed and they're worsening. I'm pretty certain it's an aggressive form. I saw a doctor about this a month before I relocated for my job, he told me to keep him updated out of concern.I intend to commit suicide instead, because I can't handle watching my body deteriorate from continuous radiation and chemotherapy.  I had just gotten my life back online, when all of the sudden I developed these symptoms.  I'm like, what kind of cruel joke is this?  I know the medical bills and condition will rob me of my recently acquired independence.  I just don't have the mental fortitude for this, the lifestyle associated with cancer.  And I'm just looking at healthy people in envy(even the fatties. I never thought one day I'd envy them. especially because they trash a potentially healthy body whereas I diet, exercise.)\n\nWhat's odd is in my sleep paralysis episodes, shortly before I felt the first lump in my armpit, I heard slime-ish,alien creatures bubbling near me. It's like my body/subconscious knew I had an imposter in it. Weird lol.\n\nI don't see anything inspirational about having cancer. And I've always detested those stupid cancer runs, that Susan G. whatever.  I always thought making cancer look inspirational in the media for fake people to fawn over was sickening. I don't want to be in some stupid Facebook 'inspirational' screenshot meme about cancer for idiots to fawn over either.  I'm not even letting my adoptive mom know.  I hate that stupid bitch.  She'd just be saying 'I'm so sorry' and 'God did this because you can handle it' with a slight smirk and twinkle in her eye.  I was content and happy, then boom nightmare in a blink.  I keep hoping I'll wake up but this time it's for real.\n\nedit: I wish I could be forever but I can't.  I wonder why God would do/allow this(like he cares lol) but there's no answer.  I'm fairly certain I'm leaning towards suicide bc it's never a guarantee cancer can't worsen.  Cancer is more than a trip to the dentist's office, complex and unpredictable in it's ramifications for the body. It's a mean, 10-dimensional thing I don't want to deal with. I err towards the side of caution, don't want to end up in a nightmare.  I don't think the trees outside have ever looked this beautiful(but the world also isn't pretty anymore.) but I have to weigh my options accordingly.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24epww", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "xcelsius01", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399067512.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24epww/i_have_lymphomapretty_sure_of_it/", "name": "t3_24epww", "created": 1398927146.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24epww/i_have_lymphomapretty_sure_of_it/", "author_flair_text": null, "title": "I have lymphoma(pretty sure of it).", "created_utc": 1398898346.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6fec8", "gilded": 0, "author": "cheese725", "parent_id": "t1_ch6ez1m", "approved_by": null, "body": "Do whatever you can. And even if you're not scared of heights, trust me, it would still be fun.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do whatever you can. And even if you&amp;#39;re not scared of heights, trust me, it would still be fun.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24epww", "score_hidden": false, "name": "t1_ch6fec8", "created": 1398905436.0, "author_flair_text": null, "created_utc": 1398901836.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6ez1m", "gilded": 0, "author": "xcelsius01", "parent_id": "t1_ch6eqnv", "approved_by": null, "body": "No, those things never appealed to me.  I'm not the least scared of heights so skydiving would be boring. And I personally can't enjoy anything with cancer lingering in my head. It's easy enough for you to say.  You don't have to feel betrayed by your body. You don't have cancer on your mind.  I like routine, I can't just say 'Fuck all' and do whatever. I spent all my time inside my room feeling safe from everything then internal chaos blooms inside of me?", "edited": 1398901075.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, those things never appealed to me.  I&amp;#39;m not the least scared of heights so skydiving would be boring. And I personally can&amp;#39;t enjoy anything with cancer lingering in my head. It&amp;#39;s easy enough for you to say.  You don&amp;#39;t have to feel betrayed by your body. You don&amp;#39;t have cancer on your mind.  I like routine, I can&amp;#39;t just say &amp;#39;Fuck all&amp;#39; and do whatever. I spent all my time inside my room feeling safe from everything then internal chaos blooms inside of me?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24epww", "score_hidden": false, "name": "t1_ch6ez1m", "created": 1398929674.0, "author_flair_text": null, "created_utc": 1398900874.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6eqnv", "gilded": 0, "author": "cheese725", "parent_id": "t3_24epww", "approved_by": null, "body": "Dude, make a bucket list and do everything on it. It'll be totally worth while, and most things on it are fun. This man raised $8 million in a week for the Teen Cancer Trust. If you really think you are going to die, suicide isn't a good way to go. First, jump out of a plane, learn to dance from a professional, go to a really nice club and have fun. Do anything you can and (Although it sounds cheesey) live life to it's fullest. Hope this helped.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, make a bucket list and do everything on it. It&amp;#39;ll be totally worth while, and most things on it are fun. This man raised $8 million in a week for the Teen Cancer Trust. If you really think you are going to die, suicide isn&amp;#39;t a good way to go. First, jump out of a plane, learn to dance from a professional, go to a really nice club and have fun. Do anything you can and (Although it sounds cheesey) live life to it&amp;#39;s fullest. Hope this helped.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24epww", "score_hidden": false, "name": "t1_ch6eqnv", "created": 1398929143.0, "author_flair_text": null, "created_utc": 1398900343.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]