[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday I finally started to look into some methods but it was way more complicated than I first thought. I can&amp;#39;t imagine how much it would suck to survive an attempt. First I looked into hanging but its quite painful if you don&amp;#39;t do it with a drop and I have yet to find a place to do it with a drop. My sister&amp;#39;s room has a nice drop from the attic that will work but I don&amp;#39;t want her to be sleeping in the room where they found me hanging. I searched how to make ricine but it takes too long to make and I doubt it if I can make it pure enough. Also looked up the castor bean itself and lily of the valley but you first get sick probably and might even puke it out..  Drowning seems like a good method but I can&amp;#39;t find the right place to do it. If I do it in the bathtub I will just get myself out of the water. I should need to find a river and tie a heavy rock to my leg.&lt;br/&gt;\nYesterday was different, I didn&amp;#39;t feel depressed or anything like every non-happy moment in my life. I didn&amp;#39;t give any fuck about anything other than finding the best method.&lt;br/&gt;\nI&amp;#39;m 17 and many other kids out there are probably dealing with more difficult things than me. For as long as I remember I played games to get out of this world but recently I lost the desire for it. I tried getting addicted to some games but it just didn&amp;#39;t work. I got diagnosed with autism 1-3 years ago which explains many things. When I was younger I got bullied sometimes by kids 4 years younger than me because of my social ineptness. Nothing much has changed about that, needles to say I have no friends or girlfriend, I only have the unconditional love of my parents. Not that I crave that much for friends, I can kill time alone too and I can&amp;#39;t tell my thoughts to others other than the people on reddit anyways.&lt;br/&gt;\n What my brain does crave for though is a gf. I feel like a guy with no legs trying to run a marathon. Fuck my brain. I had several attempts, some more heroic than others but usually I get an indifferent response.&lt;br/&gt;\nLately I became more prone to sounds(due to autism). Everyday at school is pretty much hell. I have a big class and I feel like they are having some competition about who can make the most noise.  Most of them act like a five year olds with an attention deficit. Making extremely dumb remarks. Then there is also this douchebag. He has an very hot gf that is very sweet to him and yet I heared that he is cheating on her with an other girl. I just don&amp;#39;t get it.  &lt;/p&gt;\n\n&lt;p&gt;I have no idea what I want to become when I&amp;#39;m older. I lost my will to study too.  &lt;/p&gt;\n\n&lt;p&gt;I also find it utterly frustrating that I can&amp;#39;t have a decent talk with anyone else than close family. Usually I just get awkward or nod the entire time and don&amp;#39;t say a thing. AND I know for sure that this will never change. I read alot online about social stuff but when I comes down to the moment I&amp;#39;m lost.  &lt;/p&gt;\n\n&lt;p&gt;I sometimes get irrationally angry when I hear ringing in my ears. I never listen to loud music, never went to a party and when a train passes I put my fingers in my ears and yet I have it. I think I got it from my nephew who does the &amp;quot;Hey psssss, listen&amp;quot; thing and then either blows as hard as he can or yells (when I was younger that is). Or just from the classroom that gives me headache from all the noise my classmates make. Idk.  &lt;/p&gt;\n\n&lt;p&gt;Yet after every time reality hits me I get the sudden rush of optimism and epiphany which just kinda keeps me going...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yesterday I finally started to look into some methods but it was way more complicated than I first thought. I can't imagine how much it would suck to survive an attempt. First I looked into hanging but its quite painful if you don't do it with a drop and I have yet to find a place to do it with a drop. My sister's room has a nice drop from the attic that will work but I don't want her to be sleeping in the room where they found me hanging. I searched how to make ricine but it takes too long to make and I doubt it if I can make it pure enough. Also looked up the castor bean itself and lily of the valley but you first get sick probably and might even puke it out..  Drowning seems like a good method but I can't find the right place to do it. If I do it in the bathtub I will just get myself out of the water. I should need to find a river and tie a heavy rock to my leg.  \nYesterday was different, I didn't feel depressed or anything like every non-happy moment in my life. I didn't give any fuck about anything other than finding the best method.  \nI'm 17 and many other kids out there are probably dealing with more difficult things than me. For as long as I remember I played games to get out of this world but recently I lost the desire for it. I tried getting addicted to some games but it just didn't work. I got diagnosed with autism 1-3 years ago which explains many things. When I was younger I got bullied sometimes by kids 4 years younger than me because of my social ineptness. Nothing much has changed about that, needles to say I have no friends or girlfriend, I only have the unconditional love of my parents. Not that I crave that much for friends, I can kill time alone too and I can't tell my thoughts to others other than the people on reddit anyways.   \n What my brain does crave for though is a gf. I feel like a guy with no legs trying to run a marathon. Fuck my brain. I had several attempts, some more heroic than others but usually I get an indifferent response.  \nLately I became more prone to sounds(due to autism). Everyday at school is pretty much hell. I have a big class and I feel like they are having some competition about who can make the most noise.  Most of them act like a five year olds with an attention deficit. Making extremely dumb remarks. Then there is also this douchebag. He has an very hot gf that is very sweet to him and yet I heared that he is cheating on her with an other girl. I just don't get it.  \n\nI have no idea what I want to become when I'm older. I lost my will to study too.  \n\nI also find it utterly frustrating that I can't have a decent talk with anyone else than close family. Usually I just get awkward or nod the entire time and don't say a thing. AND I know for sure that this will never change. I read alot online about social stuff but when I comes down to the moment I'm lost.  \n\nI sometimes get irrationally angry when I hear ringing in my ears. I never listen to loud music, never went to a party and when a train passes I put my fingers in my ears and yet I have it. I think I got it from my nephew who does the \"Hey psssss, listen\" thing and then either blows as hard as he can or yells (when I was younger that is). Or just from the classroom that gives me headache from all the noise my classmates make. Idk.  \n \n  \n  \n  \nYet after every time reality hits me I get the sudden rush of optimism and epiphany which just kinda keeps me going...", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24g38w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "denart4", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24g38w/i_had_the_thoughts_for_the_first_time_in_my_life/", "name": "t3_24g38w", "created": 1398970739.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24g38w/i_had_the_thoughts_for_the_first_time_in_my_life/", "author_flair_text": null, "title": "I had the thoughts for the first time in my life.", "created_utc": 1398941939.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6slbo", "gilded": 0, "author": "pambie", "parent_id": "t3_24g38w", "approved_by": null, "body": "Your life sounds like a real struggle at the moment. Have you talked to someone who can make a difference, especially at school where the noise level is making things so hard? I haven't got autism, but there are perhaps ideas at /r/autism from people who know strategies to cope with it and at /r/depression for the way it leaves you feeling. If you can get the BBC iplayer where you are there is a really good Horizon programme about the subject too, with the most up to date information.\n\nPlease don't think that things will never change. I spent time working on a project with young people with Aspergers  and it was amazing how things could improve for them when they got more experience of the world and how to deal with situations. Many young people have a tough time feeling that they don't fit in, or that they have no direction in their lives and you have got autism to deal with on top of these common feelings which is giving you a double dose of misery at the moment. Some of this may well improve just by staying alive and getting older.\n\nAs for what you want to do after education, could you see a career counselor? Start working out what appeals to you? You already have a starting point by knowing that you want a peaceful environment. Do you have any particular skills that you would want to use? Could you, instead of researching suicide methods, deliberately distract yourself by looking at different careers? I know someone with really quite severe aspergers who loves to cycle and mess about with machinery and became a bike technician so that he could get engrossed in something on his own and without noise and distraction. The world has many more opportunities than the obvious ones and you can take your time exploring them.\n\nPlease don't think I'm ignoring your feelings that you just can't bear it. I can't comment on methods of dying because I don't have that knowledge. Your very last sentence makes me think that there are other routes to take and I've concentrated on them.\n\nI wish you good luck and a good pair of noise cancelling headphones :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your life sounds like a real struggle at the moment. Have you talked to someone who can make a difference, especially at school where the noise level is making things so hard? I haven&amp;#39;t got autism, but there are perhaps ideas at &lt;a href=\"/r/autism\"&gt;/r/autism&lt;/a&gt; from people who know strategies to cope with it and at &lt;a href=\"/r/depression\"&gt;/r/depression&lt;/a&gt; for the way it leaves you feeling. If you can get the BBC iplayer where you are there is a really good Horizon programme about the subject too, with the most up to date information.&lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t think that things will never change. I spent time working on a project with young people with Aspergers  and it was amazing how things could improve for them when they got more experience of the world and how to deal with situations. Many young people have a tough time feeling that they don&amp;#39;t fit in, or that they have no direction in their lives and you have got autism to deal with on top of these common feelings which is giving you a double dose of misery at the moment. Some of this may well improve just by staying alive and getting older.&lt;/p&gt;\n\n&lt;p&gt;As for what you want to do after education, could you see a career counselor? Start working out what appeals to you? You already have a starting point by knowing that you want a peaceful environment. Do you have any particular skills that you would want to use? Could you, instead of researching suicide methods, deliberately distract yourself by looking at different careers? I know someone with really quite severe aspergers who loves to cycle and mess about with machinery and became a bike technician so that he could get engrossed in something on his own and without noise and distraction. The world has many more opportunities than the obvious ones and you can take your time exploring them.&lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t think I&amp;#39;m ignoring your feelings that you just can&amp;#39;t bear it. I can&amp;#39;t comment on methods of dying because I don&amp;#39;t have that knowledge. Your very last sentence makes me think that there are other routes to take and I&amp;#39;ve concentrated on them.&lt;/p&gt;\n\n&lt;p&gt;I wish you good luck and a good pair of noise cancelling headphones :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24g38w", "score_hidden": false, "name": "t1_ch6slbo", "created": 1398974604.0, "author_flair_text": null, "created_utc": 1398945804.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch70y2h", "gilded": 0, "author": "TheQuack45", "parent_id": "t3_24g38w", "approved_by": null, "body": "Hey, this is a bit late but I read this and I think I really can relate to you, quite a bit...\n\nI'm on my phone at the moment but I'll be on my desktop soon, I'll write a good response then.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, this is a bit late but I read this and I think I really can relate to you, quite a bit...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m on my phone at the moment but I&amp;#39;ll be on my desktop soon, I&amp;#39;ll write a good response then.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24g38w", "score_hidden": false, "name": "t1_ch70y2h", "created": 1398995589.0, "author_flair_text": null, "created_utc": 1398966789.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]