[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a 15 year old girl, almost 16. I know it is quite young to be on here, but I need help. When I was born, I had a wheeze in my chest. They checked it out and it turned out to be a minor hole. Wasn&amp;#39;t too big of a deal. We just went in for yearly checkups. In third grade at another one of these checkups they found a leaky valve. This is called Mitral Valve Regurgitation. We kept watch of it and kept going in for yearly checkups. Sixth grade, I was 12. They found something extraordinary and very rare. Anomylous Origin of The Coronary Artery. My coronary is in the wrong area. I can not exercise or do anything to get my heart rate over 120 bpm. I became the New Guinea Pig for MRIs and other machines. It was very stressful because we traveled a lot. I was young and didn&amp;#39;t understand fully. The past years I&amp;#39;ve done research on it. About .014% of the world has this and there are no signs. Many just die instantly. I could die instantly at any moment because of this. I can&amp;#39;t do any sports or pe or any fun activities in school. A year ago, I was diagnosed with depression, and social anxiety. This was terrible for me. If anyone was starring at me, my anxiety would kick in and raise my heart rate. I began self harming due to all of this, and of course, bullying. Three boys tried to kill me by raising my heart rate, five girls tried to jump me, and rumors were spread about me. All in one week. My thighs, hips, and stomach were full of slits. I couldn&amp;#39;t stop. It became addicting. I began making myself throw up, and actually burnt my neck and thigh. It got really bad, so I tried to flush away my blade. My parents found it, and took me to counseling. I hated talking to people and that&amp;#39;s when she diagnosed me. I faked getting better for a while and they took me out of counseling. Now I can&amp;#39;t think or do anything. Instead of hurting myself with fear of heading down that road again, I lock myself in my room, have panic attacks, write suicide notes, and then stare blankly at the wall. I don&amp;#39;t have anywhere else to turn without dreading it. What should I do? How can I get better? Thank you if you take the time to read this and try to understand.... &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am a 15 year old girl, almost 16. I know it is quite young to be on here, but I need help. When I was born, I had a wheeze in my chest. They checked it out and it turned out to be a minor hole. Wasn't too big of a deal. We just went in for yearly checkups. In third grade at another one of these checkups they found a leaky valve. This is called Mitral Valve Regurgitation. We kept watch of it and kept going in for yearly checkups. Sixth grade, I was 12. They found something extraordinary and very rare. Anomylous Origin of The Coronary Artery. My coronary is in the wrong area. I can not exercise or do anything to get my heart rate over 120 bpm. I became the New Guinea Pig for MRIs and other machines. It was very stressful because we traveled a lot. I was young and didn't understand fully. The past years I've done research on it. About .014% of the world has this and there are no signs. Many just die instantly. I could die instantly at any moment because of this. I can't do any sports or pe or any fun activities in school. A year ago, I was diagnosed with depression, and social anxiety. This was terrible for me. If anyone was starring at me, my anxiety would kick in and raise my heart rate. I began self harming due to all of this, and of course, bullying. Three boys tried to kill me by raising my heart rate, five girls tried to jump me, and rumors were spread about me. All in one week. My thighs, hips, and stomach were full of slits. I couldn't stop. It became addicting. I began making myself throw up, and actually burnt my neck and thigh. It got really bad, so I tried to flush away my blade. My parents found it, and took me to counseling. I hated talking to people and that's when she diagnosed me. I faked getting better for a while and they took me out of counseling. Now I can't think or do anything. Instead of hurting myself with fear of heading down that road again, I lock myself in my room, have panic attacks, write suicide notes, and then stare blankly at the wall. I don't have anywhere else to turn without dreading it. What should I do? How can I get better? Thank you if you take the time to read this and try to understand.... ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24r1fb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BeatlesCrazy", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24r1fb/i_have_problems_and_need_help/", "name": "t3_24r1fb", "created": 1399293142.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24r1fb/i_have_problems_and_need_help/", "author_flair_text": null, "title": "I have problems, and need help.", "created_utc": 1399264342.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9vqrw", "gilded": 0, "author": "hellstrange", "parent_id": "t1_ch9ujm6", "approved_by": null, "body": "Surgery is scary. I would never deny that. And you are most welcome. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surgery is scary. I would never deny that. And you are most welcome. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r1fb", "score_hidden": false, "name": "t1_ch9vqrw", "created": 1399275038.0, "author_flair_text": null, "created_utc": 1399271438.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9ujm6", "gilded": 0, "author": "BeatlesCrazy", "parent_id": "t1_ch9ucjv", "approved_by": null, "body": "Thank you for this. I am sorry to hear about your mother. You have a very valid point there. I guess decimals just scare me but I need to remember there are billions of people out there. I do know that they are doing some advanced cardiac technology. San Francisco medical schools are working on some new ones based off of my echocardiograms. The bad thing is, I can get surgery to fix it, but it's my biggest fear. Thank you for caring and reading this, and thank you. I will remember to message you if I need someone to talk to. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. I am sorry to hear about your mother. You have a very valid point there. I guess decimals just scare me but I need to remember there are billions of people out there. I do know that they are doing some advanced cardiac technology. San Francisco medical schools are working on some new ones based off of my echocardiograms. The bad thing is, I can get surgery to fix it, but it&amp;#39;s my biggest fear. Thank you for caring and reading this, and thank you. I will remember to message you if I need someone to talk to. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r1fb", "score_hidden": false, "name": "t1_ch9ujm6", "created": 1399295799.0, "author_flair_text": null, "created_utc": 1399266999.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9ucjv", "gilded": 0, "author": "hellstrange", "parent_id": "t3_24r1fb", "approved_by": null, "body": "Your situation is painfully dear to my heart. I lost my mother to Endocarditis and I have a beautiful friend that has an irregular heart beat among other problems. I know it's tough. Those kids that bothered you are just shitty human beings. Sadly, it probably has less to do with you and more to do with them. I know it's hard to not give a fuck about people, I deal with social anxiety from time to time, but don't let them get the better of you. They don't deserve to. \n\n\nPerhaps a lot of people with your condition die, but think about .014%, that's actually is a lot of people, and that means that it's a condition that gets a lot of attention. Your odds of survival fall in your favor more and more as time passes. We are making a lot of headway in cardiac technology. I personally know people in the biomedical field and they are truly amazing. \n\nI know opening up to people is hard too, but if you need to talk I will check back periodically. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your situation is painfully dear to my heart. I lost my mother to Endocarditis and I have a beautiful friend that has an irregular heart beat among other problems. I know it&amp;#39;s tough. Those kids that bothered you are just shitty human beings. Sadly, it probably has less to do with you and more to do with them. I know it&amp;#39;s hard to not give a fuck about people, I deal with social anxiety from time to time, but don&amp;#39;t let them get the better of you. They don&amp;#39;t deserve to. &lt;/p&gt;\n\n&lt;p&gt;Perhaps a lot of people with your condition die, but think about .014%, that&amp;#39;s actually is a lot of people, and that means that it&amp;#39;s a condition that gets a lot of attention. Your odds of survival fall in your favor more and more as time passes. We are making a lot of headway in cardiac technology. I personally know people in the biomedical field and they are truly amazing. &lt;/p&gt;\n\n&lt;p&gt;I know opening up to people is hard too, but if you need to talk I will check back periodically. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r1fb", "score_hidden": false, "name": "t1_ch9ucjv", "created": 1399295157.0, "author_flair_text": null, "created_utc": 1399266357.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]