[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s everyday. I think about killing myself everyday. I can&amp;#39;t stand the thought of living another day on this planet . My responsibilities are building up and becoming more difficult to fulfill. I&amp;#39;m so lazy , I have assignments up to my ears and finals are around the corner. I&amp;#39;m a junior and I still haven&amp;#39;t found an internship. I came into this major thinking about med school. Now I&amp;#39;m just trying to pass my classes hoping I graduate on time. I&amp;#39;m scared that I&amp;#39;ll be a semester late. And I just don&amp;#39;t compare that well to my other brown peers. Off at Northeastern, BU,MIT. I feel so pathetic. I&amp;#39;m scared that my future doesn&amp;#39;t hold anything for me. I&amp;#39;m just stupid and can&amp;#39;t focus. All the necessary resources are at my disposal but I still can&amp;#39;t manage to do anything. I&amp;#39;m so average and boring. I&amp;#39;m pretty sure I&amp;#39;m going to die alone because I&amp;#39;m afraid that no one will find me physically attractive. I&amp;#39;m just scared that all the hard work my grandparent and mom put into raising us has proved worthless. By the time I graduate I&amp;#39;ll be drowning in loans. I want to tell my doctor that I think about it everyday. When I filled out the mental health form for her she didn&amp;#39;t even look at it. I just hate feeling like everyone is looking down at me. &lt;/p&gt;\n\n&lt;p&gt;I just feel so frustrated all the time. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's everyday. I think about killing myself everyday. I can't stand the thought of living another day on this planet . My responsibilities are building up and becoming more difficult to fulfill. I'm so lazy , I have assignments up to my ears and finals are around the corner. I'm a junior and I still haven't found an internship. I came into this major thinking about med school. Now I'm just trying to pass my classes hoping I graduate on time. I'm scared that I'll be a semester late. And I just don't compare that well to my other brown peers. Off at Northeastern, BU,MIT. I feel so pathetic. I'm scared that my future doesn't hold anything for me. I'm just stupid and can't focus. All the necessary resources are at my disposal but I still can't manage to do anything. I'm so average and boring. I'm pretty sure I'm going to die alone because I'm afraid that no one will find me physically attractive. I'm just scared that all the hard work my grandparent and mom put into raising us has proved worthless. By the time I graduate I'll be drowning in loans. I want to tell my doctor that I think about it everyday. When I filled out the mental health form for her she didn't even look at it. I just hate feeling like everyone is looking down at me. \n\n\nI just feel so frustrated all the time. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2423ai", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Sickofthesethoughts", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2423ai/i_hate_these_thoughts/", "name": "t3_2423ai", "created": 1398576292.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2423ai/i_hate_these_thoughts/", "author_flair_text": null, "title": "I hate these thoughts", "created_utc": 1398547492.0, "ups": 7, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ut90", "gilded": 0, "author": "areyoutoasty", "parent_id": "t3_2423ai", "approved_by": null, "body": "You are not stupid, or boring, in fact I can already tell you are more intelligent than me. Attending an Ivy League school is an achievement in itself. I know it is tough to live with depression, just excuse yourself for making mistakes or struggling. Depression is a burden, and frankly you are incredibly tough for having the will to stay alive. Just make it easier on yourself and go get help. Tell your mother and your grandpa. They care about you. Go to a different doctor, you do not need to put up with any condescending bs. Go do something you can enjoy, maybe take a break from college. It sounds like the stress is seriously taking a toll on you. Dont worry about the future, it hasn't come yet, you still have plenty of time to figure it out. Pm me if you want. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not stupid, or boring, in fact I can already tell you are more intelligent than me. Attending an Ivy League school is an achievement in itself. I know it is tough to live with depression, just excuse yourself for making mistakes or struggling. Depression is a burden, and frankly you are incredibly tough for having the will to stay alive. Just make it easier on yourself and go get help. Tell your mother and your grandpa. They care about you. Go to a different doctor, you do not need to put up with any condescending bs. Go do something you can enjoy, maybe take a break from college. It sounds like the stress is seriously taking a toll on you. Dont worry about the future, it hasn&amp;#39;t come yet, you still have plenty of time to figure it out. Pm me if you want. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2423ai", "score_hidden": false, "name": "t1_ch2ut90", "created": 1398554184.0, "author_flair_text": null, "created_utc": 1398550584.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]