[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 23 from the UK. Recently I&amp;#39;ve managed to start seeing some old friends again they make me feel good when I&amp;#39;m with them. Before this I was in a mental hospital for ages and lost contact with the world. I was diagnosed with psychosis and depression. I came off meds last year and all has been ok except for withdrawals which I&amp;#39;m now pretty much over. I feel like I have no hope for my future. My two friends will probably move away soon - which stresses me as they&amp;#39;re my only friends. I don&amp;#39;t have a job or study - but I lead a comfortable life and I&amp;#39;m riddled with guilt because it all comes from state support and I feel undeserving and like a fraud. I got dropped from my mental health team today after I moved areas (only slightly away from my last home) but I had a bit of an argument with them and now I feel unworthy and like a time waster. I live on my own and I think about dying a lot. I just don&amp;#39;t know what the way forward is. Please somebody talk to me - I&amp;#39;m very close to just doing something to myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all. \n\nI'm 23 from the UK. Recently I've managed to start seeing some old friends again they make me feel good when I'm with them. Before this I was in a mental hospital for ages and lost contact with the world. I was diagnosed with psychosis and depression. I came off meds last year and all has been ok except for withdrawals which I'm now pretty much over. I feel like I have no hope for my future. My two friends will probably move away soon - which stresses me as they're my only friends. I don't have a job or study - but I lead a comfortable life and I'm riddled with guilt because it all comes from state support and I feel undeserving and like a fraud. I got dropped from my mental health team today after I moved areas (only slightly away from my last home) but I had a bit of an argument with them and now I feel unworthy and like a time waster. I live on my own and I think about dying a lot. I just don't know what the way forward is. Please somebody talk to me - I'm very close to just doing something to myself.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24z2h6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Abandonship22", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24z2h6/i_just_want_people_to_know_how_much_im_hurting/", "name": "t3_24z2h6", "created": 1399517605.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24z2h6/i_just_want_people_to_know_how_much_im_hurting/", "author_flair_text": null, "title": "I just want people to know how much I'm hurting", "created_utc": 1399488805.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc1px6", "gilded": 0, "author": "Abandonship22", "parent_id": "t3_24z2h6", "approved_by": null, "body": "I should add that I can't work either -  I need to have a low stress life. I don't have a partner but I'm told I'm good looking/funny... It just doesn't add up, I can't be who I want to be I feel like I'm already dead.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should add that I can&amp;#39;t work either -  I need to have a low stress life. I don&amp;#39;t have a partner but I&amp;#39;m told I&amp;#39;m good looking/funny... It just doesn&amp;#39;t add up, I can&amp;#39;t be who I want to be I feel like I&amp;#39;m already dead.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24z2h6", "score_hidden": false, "name": "t1_chc1px6", "created": 1399517849.0, "author_flair_text": null, "created_utc": 1399489049.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]