[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I almost killed myself today. I had the knife pressed against my wrist, and I was going to do it. I don&amp;#39;t know what stopped me from making the first cut, but I didn&amp;#39;t do it, because I knew if I made that first cut, I wouldn&amp;#39;t stop. &lt;/p&gt;\n\n&lt;p&gt;I am weak and pathetic to stoop to such levels, to almost end my life. I have never come so close to killing myself before, and it terrifies me that I would ever think of doing something as selfish as that. I hate myself for that, and I hate what I have become over the last few months.&lt;/p&gt;\n\n&lt;p&gt;Every day, I put on this mask. A perfect mask to hide my pain, and no one suspects a thing. But it hurts so fucking much to wear it. It&amp;#39;s killing me to do so. I feel invisible. Whenever my friends get suspicious and try to help, I push them away and hurt them in the process. I am an empty husk, I have lost my hope. Staying stong hurts too god damn much. I am weak anyways, so I doubt I will make it to my 18th birthday alive. My emotions have been bottled up for far too long. People have ignored ne for far too long. I will be missed by my family, but it&amp;#39;s pointless, because I hate half of them. My friends will probably blame themselves. They were not the cause of my depression. Life was. &lt;/p&gt;\n\n&lt;p&gt;Thank you, to anyone who is reading this. I need to know that someone out there could still hear me. I do not know if I will kill myself, but by my best guess, it&amp;#39;s about a 50/50 chance either way. Please, try and get help before you turn into a self loathing monster like me. &lt;/p&gt;\n\n&lt;p&gt;Goodbye for now\nRenee&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I almost killed myself today. I had the knife pressed against my wrist, and I was going to do it. I don't know what stopped me from making the first cut, but I didn't do it, because I knew if I made that first cut, I wouldn't stop. \n\nI am weak and pathetic to stoop to such levels, to almost end my life. I have never come so close to killing myself before, and it terrifies me that I would ever think of doing something as selfish as that. I hate myself for that, and I hate what I have become over the last few months.\n\n Every day, I put on this mask. A perfect mask to hide my pain, and no one suspects a thing. But it hurts so fucking much to wear it. It's killing me to do so. I feel invisible. Whenever my friends get suspicious and try to help, I push them away and hurt them in the process. I am an empty husk, I have lost my hope. Staying stong hurts too god damn much. I am weak anyways, so I doubt I will make it to my 18th birthday alive. My emotions have been bottled up for far too long. People have ignored ne for far too long. I will be missed by my family, but it's pointless, because I hate half of them. My friends will probably blame themselves. They were not the cause of my depression. Life was. \n\nThank you, to anyone who is reading this. I need to know that someone out there could still hear me. I do not know if I will kill myself, but by my best guess, it's about a 50/50 chance either way. Please, try and get help before you turn into a self loathing monster like me. \n\nGoodbye for now\nRenee", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241xud", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lonely_writer", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241xud/i_just_need_to_tell_somebody/", "name": "t3_241xud", "created": 1398572377.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241xud/i_just_need_to_tell_somebody/", "author_flair_text": null, "title": "I just need to tell somebody", "created_utc": 1398543577.0, "ups": 8, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2sver", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2stxb", "approved_by": null, "body": "Okay, get some sleep, sleep is good. I'm glad you've been able to sort a few things out for yourself. And as you said, the only way is up.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, get some sleep, sleep is good. I&amp;#39;m glad you&amp;#39;ve been able to sort a few things out for yourself. And as you said, the only way is up.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2sver", "created": 1398549322.0, "author_flair_text": null, "created_utc": 1398545722.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2stxb", "gilded": 0, "author": "lonely_writer", "parent_id": "t1_ch2sikg", "approved_by": null, "body": "I think I'm going to be okay for tonight. But if I ever do feel like this again, I promise you that I will message you, or try and get help for myself. I don't want to hit rock bottom again. And the only place you can go from here is up, so thank you, for helping me see that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I&amp;#39;m going to be okay for tonight. But if I ever do feel like this again, I promise you that I will message you, or try and get help for myself. I don&amp;#39;t want to hit rock bottom again. And the only place you can go from here is up, so thank you, for helping me see that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2stxb", "created": 1398549220.0, "author_flair_text": null, "created_utc": 1398545620.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2sikg", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2sehd", "approved_by": null, "body": "It's good to realise that you have a life ahead of you, and whatever it is that stopped you doing it, I'm grateful for it too. Hopefully it means that this isn't what you want to do, you don't want to end your life, you just don't know how things are going to get better. Well if it helps to talk about this stuff maybe send me a PM or something, I'm always happy to listen, and if you feel like things are heading this way in future please try to find help before it gets to this point, post here and someone will always try to help. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s good to realise that you have a life ahead of you, and whatever it is that stopped you doing it, I&amp;#39;m grateful for it too. Hopefully it means that this isn&amp;#39;t what you want to do, you don&amp;#39;t want to end your life, you just don&amp;#39;t know how things are going to get better. Well if it helps to talk about this stuff maybe send me a PM or something, I&amp;#39;m always happy to listen, and if you feel like things are heading this way in future please try to find help before it gets to this point, post here and someone will always try to help. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2sikg", "created": 1398548436.0, "author_flair_text": null, "created_utc": 1398544836.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2sehd", "gilded": 0, "author": "lonely_writer", "parent_id": "t1_ch2s787", "approved_by": null, "body": "Thank you. I feel like no one can hear me, even though I'm screaming my lungs out. I'm glad that I didn't go through with that, because I have a life ahead of me, but the world is just so cruel sometimes, that I don't even know if I want to live. That moment of weakness terrified me. I was on my kitchen floor with a steak knife, debating on whether or not to make the first cut. I still have no clue what stopped me, but I'm grateful for whatever it was.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I feel like no one can hear me, even though I&amp;#39;m screaming my lungs out. I&amp;#39;m glad that I didn&amp;#39;t go through with that, because I have a life ahead of me, but the world is just so cruel sometimes, that I don&amp;#39;t even know if I want to live. That moment of weakness terrified me. I was on my kitchen floor with a steak knife, debating on whether or not to make the first cut. I still have no clue what stopped me, but I&amp;#39;m grateful for whatever it was.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2sehd", "created": 1398548138.0, "author_flair_text": null, "created_utc": 1398544538.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2s787", "gilded": 0, "author": "[deleted]", "parent_id": "t3_241xud", "approved_by": null, "body": "Honestly I've never been that close myself, but i'm glad you didn't go through with it in the end. I know what you mean about the mask, what it's like to push people away and not let them help you.I'm sorry that you're feeling lost and ignored, it's a feeling a lot of people on this subreddit have gone through at times, myself included, but if it helps, I wont ignore you. I can still hear you and i'll be here to listen. I hope we can find a way so it doesn't get like this for you again.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I&amp;#39;ve never been that close myself, but i&amp;#39;m glad you didn&amp;#39;t go through with it in the end. I know what you mean about the mask, what it&amp;#39;s like to push people away and not let them help you.I&amp;#39;m sorry that you&amp;#39;re feeling lost and ignored, it&amp;#39;s a feeling a lot of people on this subreddit have gone through at times, myself included, but if it helps, I wont ignore you. I can still hear you and i&amp;#39;ll be here to listen. I hope we can find a way so it doesn&amp;#39;t get like this for you again.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2s787", "created": 1398547610.0, "author_flair_text": null, "created_utc": 1398544010.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2t2k3", "gilded": 0, "author": "wrotethis", "parent_id": "t1_ch2sq5m", "approved_by": null, "body": "It works really well for me and it is has been shown to work really well for others. It can take some practice to \"catch\" your emotions as they come to you, but all it takes is to step back form inside your own mind and feel the immediateness of the emotion fade away a bit. The more you do it the more you will want to do it when you feel your suffering ease up. your mind always wants to tell you that you are a certain way, that this is the way things are so it can get you to do certain things. 'I am mad', or 'I am sad' instead of what is more accurate: \"I am feeling sadness right now\". Everything is impermanent and transient and fluid and everchanging, and your emotions are no different. our programming convinces us otherwise or else we would never get anything done. but we all know better, and learning to go with the flow is a big part of being emotionally and mentally healthy. you have to learn and experience and become comfortable in the cage you were born in if you will begin to make your way out. It took me a long time and I struggle to not let my cage overwhelm me still to this day, but paying attention to my emotions instead of blocking them or denying them was a huge part of my recovery and progress in emotional life and I'm sure it will help you too.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It works really well for me and it is has been shown to work really well for others. It can take some practice to &amp;quot;catch&amp;quot; your emotions as they come to you, but all it takes is to step back form inside your own mind and feel the immediateness of the emotion fade away a bit. The more you do it the more you will want to do it when you feel your suffering ease up. your mind always wants to tell you that you are a certain way, that this is the way things are so it can get you to do certain things. &amp;#39;I am mad&amp;#39;, or &amp;#39;I am sad&amp;#39; instead of what is more accurate: &amp;quot;I am feeling sadness right now&amp;quot;. Everything is impermanent and transient and fluid and everchanging, and your emotions are no different. our programming convinces us otherwise or else we would never get anything done. but we all know better, and learning to go with the flow is a big part of being emotionally and mentally healthy. you have to learn and experience and become comfortable in the cage you were born in if you will begin to make your way out. It took me a long time and I struggle to not let my cage overwhelm me still to this day, but paying attention to my emotions instead of blocking them or denying them was a huge part of my recovery and progress in emotional life and I&amp;#39;m sure it will help you too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2t2k3", "created": 1398549818.0, "author_flair_text": null, "created_utc": 1398546218.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2sq5m", "gilded": 0, "author": "lonely_writer", "parent_id": "t1_ch2sfce", "approved_by": null, "body": "I've always tried to be strong for others, and I wouldn't even show any emotions when I was alone. I'm just scared to ask for help, or show emotion, because my family was never really there for me when I was a child. Now my mother thinks I'm an emotionless sociopath, but a couple of months ago, I broke down and told her about my depression. What did she do? Hire a fucking therapist, and get me on antidepressants that fucked with my hormones and gave me nightmares. I acted like I was happy, and now they think it was all a phase, and I get off of those damned antidepressants in a couple of months. I know now that my mother says that she wants to be there for me, but doesn't have the time to, and makes me lie to emotionless therapists instead, and thinks that solves everything. I'm afraid to tell my friends, because I feel like they care too much, and would get worried and tell my parents. So that sounds like something that I might as well try out. Thanks for the advice, I truly appreciate it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always tried to be strong for others, and I wouldn&amp;#39;t even show any emotions when I was alone. I&amp;#39;m just scared to ask for help, or show emotion, because my family was never really there for me when I was a child. Now my mother thinks I&amp;#39;m an emotionless sociopath, but a couple of months ago, I broke down and told her about my depression. What did she do? Hire a fucking therapist, and get me on antidepressants that fucked with my hormones and gave me nightmares. I acted like I was happy, and now they think it was all a phase, and I get off of those damned antidepressants in a couple of months. I know now that my mother says that she wants to be there for me, but doesn&amp;#39;t have the time to, and makes me lie to emotionless therapists instead, and thinks that solves everything. I&amp;#39;m afraid to tell my friends, because I feel like they care too much, and would get worried and tell my parents. So that sounds like something that I might as well try out. Thanks for the advice, I truly appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2sq5m", "created": 1398548964.0, "author_flair_text": null, "created_utc": 1398545364.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2sfce", "gilded": 0, "author": "wrotethis", "parent_id": "t3_241xud", "approved_by": null, "body": "Instead of trying to stay so strong all the time, it may help to let some of the pain in. Try to examine it and be as mindful of it as possible. watch it come and go and witness from inside yourself how your environment can trigger its coming and going. doing this can help take some of it's power over you away. when you feel your pain you can begin to express it better, and piece by piece you can get on top of it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of trying to stay so strong all the time, it may help to let some of the pain in. Try to examine it and be as mindful of it as possible. watch it come and go and witness from inside yourself how your environment can trigger its coming and going. doing this can help take some of it&amp;#39;s power over you away. when you feel your pain you can begin to express it better, and piece by piece you can get on top of it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241xud", "score_hidden": false, "name": "t1_ch2sfce", "created": 1398548202.0, "author_flair_text": null, "created_utc": 1398544602.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]