[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(This post is kinda scattered, sorry about that. Im not good at typing things out.)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a 15 year old male, turning 16 in a few months. I have very few friends, two to be exact but I don&amp;#39;t see them in person often because I moved two hours away. One of my friends is a girl. We&amp;#39;ve been friends for a while now and not too long ago I ended up confessing my feelings to her. I knew that nothing would happen between us because of certain differences that we have. I did not mean to fall in love with her, it just happened on its own. She does not feel the same way about me but she understood my feelings and did not stop talking to me or anything like that. She&amp;#39;s a great person and we&amp;#39;ve become very close. I feel like one minute I&amp;#39;ve gotten over it and then the next minute, I haven&amp;#39;t. I am not a good looking dude at all and I&amp;#39;m very self-conscious. I am kinda tall but not muscular in any way but I have no motivation whatsoever to exercise or work out. Feeling like I&amp;#39;m really ugly and that I&amp;#39;ll never have a chance with a girl has seriously gotten to me. I&amp;#39;ve never been in a relationship before either. The only thing on my mind most of the time is killing myself somehow. I would never have enough guts to actually do it but it&amp;#39;s so tempting to just end it all. I feel like I have no one, being that I live with my dad and sister two hours away from where I used to live and knowing that I&amp;#39;m too ugly for anyone to ever want. I know it sounds a little silly to feel like this all over not being in a relationship but being so self-conscious has really gotten to me. I always feel embarrassed in public and try not to look at anyone. Anyway, this is how I feel everyday of my life and I&amp;#39;m just tired of it. I want a change in my life and I don&amp;#39;t want to feel like this anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(This post is kinda scattered, sorry about that. Im not good at typing things out.)\n\nI'm a 15 year old male, turning 16 in a few months. I have very few friends, two to be exact but I don't see them in person often because I moved two hours away. One of my friends is a girl. We've been friends for a while now and not too long ago I ended up confessing my feelings to her. I knew that nothing would happen between us because of certain differences that we have. I did not mean to fall in love with her, it just happened on its own. She does not feel the same way about me but she understood my feelings and did not stop talking to me or anything like that. She's a great person and we've become very close. I feel like one minute I've gotten over it and then the next minute, I haven't. I am not a good looking dude at all and I'm very self-conscious. I am kinda tall but not muscular in any way but I have no motivation whatsoever to exercise or work out. Feeling like I'm really ugly and that I'll never have a chance with a girl has seriously gotten to me. I've never been in a relationship before either. The only thing on my mind most of the time is killing myself somehow. I would never have enough guts to actually do it but it's so tempting to just end it all. I feel like I have no one, being that I live with my dad and sister two hours away from where I used to live and knowing that I'm too ugly for anyone to ever want. I know it sounds a little silly to feel like this all over not being in a relationship but being so self-conscious has really gotten to me. I always feel embarrassed in public and try not to look at anyone. Anyway, this is how I feel everyday of my life and I'm just tired of it. I want a change in my life and I don't want to feel like this anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24obtr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "RaccoonJuice", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24obtr/i_just_cant_keep_going_on_like_this/", "name": "t3_24obtr", "created": 1399210048.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24obtr/i_just_cant_keep_going_on_like_this/", "author_flair_text": null, "title": "I just can't keep going on like this.", "created_utc": 1399181248.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch93kid", "gilded": 0, "author": "RaccoonJuice", "parent_id": "t1_ch933nq", "approved_by": null, "body": "Thanks, man. I'll take your advice and talk to her about it when I feel the need to. Thank you for taking the time to respond.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, man. I&amp;#39;ll take your advice and talk to her about it when I feel the need to. Thank you for taking the time to respond.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24obtr", "score_hidden": false, "name": "t1_ch93kid", "created": 1399214587.0, "author_flair_text": null, "created_utc": 1399185787.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch933nq", "gilded": 0, "author": "_oreo", "parent_id": "t3_24obtr", "approved_by": null, "body": "Hi there. I have a friend that sounds very much like you. It can be really hard to make sense of all the feelings that you have about yourself, especially because you didn't choose to bring them them about, they just sort of happened, and now you're stuck with them. \n\nYou have a really good friend there who was willing to listen to your feelings about her, and not leave you hanging. That's something really cool that most guys wouldn't get back in return if they did something like that. She is definitely someone worth talking to when you're feeling this way. \n\nI know it's hard, but try to understand that most people don't get into real relationships until they are in college, or well into their careers. Almost every adult I've ever known has said they've met their significant other at those points in their lives, so you definitely have something to look forward to there.\n\nWhat do you like to do in your spare time? Sometimes not having projects of your own that you look forward to can open room for these feelings to creep in and cause all this trouble. Even if it's something like going on a walk while listening to music, or taking a long bike ride, those things really do help. \n\nI hope this helped at least a little bit. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. I have a friend that sounds very much like you. It can be really hard to make sense of all the feelings that you have about yourself, especially because you didn&amp;#39;t choose to bring them them about, they just sort of happened, and now you&amp;#39;re stuck with them. &lt;/p&gt;\n\n&lt;p&gt;You have a really good friend there who was willing to listen to your feelings about her, and not leave you hanging. That&amp;#39;s something really cool that most guys wouldn&amp;#39;t get back in return if they did something like that. She is definitely someone worth talking to when you&amp;#39;re feeling this way. &lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s hard, but try to understand that most people don&amp;#39;t get into real relationships until they are in college, or well into their careers. Almost every adult I&amp;#39;ve ever known has said they&amp;#39;ve met their significant other at those points in their lives, so you definitely have something to look forward to there.&lt;/p&gt;\n\n&lt;p&gt;What do you like to do in your spare time? Sometimes not having projects of your own that you look forward to can open room for these feelings to creep in and cause all this trouble. Even if it&amp;#39;s something like going on a walk while listening to music, or taking a long bike ride, those things really do help. &lt;/p&gt;\n\n&lt;p&gt;I hope this helped at least a little bit. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24obtr", "score_hidden": false, "name": "t1_ch933nq", "created": 1399212717.0, "author_flair_text": null, "created_utc": 1399183917.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]