[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My ex killed himself almost a year ago and I&amp;#39;m still up every night feeling shitty and anxious about it. We were together for 5 years.  We have an amazing daughter together but he&amp;#39;d already emotionally abandoned her before he died. Everything was about me for him, about winning me back, even though he seemed to despise me a lot of the time. &lt;/p&gt;\n\n&lt;p&gt;I know he was mentally ill but I don&amp;#39;t understand how I could be so close to someone and not see something like this coming? None of his final actions make sense. He seemed to be moving on, and to maybe be taking a renewed interest in fatherhood. All the while he was actually planning to kill himself, taking steps to ensure that it was done in a way that totally screwed over his own kid. Wtf? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m starting to come to terms with the fact that I&amp;#39;m never going to have answers but I&amp;#39;m still so hurt and angry and confused. When I talk to people about it no one ever knows what to say so I try to focus on the anger and use that to reassure them that his death doesn&amp;#39;t really affect me because I don&amp;#39;t want to make them uncomfortable. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t help that my daughter looks just like him, or that his belongings are still all over my house. Sorry for rambling, I just thought if I wrote it down, maybe my brain would let me sleep. I wish I could just get over this already.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My ex killed himself almost a year ago and I'm still up every night feeling shitty and anxious about it. We were together for 5 years.  We have an amazing daughter together but he'd already emotionally abandoned her before he died. Everything was about me for him, about winning me back, even though he seemed to despise me a lot of the time. \n\nI know he was mentally ill but I don't understand how I could be so close to someone and not see something like this coming? None of his final actions make sense. He seemed to be moving on, and to maybe be taking a renewed interest in fatherhood. All the while he was actually planning to kill himself, taking steps to ensure that it was done in a way that totally screwed over his own kid. Wtf? \n\nI'm starting to come to terms with the fact that I'm never going to have answers but I'm still so hurt and angry and confused. When I talk to people about it no one ever knows what to say so I try to focus on the anger and use that to reassure them that his death doesn't really affect me because I don't want to make them uncomfortable. \n\nIt doesn't help that my daughter looks just like him, or that his belongings are still all over my house. Sorry for rambling, I just thought if I wrote it down, maybe my brain would let me sleep. I wish I could just get over this already.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24lwnj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tryptophantastic", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24lwnj/i_just_dont_get_it/", "name": "t3_24lwnj", "created": 1399131680.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24lwnj/i_just_dont_get_it/", "author_flair_text": null, "title": "I just don't get it", "created_utc": 1399102880.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8hsx8", "gilded": 0, "author": "ventimhere", "parent_id": "t3_24lwnj", "approved_by": null, "body": "I hope that helped to write down what you are experiencing. I have no way to relate to your situation, because you really had to struggle with something. It is admirable that you are looking out for your friends feelings &amp; not wanting to make them feel uncomfortable, but you are well within your right to discuss the hurt you have inside. Do you feel like it would help to talk these things through with someone professional? Depending on your location, im sure that there is grief counselling available to you if you need to. &amp; we as a community are here to if ever you need an environment to just talk. Is there anything else youd like to talk about?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope that helped to write down what you are experiencing. I have no way to relate to your situation, because you really had to struggle with something. It is admirable that you are looking out for your friends feelings &amp;amp; not wanting to make them feel uncomfortable, but you are well within your right to discuss the hurt you have inside. Do you feel like it would help to talk these things through with someone professional? Depending on your location, im sure that there is grief counselling available to you if you need to. &amp;amp; we as a community are here to if ever you need an environment to just talk. Is there anything else youd like to talk about?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lwnj", "score_hidden": false, "name": "t1_ch8hsx8", "created": 1399127514.0, "author_flair_text": null, "created_utc": 1399123914.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8xxrw", "gilded": 0, "author": "Soletrador", "parent_id": "t3_24lwnj", "approved_by": null, "body": "You still here?\n\nPlease answer me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You still here?&lt;/p&gt;\n\n&lt;p&gt;Please answer me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lwnj", "score_hidden": false, "name": "t1_ch8xxrw", "created": 1399171958.0, "author_flair_text": null, "created_utc": 1399168358.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]