[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have struggled with depression for years even though I haven&amp;#39;t gotten it officially diagnosed. I am terrified to go to my GP because he&amp;#39;s friends with my mom. I doubt he would believe that my mom was abusive. Lucky for me, my mom liked me and didn&amp;#39;t beat me unless I really messed up. Sadly my sister wasn&amp;#39;t so lucky. But I knew it was wrong so I always stepped up and put my mom back in her place. She knew I could seriously hurt her since I was an international karate athlete. So her way of getting back at me was to tell me I was worthless and a waste of money. \nI grew up knowing my parents were only married because of me. And I knew my parents just felt obligated to take care of me and didn&amp;#39;t give a rats ass about me. \nI dated a guy off and on for three years and just recently found out he was manipulating me by hitting my triggers of my past so he can see me in pain all just to make me feel like I needed him and couldn&amp;#39;t live without him. In reality he just made me miserable cause he would constantly pick at my past.\nBut now I can&amp;#39;t trust guys. And I am all alone. The only thoughts I have are of wanting to die cause I don&amp;#39;t think I will ever get to feel loved.  I can&amp;#39;t keep going on with all this emotional pain. All I wanna do is find a bunch of pills and take them all. I do know that my life isn&amp;#39;t too bad. It could be worse. I feel so horrible and selfish for having these suicidal thoughts. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have struggled with depression for years even though I haven't gotten it officially diagnosed. I am terrified to go to my GP because he's friends with my mom. I doubt he would believe that my mom was abusive. Lucky for me, my mom liked me and didn't beat me unless I really messed up. Sadly my sister wasn't so lucky. But I knew it was wrong so I always stepped up and put my mom back in her place. She knew I could seriously hurt her since I was an international karate athlete. So her way of getting back at me was to tell me I was worthless and a waste of money. \nI grew up knowing my parents were only married because of me. And I knew my parents just felt obligated to take care of me and didn't give a rats ass about me. \nI dated a guy off and on for three years and just recently found out he was manipulating me by hitting my triggers of my past so he can see me in pain all just to make me feel like I needed him and couldn't live without him. In reality he just made me miserable cause he would constantly pick at my past.\nBut now I can't trust guys. And I am all alone. The only thoughts I have are of wanting to die cause I don't think I will ever get to feel loved.  I can't keep going on with all this emotional pain. All I wanna do is find a bunch of pills and take them all. I do know that my life isn't too bad. It could be worse. I feel so horrible and selfish for having these suicidal thoughts. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zu7o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cmunk11", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zu7o/i_just_dont_know_if_i_can_live_this_way_anymore/", "name": "t3_23zu7o", "created": 1398499829.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zu7o/i_just_dont_know_if_i_can_live_this_way_anymore/", "author_flair_text": null, "title": "I just don't know if I can live this way anymore", "created_utc": 1398471029.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch27bjm", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23zu7o", "approved_by": null, "body": "Hi there.  You say you don't want to speak to your GP because he's friends with your mother, which makes perfect sense.  I'd be wary of that situation as well.  Have you thought about going to a different physician or a free clinic and speaking to them about your depression?  Also, keep in mind that although this physician is a friend of your mother's, it's completely illegal and unethical for him to provide any information about you to her, even if you are under the age of 18.  Abuse is an incredibly difficult thing to deal with and coming to terms with things may take some therapy from a counselor.  But for right now, the way to go would be to find a physician or a nurse practitioner with whom you can speak.  Let me know if you have any questions.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there.  You say you don&amp;#39;t want to speak to your GP because he&amp;#39;s friends with your mother, which makes perfect sense.  I&amp;#39;d be wary of that situation as well.  Have you thought about going to a different physician or a free clinic and speaking to them about your depression?  Also, keep in mind that although this physician is a friend of your mother&amp;#39;s, it&amp;#39;s completely illegal and unethical for him to provide any information about you to her, even if you are under the age of 18.  Abuse is an incredibly difficult thing to deal with and coming to terms with things may take some therapy from a counselor.  But for right now, the way to go would be to find a physician or a nurse practitioner with whom you can speak.  Let me know if you have any questions.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zu7o", "score_hidden": false, "name": "t1_ch27bjm", "created": 1398476132.0, "author_flair_text": null, "created_utc": 1398472532.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]