[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Who knows if this gets read or commented on, I don&amp;#39;t care I just need to share everything.&lt;/p&gt;\n\n&lt;p&gt;Wow, where to start? I&amp;#39;m 16 years old and I&amp;#39;ve had depression for about a year and a half. I&amp;#39;m on medication and I see a therapist every week.&lt;/p&gt;\n\n&lt;p&gt;I just want to end it all; I&amp;#39;m so tired. About 2 hours ago I really wanted to kill myself but the urge has gone now. I can&amp;#39;t stop crying. I can&amp;#39;t wake my parents because it&amp;#39;s 1 30 in the morning.\nI am currently studying for exams and I have some next week but I feel so unprepared. If I fail I&amp;#39;ll have to do them next year on top of all my other schoolwork and since I am depressed and also have problems with my sleep pattern so that might as well be a death sentence. I tried killing myself back in December but I was too scared. I think I&amp;#39;ll either kill myself this week or on the results day in august, if I do it at all- depends if I pass or not.&lt;/p&gt;\n\n&lt;p&gt;I realised I was a lesbian last year and with that I have discovered I am a selfish bitch.\nI developed a huge crush on a friend of mine and after testing the water I am sure she&amp;#39;s straight. I&amp;#39;m afraid to come out to my schoolfriends in case they think I&amp;#39;m a freak and don&amp;#39;t like me anymore.\nSaid friend invited me to a cheesy teen church service and I said yes on the basis I would get out and see friends. (I don&amp;#39;t believe in god at all.) However she&amp;#39;s quite the hippie Christian if you know what I mean. Very into putting her hands in the air, &amp;quot;praise the lord!&amp;quot; touching people when she prays and all that. She asked if I wanted to be prayed for and I said yes since it&amp;#39;s only polite, but she was really intimate and I loved it- I started going just so she would do that, even after a speaker said he didn&amp;#39;t agree with gay people I still went, though my mother was disgusted and said she&amp;#39;d never go to that man&amp;#39;s services ever.\nI digress, last week at the church my crush was lying on her friend&amp;#39;s shoulder and crying and instead of thinking &amp;quot;how terrible that she&amp;#39;s upset&amp;quot;. My first thoughts were &amp;quot; I wish it was me she was confiding in&amp;quot; and &amp;quot;maybe she&amp;#39;s upset because she&amp;#39;s gay!&amp;quot; How  awful must I be, after all the confusion and stress I went through over my sexuality, to wish that on her? Instead of caring about her I got jealous... I&amp;#39;m not going to that church again.\nI really want to hold a woman someday, and feel her and kiss her and say I love you, but how can I be a good girlfriend if I get jealous over something so petty? I&amp;#39;m so pathetic. No one will ever want me or love me.&lt;/p&gt;\n\n&lt;p&gt;I often wish I was some sort of amazing action hero, like commander Shepard. She never lets anything get her down, has a whole team of amazing supporters to fall back on listen, and wins against impossible odds. Why can&amp;#39;t I be like that? \nThe real world is such a horrible place with awful things happening all the time, it baffles me anyone wants to live in it.&lt;/p&gt;\n\n&lt;p&gt;Anyone who read this, thank you. It&amp;#39;s 2 30 now so I&amp;#39;m going to sleep. Writing all this has made me feel better. I have school tomorrow, time will tell if I survive.&lt;/p&gt;\n\n&lt;p&gt;xxx&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Who knows if this gets read or commented on, I don't care I just need to share everything.\n\nWow, where to start? I'm 16 years old and I've had depression for about a year and a half. I'm on medication and I see a therapist every week.\n\nI just want to end it all; I'm so tired. About 2 hours ago I really wanted to kill myself but the urge has gone now. I can't stop crying. I can't wake my parents because it's 1 30 in the morning.\nI am currently studying for exams and I have some next week but I feel so unprepared. If I fail I'll have to do them next year on top of all my other schoolwork and since I am depressed and also have problems with my sleep pattern so that might as well be a death sentence. I tried killing myself back in December but I was too scared. I think I'll either kill myself this week or on the results day in august, if I do it at all- depends if I pass or not.\n\nI realised I was a lesbian last year and with that I have discovered I am a selfish bitch.\nI developed a huge crush on a friend of mine and after testing the water I am sure she's straight. I'm afraid to come out to my schoolfriends in case they think I'm a freak and don't like me anymore.\nSaid friend invited me to a cheesy teen church service and I said yes on the basis I would get out and see friends. (I don't believe in god at all.) However she's quite the hippie Christian if you know what I mean. Very into putting her hands in the air, \"praise the lord!\" touching people when she prays and all that. She asked if I wanted to be prayed for and I said yes since it's only polite, but she was really intimate and I loved it- I started going just so she would do that, even after a speaker said he didn't agree with gay people I still went, though my mother was disgusted and said she'd never go to that man's services ever.\nI digress, last week at the church my crush was lying on her friend's shoulder and crying and instead of thinking \"how terrible that she's upset\". My first thoughts were \" I wish it was me she was confiding in\" and \"maybe she's upset because she's gay!\" How  awful must I be, after all the confusion and stress I went through over my sexuality, to wish that on her? Instead of caring about her I got jealous... I'm not going to that church again.\nI really want to hold a woman someday, and feel her and kiss her and say I love you, but how can I be a good girlfriend if I get jealous over something so petty? I'm so pathetic. No one will ever want me or love me.\n\nI often wish I was some sort of amazing action hero, like commander Shepard. She never lets anything get her down, has a whole team of amazing supporters to fall back on listen, and wins against impossible odds. Why can't I be like that? \nThe real world is such a horrible place with awful things happening all the time, it baffles me anyone wants to live in it.\n\nAnyone who read this, thank you. It's 2 30 now so I'm going to sleep. Writing all this has made me feel better. I have school tomorrow, time will tell if I survive.\n\nxxx", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24tsie", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iwillonlyusethisonce", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24tsie/i_just_need_to_vent/", "name": "t3_24tsie", "created": 1399368833.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24tsie/i_just_need_to_vent/", "author_flair_text": null, "title": "I just need to vent", "created_utc": 1399340033.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chalb94", "gilded": 0, "author": "Defyingtoitle", "parent_id": "t3_24tsie", "approved_by": null, "body": "I'll be the one to comment on it if no one else does.  \nThe first thing you should do is focus on exams. Don't let anything else get to your head. These exams carry you through the rest of your school year; and as you said yourself they decide what you do next year. Don't let yourself fall behind now because of the friend issues, those will sort themselves out in the second part of this.  \nAs for the friends, you want to open up to the one you trust the most. Open up to someone who you know will support you, and won't run away thinking you are weird because you're different. If they do run away, they aren't your friend. Simply put, friends stand for each other, and they will understand that you like woman. It's a personal choice, and you aren't forcing your way on them, so why should they take offense? As for your crush, best of luck with her. I just lost one myself, but that's another story.   \nxxx", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be the one to comment on it if no one else does.&lt;br/&gt;\nThe first thing you should do is focus on exams. Don&amp;#39;t let anything else get to your head. These exams carry you through the rest of your school year; and as you said yourself they decide what you do next year. Don&amp;#39;t let yourself fall behind now because of the friend issues, those will sort themselves out in the second part of this.&lt;br/&gt;\nAs for the friends, you want to open up to the one you trust the most. Open up to someone who you know will support you, and won&amp;#39;t run away thinking you are weird because you&amp;#39;re different. If they do run away, they aren&amp;#39;t your friend. Simply put, friends stand for each other, and they will understand that you like woman. It&amp;#39;s a personal choice, and you aren&amp;#39;t forcing your way on them, so why should they take offense? As for your crush, best of luck with her. I just lost one myself, but that&amp;#39;s another story.&lt;br/&gt;\nxxx&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tsie", "score_hidden": false, "name": "t1_chalb94", "created": 1399369333.0, "author_flair_text": null, "created_utc": 1399340533.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]