[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to work, I don&amp;#39;t want to go to school, I don&amp;#39;t want to get a nice job, I don&amp;#39;t want to get married.&lt;/p&gt;\n\n&lt;p&gt;Whenever I think about the future I get a sudden surge of anxiety and indifference. I honestly don&amp;#39;t care about myself in the slightest. If I died in my sleep tonight, I wouldn&amp;#39;t give the slightest fuck. At least then I wouldn&amp;#39;t have to worry about homework, work, never having a girlfriend, why I&amp;#39;m defective, or why I have these thoughts.&lt;/p&gt;\n\n&lt;p&gt;My entire life is a lie, I lie to everyone about everything. I go to drug counseling and I haven&amp;#39;t told them the truth about a single part of my life besides where I work and that I go to school. I&amp;#39;m a pathological liar that will do anything to get you to believe that I am who I say I am. The world is better off without scum like me to deceive and manipulate others. &lt;/p&gt;\n\n&lt;p&gt;When I was in elementary school I bullied a kid until he cut himself everyday. I messaged a girl who liked me in class and told her to ask the kid out just so she would break up with him the next day. This kid had no friends at all. She asked him out, he said yes, it made his life. He finally felt self worth. Then I told her to dump him and she did. He didn&amp;#39;t come to school for three days and when he did show up he had bandages on his wrist and was in the nurses office all day. Why would I do this? Because I could.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a piece of shit. I cannot wait for the day that I finally off myself, I fantasize about it in class and at work. How easy it would be, how fun it would be. How hurt everyone would be. I don&amp;#39;t even feel bad, I feel great about it. I finally get to make everyone feel like shit around me. Shit, some of them will even feel depressed. Having that much control over their emotions is an amazing feeling. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want your help, your pity. I want the world to suffer and I want to be the reason it suffers. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't want to work, I don't want to go to school, I don't want to get a nice job, I don't want to get married.\n\nWhenever I think about the future I get a sudden surge of anxiety and indifference. I honestly don't care about myself in the slightest. If I died in my sleep tonight, I wouldn't give the slightest fuck. At least then I wouldn't have to worry about homework, work, never having a girlfriend, why I'm defective, or why I have these thoughts.\n\nMy entire life is a lie, I lie to everyone about everything. I go to drug counseling and I haven't told them the truth about a single part of my life besides where I work and that I go to school. I'm a pathological liar that will do anything to get you to believe that I am who I say I am. The world is better off without scum like me to deceive and manipulate others. \n\nWhen I was in elementary school I bullied a kid until he cut himself everyday. I messaged a girl who liked me in class and told her to ask the kid out just so she would break up with him the next day. This kid had no friends at all. She asked him out, he said yes, it made his life. He finally felt self worth. Then I told her to dump him and she did. He didn't come to school for three days and when he did show up he had bandages on his wrist and was in the nurses office all day. Why would I do this? Because I could.\n\nI'm a piece of shit. I cannot wait for the day that I finally off myself, I fantasize about it in class and at work. How easy it would be, how fun it would be. How hurt everyone would be. I don't even feel bad, I feel great about it. I finally get to make everyone feel like shit around me. Shit, some of them will even feel depressed. Having that much control over their emotions is an amazing feeling. \n\nI don't want your help, your pity. I want the world to suffer and I want to be the reason it suffers. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24u6cg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ransom12351", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24u6cg/i_just_dont_want_to_live/", "name": "t3_24u6cg", "created": 1399378292.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24u6cg/i_just_dont_want_to_live/", "author_flair_text": null, "title": "I just don't want to live.", "created_utc": 1399349492.0, "ups": 5, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaukng", "gilded": 0, "author": "boobmuncher", "parent_id": "t3_24u6cg", "approved_by": null, "body": "What's your home life like, OP? *plz don't lie 2 mi*", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s your home life like, OP? &lt;em&gt;plz don&amp;#39;t lie 2 mi&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24u6cg", "score_hidden": false, "name": "t1_chaukng", "created": 1399377705.0, "author_flair_text": null, "created_utc": 1399374105.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]