[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am tired. I&amp;#39;m sick of everyone telling me that it will pass you will be happy. Cause they really don&amp;#39;t know if I will ever be I&amp;#39;d rather people just tell me the truth tell tell me the same cliche. It is so dumb and a bunch of bullshit. Sorry if I&amp;#39;m rude :/ I know how I will kill myself and one of these days maybe I will but not today not this week probably not even this month but one of these days I will pop the pills that will end this hell that we call life. I wish I had a friend to talk to, someone to laugh with someone to hug and watch movies with but I don&amp;#39;t open myself up to people because of my mental disorder. They wouldn&amp;#39;t understand that I am crazy compared to them. I tend to ignore my emotions cause I would rather live through other people since I hate myself and all of my failures. \nI know that I need to go to a hospital but I can&amp;#39;t because my parents cannot afford it I already cost them so much money with myself having epilepsy a lot more frequently. I don&amp;#39;t want to be a burden to them anymore. I honestly just needed to vent. I don&amp;#39;t expect comments. There are people in more need of help than me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am tired. I'm sick of everyone telling me that it will pass you will be happy. Cause they really don't know if I will ever be I'd rather people just tell me the truth tell tell me the same cliche. It is so dumb and a bunch of bullshit. Sorry if I'm rude :/ I know how I will kill myself and one of these days maybe I will but not today not this week probably not even this month but one of these days I will pop the pills that will end this hell that we call life. I wish I had a friend to talk to, someone to laugh with someone to hug and watch movies with but I don't open myself up to people because of my mental disorder. They wouldn't understand that I am crazy compared to them. I tend to ignore my emotions cause I would rather live through other people since I hate myself and all of my failures. \nI know that I need to go to a hospital but I can't because my parents cannot afford it I already cost them so much money with myself having epilepsy a lot more frequently. I don't want to be a burden to them anymore. I honestly just needed to vent. I don't expect comments. There are people in more need of help than me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xlra", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "xxanders", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xlra/i_just_dont_even_know/", "name": "t3_23xlra", "created": 1398437659.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xlra/i_just_dont_even_know/", "author_flair_text": null, "title": "I just don't even know...", "created_utc": 1398408859.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1mnt4", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_23xlra", "approved_by": null, "body": "Doesn't sound to me like there are people who need more help than you. Sounds like you need just as much help as them.\n\nI understand the feeling of depression and feeling like ending it is the only way out and it is just a giant hole that gets harder and harder to get out of. BUT you can't expect others to get you out of the hole.\n\nYou need to wake up every morning and tell yourself it is going to be a good day. You wake up and feel like shit? The day can only get better then. I wake up every morning and throw up due to a stomach condition yet every morning I tell myself today is going to be great.\n\nI don't know exactly how you feel because depression is different for a lot of people but just try being generally optimistic and slowly you will get out of the hole.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t sound to me like there are people who need more help than you. Sounds like you need just as much help as them.&lt;/p&gt;\n\n&lt;p&gt;I understand the feeling of depression and feeling like ending it is the only way out and it is just a giant hole that gets harder and harder to get out of. BUT you can&amp;#39;t expect others to get you out of the hole.&lt;/p&gt;\n\n&lt;p&gt;You need to wake up every morning and tell yourself it is going to be a good day. You wake up and feel like shit? The day can only get better then. I wake up every morning and throw up due to a stomach condition yet every morning I tell myself today is going to be great.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know exactly how you feel because depression is different for a lot of people but just try being generally optimistic and slowly you will get out of the hole.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xlra", "score_hidden": false, "name": "t1_ch1mnt4", "created": 1398427113.0, "author_flair_text": null, "created_utc": 1398423513.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]