[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this evening I just got yelled at by my parents for around half an hour for being depressed. I was pretty much at a tipping point anyway and that really just pushed me over the edge. I planned to just open up my wrists and be done with it once they went to bed.&lt;/p&gt;\n\n&lt;p&gt;Testing how much pressure I&amp;#39;d have had to apply on the back of my forearm to break the skin actually felt really good. Not good in the sense of hearing a song you like or eating your favourite food but in the relieving way if that makes sense at all. &lt;/p&gt;\n\n&lt;p&gt;So now I&amp;#39;m just feeling quite tired and pretty ok at the same time. I feel way less depressed which I didn&amp;#39;t really expect. &lt;/p&gt;\n\n&lt;p&gt;Sorry this is a bit of a monologue - I just wanted to get it off my chest.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this evening I just got yelled at by my parents for around half an hour for being depressed. I was pretty much at a tipping point anyway and that really just pushed me over the edge. I planned to just open up my wrists and be done with it once they went to bed.\n\nTesting how much pressure I'd have had to apply on the back of my forearm to break the skin actually felt really good. Not good in the sense of hearing a song you like or eating your favourite food but in the relieving way if that makes sense at all. \n\nSo now I'm just feeling quite tired and pretty ok at the same time. I feel way less depressed which I didn't really expect. \n\nSorry this is a bit of a monologue - I just wanted to get it off my chest.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bb63", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "glittersprayinganus", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bb63/i_just_cut_myself/", "name": "t3_25bb63", "created": 1399877833.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bb63/i_just_cut_myself/", "author_flair_text": null, "title": "I just cut myself.", "created_utc": 1399849033.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfm8dh", "gilded": 0, "author": "myowmyow", "parent_id": "t3_25bb63", "approved_by": null, "body": "Hey. I remember the first time I felt that relief. I know it's useless to say this, but you are literally only hurting yourself. It doesn't really help much after a while and it escalates quickly, and I took a long time to figure out that I needed to care about me before anyone else would. And how could I care about a mind so abusive, how could I care for a body when I was abusing it?\n\n\nTo be honest, as much as I remember the relief that this releases from broken skin, I don't remember when was the first time I cut myself. I took the family scissors and dull as they were I scraped thin lines into my wrists that swelled after a moment. The pain wasn't unbearable, they just itched after a day or so, but when I drew blood later on with the first swipe of a new blade, I was fascinated.\n\nSometime in early high school I got carried away. Dozens of horizontal lines across the backs of my legs, mid-thigh to ankle. There was something about the way skin separates from itself... you can almost hear a sharp razor cutting through your own flesh like a cleaver through a steak.\n\n\n\nI got kind of weird in the head for a while then.\n\n\n\nSometime in junior year I got foggy-minded and to clear the haze, I kept trying to get to that point of clarity that you reach when your body tells your brain what has happened... I kept trying to get one slice closer. I realized in the middle of the night that I had cut patterns all down my forearm and was bleeding out onto my bedroom floor. It sucked. It took a long time to recover from that. And it takes even longer to recover from all of it. I actually still slip up, years later, just by thinking of the relief I could get...\n\n\n\n\nI just realized that all this seems like crap, that I'm just telling my story, and offering no help or understanding. I got caught up in the whirlwind of gloom and pain that surrounded me and still catches up at times.\n\n\nPlease just realize, if nothing else helps, neither will cutting. The only thing you can do for yourself is to be better to yourself.\n\n\n\nYou deserve better. &lt;3", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey. I remember the first time I felt that relief. I know it&amp;#39;s useless to say this, but you are literally only hurting yourself. It doesn&amp;#39;t really help much after a while and it escalates quickly, and I took a long time to figure out that I needed to care about me before anyone else would. And how could I care about a mind so abusive, how could I care for a body when I was abusing it?&lt;/p&gt;\n\n&lt;p&gt;To be honest, as much as I remember the relief that this releases from broken skin, I don&amp;#39;t remember when was the first time I cut myself. I took the family scissors and dull as they were I scraped thin lines into my wrists that swelled after a moment. The pain wasn&amp;#39;t unbearable, they just itched after a day or so, but when I drew blood later on with the first swipe of a new blade, I was fascinated.&lt;/p&gt;\n\n&lt;p&gt;Sometime in early high school I got carried away. Dozens of horizontal lines across the backs of my legs, mid-thigh to ankle. There was something about the way skin separates from itself... you can almost hear a sharp razor cutting through your own flesh like a cleaver through a steak.&lt;/p&gt;\n\n&lt;p&gt;I got kind of weird in the head for a while then.&lt;/p&gt;\n\n&lt;p&gt;Sometime in junior year I got foggy-minded and to clear the haze, I kept trying to get to that point of clarity that you reach when your body tells your brain what has happened... I kept trying to get one slice closer. I realized in the middle of the night that I had cut patterns all down my forearm and was bleeding out onto my bedroom floor. It sucked. It took a long time to recover from that. And it takes even longer to recover from all of it. I actually still slip up, years later, just by thinking of the relief I could get...&lt;/p&gt;\n\n&lt;p&gt;I just realized that all this seems like crap, that I&amp;#39;m just telling my story, and offering no help or understanding. I got caught up in the whirlwind of gloom and pain that surrounded me and still catches up at times.&lt;/p&gt;\n\n&lt;p&gt;Please just realize, if nothing else helps, neither will cutting. The only thing you can do for yourself is to be better to yourself.&lt;/p&gt;\n\n&lt;p&gt;You deserve better. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bb63", "score_hidden": false, "name": "t1_chfm8dh", "created": 1399889299.0, "author_flair_text": null, "created_utc": 1399860499.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]