[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am in the final stages of my degree but recently i have been diagnosed with anxiety and depression. I been feeling unmotivated for a while now. I mean its not like I&amp;#39;m stupid, I been getting 2.1 and first in my uni but I always felt like everything i do is never good enough for my family. I have always felt like an outcast. At the age of 10 I moved from China to live here in the UK with my mum and step Dad, along with my two half brothers. I never felt like I belonged anywhere. Everything I did wasn&amp;#39;t good enough for my step dad, mum and my real dad. Here in UK i went to a white school, I was the only Chinese person there, then there was one black guy and 2 asian guy out of over 1000 students. I was bullied throughout my time there. in my first 2 years I couldn&amp;#39;t speak a word of english so I didn&amp;#39;t really make any real friends. In my teens I have tried to take my own life because I had no control of anything in my own life, again I felt like I&amp;#39;m a waste. Now I&amp;#39;m 21 in uni, I want to be successful in life but right now I can&amp;#39;t find anything that drives me forward anymore. I want this pain to end, for the past month I didn&amp;#39;t go into uni and didn&amp;#39;t contact anyone, pretty much just slept, sometimes not eating for days. People thought I could be dead. I cry in my bed because I&amp;#39;m worried about my work but why am i so unmotivated? I can&amp;#39;t get up till stupid time in the afternoon. Whats making me feel worse is, everyone my friends and tutors all tried to help me but I feel like I don&amp;#39;t deserve this at all. After all I have always been alone, I want this to end so bad but why am I so scared of it? Am I that much of a waste? Why do I even bother to live anymore ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am in the final stages of my degree but recently i have been diagnosed with anxiety and depression. I been feeling unmotivated for a while now. I mean its not like I'm stupid, I been getting 2.1 and first in my uni but I always felt like everything i do is never good enough for my family. I have always felt like an outcast. At the age of 10 I moved from China to live here in the UK with my mum and step Dad, along with my two half brothers. I never felt like I belonged anywhere. Everything I did wasn't good enough for my step dad, mum and my real dad. Here in UK i went to a white school, I was the only Chinese person there, then there was one black guy and 2 asian guy out of over 1000 students. I was bullied throughout my time there. in my first 2 years I couldn't speak a word of english so I didn't really make any real friends. In my teens I have tried to take my own life because I had no control of anything in my own life, again I felt like I'm a waste. Now I'm 21 in uni, I want to be successful in life but right now I can't find anything that drives me forward anymore. I want this pain to end, for the past month I didn't go into uni and didn't contact anyone, pretty much just slept, sometimes not eating for days. People thought I could be dead. I cry in my bed because I'm worried about my work but why am i so unmotivated? I can't get up till stupid time in the afternoon. Whats making me feel worse is, everyone my friends and tutors all tried to help me but I feel like I don't deserve this at all. After all I have always been alone, I want this to end so bad but why am I so scared of it? Am I that much of a waste? Why do I even bother to live anymore ?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wp8b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "wizmeister", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399422354.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wp8b/i_just_want_to_fade_away_i_cant_deal_with_this/", "name": "t3_24wp8b", "created": 1399448634.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wp8b/i_just_want_to_fade_away_i_cant_deal_with_this/", "author_flair_text": null, "title": "I just want to fade away, I can't deal with this sadness anymore", "created_utc": 1399419834.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbeufb", "gilded": 0, "author": "Tallm", "parent_id": "t3_24wp8b", "approved_by": null, "body": "I'm sorry to hear that you're suffering. You sound depressed. I've been there, but for different reasons. Don't try to do this alone, one man's mind is not a match for it. If I were you, I would try to find a way to get talk therapy/counseling, and be open to temporary medication. \n\nMost people who have survived attempted suicides regret having tried it the second they do it. 6 months from now, you may feel better, and you'll be looking back on this moment, remembering how hard it was. If it doesn't kill you, it makes you stronger.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear that you&amp;#39;re suffering. You sound depressed. I&amp;#39;ve been there, but for different reasons. Don&amp;#39;t try to do this alone, one man&amp;#39;s mind is not a match for it. If I were you, I would try to find a way to get talk therapy/counseling, and be open to temporary medication. &lt;/p&gt;\n\n&lt;p&gt;Most people who have survived attempted suicides regret having tried it the second they do it. 6 months from now, you may feel better, and you&amp;#39;ll be looking back on this moment, remembering how hard it was. If it doesn&amp;#39;t kill you, it makes you stronger.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wp8b", "score_hidden": false, "name": "t1_chbeufb", "created": 1399450922.0, "author_flair_text": null, "created_utc": 1399422122.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]