[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m scared and alone and afraid of what I&amp;#39;m capable of at this point and what I&amp;#39;ll be capable of soon&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m scratching myself, leaving big red ribbons running along my arms and it&amp;#39;s the best thing I&amp;#39;ve felt in days. I want to hurt myself and feel something extinguish on my skin, I want to feel something sharp underneath my skin and I want to know that I am the person who put it there.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never been a happy person and I&amp;#39;ve dealt with depression my whole life since as far back as I can remember and none of it really matters anymore but my biggest fear was that this part of me would eat up and swallow and chew and consume everything important to me in life and it always has, it&amp;#39;s always been able to do just that and now when I&amp;#39;ve been backsliding and hurting so much the only thing in my life that served as proof against that fear has left me here and I&amp;#39;m not mad at them or upset at them I&amp;#39;m glad for them because I think I would have left me too I just wish I wasn&amp;#39;t so alone and wish I wasn&amp;#39;t so scared and wish I wasn&amp;#39;t so completely bottomless, I keep sinking and sinking and have for months and everytime in the past that this has happened I&amp;#39;ve found the ocean floor before I&amp;#39;ve started to drown but this time it&amp;#39;s like my lungs keep filling with water and I can&amp;#39;t even see the surface above be anymore, there&amp;#39;s no sunlight pouring through from above it&amp;#39;s just gone and dark and cold and suffocating me and as far as I fall I can&amp;#39;t reach a destination and I don&amp;#39;t know what to do&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a little scared sharing this because I think somebody might see this at some point and judge me or get worried for me and do something I don&amp;#39;t want happening, I don&amp;#39;t want to be forced into meds or therapy or forced into creating expenses I cannot afford but I just really want to feel like someone is hearing me as I try to shout into the darkness because all I&amp;#39;m finding is my own constant echo&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I&amp;#39;m wanting to kill myself just yet but I&amp;#39;ve wanted to and attempted to in the past and I know that I&amp;#39;m almost there, I know that I&amp;#39;m nearing the point that I&amp;#39;ll not care enough and everything will be too goddamned heavy and that something will grab me from below and pull me even deeper past the point that I can swim on my own back to the surface&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thanks to all of you; between this subreddit, people in my life and on another site I&amp;#39;ve finally decided to seek out professional help and I think I&amp;#39;m willing to try whatever happens from it. I don&amp;#39;t really want to get help but I think the fact that I don&amp;#39;t want it proves how much I need it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm scared and alone and afraid of what I'm capable of at this point and what I'll be capable of soon\n\nI'm scratching myself, leaving big red ribbons running along my arms and it's the best thing I've felt in days. I want to hurt myself and feel something extinguish on my skin, I want to feel something sharp underneath my skin and I want to know that I am the person who put it there.\n\nI've never been a happy person and I've dealt with depression my whole life since as far back as I can remember and none of it really matters anymore but my biggest fear was that this part of me would eat up and swallow and chew and consume everything important to me in life and it always has, it's always been able to do just that and now when I've been backsliding and hurting so much the only thing in my life that served as proof against that fear has left me here and I'm not mad at them or upset at them I'm glad for them because I think I would have left me too I just wish I wasn't so alone and wish I wasn't so scared and wish I wasn't so completely bottomless, I keep sinking and sinking and have for months and everytime in the past that this has happened I've found the ocean floor before I've started to drown but this time it's like my lungs keep filling with water and I can't even see the surface above be anymore, there's no sunlight pouring through from above it's just gone and dark and cold and suffocating me and as far as I fall I can't reach a destination and I don't know what to do\n\nI'm a little scared sharing this because I think somebody might see this at some point and judge me or get worried for me and do something I don't want happening, I don't want to be forced into meds or therapy or forced into creating expenses I cannot afford but I just really want to feel like someone is hearing me as I try to shout into the darkness because all I'm finding is my own constant echo\n\nI don't think I'm wanting to kill myself just yet but I've wanted to and attempted to in the past and I know that I'm almost there, I know that I'm nearing the point that I'll not care enough and everything will be too goddamned heavy and that something will grab me from below and pull me even deeper past the point that I can swim on my own back to the surface\n\nEDIT: Thanks to all of you; between this subreddit, people in my life and on another site I've finally decided to seek out professional help and I think I'm willing to try whatever happens from it. I don't really want to get help but I think the fact that I don't want it proves how much I need it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25b243", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "kleiner352", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399856943.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25b243/i_keep_getting_closer_and_closer_and_slipping/", "name": "t3_25b243", "created": 1399871308.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25b243/i_keep_getting_closer_and_closer_and_slipping/", "author_flair_text": null, "title": "I keep getting closer and closer and slipping further away from myself and everything else and I'm not there yet but I think soon I might be and I want someone to listen and to care before nobody can", "created_utc": 1399842508.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfidzv", "gilded": 0, "author": "clearblusky", "parent_id": "t1_chfhaof", "approved_by": null, "body": "I can't tell you what will help or won't for you, I don't know.  If it is the depression that is causing pain in your life and not the reverse, chronic depression is an illness you didn't ask for or want and you should never feel shame or that you deserved it or anything, anymore than a diabetic or someone with asthma.\n\nMedication works for some people.  Sometimes, as a temporary measure, it won't cure your pain, but it will level the playing field so to speak.  Help you normalize sleep and daily things.  Don't give in to their thinking, or the stigma of medication as a weakness.  Pragmatism, if it works it works.  So do glasses, but nobody calls myopia a weakness.\n\nI can tell you from my experience that trying to struggle with this affliction on my own, ashamed, I lost years of my life pushing people away and hiding my pain.  Helping yourself will help others.  Don't do this alone.\n\n", "edited": 1399853615.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t tell you what will help or won&amp;#39;t for you, I don&amp;#39;t know.  If it is the depression that is causing pain in your life and not the reverse, chronic depression is an illness you didn&amp;#39;t ask for or want and you should never feel shame or that you deserved it or anything, anymore than a diabetic or someone with asthma.&lt;/p&gt;\n\n&lt;p&gt;Medication works for some people.  Sometimes, as a temporary measure, it won&amp;#39;t cure your pain, but it will level the playing field so to speak.  Help you normalize sleep and daily things.  Don&amp;#39;t give in to their thinking, or the stigma of medication as a weakness.  Pragmatism, if it works it works.  So do glasses, but nobody calls myopia a weakness.&lt;/p&gt;\n\n&lt;p&gt;I can tell you from my experience that trying to struggle with this affliction on my own, ashamed, I lost years of my life pushing people away and hiding my pain.  Helping yourself will help others.  Don&amp;#39;t do this alone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfidzv", "created": 1399879571.0, "author_flair_text": null, "created_utc": 1399850771.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfhaof", "gilded": 0, "author": "kleiner352", "parent_id": "t1_chfg3us", "approved_by": null, "body": "Thank you so much for being so understanding.\n\nI don't really know what happened. It just always does. It just keeps happening and finding a way into my head and into my heart and into my life. There's just nothing I can do to make it go away forever, just find ways to manage and keep it from taking over me, and I don't know what it is that let it take control again. I feel like I keep losing more and more of myself every day, and the person who kept a part of me from slipping away and helped hold me together couldn't do it anymore. I feel like I don't even know who I am anymore or recognize myself when I look in the mirror", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for being so understanding.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really know what happened. It just always does. It just keeps happening and finding a way into my head and into my heart and into my life. There&amp;#39;s just nothing I can do to make it go away forever, just find ways to manage and keep it from taking over me, and I don&amp;#39;t know what it is that let it take control again. I feel like I keep losing more and more of myself every day, and the person who kept a part of me from slipping away and helped hold me together couldn&amp;#39;t do it anymore. I feel like I don&amp;#39;t even know who I am anymore or recognize myself when I look in the mirror&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfhaof", "created": 1399876668.0, "author_flair_text": null, "created_utc": 1399847868.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfg3us", "gilded": 0, "author": "clearblusky", "parent_id": "t3_25b243", "approved_by": null, "body": "I registered to respond...it took a minute.  I know there are skills about how to talk to someone in pain, things you're supposed to say or not say and I don't know them.\n\nI just very badly want to tell you that the bottom of the ocean in littered with us, that you are part of a tribe of people who carry these sufferings, that you are not alone, that you never have been.  We understand.\n\nWhat has happened that brought you to this place?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I registered to respond...it took a minute.  I know there are skills about how to talk to someone in pain, things you&amp;#39;re supposed to say or not say and I don&amp;#39;t know them.&lt;/p&gt;\n\n&lt;p&gt;I just very badly want to tell you that the bottom of the ocean in littered with us, that you are part of a tribe of people who carry these sufferings, that you are not alone, that you never have been.  We understand.&lt;/p&gt;\n\n&lt;p&gt;What has happened that brought you to this place?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfg3us", "created": 1399873639.0, "author_flair_text": null, "created_utc": 1399844839.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfh9ek", "gilded": 0, "author": "twinsfan68", "parent_id": "t1_chfgz51", "approved_by": null, "body": "I know exactly how you feel. One thing to consider is that if you did start medication, you could talk to your doctor about doing so just temporarily until you got yourself back in balance. Once you've \"restored order\" in your own head, and have felt that way for a while, you could discuss tapering off the meds and using different, less \"clinical\" coping techniques (meditation, exercise, etc.) to help. \n\nLet me know if you have any questions or concerns, I've been there myself, so feel free to reach out!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly how you feel. One thing to consider is that if you did start medication, you could talk to your doctor about doing so just temporarily until you got yourself back in balance. Once you&amp;#39;ve &amp;quot;restored order&amp;quot; in your own head, and have felt that way for a while, you could discuss tapering off the meds and using different, less &amp;quot;clinical&amp;quot; coping techniques (meditation, exercise, etc.) to help. &lt;/p&gt;\n\n&lt;p&gt;Let me know if you have any questions or concerns, I&amp;#39;ve been there myself, so feel free to reach out!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfh9ek", "created": 1399876575.0, "author_flair_text": null, "created_utc": 1399847775.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfgz51", "gilded": 0, "author": "kleiner352", "parent_id": "t1_chfgtyf", "approved_by": null, "body": "Thank you; I honestly am considering it more and more I just would love to be able to be functional on my own without a constant supply of medication making me dependent on it, but I'm really starting to wonder if that would be as bad as nothing at all.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you; I honestly am considering it more and more I just would love to be able to be functional on my own without a constant supply of medication making me dependent on it, but I&amp;#39;m really starting to wonder if that would be as bad as nothing at all.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfgz51", "created": 1399875818.0, "author_flair_text": null, "created_utc": 1399847018.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfgtyf", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_25b243", "approved_by": null, "body": "This is a safe place - nobody is going to judge you. You are in the right place, and you did well by reaching out to us here. Nobody can force you to do anything - all we can do is encourage you. I have dealt with depression for most of my adult life, and at first I thought I could handle it, and that everyone has anxiety or depression to a certain extent. I felt that I would never need or want medication or therapy, I viewed those things as weak answers to a problem I could handle by myself. I carried an increasingly heavier burden for years, until I finally accepted that I might need some professional help. And that's exactly what I did - and I have never looked back. I'm on meds and see a therapist regularly. It helps bring balance back to my life and I have never felt better. \n\nIt seems difficult at first to admit you might actually need some help in this struggle, but I'll be the first to tell you you don't have to go it alone. I encourage you to reach out, talk to someone, share how you are feeling and how this depression is affecting you. That's the best advice I can give - I just hope it finds you in a good place.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a safe place - nobody is going to judge you. You are in the right place, and you did well by reaching out to us here. Nobody can force you to do anything - all we can do is encourage you. I have dealt with depression for most of my adult life, and at first I thought I could handle it, and that everyone has anxiety or depression to a certain extent. I felt that I would never need or want medication or therapy, I viewed those things as weak answers to a problem I could handle by myself. I carried an increasingly heavier burden for years, until I finally accepted that I might need some professional help. And that&amp;#39;s exactly what I did - and I have never looked back. I&amp;#39;m on meds and see a therapist regularly. It helps bring balance back to my life and I have never felt better. &lt;/p&gt;\n\n&lt;p&gt;It seems difficult at first to admit you might actually need some help in this struggle, but I&amp;#39;ll be the first to tell you you don&amp;#39;t have to go it alone. I encourage you to reach out, talk to someone, share how you are feeling and how this depression is affecting you. That&amp;#39;s the best advice I can give - I just hope it finds you in a good place.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b243", "score_hidden": false, "name": "t1_chfgtyf", "created": 1399875458.0, "author_flair_text": null, "created_utc": 1399846658.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]