[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Earlier today was pretty rough for me, trying to go back and get my job that i quit, trying to re hash things with a girl, i mean tons of stuff. Ive posted here before, I posted a song i made the other day about my family and some things that I am dealing with clinically. Anyways, today I came home after the meeting with my job, and i was feeling horrible. I happened to see a copperhead in this really big brush pile that lays right next to the driveway whenever you pull in. (I know, i still live with my parents and am 21). Anyways, i decided that how nice of an enlightening thing would it be to turn that 15 by 15 foot area into a flower garden or maybe a small bird sanctuary where I&amp;#39;d put some feeders and stuff for the birds. Not to mention that my parents anniversary was recent and they would be absolutely shocked if their mental case of a son did something for them for once instead of always causing them pain and a hassle. So i started, and i want you guys to know that in that moment of me digging up roots, using hedges, a machete, rakes, the lawnmower, i mean everything, It was so relaxing and I felt free for once. Instead of being all worried about the thoughts in my head and everything going on in my life right now, I did not have a moment where i thought about living any other way or not being here any more. It really, really relieved me from a lot of stress and other things. Im going to post more pictures than I have so you guys can see the progress of the garden/sanctuary if you care too, but i just wanted to share that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Earlier today was pretty rough for me, trying to go back and get my job that i quit, trying to re hash things with a girl, i mean tons of stuff. Ive posted here before, I posted a song i made the other day about my family and some things that I am dealing with clinically. Anyways, today I came home after the meeting with my job, and i was feeling horrible. I happened to see a copperhead in this really big brush pile that lays right next to the driveway whenever you pull in. (I know, i still live with my parents and am 21). Anyways, i decided that how nice of an enlightening thing would it be to turn that 15 by 15 foot area into a flower garden or maybe a small bird sanctuary where I'd put some feeders and stuff for the birds. Not to mention that my parents anniversary was recent and they would be absolutely shocked if their mental case of a son did something for them for once instead of always causing them pain and a hassle. So i started, and i want you guys to know that in that moment of me digging up roots, using hedges, a machete, rakes, the lawnmower, i mean everything, It was so relaxing and I felt free for once. Instead of being all worried about the thoughts in my head and everything going on in my life right now, I did not have a moment where i thought about living any other way or not being here any more. It really, really relieved me from a lot of stress and other things. Im going to post more pictures than I have so you guys can see the progress of the garden/sanctuary if you care too, but i just wanted to share that.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24l7ov", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayvocals", "media": null, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24l7ov/i_know_this_is_a_little_long_winded_but_ive/", "name": "t3_24l7ov", "created": 1399108132.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24l7ov/i_know_this_is_a_little_long_winded_but_ive/", "author_flair_text": null, "title": "I know this is a little long winded, but i've finally had a decent day today.", "created_utc": 1399079332.0, "ups": 12, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch880km", "gilded": 0, "author": "pangie12", "parent_id": "t3_24l7ov", "approved_by": null, "body": "Im glad you felt so relaxed :) Also its ok im 21 and I still live with my step dad. So dont be ashamed :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im glad you felt so relaxed :) Also its ok im 21 and I still live with my step dad. So dont be ashamed :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l7ov", "score_hidden": false, "name": "t1_ch880km", "created": 1399084925.0, "author_flair_text": null, "created_utc": 1399081325.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]