[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Shits been a wreck lately.&lt;/p&gt;\n\n&lt;p&gt;I have a history if being self destructive but I keep it private.\nCutting, burning, strangling, bruising, bulimia, anorexia, binge drinking, impulsive decisions, money spending it&amp;#39;s what I do best.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been under a lot of stress. New job but I&amp;#39;m actually really good at it. The people I work with suck though.&lt;/p&gt;\n\n&lt;p&gt;Husband and I have been fighting.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re young, newlyweds. I moved across the world to live with him as he traveled with his job. I rarely see him. I have trust issues. My last few relationships have ended from me being cheated on and leaving. &lt;/p&gt;\n\n&lt;p&gt;Caught him for the third time with dirty pictures of another girl. We fought we talked it out he did as I wished and deleted everything. He&amp;#39;s trying hard to make things right but I&amp;#39;m having difficulty accepting it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m angry.\nI&amp;#39;ve said mean things.\nI told him &amp;#39;if we had been dating I would walk away and not look back hut we&amp;#39;re married so I&amp;#39;m trying to figure out what to do.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;I contacted the girl. Threatened to port her nudes if she contacted my husband again. She was sweet, had no idea.&lt;/p&gt;\n\n&lt;p&gt;My husband likes tits, her tits. I&amp;#39;m an A cup. I&amp;#39;ve tried everything to make myself his ideal woman. I can&amp;#39;t change my body, I like my slim athletic build. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve talked it out, we&amp;#39;ve said everything here is to be said. I&amp;#39;ve been mean and I&amp;#39;ve  to make up for it. &lt;/p&gt;\n\n&lt;p&gt;I feel he resents me, he regrets marrying me. He wishes I was more interesting, had bigger tits, didn&amp;#39;t care about his infidelity. &lt;/p&gt;\n\n&lt;p&gt;I thought about leaving him. I love him though. I&amp;#39;ve been in love before but I don&amp;#39;t want to live without him. He makes me happier than I&amp;#39;ve been since I was a kid. He makes me laugh, makes me think, takes care of me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m having trouble getting over his infidelity, I know he loves me. He&amp;#39;s honestly great to me and makes me feel loved. I just fear I&amp;#39;m not enough for him. I&amp;#39;m not 100% interested in the same things as him. I&amp;#39;m skinny when he likes thick girls. Why did he even marry me? Out of desperation? I&amp;#39;m pretty, somewhat average but I&amp;#39;m not ugly, why am I not good enough?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m working on not being angry. I just don&amp;#39;t know how to deal with the situation. When he&amp;#39;s not around I&amp;#39;m crying, even at work. When I get off work I drink (I&amp;#39;m 2/3 through a bottle of wine now, sorry!) I&amp;#39;ve drank every night since this happened. When I am around him I try to enjoy him like used to but time to time little things will remind me of what happened and I snap at him with smart remarks. &amp;#39;How about we watch anatomy of a liar&amp;#39; me: &amp;#39;oh you would know all about that&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I just say I think it&amp;#39;s a self defense mechanism, \nI still love him I&amp;#39;m just afraid I&amp;#39;m scaring him away now, making him not love me, i just need time.&lt;/p&gt;\n\n&lt;p&gt;The more he pushes himself away from me the more i think about how I could easily go. I&amp;#39;m on a beautiful island. Here are tons of cliffs. One step and it could be done.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Shits been a wreck lately.\n\nI have a history if being self destructive but I keep it private.\nCutting, burning, strangling, bruising, bulimia, anorexia, binge drinking, impulsive decisions, money spending it's what I do best.\n\nI've been under a lot of stress. New job but I'm actually really good at it. The people I work with suck though.\n\nHusband and I have been fighting.\n\n\nWe're young, newlyweds. I moved across the world to live with him as he traveled with his job. I rarely see him. I have trust issues. My last few relationships have ended from me being cheated on and leaving. \n\nCaught him for the third time with dirty pictures of another girl. We fought we talked it out he did as I wished and deleted everything. He's trying hard to make things right but I'm having difficulty accepting it.\n\nI'm angry.\nI've said mean things.\nI told him 'if we had been dating I would walk away and not look back hut we're married so I'm trying to figure out what to do.'\n\nI contacted the girl. Threatened to port her nudes if she contacted my husband again. She was sweet, had no idea.\n\nMy husband likes tits, her tits. I'm an A cup. I've tried everything to make myself his ideal woman. I can't change my body, I like my slim athletic build. \n\nWe've talked it out, we've said everything here is to be said. I've been mean and I've  to make up for it. \n\nI feel he resents me, he regrets marrying me. He wishes I was more interesting, had bigger tits, didn't care about his infidelity. \n\nI thought about leaving him. I love him though. I've been in love before but I don't want to live without him. He makes me happier than I've been since I was a kid. He makes me laugh, makes me think, takes care of me.\n\nI'm having trouble getting over his infidelity, I know he loves me. He's honestly great to me and makes me feel loved. I just fear I'm not enough for him. I'm not 100% interested in the same things as him. I'm skinny when he likes thick girls. Why did he even marry me? Out of desperation? I'm pretty, somewhat average but I'm not ugly, why am I not good enough?\n\nI'm working on not being angry. I just don't know how to deal with the situation. When he's not around I'm crying, even at work. When I get off work I drink (I'm 2/3 through a bottle of wine now, sorry!) I've drank every night since this happened. When I am around him I try to enjoy him like used to but time to time little things will remind me of what happened and I snap at him with smart remarks. 'How about we watch anatomy of a liar' me: 'oh you would know all about that' \n\nI don't think I just say I think it's a self defense mechanism, \nI still love him I'm just afraid I'm scaring him away now, making him not love me, i just need time.\n\n\nThe more he pushes himself away from me the more i think about how I could easily go. I'm on a beautiful island. Here are tons of cliffs. One step and it could be done.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2586zw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Pupe_chute", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2586zw/i_know_the_most_beautiful_serene_cliff/", "name": "t3_2586zw", "created": 1399778949.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2586zw/i_know_the_most_beautiful_serene_cliff/", "author_flair_text": null, "title": "I know the most beautiful serene cliff", "created_utc": 1399750149.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chemmfz", "gilded": 0, "author": "Pupe_chute", "parent_id": "t3_2586zw", "approved_by": null, "body": "I don't want to die it's just starting to seen like my best option right now  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to die it&amp;#39;s just starting to seen like my best option right now  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2586zw", "score_hidden": false, "name": "t1_chemmfz", "created": 1399779526.0, "author_flair_text": null, "created_utc": 1399750726.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheqdd9", "gilded": 0, "author": "sardonic_clam", "parent_id": "t3_2586zw", "approved_by": null, "body": "I figure love is a two way street and your husband isn't being the ideal partner. IMHO Maybe consider a divorce as there is no point sticking around for more emotional abuse.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I figure love is a two way street and your husband isn&amp;#39;t being the ideal partner. IMHO Maybe consider a divorce as there is no point sticking around for more emotional abuse.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2586zw", "score_hidden": false, "name": "t1_cheqdd9", "created": 1399789163.0, "author_flair_text": null, "created_utc": 1399760363.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chere4j", "gilded": 0, "author": "Throwaway2014111", "parent_id": "t3_2586zw", "approved_by": null, "body": "I know this sounds lame but consider reading some Dan Savage relationship advice stuff.\n\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this sounds lame but consider reading some Dan Savage relationship advice stuff.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2586zw", "score_hidden": false, "name": "t1_chere4j", "created": 1399791768.0, "author_flair_text": null, "created_utc": 1399762968.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]