[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A couple weeks ago my therapist told me I need to know what I want to get over my depression. I didn’t tell her at the time, but I know what I want, but its impossible to get.&lt;/p&gt;\n\n&lt;p&gt;I want to be female. I&amp;#39;m not transgender,  I&amp;#39;m not a girl trapped in a woman&amp;#39;s body, I just wish I was a girl.&lt;/p&gt;\n\n&lt;p&gt;I want to be less feminine. If I&amp;#39;m going to be a guy, could I atleast like maly things so I don&amp;#39;t have to hide my true self to not be bullied? &lt;/p&gt;\n\n&lt;p&gt;I want to be dead. Obviously no one&amp;#39;s going to help me with that, they&amp;#39;re very against that idea. This is the reason I couldn&amp;#39;t tell her, I didn’t want to be sent back to the hospital. &lt;/p&gt;\n\n&lt;p&gt;I want my father to love me, or atleast stop being a lying hypocritical cunt, but I can&amp;#39;t control him.&lt;/p&gt;\n\n&lt;p&gt;I want friends but noone wants to be near me and I&amp;#39;m to socially akward to talk to anyone. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be sensitive. It&amp;#39;s embarrassing as a guy.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to have empathy. I can&amp;#39;t stop helping people, and I help people hurt me&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be so ugly. I hate my curly hair, my long eyelashes, my fucked up ears, my big nose, my ugly face, or my fat body.&lt;/p&gt;\n\n&lt;p&gt;I want to talk to people, I dont want to be socially akward. &lt;/p&gt;\n\n&lt;p&gt;I want to play music,  but I can&amp;#39;t play any instruments because of my poor hand eye coordinations and motor skills. My voice is horrible and I can&amp;#39;t sing without it cracking. I can&amp;#39;t even whistle. &lt;/p&gt;\n\n&lt;p&gt;I want to play with my pets, but they don&amp;#39;t want to be around me unless I have food.&lt;/p&gt;\n\n&lt;p&gt;I want to feel good. I want to be happy. I use masturbation as a kind of natural drug, but it&amp;#39;s not that helpful. The only other options are to live my life drunk or high which I can&amp;#39;t and shouldn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;People always say, the point of life is to go through it complete goals to reach happiness. This is my happiness, these are my goals, and its out of my reach. So what&amp;#39;s the point of my life?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A couple weeks ago my therapist told me I need to know what I want to get over my depression. I didn’t tell her at the time, but I know what I want, but its impossible to get.\n\nI want to be female. I'm not transgender,  I'm not a girl trapped in a woman's body, I just wish I was a girl.\n\nI want to be less feminine. If I'm going to be a guy, could I atleast like maly things so I don't have to hide my true self to not be bullied? \n\nI want to be dead. Obviously no one's going to help me with that, they're very against that idea. This is the reason I couldn't tell her, I didn’t want to be sent back to the hospital. \n\nI want my father to love me, or atleast stop being a lying hypocritical cunt, but I can't control him.\n\nI want friends but noone wants to be near me and I'm to socially akward to talk to anyone. \n\nI don't want to be sensitive. It's embarrassing as a guy.\n\nI don't want to have empathy. I can't stop helping people, and I help people hurt me\n\nI don't want to be so ugly. I hate my curly hair, my long eyelashes, my fucked up ears, my big nose, my ugly face, or my fat body.\n\nI want to talk to people, I dont want to be socially akward. \n\nI want to play music,  but I can't play any instruments because of my poor hand eye coordinations and motor skills. My voice is horrible and I can't sing without it cracking. I can't even whistle. \n\nI want to play with my pets, but they don't want to be around me unless I have food.\n\nI want to feel good. I want to be happy. I use masturbation as a kind of natural drug, but it's not that helpful. The only other options are to live my life drunk or high which I can't and shouldn't. \n\nPeople always say, the point of life is to go through it complete goals to reach happiness. This is my happiness, these are my goals, and its out of my reach. So what's the point of my life?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25ddq7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TheCommunistElephant", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25ddq7/i_know_what_i_want/", "name": "t3_25ddq7", "created": 1399942340.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25ddq7/i_know_what_i_want/", "author_flair_text": null, "title": "I know what I want.", "created_utc": 1399913540.0, "ups": 7, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg25d7", "gilded": 0, "author": "TheCommunistElephant", "parent_id": "t3_25ddq7", "approved_by": null, "body": "I don't know if this should be here, sorry if it doesn't fit. And sorry for this badly written rant.\n\nI didn’t write this because I needed your help, I wrote it because jotting this stuff down this is helpful to me. Some users of the subreddit I usually post in have told me they don't want to read this depressing stuff in the sub, so I decided to dump it here instead of their. \n\nI've aviod this sub and /r/depression because I felt like I'd only get generic replies of \"I know how you feel,\" \"I'm here for you, PM me,\" and that stupid story about all the surviving bridge jumpers immediately regretted their descions and found answers to there problems. The sidebar is against these replies, but I kinda expect them anyway. \n\nWith that said, feel free to comment. I didn’t make this for your guy's help, but that doesn't mean your relpies wouldn't be helpful. \n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if this should be here, sorry if it doesn&amp;#39;t fit. And sorry for this badly written rant.&lt;/p&gt;\n\n&lt;p&gt;I didn’t write this because I needed your help, I wrote it because jotting this stuff down this is helpful to me. Some users of the subreddit I usually post in have told me they don&amp;#39;t want to read this depressing stuff in the sub, so I decided to dump it here instead of their. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve aviod this sub and &lt;a href=\"/r/depression\"&gt;/r/depression&lt;/a&gt; because I felt like I&amp;#39;d only get generic replies of &amp;quot;I know how you feel,&amp;quot; &amp;quot;I&amp;#39;m here for you, PM me,&amp;quot; and that stupid story about all the surviving bridge jumpers immediately regretted their descions and found answers to there problems. The sidebar is against these replies, but I kinda expect them anyway. &lt;/p&gt;\n\n&lt;p&gt;With that said, feel free to comment. I didn’t make this for your guy&amp;#39;s help, but that doesn&amp;#39;t mean your relpies wouldn&amp;#39;t be helpful. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ddq7", "score_hidden": false, "name": "t1_chg25d7", "created": 1399942526.0, "author_flair_text": null, "created_utc": 1399913726.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg3zd9", "gilded": 0, "author": "TheCommunistElephant", "parent_id": "t1_chg3bf4", "approved_by": null, "body": "I don't see how. These aren't my dreams,  this is what I need, love and a sense of identity. And it's physically impossible for me to achieve most of this without surgery and brainwashing people. These things probably won't even make me happy, only content. If I can't even fell content time I don't see why I should go through suffering for a reward is worth it. The reward isnt worth it. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see how. These aren&amp;#39;t my dreams,  this is what I need, love and a sense of identity. And it&amp;#39;s physically impossible for me to achieve most of this without surgery and brainwashing people. These things probably won&amp;#39;t even make me happy, only content. If I can&amp;#39;t even fell content time I don&amp;#39;t see why I should go through suffering for a reward is worth it. The reward isnt worth it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ddq7", "score_hidden": false, "name": "t1_chg3zd9", "created": 1399946323.0, "author_flair_text": null, "created_utc": 1399917523.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chg3bf4", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25ddq7", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ddq7", "score_hidden": false, "name": "t1_chg3bf4", "created": 1399944953.0, "author_flair_text": null, "created_utc": 1399916153.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg5g6p", "gilded": 0, "author": "circinia", "parent_id": "t3_25ddq7", "approved_by": null, "body": "You've articulated the things you feel you need to be happy well and thoughtfully here; I hope that you're able to share this list with your therapist as well.\n\nIf it's okay to ask, what are the obstacles to being female for you? It seems like you feel conflicted between wanting to be the person that you feel like you are inside, and wanting to be someone who could be accepted by others. \n\n&gt; People always say, the point of life is to go through it complete goals to reach happiness.\n\nI'm not sure if I'd *quite* agree with that statement. There are many different possible points to life: reaching happiness (or peace, or contentment, or whatever emotional state one is seeking) is certainly one--but there's not always a single set of goals that will get one there. \n\nAt the same time, as you've written, being comfortable in your identity and in feeling loved by others can be essential needs for happiness. I don't know if it's possible for you to accomplish all the wants you've shared here--but I hope you can find a way to accomplish enough of them to get those needs met.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve articulated the things you feel you need to be happy well and thoughtfully here; I hope that you&amp;#39;re able to share this list with your therapist as well.&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s okay to ask, what are the obstacles to being female for you? It seems like you feel conflicted between wanting to be the person that you feel like you are inside, and wanting to be someone who could be accepted by others. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;People always say, the point of life is to go through it complete goals to reach happiness.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if I&amp;#39;d &lt;em&gt;quite&lt;/em&gt; agree with that statement. There are many different possible points to life: reaching happiness (or peace, or contentment, or whatever emotional state one is seeking) is certainly one--but there&amp;#39;s not always a single set of goals that will get one there. &lt;/p&gt;\n\n&lt;p&gt;At the same time, as you&amp;#39;ve written, being comfortable in your identity and in feeling loved by others can be essential needs for happiness. I don&amp;#39;t know if it&amp;#39;s possible for you to accomplish all the wants you&amp;#39;ve shared here--but I hope you can find a way to accomplish enough of them to get those needs met.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ddq7", "score_hidden": false, "name": "t1_chg5g6p", "created": 1399949400.0, "author_flair_text": null, "created_utc": 1399920600.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg74dn", "gilded": 0, "author": "unicornzforevaz", "parent_id": "t3_25ddq7", "approved_by": null, "body": "I know its hard to see out of this period in your life. But I can promise you it won't last forever. Be yourself, and be true to yourself. You don't need to be anything else for anyone else. And you might not have the means necessary to truly be happy, but that doesn't mean it will be unobtainable forever. In addition, things you want now you might not want forever. Desires change, and so do opportunities. Perhaps you haven't found the right instrument, or even the right friend. But you can find happiness, just keep your eye out and stay strong :)", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know its hard to see out of this period in your life. But I can promise you it won&amp;#39;t last forever. Be yourself, and be true to yourself. You don&amp;#39;t need to be anything else for anyone else. And you might not have the means necessary to truly be happy, but that doesn&amp;#39;t mean it will be unobtainable forever. In addition, things you want now you might not want forever. Desires change, and so do opportunities. Perhaps you haven&amp;#39;t found the right instrument, or even the right friend. But you can find happiness, just keep your eye out and stay strong :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25ddq7", "score_hidden": false, "name": "t1_chg74dn", "created": 1399952782.0, "author_flair_text": null, "created_utc": 1399923982.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]