[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to do, I&amp;#39;m scared and feel like I have a void in my heart. I&amp;#39;ve gone through a lot in my short 20 years of life, it&amp;#39;s always been tough. I&amp;#39;ve been dealing with depression and anxiety my entire life. When I turned 15 I met him. The one person who believed in me, made me grow as a person, dealt with my issues and loved me through my imperfections. He was my everything, I should have told him more, I should have been the better person but didn&amp;#39;t realize what I had right in front of me do to the mask that was my issues. I love him with all my heart and soul. I was with him for 4 years. We broke up. Plain and simple. We are good friends now but I am still at a struggle. He&amp;#39;s still the amazing person I use to know. Through these last 5 months I have been falling apart. I put a gun up to my head but didn&amp;#39;t pull the trigger, why didn&amp;#39;t I pull the trigger? This would be easier if he was a bad guy, an abusive and mean guy, but he&amp;#39;s not, he&amp;#39;s an amazing guy even with his flaws did everything in his power to make me happy and more. We were young, I know we were young and still are and have a lot to learn. But we were completely in love with each other. It wasn&amp;#39;t us that made us fall apart it was the people and issues around us that caused our down fall. He couldn&amp;#39;t handle it, and neither could I. Now my happiness and light in my life is gone, I am his friend and we still hang out occasionally. Those times have been the happiest I&amp;#39;ve felt in months. Those shorts hours of being with him keeps me going. I have very little friends and the ones I do I have I feel I am taking advantage of. I complain to them, tell them how I am feeling. Being in a constant depression. I feel I am bringing them down. They have their own issues, I don&amp;#39;t want to be a burden on them. That is not fair.  I&amp;#39;m trying my best to be happy, do things I wouldn&amp;#39;t normal do, take meds, hang out with people, be positive, try to do hobbies. But I&amp;#39;m still miserable, I am honestly surprised I have survived this long.  I just feel so much pain, there is a hole in my heart. It&amp;#39;s not just he has left my life, many other things are happening as well. My house is being foreclosed on I might be homeless in a month. I can&amp;#39;t hold a job do to my issues, I&amp;#39;m trying to go to college but it&amp;#39;s hard to do well when you are struggling. We don&amp;#39;t know what will happen in the future, he said to me the other day And he is right but how can I see the future if I can&amp;#39;t seem to survive the present? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know what to do, I'm scared and feel like I have a void in my heart. I've gone through a lot in my short 20 years of life, it's always been tough. I've been dealing with depression and anxiety my entire life. When I turned 15 I met him. The one person who believed in me, made me grow as a person, dealt with my issues and loved me through my imperfections. He was my everything, I should have told him more, I should have been the better person but didn't realize what I had right in front of me do to the mask that was my issues. I love him with all my heart and soul. I was with him for 4 years. We broke up. Plain and simple. We are good friends now but I am still at a struggle. He's still the amazing person I use to know. Through these last 5 months I have been falling apart. I put a gun up to my head but didn't pull the trigger, why didn't I pull the trigger? This would be easier if he was a bad guy, an abusive and mean guy, but he's not, he's an amazing guy even with his flaws did everything in his power to make me happy and more. We were young, I know we were young and still are and have a lot to learn. But we were completely in love with each other. It wasn't us that made us fall apart it was the people and issues around us that caused our down fall. He couldn't handle it, and neither could I. Now my happiness and light in my life is gone, I am his friend and we still hang out occasionally. Those times have been the happiest I've felt in months. Those shorts hours of being with him keeps me going. I have very little friends and the ones I do I have I feel I am taking advantage of. I complain to them, tell them how I am feeling. Being in a constant depression. I feel I am bringing them down. They have their own issues, I don't want to be a burden on them. That is not fair.  I'm trying my best to be happy, do things I wouldn't normal do, take meds, hang out with people, be positive, try to do hobbies. But I'm still miserable, I am honestly surprised I have survived this long.  I just feel so much pain, there is a hole in my heart. It's not just he has left my life, many other things are happening as well. My house is being foreclosed on I might be homeless in a month. I can't hold a job do to my issues, I'm trying to go to college but it's hard to do well when you are struggling. We don't know what will happen in the future, he said to me the other day And he is right but how can I see the future if I can't seem to survive the present? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249vy2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Ang3lBit3s", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398778202.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249vy2/i_lost_the_love_of_my_life_five_months_ago_and_my/", "name": "t3_249vy2", "created": 1398806606.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249vy2/i_lost_the_love_of_my_life_five_months_ago_and_my/", "author_flair_text": null, "title": "I lost the love of my life five months ago and my life has been crumbling ever since.", "created_utc": 1398777806.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch52xlz", "gilded": 0, "author": "goldguy81", "parent_id": "t3_249vy2", "approved_by": null, "body": "I might not be the best person to respond to this, but I'm here now and am giving it a shot!\n\nI know this is happened to two diffrent people I know(A sister and friend). My friend had been dumped by a guy she loved for several years, but the problem was he took every friend she had with him. He was a good guy, and nowadays can't even see why she liked him. What she did to change things around was she told herself to smile all the time, and inspired others to do so. She then made friends on a forum, of which I was one. Most she talks to even to this day! All she wanted was friends and made a post about just that. They've made such a positive impact on her life, and I'm so happy for her! They're all meeting at RTX soon, with only a few missing out. This makes me so happy, I can't even begin to describe it!\n\nThe other is my sister, of which decided to go an alternative route. She had got out of a four year relationship, and is struggling to find another love. He was an okay guy, and unlike the former, she still has most of her friends. Though, she couldn't feel happy as much after that. Her sister and other friends got married and she felt as if everyone had an SO but her. What she did was teach in my CCD class. She did this four two year, not because she needed to get closer to God or anything like that. She wanted to have a positive impact on other people's lives, my classmates. She bonded with many of them, and was so very happy to see them get confirmed, but mostly because she got to see them grow over time. That helped her get her out of the majority of her depression, and is genuinely happy!\n\nThe way I see it, the way to get out of a something like this, set a goal for yourself and make a difference in someone else's life. You might be surprised how warm it'll make you feel! Try posting in subs like this one(/r/SuicideWatch/new in particular), /r/r4r (To look for friends), /r/photography (A place where you can bond with others over something you love, and give back to the people just starting out) or something like /r/dogecoin that may help you financially along with positive bonding over many shared moments.\n\nRegardless of where you go, just remember to smile! :D", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might not be the best person to respond to this, but I&amp;#39;m here now and am giving it a shot!&lt;/p&gt;\n\n&lt;p&gt;I know this is happened to two diffrent people I know(A sister and friend). My friend had been dumped by a guy she loved for several years, but the problem was he took every friend she had with him. He was a good guy, and nowadays can&amp;#39;t even see why she liked him. What she did to change things around was she told herself to smile all the time, and inspired others to do so. She then made friends on a forum, of which I was one. Most she talks to even to this day! All she wanted was friends and made a post about just that. They&amp;#39;ve made such a positive impact on her life, and I&amp;#39;m so happy for her! They&amp;#39;re all meeting at RTX soon, with only a few missing out. This makes me so happy, I can&amp;#39;t even begin to describe it!&lt;/p&gt;\n\n&lt;p&gt;The other is my sister, of which decided to go an alternative route. She had got out of a four year relationship, and is struggling to find another love. He was an okay guy, and unlike the former, she still has most of her friends. Though, she couldn&amp;#39;t feel happy as much after that. Her sister and other friends got married and she felt as if everyone had an SO but her. What she did was teach in my CCD class. She did this four two year, not because she needed to get closer to God or anything like that. She wanted to have a positive impact on other people&amp;#39;s lives, my classmates. She bonded with many of them, and was so very happy to see them get confirmed, but mostly because she got to see them grow over time. That helped her get her out of the majority of her depression, and is genuinely happy!&lt;/p&gt;\n\n&lt;p&gt;The way I see it, the way to get out of a something like this, set a goal for yourself and make a difference in someone else&amp;#39;s life. You might be surprised how warm it&amp;#39;ll make you feel! Try posting in subs like this one(&lt;a href=\"/r/SuicideWatch/new\"&gt;/r/SuicideWatch/new&lt;/a&gt; in particular), &lt;a href=\"/r/r4r\"&gt;/r/r4r&lt;/a&gt; (To look for friends), &lt;a href=\"/r/photography\"&gt;/r/photography&lt;/a&gt; (A place where you can bond with others over something you love, and give back to the people just starting out) or something like &lt;a href=\"/r/dogecoin\"&gt;/r/dogecoin&lt;/a&gt; that may help you financially along with positive bonding over many shared moments.&lt;/p&gt;\n\n&lt;p&gt;Regardless of where you go, just remember to smile! :D&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249vy2", "score_hidden": false, "name": "t1_ch52xlz", "created": 1398813442.0, "author_flair_text": null, "created_utc": 1398784642.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]