[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It feels strange to post this, but humans are selfish creatures and I guess I&amp;#39;m not exempt. I don&amp;#39;t want to be remembered, I don&amp;#39;t want to be mourned, and if I had a choice I would chose to have never existed. I guess this is to explain my actions.&lt;/p&gt;\n\n&lt;p&gt;I cannot remember a time in my life where I have felt happy. I remember being 4/5 and laying in my bed at night, crying because I didn&amp;#39;t want to wake up in the morning. I couldn&amp;#39;t bathe by myself until I was older because I would try to &amp;#39;fall asleep&amp;#39; in the tub and more than once my parents had to pull me out of the water. The only thing that has kept me alive until now is that I don&amp;#39;t want to burden anyone when I die. I don&amp;#39;t want people to have to pick up the pieces or be traumatized. There is probably something wrong with my brain that makes it constantly try to kill me, but I feel like this is normal and I&amp;#39;m simply too weak for this world. Even if I get help, there is no time in my life when I wasn&amp;#39;t like this. There is nothing to me without this. I don&amp;#39;t know the person I could become if I got help and that frightens me. I can&amp;#39;t risk hurting anyone. I&amp;#39;m sorry I wasn&amp;#39;t able to bear with it.&lt;/p&gt;\n\n&lt;p&gt;I think the world is very beautiful. I have loved every person I met, even those that hurt me. I just want to stop hurting people with my existence. I am sorry I did not die when I broke my head open, but I&amp;#39;m finally going to fix the cosmic fuck up that allowed me to be born. I just want everyone to be happy. No matter who you are, please try and be happy. Please try to find some joy in life and learn to leave the guilt and anxiety behind. &lt;/p&gt;\n\n&lt;p&gt;I am sorry for leaving a mess. I love you all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It feels strange to post this, but humans are selfish creatures and I guess I'm not exempt. I don't want to be remembered, I don't want to be mourned, and if I had a choice I would chose to have never existed. I guess this is to explain my actions.\n\nI cannot remember a time in my life where I have felt happy. I remember being 4/5 and laying in my bed at night, crying because I didn't want to wake up in the morning. I couldn't bathe by myself until I was older because I would try to 'fall asleep' in the tub and more than once my parents had to pull me out of the water. The only thing that has kept me alive until now is that I don't want to burden anyone when I die. I don't want people to have to pick up the pieces or be traumatized. There is probably something wrong with my brain that makes it constantly try to kill me, but I feel like this is normal and I'm simply too weak for this world. Even if I get help, there is no time in my life when I wasn't like this. There is nothing to me without this. I don't know the person I could become if I got help and that frightens me. I can't risk hurting anyone. I'm sorry I wasn't able to bear with it.\n\nI think the world is very beautiful. I have loved every person I met, even those that hurt me. I just want to stop hurting people with my existence. I am sorry I did not die when I broke my head open, but I'm finally going to fix the cosmic fuck up that allowed me to be born. I just want everyone to be happy. No matter who you are, please try and be happy. Please try to find some joy in life and learn to leave the guilt and anxiety behind. \n\nI am sorry for leaving a mess. I love you all.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2589g6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lkjaejfijsdkj", "media": null, "score": 31, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2589g6/i_love_everyone_i_love_this_world/", "name": "t3_2589g6", "created": 1399780649.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2589g6/i_love_everyone_i_love_this_world/", "author_flair_text": null, "title": "I love everyone. I love this world.", "created_utc": 1399751849.0, "ups": 35, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheqpsh", "gilded": 0, "author": "Throwaway2014111", "parent_id": "t3_2589g6", "approved_by": null, "body": "You sound like the kind of person the world needs more of.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like the kind of person the world needs more of.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_cheqpsh", "created": 1399790068.0, "author_flair_text": null, "created_utc": 1399761268.0, "distinguished": null, "num_reports": null, "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chewcs2", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2589g6", "approved_by": null, "body": "In my own personal experience, it's the most sensitive people who experience depression, anxiety, and a whole host of other problems much more strongly than others, and it's precisely because we care the most. If you didn't care, you would just stumble around like some cruel, random jackass.\n\nI was the kid who threw up before every nerve-wracking event in school, whether it be asking a girl out or performing in a third-grade play. It's the reason why I completely shut down emotionally, and is the reason why I'm currently in the same boat. In any case, I don't condemn you if you've made the decision to end your life (as I'm currently asking advice for the same issue) but I just felt like I should mention that it's not because you're too selfish. It's because you care more than other people.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my own personal experience, it&amp;#39;s the most sensitive people who experience depression, anxiety, and a whole host of other problems much more strongly than others, and it&amp;#39;s precisely because we care the most. If you didn&amp;#39;t care, you would just stumble around like some cruel, random jackass.&lt;/p&gt;\n\n&lt;p&gt;I was the kid who threw up before every nerve-wracking event in school, whether it be asking a girl out or performing in a third-grade play. It&amp;#39;s the reason why I completely shut down emotionally, and is the reason why I&amp;#39;m currently in the same boat. In any case, I don&amp;#39;t condemn you if you&amp;#39;ve made the decision to end your life (as I&amp;#39;m currently asking advice for the same issue) but I just felt like I should mention that it&amp;#39;s not because you&amp;#39;re too selfish. It&amp;#39;s because you care more than other people.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_chewcs2", "created": 1399804879.0, "author_flair_text": null, "created_utc": 1399776079.0, "distinguished": null, "num_reports": null, "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chewpgu", "gilded": 0, "author": "fallout06", "parent_id": "t3_2589g6", "approved_by": null, "body": "\"I have loved every person I met, even those that hurt me.\"\n\nYou are a rare person. I'm an extremely sensitive person, so it hurts doubly when bad shit happens. I can see things for everyone's point of view, and even when I'm hurt, I seek to understand the reason why that person hurt me.\n\nIt's a recipe for madness...all I can say is, stay strong, my friend. I'm experiencing suicidal thoughts myself for many of the above reasons you've stated...all I can say is, sometimes it seems like there's no point in going on, but we need to continue fighting, because that's who we are...\n\nBest.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I have loved every person I met, even those that hurt me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You are a rare person. I&amp;#39;m an extremely sensitive person, so it hurts doubly when bad shit happens. I can see things for everyone&amp;#39;s point of view, and even when I&amp;#39;m hurt, I seek to understand the reason why that person hurt me.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a recipe for madness...all I can say is, stay strong, my friend. I&amp;#39;m experiencing suicidal thoughts myself for many of the above reasons you&amp;#39;ve stated...all I can say is, sometimes it seems like there&amp;#39;s no point in going on, but we need to continue fighting, because that&amp;#39;s who we are...&lt;/p&gt;\n\n&lt;p&gt;Best.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_chewpgu", "created": 1399805810.0, "author_flair_text": null, "created_utc": 1399777010.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chepbhr", "gilded": 0, "author": "HoppingOnce", "parent_id": "t3_2589g6", "approved_by": null, "body": "You sound like a very interesting person. I love the the world and the people in it also even though I've always lived on the darker side of things, most people crack jokes about my optimism once they get to know me and my past, I'd like to talk to you if it's okay. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like a very interesting person. I love the the world and the people in it also even though I&amp;#39;ve always lived on the darker side of things, most people crack jokes about my optimism once they get to know me and my past, I&amp;#39;d like to talk to you if it&amp;#39;s okay. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_chepbhr", "created": 1399786432.0, "author_flair_text": null, "created_utc": 1399757632.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chewswj", "gilded": 0, "author": "MoonPark", "parent_id": "t3_2589g6", "approved_by": null, "body": "I can totally understand your feelings: it's a hard, hard world for a sensitive and empathetic person. You sound like a beautiful person yourself, from your post. You're not selfish, you're just tired of hurting. Whatever your choice may be, I wish you the true happiness you deserve.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can totally understand your feelings: it&amp;#39;s a hard, hard world for a sensitive and empathetic person. You sound like a beautiful person yourself, from your post. You&amp;#39;re not selfish, you&amp;#39;re just tired of hurting. Whatever your choice may be, I wish you the true happiness you deserve.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_chewswj", "created": 1399806069.0, "author_flair_text": null, "created_utc": 1399777269.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheyq7a", "gilded": 0, "author": "Lulu_lovesmusik_", "parent_id": "t3_2589g6", "approved_by": null, "body": "I can't agree more with everyone here. You sound like the exact type of person the world needs more of. At least you care about things. You deserve to feel happiness. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t agree more with everyone here. You sound like the exact type of person the world needs more of. At least you care about things. You deserve to feel happiness. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_cheyq7a", "created": 1399811507.0, "author_flair_text": null, "created_utc": 1399782707.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf61rw", "gilded": 0, "author": "Spleeniator", "parent_id": "t3_2589g6", "approved_by": null, "body": "Its good that you are around. You have made a reddit stranger feel a bit better about the universe knowing there is someone so full of love around. I know its hard but you are obviously rather strong.\n\nAnd if you can make us happy with even the briefest glimpse into who you are, you can bet anything you are making other people happy.\n\nPlease get some help OP. It would be good for you. And even after living with suicidal ideation for years, you can end up feeling something. It won't be easy, nothing is, but after what you have already lived through, you are used to things being hard.\n\nAnd it is really worth it. \n\nWe love you too OP.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its good that you are around. You have made a reddit stranger feel a bit better about the universe knowing there is someone so full of love around. I know its hard but you are obviously rather strong.&lt;/p&gt;\n\n&lt;p&gt;And if you can make us happy with even the briefest glimpse into who you are, you can bet anything you are making other people happy.&lt;/p&gt;\n\n&lt;p&gt;Please get some help OP. It would be good for you. And even after living with suicidal ideation for years, you can end up feeling something. It won&amp;#39;t be easy, nothing is, but after what you have already lived through, you are used to things being hard.&lt;/p&gt;\n\n&lt;p&gt;And it is really worth it. &lt;/p&gt;\n\n&lt;p&gt;We love you too OP.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2589g6", "score_hidden": false, "name": "t1_chf61rw", "created": 1399847141.0, "author_flair_text": null, "created_utc": 1399818341.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]