[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Few details - about 10 days ago she said she was miserable and was having suicidal thoughts again. I did the normal thing and comforted her as best I could, I didn&amp;#39;t really know what to say I&amp;#39;ve never had someone tell me that before. A few days past, normal stuff. Talking on skype, texting (we&amp;#39;re in a somewhat LDR, few states away) and I don&amp;#39;t hear from her for a day. I shrug it off. Then the days turned into a week. I&amp;#39;m really worried at this point. Nothing. Off skype. No text message response. No call pickups. &lt;/p&gt;\n\n&lt;p&gt;But I heard from her this morning. Apparently her phone and basically everything was confiscated and she&amp;#39;s been supervised by her family. She tried taking painkillers to end it, but her brother caught her and made her cough/throw them up. She was taken to the hospital, and they wanted to keep her there but her family said they would take her home and they&amp;#39;d keep her under supervision. She&amp;#39;s only been able to tell me this now because she&amp;#39;s going out with her grandmother and she trusted her with her phone back. I was as comforting as I could be, I didn&amp;#39;t try to make her feel bad or anything like that. I just told her I loved her and it wouldn&amp;#39;t be the same without her (in fancier and longer ways) but she had to go out, so I wasn&amp;#39;t able to speak with her for long.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do. For the few days she was gone I was losing my mind and I assumed the worst. I don&amp;#39;t have contact with her family. The one friend I have contact with I believe refuses to speak to me, so she wouldn&amp;#39;t answer. So I had no choice but to sit and wait. &lt;/p&gt;\n\n&lt;p&gt;Anyway, I&amp;#39;m sorry for the horrible type up. I probably missed some details but I&amp;#39;m not thinking straight right now. I&amp;#39;ve been up all night. It&amp;#39;s nearing 8 AM. I&amp;#39;m exhausted, I don&amp;#39;t know what to do. I&amp;#39;m stressing out. I&amp;#39;m gonna try and sleep. I just wanted to get this out there before I do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Few details - about 10 days ago she said she was miserable and was having suicidal thoughts again. I did the normal thing and comforted her as best I could, I didn't really know what to say I've never had someone tell me that before. A few days past, normal stuff. Talking on skype, texting (we're in a somewhat LDR, few states away) and I don't hear from her for a day. I shrug it off. Then the days turned into a week. I'm really worried at this point. Nothing. Off skype. No text message response. No call pickups. \n\nBut I heard from her this morning. Apparently her phone and basically everything was confiscated and she's been supervised by her family. She tried taking painkillers to end it, but her brother caught her and made her cough/throw them up. She was taken to the hospital, and they wanted to keep her there but her family said they would take her home and they'd keep her under supervision. She's only been able to tell me this now because she's going out with her grandmother and she trusted her with her phone back. I was as comforting as I could be, I didn't try to make her feel bad or anything like that. I just told her I loved her and it wouldn't be the same without her (in fancier and longer ways) but she had to go out, so I wasn't able to speak with her for long.\n\nI don't know what to do. For the few days she was gone I was losing my mind and I assumed the worst. I don't have contact with her family. The one friend I have contact with I believe refuses to speak to me, so she wouldn't answer. So I had no choice but to sit and wait. \n\nAnyway, I'm sorry for the horrible type up. I probably missed some details but I'm not thinking straight right now. I've been up all night. It's nearing 8 AM. I'm exhausted, I don't know what to do. I'm stressing out. I'm gonna try and sleep. I just wanted to get this out there before I do.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243tni", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "helpmeout418", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243tni/i_need_help_with_my_girlfriend/", "name": "t3_243tni", "created": 1398638357.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243tni/i_need_help_with_my_girlfriend/", "author_flair_text": null, "title": "I need help with my girlfriend", "created_utc": 1398609557.0, "ups": 7, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3i622", "gilded": 0, "author": "Christinestine", "parent_id": "t3_243tni", "approved_by": null, "body": "If I were you I would attempt to visit with her as soon as possible.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I were you I would attempt to visit with her as soon as possible.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243tni", "score_hidden": false, "name": "t1_ch3i622", "created": 1398630886.0, "author_flair_text": null, "created_utc": 1398627286.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3oe6w", "gilded": 0, "author": "TheTurretCube", "parent_id": "t3_243tni", "approved_by": null, "body": "I think you did all you could, she's lucky to have someone so supportive.\n\nhopefully this a step to recovery for her", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you did all you could, she&amp;#39;s lucky to have someone so supportive.&lt;/p&gt;\n\n&lt;p&gt;hopefully this a step to recovery for her&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243tni", "score_hidden": false, "name": "t1_ch3oe6w", "created": 1398644923.0, "author_flair_text": null, "created_utc": 1398641323.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]