[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t meant to sound over dramatic, like I&amp;#39;m just some bratty attention seeker. I apologise if I come across that way, but I&amp;#39;m not. I just need somewhere to vent, I guess.&lt;/p&gt;\n\n&lt;p&gt;So first things first. I&amp;#39;m bipolar, though I&amp;#39;d prefer to say have it, as I&amp;#39;m a damn sight more than my malfunctioning parts, but it explains a lot. I&amp;#39;m currently taking Fluoxetine, just to see how it goes and feeling worse than ever. It&amp;#39;ll pass, at least that&amp;#39;s what they tell me, but I&amp;#39;ve started becoming even more reckless and irrational than I ever was before. &lt;/p&gt;\n\n&lt;p&gt;When I&amp;#39;m up, I&amp;#39;m up. I&amp;#39;m in love with the universe. I&amp;#39;m invincible, immortal, and I don&amp;#39;t give a fuck. When I&amp;#39;m down, I can&amp;#39;t stop the unpleasant thoughts and feelings overwhelming me. I don&amp;#39;t want to talk, to get involved with anything, because everything I touch I ruin, and ruin beyond repair when I try to fix it. Every relationship I have with friends and family just further showcases my worthlessness. I get tired, so fucking tired of it all. And I know how pathetic it is to feel that way, and I try not to, but what&amp;#39;s the point? I kept it to myself, didn&amp;#39;t bother anyone, and it ate me up. I&amp;#39;ve attempted to off myself twice in the last two weeks, the first was out of desperation, half hearted and sloppy, the second time, today, I would have succeeded. That thought frightens me. &lt;/p&gt;\n\n&lt;p&gt;Suicide isn&amp;#39;t something I plan, the urge just sneaks upon me or steadily grows too great to ignore. I&amp;#39;m a sensible person, I know my death would affect and effect more than my immediate being and surroundings. I know it&amp;#39;s selfish. But sometimes I think being here causes more pain than not.&lt;/p&gt;\n\n&lt;p&gt;Admitting I needed help was the hard part. Having to explain myself to a stranger was humiliating, but she respected my refusal for therapy sessions, filled out my prescriptions, and sent me on my merry way. Tell someone, she said, talk to someone. And that&amp;#39;s where things get a little tricky. The very people who care about me are the very people I could never tell, because I have to protect them from it. I have to put on my act and keep smiling. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t talk to my parents, that&amp;#39;s completely out of the question. My father would think a lot less of me, and despite what softer individuals might say, I would only disappoint him. My mother spiraled out of control before, and suffered my father&amp;#39;s cold, unsympathetic attitude, and I&amp;#39;m ashamed to say I played a part in that. Holding it together is what I excelled at, and I looked down on her. I thought she wasn&amp;#39;t strong enough, or tough enough, she needed to get a grip and pull herself together. Now I&amp;#39;m where she was all those years ago, scraping rock bottom, and I finally understand how easy it would be just to let go. &lt;/p&gt;\n\n&lt;p&gt;As for friends? I&amp;#39;m not sure you could call them that. They&amp;#39;re folks I&amp;#39;ve shared experiences with, but there&amp;#39;s no connection on any sort of level, deep or otherwise. I did tell someone, but immediately regretted it. It was a huge mistake. The timing, the way it was phrased, it just seemed like some desperate attempt to get a rise out of them, at least they said as much. Any other interactions after that point were strained, to the point where I was accused of deliberately pushing buttons and stirring up drama they could really do without. &lt;/p&gt;\n\n&lt;p&gt;In my defence, I&amp;#39;m not a dramatic person. I keep myself to myself. I like things simple and low key. When it gets all fucked up, it gives me a headache and I can&amp;#39;t rest until it&amp;#39;s sorted out. Failing that, I detach myself from the situation completely, isolate as best I can. In general, I don&amp;#39;t draw attention and I hate showing any signs of weakness. I guess depression has such a stigma nowadays it completely overrides individual character. It makes me feel sick that I actually told them, but sicker still that they think so little of me, but I honestly had nowhere else to turn. To other people, I&amp;#39;m nothing but a fucking inconvenience. That&amp;#39;s what my entire existence boils down to, and it&amp;#39;s true. But some folks don&amp;#39;t mind being inconvenienced. &lt;/p&gt;\n\n&lt;p&gt;I had a complete stranger sit with me for twenty minutes today, just chit chatting away, holding me the entire time. They were late for work, I was late for work, their children late for school, but they put me first, I was the most important person to them at that point. The guilt I had for upsetting their day was washed away with such honest and loving words. They were there right when I needed them, but it was pure luck they were passing by and luck is unreliable.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s why I&amp;#39;m here. I&amp;#39;m not ready to die, not yet. I just need to stay alive for a few more weeks, until the anti-depressants kick in. I can pull myself through the rest, I&amp;#39;ve made it this far after all.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: I post narcissistic bullwank about my feefees and want someone to hold my hand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This isn't meant to sound over dramatic, like I'm just some bratty attention seeker. I apologise if I come across that way, but I'm not. I just need somewhere to vent, I guess.\n\nSo first things first. I'm bipolar, though I'd prefer to say have it, as I'm a damn sight more than my malfunctioning parts, but it explains a lot. I'm currently taking Fluoxetine, just to see how it goes and feeling worse than ever. It'll pass, at least that's what they tell me, but I've started becoming even more reckless and irrational than I ever was before. \n\nWhen I'm up, I'm up. I'm in love with the universe. I'm invincible, immortal, and I don't give a fuck. When I'm down, I can't stop the unpleasant thoughts and feelings overwhelming me. I don't want to talk, to get involved with anything, because everything I touch I ruin, and ruin beyond repair when I try to fix it. Every relationship I have with friends and family just further showcases my worthlessness. I get tired, so fucking tired of it all. And I know how pathetic it is to feel that way, and I try not to, but what's the point? I kept it to myself, didn't bother anyone, and it ate me up. I've attempted to off myself twice in the last two weeks, the first was out of desperation, half hearted and sloppy, the second time, today, I would have succeeded. That thought frightens me. \n\nSuicide isn't something I plan, the urge just sneaks upon me or steadily grows too great to ignore. I'm a sensible person, I know my death would affect and effect more than my immediate being and surroundings. I know it's selfish. But sometimes I think being here causes more pain than not.\n\nAdmitting I needed help was the hard part. Having to explain myself to a stranger was humiliating, but she respected my refusal for therapy sessions, filled out my prescriptions, and sent me on my merry way. Tell someone, she said, talk to someone. And that's where things get a little tricky. The very people who care about me are the very people I could never tell, because I have to protect them from it. I have to put on my act and keep smiling. \n\nI can't talk to my parents, that's completely out of the question. My father would think a lot less of me, and despite what softer individuals might say, I would only disappoint him. My mother spiraled out of control before, and suffered my father's cold, unsympathetic attitude, and I'm ashamed to say I played a part in that. Holding it together is what I excelled at, and I looked down on her. I thought she wasn't strong enough, or tough enough, she needed to get a grip and pull herself together. Now I'm where she was all those years ago, scraping rock bottom, and I finally understand how easy it would be just to let go. \n\nAs for friends? I'm not sure you could call them that. They're folks I've shared experiences with, but there's no connection on any sort of level, deep or otherwise. I did tell someone, but immediately regretted it. It was a huge mistake. The timing, the way it was phrased, it just seemed like some desperate attempt to get a rise out of them, at least they said as much. Any other interactions after that point were strained, to the point where I was accused of deliberately pushing buttons and stirring up drama they could really do without. \n\nIn my defence, I'm not a dramatic person. I keep myself to myself. I like things simple and low key. When it gets all fucked up, it gives me a headache and I can't rest until it's sorted out. Failing that, I detach myself from the situation completely, isolate as best I can. In general, I don't draw attention and I hate showing any signs of weakness. I guess depression has such a stigma nowadays it completely overrides individual character. It makes me feel sick that I actually told them, but sicker still that they think so little of me, but I honestly had nowhere else to turn. To other people, I'm nothing but a fucking inconvenience. That's what my entire existence boils down to, and it's true. But some folks don't mind being inconvenienced. \n\nI had a complete stranger sit with me for twenty minutes today, just chit chatting away, holding me the entire time. They were late for work, I was late for work, their children late for school, but they put me first, I was the most important person to them at that point. The guilt I had for upsetting their day was washed away with such honest and loving words. They were there right when I needed them, but it was pure luck they were passing by and luck is unreliable.\n\nSo that's why I'm here. I'm not ready to die, not yet. I just need to stay alive for a few more weeks, until the anti-depressants kick in. I can pull myself through the rest, I've made it this far after all.\n\n\nTL;DR: I post narcissistic bullwank about my feefees and want someone to hold my hand.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25cupq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "McSpermyToes", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25cupq/i_never_intended_for_this_to_be_my_first_post_but/", "name": "t3_25cupq", "created": 1399929729.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25cupq/i_never_intended_for_this_to_be_my_first_post_but/", "author_flair_text": null, "title": "I never intended for this to be my first post, but don't intend for it to be my last either.", "created_utc": 1399900929.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgr52d", "gilded": 0, "author": "McSpermyToes", "parent_id": "t1_chfzl1y", "approved_by": null, "body": "I'm from a pretty small town, working in a nearby village, so therapy would be anything but anonymous for the likes of me. I agree that it's easier to talk to folks who don't know you, or that you'll never meet, because as much as they can judge you for what you share, they're not in your immediate circle. \n\nAs for the lack of advice, I think it's reassurance we really crave. That as frustrating and silly as we think our issues are, there are folks out there who won't tune us out or turn us down, who'll listen without constantly thinking \"just get over it already\". I say that enough to myself, after all. I think it's enough just to know someone's there for you at times.\n\nAnd thanks, for replying. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from a pretty small town, working in a nearby village, so therapy would be anything but anonymous for the likes of me. I agree that it&amp;#39;s easier to talk to folks who don&amp;#39;t know you, or that you&amp;#39;ll never meet, because as much as they can judge you for what you share, they&amp;#39;re not in your immediate circle. &lt;/p&gt;\n\n&lt;p&gt;As for the lack of advice, I think it&amp;#39;s reassurance we really crave. That as frustrating and silly as we think our issues are, there are folks out there who won&amp;#39;t tune us out or turn us down, who&amp;#39;ll listen without constantly thinking &amp;quot;just get over it already&amp;quot;. I say that enough to myself, after all. I think it&amp;#39;s enough just to know someone&amp;#39;s there for you at times.&lt;/p&gt;\n\n&lt;p&gt;And thanks, for replying. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25cupq", "score_hidden": false, "name": "t1_chgr52d", "created": 1400010349.0, "author_flair_text": null, "created_utc": 1399981549.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfzl1y", "gilded": 0, "author": "trulooloo", "parent_id": "t3_25cupq", "approved_by": null, "body": "I'll hold your hand.\n\nBut I don't know what else to do because I'm stuck in the same boat as you. I've never told anyone how I feel; can't tell them anyways because I need to save face or simply because of the individual. I wish I had wisdom to share, but if I did, I probably wouldn't be in this mess.\n\nI'm very glad that you had that experience with the stranger. Random acts of genuine kindness and empathy can really turn things around, even if for a moment. Little things can make all the difference. :) Sometimes there's more honesty in anonymity (as weird as that sounds), which is also why I think therapy can be beneficial. I understand that this wasn't the case for you, but I think it's something that I think might be beneficial for myself. Maybe a different, random person might help for you. Anyways, I admire your perseverance. There's hope for all of us. :)\n\nThis comment ended up getting kinda long... Sorry for the rambling and  lack of advice. I was hoping to provide some solace in the fact that there are others beside you", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll hold your hand.&lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t know what else to do because I&amp;#39;m stuck in the same boat as you. I&amp;#39;ve never told anyone how I feel; can&amp;#39;t tell them anyways because I need to save face or simply because of the individual. I wish I had wisdom to share, but if I did, I probably wouldn&amp;#39;t be in this mess.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very glad that you had that experience with the stranger. Random acts of genuine kindness and empathy can really turn things around, even if for a moment. Little things can make all the difference. :) Sometimes there&amp;#39;s more honesty in anonymity (as weird as that sounds), which is also why I think therapy can be beneficial. I understand that this wasn&amp;#39;t the case for you, but I think it&amp;#39;s something that I think might be beneficial for myself. Maybe a different, random person might help for you. Anyways, I admire your perseverance. There&amp;#39;s hope for all of us. :)&lt;/p&gt;\n\n&lt;p&gt;This comment ended up getting kinda long... Sorry for the rambling and  lack of advice. I was hoping to provide some solace in the fact that there are others beside you&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25cupq", "score_hidden": false, "name": "t1_chfzl1y", "created": 1399936969.0, "author_flair_text": null, "created_utc": 1399908169.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]