[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, you don&amp;#39;t know me. I come to you with a desperate plea because I have no friends to confide in so I must confide with strangers on the Internet. At least you guys seem to be an amiable bunch that are more likely to help out than tell me to kill myself (which I have to admit has come across my mind more than a few times in the recent past). I&amp;#39;ve posted this on another subreddit and I don&amp;#39;t know your rules on multiple posting, but if I don&amp;#39;t get help soon, I fear what I might do.&lt;/p&gt;\n\n&lt;p&gt;I need life advice. &lt;/p&gt;\n\n&lt;p&gt;Ever since I&amp;#39;ve left high school, my life has been nothing but a string of failure after failure. I was originally accepted to the University of Waterloo in Ontario, for an ambitious program that combined a computer science degree with an accounting degree. I originally wanted to be just computer science, but with influence from my accountant mother, she encouraged me to take CompSci with Accounting.&lt;/p&gt;\n\n&lt;p&gt;I moved out, then something in my head just switched. In high school, I was a responsible honor roll student who got all As with little to no effort. When I moved out, I just let go of everything. All my classes started failing, I got sucked into different computer games that sucked up all my time, starting with Skyrim, then into League of Legends. &lt;/p&gt;\n\n&lt;p&gt;After I moved out of the dorm without steady internet, I realized how wretched of a person I could become. I remember that after every class, instead of going somewhere to study, I went to one of the common rooms with my PC, mouse and mousepad ready, hooked up and just played League of Legends until an ungodly hour before returning to my room to sleep. I&amp;#39;ve also downloaded a porn game and fapped to it until 5 am in the morning, making me unable to go to class the next day.&lt;/p&gt;\n\n&lt;p&gt;After a straight year of mediocre marks, my parents and I agreed that maybe Waterloo was too difficult of a university and that I should go to an easier university. Better to do well in a lesser university than to do bad in a good university right?&lt;/p&gt;\n\n&lt;p&gt;Well, moving to York University initially wasn&amp;#39;t so bad. I did get good marks initially. But this year, I&amp;#39;ve once again failed my parents and myself. My League of Legends addiction stayed, causing me to play instead of studying, causing me to bomb my midterms on two of my major courses, causing me to drop one and end up getting a D in the other. I never paid attention in class, I was too proud and stupid to think that I needed to. &amp;quot;I would read that on my own&amp;quot; I said to myself, but I never did since my nights were filled with League. Since I also repeated an accounting course that I needed for an internship but didn&amp;#39;t get the mark I needed last semester, but since I kept forgetting to do online assignments and didn&amp;#39;t pay attention in class, I ended up getting a worse mark than before. I&amp;#39;m very lucky that the internship office said that they could make exceptions if my GPA was high enough.&lt;/p&gt;\n\n&lt;p&gt;Now, with the beginning of my new semester, my ol&amp;#39; faithful ASUS laptop that fed my addiction to all of my video games for the past 4 years has died and I&amp;#39;ve managed to get some time to think about my life. I decided that I would start paying attention in class, start studying and stop playing so much games, especially since the laptop I have now can only play shitty games.&lt;/p&gt;\n\n&lt;p&gt;However, my dad just talked to me about an hour before I typed this. He and my mom have been nothing but supportive of me throughout my failure at Waterloo, but my recent failings has recently driven them over the edge. My mom, who was usually a taskmaster behind me in high school and my main motivation for getting good marks often came from her, has become more dismissive and pessimistic about me and my schooling. My dad picked up on this and after hearing about me fucking up last semester has issued an ultimatum.&lt;/p&gt;\n\n&lt;p&gt;If I don&amp;#39;t start pulling my marks up (and B&amp;#39;s are probably not going to cut it), he said that he no longer wanted to feel like a failure as a father and wants me to live alone. For the past 20 years of my life, he has offered nothing but support and fatherly advice, but I have never done any of it. I can&amp;#39;t blame him for wanting to kick me out. I&amp;#39;ve wasted so much money with my failure and appear to want nothing more but to play games all day and night.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do. I want to believe that I can study and do better in school, but I don&amp;#39;t know if I can at this point. I have already promised myself the same thing multiple times in the past, but I always seem to forget the strife and pain that I went through just a few months before and fall into old habits.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve already feel guilty about all the shit I&amp;#39;ve put my parents through and it&amp;#39;s beginning to affect my head. Ever since I&amp;#39;ve failed those midterms last semester, every time I go through any kind of emotional stress, I&amp;#39;ve been getting these intrusive thoughts in my head. &amp;quot;Maybe you should just kill yourself,&amp;quot; they say. After I hear these things in my head, I always find myself going down a train of thought analyzing the benefits of suicide, how it would help my parents not have to feel as failures anymore and how I wouldn&amp;#39;t have to worry about disappointing them anymore. I&amp;#39;m scared of what my own mind is doing that is seemingly out of my control.&lt;/p&gt;\n\n&lt;p&gt;Even with suicidal thoughts and all of my parents efforts, I am very afraid of falling back into the cycle of improving, then forgetting and returning to old habits that will cause failure. I&amp;#39;m lost. I cannot tell anyone in my life about this. All of my friends wouldn&amp;#39;t know what to tell me and probably couldn&amp;#39;t tell me much but basic uplifting tropes and shit. I don&amp;#39;t want to put all of my emotional baggage on them. They don&amp;#39;t deserve it, they have their own lives to worry about.&lt;/p&gt;\n\n&lt;p&gt;The only glimmer of hope I see is that I have been successfully working out at home using workout videos. Although most of my drive to get in shape was to get &amp;quot;a pornstar body&amp;quot; (I&amp;#39;m really fucking motivated by sex for some reason), it&amp;#39;s about the only good thing I have going for me. Hell, that might be the only way I could make money when my dad kicks me out and I have to start whoring my self out.&lt;/p&gt;\n\n&lt;p&gt;Please, I need help. I need a third party to tell me what to do. I keep seeing the pattern of my life but I just can&amp;#39;t seem to break the cycle. With my dad about to kick me out, I&amp;#39;m really afraid that if I don&amp;#39;t pull my marks up and turn myself around, I may end up on the news no more than a year later as a dead man who hanged himself in a local alley.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not currently suicidal right now, but I know that if I can&amp;#39;t pull this life off soon, I will have good reason to be. Any kind of advice is needed, even if it&amp;#39;s just a redirection to a larger advice subreddit. I&amp;#39;ve tried to find one but Google didn&amp;#39;t help me this time. Please, I don&amp;#39;t know what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, you don't know me. I come to you with a desperate plea because I have no friends to confide in so I must confide with strangers on the Internet. At least you guys seem to be an amiable bunch that are more likely to help out than tell me to kill myself (which I have to admit has come across my mind more than a few times in the recent past). I've posted this on another subreddit and I don't know your rules on multiple posting, but if I don't get help soon, I fear what I might do.\n\nI need life advice. \n\nEver since I've left high school, my life has been nothing but a string of failure after failure. I was originally accepted to the University of Waterloo in Ontario, for an ambitious program that combined a computer science degree with an accounting degree. I originally wanted to be just computer science, but with influence from my accountant mother, she encouraged me to take CompSci with Accounting.\n\nI moved out, then something in my head just switched. In high school, I was a responsible honor roll student who got all As with little to no effort. When I moved out, I just let go of everything. All my classes started failing, I got sucked into different computer games that sucked up all my time, starting with Skyrim, then into League of Legends. \n\nAfter I moved out of the dorm without steady internet, I realized how wretched of a person I could become. I remember that after every class, instead of going somewhere to study, I went to one of the common rooms with my PC, mouse and mousepad ready, hooked up and just played League of Legends until an ungodly hour before returning to my room to sleep. I've also downloaded a porn game and fapped to it until 5 am in the morning, making me unable to go to class the next day.\n\nAfter a straight year of mediocre marks, my parents and I agreed that maybe Waterloo was too difficult of a university and that I should go to an easier university. Better to do well in a lesser university than to do bad in a good university right?\n\nWell, moving to York University initially wasn't so bad. I did get good marks initially. But this year, I've once again failed my parents and myself. My League of Legends addiction stayed, causing me to play instead of studying, causing me to bomb my midterms on two of my major courses, causing me to drop one and end up getting a D in the other. I never paid attention in class, I was too proud and stupid to think that I needed to. \"I would read that on my own\" I said to myself, but I never did since my nights were filled with League. Since I also repeated an accounting course that I needed for an internship but didn't get the mark I needed last semester, but since I kept forgetting to do online assignments and didn't pay attention in class, I ended up getting a worse mark than before. I'm very lucky that the internship office said that they could make exceptions if my GPA was high enough.\n\nNow, with the beginning of my new semester, my ol' faithful ASUS laptop that fed my addiction to all of my video games for the past 4 years has died and I've managed to get some time to think about my life. I decided that I would start paying attention in class, start studying and stop playing so much games, especially since the laptop I have now can only play shitty games.\n\nHowever, my dad just talked to me about an hour before I typed this. He and my mom have been nothing but supportive of me throughout my failure at Waterloo, but my recent failings has recently driven them over the edge. My mom, who was usually a taskmaster behind me in high school and my main motivation for getting good marks often came from her, has become more dismissive and pessimistic about me and my schooling. My dad picked up on this and after hearing about me fucking up last semester has issued an ultimatum.\n\nIf I don't start pulling my marks up (and B's are probably not going to cut it), he said that he no longer wanted to feel like a failure as a father and wants me to live alone. For the past 20 years of my life, he has offered nothing but support and fatherly advice, but I have never done any of it. I can't blame him for wanting to kick me out. I've wasted so much money with my failure and appear to want nothing more but to play games all day and night.\n\nI don't know what to do. I want to believe that I can study and do better in school, but I don't know if I can at this point. I have already promised myself the same thing multiple times in the past, but I always seem to forget the strife and pain that I went through just a few months before and fall into old habits.\n\nI've already feel guilty about all the shit I've put my parents through and it's beginning to affect my head. Ever since I've failed those midterms last semester, every time I go through any kind of emotional stress, I've been getting these intrusive thoughts in my head. \"Maybe you should just kill yourself,\" they say. After I hear these things in my head, I always find myself going down a train of thought analyzing the benefits of suicide, how it would help my parents not have to feel as failures anymore and how I wouldn't have to worry about disappointing them anymore. I'm scared of what my own mind is doing that is seemingly out of my control.\n\nEven with suicidal thoughts and all of my parents efforts, I am very afraid of falling back into the cycle of improving, then forgetting and returning to old habits that will cause failure. I'm lost. I cannot tell anyone in my life about this. All of my friends wouldn't know what to tell me and probably couldn't tell me much but basic uplifting tropes and shit. I don't want to put all of my emotional baggage on them. They don't deserve it, they have their own lives to worry about.\n\nThe only glimmer of hope I see is that I have been successfully working out at home using workout videos. Although most of my drive to get in shape was to get \"a pornstar body\" (I'm really fucking motivated by sex for some reason), it's about the only good thing I have going for me. Hell, that might be the only way I could make money when my dad kicks me out and I have to start whoring my self out.\n\nPlease, I need help. I need a third party to tell me what to do. I keep seeing the pattern of my life but I just can't seem to break the cycle. With my dad about to kick me out, I'm really afraid that if I don't pull my marks up and turn myself around, I may end up on the news no more than a year later as a dead man who hanged himself in a local alley.\n\nI'm not currently suicidal right now, but I know that if I can't pull this life off soon, I will have good reason to be. Any kind of advice is needed, even if it's just a redirection to a larger advice subreddit. I've tried to find one but Google didn't help me this time. Please, I don't know what to do.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250jey", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Otaku-sama", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250jey/i_need_help_and_i_dont_know_where_to_go/", "name": "t3_250jey", "created": 1399550584.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250jey/i_need_help_and_i_dont_know_where_to_go/", "author_flair_text": null, "title": "I need help and I don't know where to go.", "created_utc": 1399521784.0, "ups": 8, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chckl6c", "gilded": 0, "author": "Bloodysick", "parent_id": "t3_250jey", "approved_by": null, "body": "Hi,\n\nFirst off, let me say, big League of Legends fan here. I understand what you are talking about, I understand the addiction, I have seen alot of failure in my life due to my gaming obsession as well. But frankly failure in studies may amount to nothing if you can find other interests and get jobs that may suit you. Or you can just try deleting all the games and start writing diary or journal, helps me alot.\n\nAlso, you should talk to your friends and family about your thoughts, they will understand and guide you much better than anyone on internet can. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi,&lt;/p&gt;\n\n&lt;p&gt;First off, let me say, big League of Legends fan here. I understand what you are talking about, I understand the addiction, I have seen alot of failure in my life due to my gaming obsession as well. But frankly failure in studies may amount to nothing if you can find other interests and get jobs that may suit you. Or you can just try deleting all the games and start writing diary or journal, helps me alot.&lt;/p&gt;\n\n&lt;p&gt;Also, you should talk to your friends and family about your thoughts, they will understand and guide you much better than anyone on internet can. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250jey", "score_hidden": false, "name": "t1_chckl6c", "created": 1399564795.0, "author_flair_text": null, "created_utc": 1399535995.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chckrps", "gilded": 0, "author": "Bluesky83", "parent_id": "t3_250jey", "approved_by": null, "body": "I'm not much of an expert, but you asked for advice; feel free to take my humble opinions with a grain of salt. You say that you can't seem to break the cycle of your life. I can relate to that, I guess. What worked for me was to take baby steps. When I thought about how much work was ahead of me I just got really depressed and wanted to give up. Instead of thinking, I have to do everything perfect or else, think: \"Tonight, I will get some of my work done\". Or \"For the next ten minutes I will read this textbook\". Just one foot in front of the other.\n\nI don't know your dad, but it seems like he does love you very much, based on how much he supported you in the past even if he is frustrated now. Maybe if he sees improvement (even if it's not A's--I mean, come on, college is hard) he'll be encouraged. I wouldn't give up on your parents if I were you (I'm not you, but still).\n\nYou aren't lost yet; you can still see the path. You've got a lot to deal with right now, but just the fact that you are trying to get help is a good sign. It means that you want to make a change and that's the first step.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not much of an expert, but you asked for advice; feel free to take my humble opinions with a grain of salt. You say that you can&amp;#39;t seem to break the cycle of your life. I can relate to that, I guess. What worked for me was to take baby steps. When I thought about how much work was ahead of me I just got really depressed and wanted to give up. Instead of thinking, I have to do everything perfect or else, think: &amp;quot;Tonight, I will get some of my work done&amp;quot;. Or &amp;quot;For the next ten minutes I will read this textbook&amp;quot;. Just one foot in front of the other.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know your dad, but it seems like he does love you very much, based on how much he supported you in the past even if he is frustrated now. Maybe if he sees improvement (even if it&amp;#39;s not A&amp;#39;s--I mean, come on, college is hard) he&amp;#39;ll be encouraged. I wouldn&amp;#39;t give up on your parents if I were you (I&amp;#39;m not you, but still).&lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t lost yet; you can still see the path. You&amp;#39;ve got a lot to deal with right now, but just the fact that you are trying to get help is a good sign. It means that you want to make a change and that&amp;#39;s the first step.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250jey", "score_hidden": false, "name": "t1_chckrps", "created": 1399565846.0, "author_flair_text": null, "created_utc": 1399537046.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]