[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is coming from a 14 year old child, 8th grade now, someone that right now should have a care free life but can&amp;#39;t. I came hear looking for help. Not for me, but for my friend. She is probably the nicest person I know and one of the most important people in my life. She is struggling with depression, and often speaks to me about her emotional and physical problems. I have tried to help her as much as I possibly could. But by now it&amp;#39;s dragging me down too. I have had troubles in the past  and I have gotten better, but it&amp;#39;s begun to affect me in many ways. I need some advice, she isn&amp;#39;t able to get medication or see help and I&amp;#39;m the only one she has. And I&amp;#39;m running out of ideas. She has been taking pills from her parents, she has been cutting very often, she is in an extremely suicidal state. And I&amp;#39;m worried that one day she will just disappear and I&amp;#39;ll never see her again. If any of you can provide me any help it would be absolutely wonderful&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is coming from a 14 year old child, 8th grade now, someone that right now should have a care free life but can't. I came hear looking for help. Not for me, but for my friend. She is probably the nicest person I know and one of the most important people in my life. She is struggling with depression, and often speaks to me about her emotional and physical problems. I have tried to help her as much as I possibly could. But by now it's dragging me down too. I have had troubles in the past  and I have gotten better, but it's begun to affect me in many ways. I need some advice, she isn't able to get medication or see help and I'm the only one she has. And I'm running out of ideas. She has been taking pills from her parents, she has been cutting very often, she is in an extremely suicidal state. And I'm worried that one day she will just disappear and I'll never see her again. If any of you can provide me any help it would be absolutely wonderful", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xjnl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Twidge912", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xjnl/i_need_help_with_some_things/", "name": "t3_23xjnl", "created": 1398435383.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xjnl/i_need_help_with_some_things/", "author_flair_text": null, "title": "I need help with some things", "created_utc": 1398406583.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1uqyd", "gilded": 0, "author": "remington259", "parent_id": "t1_ch1ud0t", "approved_by": null, "body": "I understand and your most welcome. You need to be strong for her but not let it take you down as well. As I said...the next step would be a school counselor. Perhaps you can go with her if it'll make her more comfortable. You're doing a good thing helping your friend. She'll always love you for that as long as continue doing what a good friend should.\nGood luck from my heart to hers.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand and your most welcome. You need to be strong for her but not let it take you down as well. As I said...the next step would be a school counselor. Perhaps you can go with her if it&amp;#39;ll make her more comfortable. You&amp;#39;re doing a good thing helping your friend. She&amp;#39;ll always love you for that as long as continue doing what a good friend should.\nGood luck from my heart to hers.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xjnl", "score_hidden": false, "name": "t1_ch1uqyd", "created": 1398448686.0, "author_flair_text": null, "created_utc": 1398445086.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1ud0t", "gilded": 0, "author": "Twidge912", "parent_id": "t1_ch1k22w", "approved_by": null, "body": "Thank you for your response, her parents know, but they don't believe her and think it's just a cry for attention. Her father has literally disowned her and really it's just overall just a really bad situation so I'll do what I can.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your response, her parents know, but they don&amp;#39;t believe her and think it&amp;#39;s just a cry for attention. Her father has literally disowned her and really it&amp;#39;s just overall just a really bad situation so I&amp;#39;ll do what I can.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xjnl", "score_hidden": false, "name": "t1_ch1ud0t", "created": 1398447934.0, "author_flair_text": null, "created_utc": 1398444334.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1k22w", "gilded": 0, "author": "remington259", "parent_id": "t3_23xjnl", "approved_by": null, "body": "You friend needs professional help. What she needs to do is talk to a school counselor if possible. If none is available or she isn't comfortable with that, she needs to call a hotline or check herself into the hospital for care.\n\nIt's great that you are a lifeline for her but there is only so much you can do...especially being outside her family.\n\nWhat you can do is try to remind her how beautiful life and the world can be. That she has an entire world waiting to be explored but that she'll never see it if she hurts herself. You need to remind her that she is loved and that while the world may seem unfair and can be hurtful, it gets better. Being someone so young, her emotions may override her common sense a bit. Small things can balloon into end-of-the-world scenarios. You need to be gentle with her and reassure her of everything.\n\nIf you're close enough to her, find some sort of activity you can both share that will keep her going while she seeks help.\n\nAnd above all else, you need to notify her parents in as calm and collected a way as possible if they don't know. \n\nThere is little worse in this world I imagine than being a parent and losing your child...for whatever reason. They need to know. They are the front line when it comes to helping her.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You friend needs professional help. What she needs to do is talk to a school counselor if possible. If none is available or she isn&amp;#39;t comfortable with that, she needs to call a hotline or check herself into the hospital for care.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s great that you are a lifeline for her but there is only so much you can do...especially being outside her family.&lt;/p&gt;\n\n&lt;p&gt;What you can do is try to remind her how beautiful life and the world can be. That she has an entire world waiting to be explored but that she&amp;#39;ll never see it if she hurts herself. You need to remind her that she is loved and that while the world may seem unfair and can be hurtful, it gets better. Being someone so young, her emotions may override her common sense a bit. Small things can balloon into end-of-the-world scenarios. You need to be gentle with her and reassure her of everything.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re close enough to her, find some sort of activity you can both share that will keep her going while she seeks help.&lt;/p&gt;\n\n&lt;p&gt;And above all else, you need to notify her parents in as calm and collected a way as possible if they don&amp;#39;t know. &lt;/p&gt;\n\n&lt;p&gt;There is little worse in this world I imagine than being a parent and losing your child...for whatever reason. They need to know. They are the front line when it comes to helping her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xjnl", "score_hidden": false, "name": "t1_ch1k22w", "created": 1398412362.0, "author_flair_text": null, "created_utc": 1398408762.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]