[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello.&lt;/p&gt;\n\n&lt;p&gt;I have a phobia of blood, falling, have no dangerous items near me, so suicide is nearly impossible for me. But still hear me out and help me.as I&amp;#39;ve thought about it so many times. I&amp;#39;ve thought, while looking out of my six story apartment, &amp;quot;This windows open enough to let me go out and fall.&amp;quot; I&amp;#39;ve thought while cooking, &amp;quot;This knife is mighty sharp.&amp;quot; I&amp;#39;ve thought while crossing the road, &amp;quot;That car is going fast. I hope it doesn&amp;#39;t stop and hits me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know where my moderating skills have gone. You know the ones that help you look at negative events and say &amp;quot;it&amp;#39;ll be all right. You just have to get over this...&amp;quot; Perhaps it&amp;#39;s just because I&amp;#39;m getting overcome with too many negative events.&lt;/p&gt;\n\n&lt;p&gt;What negative events? Let&amp;#39;s see. \n* I might get kicked out of my major and I don&amp;#39;t have the time/money to start a new one. I need at least a BA in anything to achieve what I want, which I just found out, but no time/money means no BA. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The major I&amp;#39;m in is actually one that I do not enjoy at all, but again no time/money to change it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The people around me are either think my problem is just like everyone else&amp;#39;s and that it&amp;#39;s not something to get that upset about or they just don&amp;#39;t understand and say that it&amp;#39;s bothering them that I am bothered by it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I cause my parents to worry about me and it hurts me so much that I do.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Every time I go to therapy I feel worse afterwards.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;ve realized that all the negative events are actually my fault instead of whoever or whatever I&amp;#39;m trying to blame. So, it&amp;#39;s all me.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Everyone tells me their worries and it gets so hard to listen to them because I take those worries on myself.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I realize I&amp;#39;m surrounded by so many selfish people. I know I have my selfish moments, too.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;ve been wondering why I haven&amp;#39;t had many true friends. I try so hard to be interested in what they are interested in - and some I&amp;#39;d actually been interested in myself, but now no one is particularly interested in what I&amp;#39;m interested in.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Not that I know what I&amp;#39;m interested in. I find it harder and harder to understand what I enjoy. Or I&amp;#39;m not that great at what I enjoy.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This one sounds cliche and immature, but I wonder why no males have had any interest in me.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t think my opinions are taken into consideration by others. Maybe it&amp;#39;s because I&amp;#39;m not articulate enough or too verbose.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m basically a push-over. I&amp;#39;ve payed for most of the things that the apartment needs - toilet paper, dish soap, trash bags, cleaning supplies, etc - for my roommates. I&amp;#39;ve gone to things that honestly I don&amp;#39;t need to. I know it&amp;#39;s partially my fault for being a push-over. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I want to stop saying sorry and stand up for myself, but I&amp;#39;m too afraid of rejection that I take the blame.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I get sick over conflict. I&amp;#39;m afraid of rejection.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m afraid of rejection.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All my projects I try to start - a program, a book, a drawing, a game - have failed.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The club I&amp;#39;m president of is failing.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I keep thinking about how everything dies and fades away. Forgotten. We are so insignificant. Why are we even here? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I have anxiety over money even when I do have money.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m stuck in a paradox, where I want to die, but I&amp;#39;m too scared to die. Since I&amp;#39;m too scared to die, I want to die to get it over with. I want to live, but I&amp;#39;m too scared to live - accept risks. Since I&amp;#39;m too scared to live - accept risks, I can&amp;#39;t live.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;and more.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I was able to handle all these things before. My anxiety over money, I said to myself &amp;quot;The millionaire on his death bed has no use for his money.&amp;quot; For having no boys interested in me, I said to myself, &amp;quot;It&amp;#39;s fine. Plenty of people live alone.  I need no man. I can just get a dog to keep me company.&amp;quot; The failed projects, I&amp;#39;ve said, &amp;quot;Eh, we can start again.&amp;quot; AKA moderation skills.&lt;/p&gt;\n\n&lt;p&gt;But now, I&amp;#39;m getting worn down. I&amp;#39;ve had enough with people using me. I&amp;#39;ve had enough of failing. I&amp;#39;ve had enough of being scared. I&amp;#39;m getting worn down from trying to fix my problems. When I try to fix my problems (if I&amp;#39;m not articulate, trying to become more articulate), the other problems get in the way and make it harder for me to fix a single problem.&lt;/p&gt;\n\n&lt;p&gt;SO...Thanks for reading. How do I pick myself up?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello.\n\n\nI have a phobia of blood, falling, have no dangerous items near me, so suicide is nearly impossible for me. But still hear me out and help me.as I've thought about it so many times. I've thought, while looking out of my six story apartment, \"This windows open enough to let me go out and fall.\" I've thought while cooking, \"This knife is mighty sharp.\" I've thought while crossing the road, \"That car is going fast. I hope it doesn't stop and hits me.\"\n\nI don't know where my moderating skills have gone. You know the ones that help you look at negative events and say \"it'll be all right. You just have to get over this...\" Perhaps it's just because I'm getting overcome with too many negative events.\n\n\nWhat negative events? Let's see. \n* I might get kicked out of my major and I don't have the time/money to start a new one. I need at least a BA in anything to achieve what I want, which I just found out, but no time/money means no BA. \n\n* The major I'm in is actually one that I do not enjoy at all, but again no time/money to change it.\n\n* The people around me are either think my problem is just like everyone else's and that it's not something to get that upset about or they just don't understand and say that it's bothering them that I am bothered by it.\n\n* I cause my parents to worry about me and it hurts me so much that I do.\n\n* Every time I go to therapy I feel worse afterwards.\n\n* I've realized that all the negative events are actually my fault instead of whoever or whatever I'm trying to blame. So, it's all me.\n\n\n* Everyone tells me their worries and it gets so hard to listen to them because I take those worries on myself.\n\n* I realize I'm surrounded by so many selfish people. I know I have my selfish moments, too.\n\n* I've been wondering why I haven't had many true friends. I try so hard to be interested in what they are interested in - and some I'd actually been interested in myself, but now no one is particularly interested in what I'm interested in.\n\n* Not that I know what I'm interested in. I find it harder and harder to understand what I enjoy. Or I'm not that great at what I enjoy.\n\n* This one sounds cliche and immature, but I wonder why no males have had any interest in me.\n\n* I don't think my opinions are taken into consideration by others. Maybe it's because I'm not articulate enough or too verbose.\n\n* I'm basically a push-over. I've payed for most of the things that the apartment needs - toilet paper, dish soap, trash bags, cleaning supplies, etc - for my roommates. I've gone to things that honestly I don't need to. I know it's partially my fault for being a push-over. \n\n* I want to stop saying sorry and stand up for myself, but I'm too afraid of rejection that I take the blame.\n\n* I get sick over conflict. I'm afraid of rejection.\n\n* I'm afraid of rejection.\n\n* All my projects I try to start - a program, a book, a drawing, a game - have failed.\n\n* The club I'm president of is failing.\n\n* I keep thinking about how everything dies and fades away. Forgotten. We are so insignificant. Why are we even here? \n\n* I have anxiety over money even when I do have money.\n\n* I'm stuck in a paradox, where I want to die, but I'm too scared to die. Since I'm too scared to die, I want to die to get it over with. I want to live, but I'm too scared to live - accept risks. Since I'm too scared to live - accept risks, I can't live.\n\n* and more.\n\nI was able to handle all these things before. My anxiety over money, I said to myself \"The millionaire on his death bed has no use for his money.\" For having no boys interested in me, I said to myself, \"It's fine. Plenty of people live alone.  I need no man. I can just get a dog to keep me company.\" The failed projects, I've said, \"Eh, we can start again.\" AKA moderation skills.\n\nBut now, I'm getting worn down. I've had enough with people using me. I've had enough of failing. I've had enough of being scared. I'm getting worn down from trying to fix my problems. When I try to fix my problems (if I'm not articulate, trying to become more articulate), the other problems get in the way and make it harder for me to fix a single problem.\n\nSO...Thanks for reading. How do I pick myself up?\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wd8y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "feelingverydown", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399413140.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wd8y/i_need_advice_how_to_pick_myself_up/", "name": "t3_24wd8y", "created": 1399440995.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wd8y/i_need_advice_how_to_pick_myself_up/", "author_flair_text": null, "title": "I Need Advice: How to Pick Myself Up", "created_utc": 1399412195.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbb4gx", "gilded": 0, "author": "taufish", "parent_id": "t3_24wd8y", "approved_by": null, "body": "Hey feelingverydown,\n\nAnxiety about anxiety is a nasty place to be. As you said, \"When I try to fix my problems (if I'm not articulate, trying to become more articulate), the other problems get in the way and make it harder for me to fix a single problem.\" Like trying to step out of quicksand while standing in quicksand.\n\nFirst, a difficult question: when you are thinking about your anxieties, is there a common theme that points to a root issue? As you say, each worry brings more worries which intensify the existing worries until that's all you can see. Is there one common underlying concern at the back of all the myriad anxieties? It's a difficult question because you're in the midst of it, rather than an outside observer. \n\nSecond, you said that you feel worse after seeing your therapist. Do you think it might be beneficial to see a different therapist? Similarly-qualified people still have different perspectives, approaches, etc., and you might find someone who suits you better. Also, are you now or have you been on meds? An obvious question, but an important one. I have been on meds off and on for years, and sometimes the only way I can move forward is through meds giving me a bit of a mental reset.\n\nYou are very insightful to see that a deep anxiety is coloring all of your other experiences, so that everything in your life is an anxiety. That means that you don't have to cure infinite, tiny anxieties. Something deeper needs to be addressed.\n\nYour fear of dying isn't a sign of weakness. Your willingness to seek help is a sign of strength. There is stigma surrounding mental health issues, and that stigma is ridiculous. Thank you for giving this community a change to reach out to you.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey feelingverydown,&lt;/p&gt;\n\n&lt;p&gt;Anxiety about anxiety is a nasty place to be. As you said, &amp;quot;When I try to fix my problems (if I&amp;#39;m not articulate, trying to become more articulate), the other problems get in the way and make it harder for me to fix a single problem.&amp;quot; Like trying to step out of quicksand while standing in quicksand.&lt;/p&gt;\n\n&lt;p&gt;First, a difficult question: when you are thinking about your anxieties, is there a common theme that points to a root issue? As you say, each worry brings more worries which intensify the existing worries until that&amp;#39;s all you can see. Is there one common underlying concern at the back of all the myriad anxieties? It&amp;#39;s a difficult question because you&amp;#39;re in the midst of it, rather than an outside observer. &lt;/p&gt;\n\n&lt;p&gt;Second, you said that you feel worse after seeing your therapist. Do you think it might be beneficial to see a different therapist? Similarly-qualified people still have different perspectives, approaches, etc., and you might find someone who suits you better. Also, are you now or have you been on meds? An obvious question, but an important one. I have been on meds off and on for years, and sometimes the only way I can move forward is through meds giving me a bit of a mental reset.&lt;/p&gt;\n\n&lt;p&gt;You are very insightful to see that a deep anxiety is coloring all of your other experiences, so that everything in your life is an anxiety. That means that you don&amp;#39;t have to cure infinite, tiny anxieties. Something deeper needs to be addressed.&lt;/p&gt;\n\n&lt;p&gt;Your fear of dying isn&amp;#39;t a sign of weakness. Your willingness to seek help is a sign of strength. There is stigma surrounding mental health issues, and that stigma is ridiculous. Thank you for giving this community a change to reach out to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wd8y", "score_hidden": false, "name": "t1_chbb4gx", "created": 1399417579.0, "author_flair_text": null, "created_utc": 1399413979.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]