[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post is kind of long and maybe messy, I needed to both get this of my chest and seek for advice. Please read and help me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in a situation where I don&amp;#39;t know what the fuck I can do. My girlfriend is deeply depressed and not to sound like there are unlegitimate depression or anything, no disrespect, but she is depressed due to problems with her family that aren&amp;#39;t likely to ever go away. These problems will, according to her, leave her unhappy and unable to live a normal life till the day she dies. I have tried to be the rock to lean on or atleast tried to be a happy place where she can forget or atleast distract her from the problems. I think I&amp;#39;ve been doing as good a job as I&amp;#39;ve been able to until very recently. I&amp;#39;m the only person shes ever discussed her situation with and I think it felt good to have somebody to trust and actually discuss all her thoughts and emotions with. &lt;/p&gt;\n\n&lt;p&gt;The other day I fucked up. I don&amp;#39;t know why I acted like I did. I didn&amp;#39;t want to be the bad boyfriend I was. I let her down so bad that I surprised both her and myself. \nThe day before this happened, she had a breakdown and cried for hours. I was with her on the phone and as usual when these breakdowns occur I tried my best to be supportive and be of any help possible. The day after I picked her up and we were going to just relax and try to unwind for a while. I knew she had been feeling down and she was trying her best to keep her mood up. Even so, I acted like an asshole. Not deliberately but nonetheless, looking back I can&amp;#39;t see why I was that way. At the time, I didn&amp;#39;t even realize why she reacted like she did. Any other day I would have been as good support as i possibly could but I wasn&amp;#39;t. I won&amp;#39;t go in to details as to what happened, I wasn&amp;#39;t mean but it was all such bad timing on my part and I hurt her so fucking bad. I&amp;#39;ve felt terrible ever since. &lt;/p&gt;\n\n&lt;p&gt;The reason to why this happened is beyond me but if I had to guess, I&amp;#39;d say that her depression isn&amp;#39;t only weighing her down but it gets to me too. It tears me up slowly inside to be this rock and just be perfect for her. It&amp;#39;s been about a year since she told me about her family situation and I&amp;#39;m really the only person in the world she truly trusted. &lt;/p&gt;\n\n&lt;p&gt;Shes been talking about taking her own life since it&amp;#39;s the only way out of her misery but she doesn&amp;#39;t want to do it. She wants to live but suicide is her only viable option. I don&amp;#39;t think its the right way but she is hurting so bad every day, crying herself to sleep every night. The worst thing is, even as an &amp;quot;outsider&amp;quot; I can&amp;#39;t see a way out of her problems. I mean I could tell her that it will all work out, and I do, but I don&amp;#39;t even really think it will work out. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I can do for her, I let her down in a time of need even though I&amp;#39;ve promised to be there for her everytime she needs it. I&amp;#39;ve never felt so bad in my life, and I&amp;#39;ve been through a period of depression myself. I know how it never looks like there is a way out while you&amp;#39;re depressed but know I as her boyfriend don&amp;#39;t even see a solution. &lt;/p&gt;\n\n&lt;p&gt;I need advice on what to do to be able to let me support her again.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t feel like elaborating on what the problem is right now, maybe later. Right now I just want her to be able to trust me again since she has noone else to help her.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This post is kind of long and maybe messy, I needed to both get this of my chest and seek for advice. Please read and help me.\n\nI'm in a situation where I don't know what the fuck I can do. My girlfriend is deeply depressed and not to sound like there are unlegitimate depression or anything, no disrespect, but she is depressed due to problems with her family that aren't likely to ever go away. These problems will, according to her, leave her unhappy and unable to live a normal life till the day she dies. I have tried to be the rock to lean on or atleast tried to be a happy place where she can forget or atleast distract her from the problems. I think I've been doing as good a job as I've been able to until very recently. I'm the only person shes ever discussed her situation with and I think it felt good to have somebody to trust and actually discuss all her thoughts and emotions with. \n\nThe other day I fucked up. I don't know why I acted like I did. I didn't want to be the bad boyfriend I was. I let her down so bad that I surprised both her and myself. \nThe day before this happened, she had a breakdown and cried for hours. I was with her on the phone and as usual when these breakdowns occur I tried my best to be supportive and be of any help possible. The day after I picked her up and we were going to just relax and try to unwind for a while. I knew she had been feeling down and she was trying her best to keep her mood up. Even so, I acted like an asshole. Not deliberately but nonetheless, looking back I can't see why I was that way. At the time, I didn't even realize why she reacted like she did. Any other day I would have been as good support as i possibly could but I wasn't. I won't go in to details as to what happened, I wasn't mean but it was all such bad timing on my part and I hurt her so fucking bad. I've felt terrible ever since. \n\nThe reason to why this happened is beyond me but if I had to guess, I'd say that her depression isn't only weighing her down but it gets to me too. It tears me up slowly inside to be this rock and just be perfect for her. It's been about a year since she told me about her family situation and I'm really the only person in the world she truly trusted. \n\nShes been talking about taking her own life since it's the only way out of her misery but she doesn't want to do it. She wants to live but suicide is her only viable option. I don't think its the right way but she is hurting so bad every day, crying herself to sleep every night. The worst thing is, even as an \"outsider\" I can't see a way out of her problems. I mean I could tell her that it will all work out, and I do, but I don't even really think it will work out. \n\nI don't know what I can do for her, I let her down in a time of need even though I've promised to be there for her everytime she needs it. I've never felt so bad in my life, and I've been through a period of depression myself. I know how it never looks like there is a way out while you're depressed but know I as her boyfriend don't even see a solution. \n\nI need advice on what to do to be able to let me support her again.\n\nI don't feel like elaborating on what the problem is right now, maybe later. Right now I just want her to be able to trust me again since she has noone else to help her.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2535rc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ILetHerDown", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2535rc/i_need_all_the_advice_i_can_get_right_now/", "name": "t3_2535rc", "created": 1399623245.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2535rc/i_need_all_the_advice_i_can_get_right_now/", "author_flair_text": null, "title": "I need all the advice I can get right now", "created_utc": 1399594445.0, "ups": 6, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd8bfd", "gilded": 0, "author": "omar_strollin", "parent_id": "t3_2535rc", "approved_by": null, "body": "Is she seeing a mental health provider?\n\nI understand and respect your concern for her, but I don't know if it's your responsibility or place to come up with a solution. Humans and our experiences aren't that simple. That being said, you are still there to support her and help get her to the resources she sounds like she needs.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she seeing a mental health provider?&lt;/p&gt;\n\n&lt;p&gt;I understand and respect your concern for her, but I don&amp;#39;t know if it&amp;#39;s your responsibility or place to come up with a solution. Humans and our experiences aren&amp;#39;t that simple. That being said, you are still there to support her and help get her to the resources she sounds like she needs.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2535rc", "score_hidden": false, "name": "t1_chd8bfd", "created": 1399625892.0, "author_flair_text": null, "created_utc": 1399597092.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd9tow", "gilded": 0, "author": "Dogg_92", "parent_id": "t3_2535rc", "approved_by": null, "body": "It sounds to me like you have been an extremely good boyfriend to her. Yes, you let her down. But that is because you are human. I'm not exactly sure of what the situation is, and so please disregard what I am saying if it does not apply. But to me it sounds like you are a very supportive person who has been trying to be perfect for her. That is a huge weight to be carrying around on your shoulders. You failed to be supportive once, and you let her down. You are not a bad person for doing this. It happens to everyone. Please don't feel like you are \"bad\". It actually sounds like you are more supportive than most boyfriends. You made a mistake. And that is okay. \n\nDo you mind me asking how old you two are? If the family situation will not get better, is there any way that she would be able to distance herself from her family? Is she under 18? If she is over 18, can she move out?\n\nHave you spoken to your girlfriend and apologized to her? Due to her depression, she may be extremely upset over this. How about bringing her some roses and her favorite coffee/tea/chocolates, and sitting her down to tell her that you are sorry? You are not a bad boyfriend at all. But since she is extremely depressed, you may have to go the \"extra mile\" to make her feel better again.\n\nPlease, also remember that it is not your responsibility to take her out of this situation she is in (unless she or someone else is being abused, then you do need to tell the authorities). It is absolutely amazing of you to be such a huge support for her. That is really, really good! I'm sure you have helped her a lot. Just please remember that you do not need to be perfect. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like you have been an extremely good boyfriend to her. Yes, you let her down. But that is because you are human. I&amp;#39;m not exactly sure of what the situation is, and so please disregard what I am saying if it does not apply. But to me it sounds like you are a very supportive person who has been trying to be perfect for her. That is a huge weight to be carrying around on your shoulders. You failed to be supportive once, and you let her down. You are not a bad person for doing this. It happens to everyone. Please don&amp;#39;t feel like you are &amp;quot;bad&amp;quot;. It actually sounds like you are more supportive than most boyfriends. You made a mistake. And that is okay. &lt;/p&gt;\n\n&lt;p&gt;Do you mind me asking how old you two are? If the family situation will not get better, is there any way that she would be able to distance herself from her family? Is she under 18? If she is over 18, can she move out?&lt;/p&gt;\n\n&lt;p&gt;Have you spoken to your girlfriend and apologized to her? Due to her depression, she may be extremely upset over this. How about bringing her some roses and her favorite coffee/tea/chocolates, and sitting her down to tell her that you are sorry? You are not a bad boyfriend at all. But since she is extremely depressed, you may have to go the &amp;quot;extra mile&amp;quot; to make her feel better again.&lt;/p&gt;\n\n&lt;p&gt;Please, also remember that it is not your responsibility to take her out of this situation she is in (unless she or someone else is being abused, then you do need to tell the authorities). It is absolutely amazing of you to be such a huge support for her. That is really, really good! I&amp;#39;m sure you have helped her a lot. Just please remember that you do not need to be perfect. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2535rc", "score_hidden": false, "name": "t1_chd9tow", "created": 1399628771.0, "author_flair_text": null, "created_utc": 1399599971.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdanzk", "gilded": 0, "author": "Greenedified", "parent_id": "t3_2535rc", "approved_by": null, "body": "I'd talk to her. Open up your feelings to her if you can. Tell her how you feel about the whole situation of her family and her and how it gets to you. Try to explain her what happened that made you lose control of being the solid rock you normally are for her.\n\nAbout her problem with her family. I'm talking about this because it looks like you agree with her that there is no positive ending about that. I don't know what the exact problems are but it seems that those problems are holding her back from happiness. Let me make a metaphore (I like making metaphores): There is this road and your girlfriend is driving a car. The destination is happiness. In the middle of the road is a huge rock which blocks her path (the family problems). There are two options now. She can remove the rock by herself and the passenger (you), but it will be tough. The good thing about this is that you will be able to bring the rock with you further along the road of happiness. The second thing she can do is to drive back a little back and take the road that goes around the rock, sometimes this is the only way. Me personally, I'd first give a shot at removing the rock before taking the other road. If it doesn't work out and the rock is too heavy, you'll still be able to look back at the memory of the rock.\n\nI don't know if this helped at all and I hope I gave you some solid advice.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d talk to her. Open up your feelings to her if you can. Tell her how you feel about the whole situation of her family and her and how it gets to you. Try to explain her what happened that made you lose control of being the solid rock you normally are for her.&lt;/p&gt;\n\n&lt;p&gt;About her problem with her family. I&amp;#39;m talking about this because it looks like you agree with her that there is no positive ending about that. I don&amp;#39;t know what the exact problems are but it seems that those problems are holding her back from happiness. Let me make a metaphore (I like making metaphores): There is this road and your girlfriend is driving a car. The destination is happiness. In the middle of the road is a huge rock which blocks her path (the family problems). There are two options now. She can remove the rock by herself and the passenger (you), but it will be tough. The good thing about this is that you will be able to bring the rock with you further along the road of happiness. The second thing she can do is to drive back a little back and take the road that goes around the rock, sometimes this is the only way. Me personally, I&amp;#39;d first give a shot at removing the rock before taking the other road. If it doesn&amp;#39;t work out and the rock is too heavy, you&amp;#39;ll still be able to look back at the memory of the rock.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if this helped at all and I hope I gave you some solid advice.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2535rc", "score_hidden": false, "name": "t1_chdanzk", "created": 1399630396.0, "author_flair_text": null, "created_utc": 1399601596.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]