[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just to introduce myself a bit about things I think are important for you to better understand me: I&amp;#39;m 19 years old young male, I&amp;#39;ve never had a girlfriend or relantionship which is the main reason I&amp;#39;m depressed, but also I know that sadness and depression want help me so I try to do my best. I also realise that after my first relantionship I&amp;#39;ll come to an end that it&amp;#39;s not everything. But because I&amp;#39;ve never ever even kissed a girl, in my heart I feel I&amp;#39;m missing a lot on that. I get depressed for no apparent reason (other than no-girlfriend issue) - this lasts for two years now but somewhat I hold on, I&amp;#39;ve got slight social anxiety, I&amp;#39;m really self-conscious and overthink stuff too much but I can&amp;#39;t help myself, I have maybe 30 friends and 4 of them are my best friends to whom I can talk about even the weirdest stuff, I mean we know ourselves a lot. I&amp;#39;m here because I get paranoid then depressed then suicidal. One of that 4 friends has become my ultimate friend in last half a year. We go to the same class, text with each other every day, know everything about ourselves. Yet I still get really paranoid that I&amp;#39;m annoying to him. I care about the 3 others as well, I honestly appreciate our friendship and I believe these ones will last for the end of my life,  but not that much as this one. I talked to him about this issue last week and he understood me because we are really close and similar. I just want to be his favourite person to talk to, to spend time with and feel like I&amp;#39;m no burden and that he honestly likes me the way I&amp;#39;m even at my worst. However we are together at least 5 days per week I get the strange feeling that I&amp;#39;m needy, clingy and annoying to him and he secretly hates me. I talked to him about it and he reassured me that he likes me and it&amp;#39;s ok. He even starts first texting me or is the first one to iniciate conversation. I also know that after me he has his best female friend to whom he can talk about anything at all and one male friend. He told me that himself, I&amp;#39;m not some kind of freak who stalks him. I&amp;#39;m completely ok with that it&amp;#39;s just for the record. But after week or so I start to overthink that he might forget about everything that we&amp;#39;ve talked about and it really strucks me down. I realise that I&amp;#39;m maybe whiny bitch or selfish. I don&amp;#39;t know what to do, it&amp;#39;s driving me nuts. I need constant reassurance that I&amp;#39;m not hated. I don&amp;#39;t want to sound self-centred or anything but I can&amp;#39;t live like this. I want to enjoy life. I&amp;#39;m not being sentimental because I lurk here a lot and know the way things are. Someone here told me that I have the tendency to control people. Well maybe I have but only about this one guy. I really can&amp;#39;t help it and then I get really depressed. I can give the additional info to whoever who tries to help me. In the end I guess I need someone about who I&amp;#39;d know that I&amp;#39;m their favourite person. I&amp;#39;d be rally happy if it was female. I feel just so powerless I&amp;#39;m posting here because you guys are really the best and caring. I just can&amp;#39;t live like this. I&amp;#39;ve been alone for most of my life besides texting... I go to socialise every now and then but it isn&amp;#39;t getting me any joy anymore. I can&amp;#39;t even stand myself. I hate myself so much for this my issues. I loathe myself for the fact that everytime I turn on my phone and see he has texted me I get so happy about it and then start to overthink if he is going to text me again.... Please help I can&amp;#39;t stand it...\n(excuse my poor english I&amp;#39;m not native speaker and my vocabulary is pretty small which means I can&amp;#39;t express myself well, also please don&amp;#39;t tell to seek professional help because it&amp;#39;s not possible and please don&amp;#39;t tell me to do things that give me joy and make me happy because I see no point in doing them if not for someone I could share it with and make that person happy) Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just to introduce myself a bit about things I think are important for you to better understand me: I'm 19 years old young male, I've never had a girlfriend or relantionship which is the main reason I'm depressed, but also I know that sadness and depression want help me so I try to do my best. I also realise that after my first relantionship I'll come to an end that it's not everything. But because I've never ever even kissed a girl, in my heart I feel I'm missing a lot on that. I get depressed for no apparent reason (other than no-girlfriend issue) - this lasts for two years now but somewhat I hold on, I've got slight social anxiety, I'm really self-conscious and overthink stuff too much but I can't help myself, I have maybe 30 friends and 4 of them are my best friends to whom I can talk about even the weirdest stuff, I mean we know ourselves a lot. I'm here because I get paranoid then depressed then suicidal. One of that 4 friends has become my ultimate friend in last half a year. We go to the same class, text with each other every day, know everything about ourselves. Yet I still get really paranoid that I'm annoying to him. I care about the 3 others as well, I honestly appreciate our friendship and I believe these ones will last for the end of my life,  but not that much as this one. I talked to him about this issue last week and he understood me because we are really close and similar. I just want to be his favourite person to talk to, to spend time with and feel like I'm no burden and that he honestly likes me the way I'm even at my worst. However we are together at least 5 days per week I get the strange feeling that I'm needy, clingy and annoying to him and he secretly hates me. I talked to him about it and he reassured me that he likes me and it's ok. He even starts first texting me or is the first one to iniciate conversation. I also know that after me he has his best female friend to whom he can talk about anything at all and one male friend. He told me that himself, I'm not some kind of freak who stalks him. I'm completely ok with that it's just for the record. But after week or so I start to overthink that he might forget about everything that we've talked about and it really strucks me down. I realise that I'm maybe whiny bitch or selfish. I don't know what to do, it's driving me nuts. I need constant reassurance that I'm not hated. I don't want to sound self-centred or anything but I can't live like this. I want to enjoy life. I'm not being sentimental because I lurk here a lot and know the way things are. Someone here told me that I have the tendency to control people. Well maybe I have but only about this one guy. I really can't help it and then I get really depressed. I can give the additional info to whoever who tries to help me. In the end I guess I need someone about who I'd know that I'm their favourite person. I'd be rally happy if it was female. I feel just so powerless I'm posting here because you guys are really the best and caring. I just can't live like this. I've been alone for most of my life besides texting... I go to socialise every now and then but it isn't getting me any joy anymore. I can't even stand myself. I hate myself so much for this my issues. I loathe myself for the fact that everytime I turn on my phone and see he has texted me I get so happy about it and then start to overthink if he is going to text me again.... Please help I can't stand it...\n(excuse my poor english I'm not native speaker and my vocabulary is pretty small which means I can't express myself well, also please don't tell to seek professional help because it's not possible and please don't tell me to do things that give me joy and make me happy because I see no point in doing them if not for someone I could share it with and make that person happy) Thank you.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240q9w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "a2185750", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240q9w/i_need_help/", "name": "t3_240q9w", "created": 1398531303.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240q9w/i_need_help/", "author_flair_text": null, "title": "I need help.", "created_utc": 1398502503.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch396a6", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_ch2grhy", "approved_by": null, "body": "It sounds like you're kind of clingy because you're afraid of losing the friends you have.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re kind of clingy because you&amp;#39;re afraid of losing the friends you have.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240q9w", "score_hidden": false, "name": "t1_ch396a6", "created": 1398606793.0, "author_flair_text": null, "created_utc": 1398603193.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2grhy", "gilded": 0, "author": "a2185750", "parent_id": "t1_ch2gosa", "approved_by": null, "body": "I like to search stuff on the internet, I workout five times per week, I play guitar... I'm not that interested in meeting new people ( that might sound dumb if I want to solve my problem) because I'm introverted and to get new best friend requires a lot of work... that's not the biggest problem but after all I get that I'mtooannoyingandclingy-like feeling that I lose interest.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like to search stuff on the internet, I workout five times per week, I play guitar... I&amp;#39;m not that interested in meeting new people ( that might sound dumb if I want to solve my problem) because I&amp;#39;m introverted and to get new best friend requires a lot of work... that&amp;#39;s not the biggest problem but after all I get that I&amp;#39;mtooannoyingandclingy-like feeling that I lose interest.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240q9w", "score_hidden": false, "name": "t1_ch2grhy", "created": 1398507451.0, "author_flair_text": null, "created_utc": 1398503851.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2gosa", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_240q9w", "approved_by": null, "body": "What are your interests?  Are there any clubs on your campus you could join focused around those interests?  That would be a good place to meet more people.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are your interests?  Are there any clubs on your campus you could join focused around those interests?  That would be a good place to meet more people.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240q9w", "score_hidden": false, "name": "t1_ch2gosa", "created": 1398506943.0, "author_flair_text": null, "created_utc": 1398503343.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]