[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not to long ago I posted about how I wanted to kill myself, I had the means to do so but I decided against it. I&amp;#39;m past feeling suicidal for the most part but my depression is still a big part of my life. I have 2 weeks left of high school and I&amp;#39;m in danger of not graduating because I can&amp;#39;t manage my depression. I can&amp;#39;t make myself get out of bed In the morning and its really ruining my life. What I need is some sort of advice from someone who has gone through something similar and made it. I need help getting past this so I can graduate, I&amp;#39;m so close but at the same time I&amp;#39;m so far away from it. I have seen therapists and I was in medication but it made me have suicidal thoughts(kind of counter productive for an &amp;quot;anti depressant&amp;quot;). I just don&amp;#39;t know where to go from here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Not to long ago I posted about how I wanted to kill myself, I had the means to do so but I decided against it. I'm past feeling suicidal for the most part but my depression is still a big part of my life. I have 2 weeks left of high school and I'm in danger of not graduating because I can't manage my depression. I can't make myself get out of bed In the morning and its really ruining my life. What I need is some sort of advice from someone who has gone through something similar and made it. I need help getting past this so I can graduate, I'm so close but at the same time I'm so far away from it. I have seen therapists and I was in medication but it made me have suicidal thoughts(kind of counter productive for an \"anti depressant\"). I just don't know where to go from here.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23vexs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iFly_TheTardis", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23vexs/i_need_some_help/", "name": "t3_23vexs", "created": 1398386935.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23vexs/i_need_some_help/", "author_flair_text": null, "title": "I need some help", "created_utc": 1398358135.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1v6v3", "gilded": 0, "author": "Jangetta", "parent_id": "t1_ch1uigg", "approved_by": null, "body": "You're quite welcome :)\n\nI would start with getting some extra Vitamin D (local drug stores and super markets sell it separate from multi), winter just ended and a lot of seasonal depression and even clinical can come from some vitamin imbalance (though I do realize clinical is a lot of chemical and hormonal as well). Our main source of Vitamin D is actually from the sun but it's also in red meats as well. \n\nHigh school ending is a scary time. I understand perfectly where you're coming from and I'm going to tell you, you are going to become distant from some friends but you'll make new ones as well once high school is over. High school is a hell hole compared to college and if your grades aren't where they should be for a 4-year college, there is absolutely no shame or ANYTHING wrong with a 2-year to transfer into a 4-year, or even taking a break from school! It's a stressful place, as I'm sitting here stuffing my face with ice cream from final stress. :)\n\nFind someone you absolutely trust and can confide in as well. It really helps to have at least ONE friend you know can always be true to you. Creative outlets help with just the raw emotion as well, which is why I suggest writing things down because my depression is due to a lot of pent up emotions that I've just continuously stuffed down inside me because I felt I was just bothering everyone, or I would get yelled at. And it's totally unhealthy.\n\nAll the best to you and I'm glad you've gone from suicidal to seeking to find help for yourself. That's the biggest step. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re quite welcome :)&lt;/p&gt;\n\n&lt;p&gt;I would start with getting some extra Vitamin D (local drug stores and super markets sell it separate from multi), winter just ended and a lot of seasonal depression and even clinical can come from some vitamin imbalance (though I do realize clinical is a lot of chemical and hormonal as well). Our main source of Vitamin D is actually from the sun but it&amp;#39;s also in red meats as well. &lt;/p&gt;\n\n&lt;p&gt;High school ending is a scary time. I understand perfectly where you&amp;#39;re coming from and I&amp;#39;m going to tell you, you are going to become distant from some friends but you&amp;#39;ll make new ones as well once high school is over. High school is a hell hole compared to college and if your grades aren&amp;#39;t where they should be for a 4-year college, there is absolutely no shame or ANYTHING wrong with a 2-year to transfer into a 4-year, or even taking a break from school! It&amp;#39;s a stressful place, as I&amp;#39;m sitting here stuffing my face with ice cream from final stress. :)&lt;/p&gt;\n\n&lt;p&gt;Find someone you absolutely trust and can confide in as well. It really helps to have at least ONE friend you know can always be true to you. Creative outlets help with just the raw emotion as well, which is why I suggest writing things down because my depression is due to a lot of pent up emotions that I&amp;#39;ve just continuously stuffed down inside me because I felt I was just bothering everyone, or I would get yelled at. And it&amp;#39;s totally unhealthy.&lt;/p&gt;\n\n&lt;p&gt;All the best to you and I&amp;#39;m glad you&amp;#39;ve gone from suicidal to seeking to find help for yourself. That&amp;#39;s the biggest step. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vexs", "score_hidden": false, "name": "t1_ch1v6v3", "created": 1398474749.0, "author_flair_text": null, "created_utc": 1398445949.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1uigg", "gilded": 0, "author": "iFly_TheTardis", "parent_id": "t1_ch1246z", "approved_by": null, "body": "Thank you for this. I've yet to try a few things you said you did, so that will be where I start first. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. I&amp;#39;ve yet to try a few things you said you did, so that will be where I start first. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vexs", "score_hidden": false, "name": "t1_ch1uigg", "created": 1398473429.0, "author_flair_text": null, "created_utc": 1398444629.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1246z", "gilded": 0, "author": "Jangetta", "parent_id": "t3_23vexs", "approved_by": null, "body": "Hey,\nI'm currently going through this right now and I had last summer in my job and my summer course. I was so miserable I couldn't get out of bed half the time and I stopped eating meals. I also couldn't pay attention in classes and I zoned a lot and I was dead weight at my job. I noticed this as I refused to paint, draw, watch TV or even play video games or try to contact friends and found myself in a panic every time they picked up (over skype) because I was ashamed of where I was mentally, even though they didn't pick up on it. \n\nI got myself a small pet (spontaneously adopted a turtle) and I found sunlight and vitamin D very helpful. I also found talking with friends or trying to talk to people, even about class things was helpful to me, or even teachers and their interests. Also, working out, even 15 minutes a day or a jog around the block, has been helping too. \n\nI write in a book every day now as a kind of way to find out why I'm depressed and find a meaning in it and just to get out raw emotion where I feel like it can't be shared. I didn't even realize it was depression at first and just thought of my state as completely numb or apathetic.\n\nI always kept trying to look back in the past and figure out where I went wrong and why can't I be happy again, like before. I realized at the middle of summer, I'm not that person anymore. I had to look up and see the person I am, post depression because that's all that's there and THAT'S who needs the help more than finding the me in the past. \n\nI'm sorry if this doesn't help because I'm not exactly sure why you feel so depressed, though I am willing to listen and talk to YOU. My experience is through college, but my brother went through the same things with High school and is currently going through this as he is getting closer to graduating and I'm helping him all I can. For the record: My grades have gotten better and it has been easier to get up every day since then. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey,\nI&amp;#39;m currently going through this right now and I had last summer in my job and my summer course. I was so miserable I couldn&amp;#39;t get out of bed half the time and I stopped eating meals. I also couldn&amp;#39;t pay attention in classes and I zoned a lot and I was dead weight at my job. I noticed this as I refused to paint, draw, watch TV or even play video games or try to contact friends and found myself in a panic every time they picked up (over skype) because I was ashamed of where I was mentally, even though they didn&amp;#39;t pick up on it. &lt;/p&gt;\n\n&lt;p&gt;I got myself a small pet (spontaneously adopted a turtle) and I found sunlight and vitamin D very helpful. I also found talking with friends or trying to talk to people, even about class things was helpful to me, or even teachers and their interests. Also, working out, even 15 minutes a day or a jog around the block, has been helping too. &lt;/p&gt;\n\n&lt;p&gt;I write in a book every day now as a kind of way to find out why I&amp;#39;m depressed and find a meaning in it and just to get out raw emotion where I feel like it can&amp;#39;t be shared. I didn&amp;#39;t even realize it was depression at first and just thought of my state as completely numb or apathetic.&lt;/p&gt;\n\n&lt;p&gt;I always kept trying to look back in the past and figure out where I went wrong and why can&amp;#39;t I be happy again, like before. I realized at the middle of summer, I&amp;#39;m not that person anymore. I had to look up and see the person I am, post depression because that&amp;#39;s all that&amp;#39;s there and THAT&amp;#39;S who needs the help more than finding the me in the past. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry if this doesn&amp;#39;t help because I&amp;#39;m not exactly sure why you feel so depressed, though I am willing to listen and talk to YOU. My experience is through college, but my brother went through the same things with High school and is currently going through this as he is getting closer to graduating and I&amp;#39;m helping him all I can. For the record: My grades have gotten better and it has been easier to get up every day since then. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vexs", "score_hidden": false, "name": "t1_ch1246z", "created": 1398395869.0, "author_flair_text": null, "created_utc": 1398367069.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1ud35", "gilded": 0, "author": "iFly_TheTardis", "parent_id": "t1_ch10i35", "approved_by": null, "body": "Mainly my depression but other than that its how nervous I am knowing high school is over in such a short amount of time. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mainly my depression but other than that its how nervous I am knowing high school is over in such a short amount of time. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vexs", "score_hidden": false, "name": "t1_ch1ud35", "created": 1398447937.0, "author_flair_text": null, "created_utc": 1398444337.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch10i35", "gilded": 0, "author": "Dyspher", "parent_id": "t3_23vexs", "approved_by": null, "body": "Do you have any idea why you feel this way?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any idea why you feel this way?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vexs", "score_hidden": false, "name": "t1_ch10i35", "created": 1398367551.0, "author_flair_text": null, "created_utc": 1398363951.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]