[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if this even belongs here but I&amp;#39;m having those feelings really strongly again so I guess theres no better place to post this.\nSo you might have seen me here before. If you read my last post I was a bit lost. Well I took some time to gather my thoughts. I found out my school doesn&amp;#39;t have a counselor. Closest we have is a health teacher, but shes more medical than psychological. I also cleared up in my own mind why I don&amp;#39;t want to talk to my friend. \nThe whole situation with my parents finding out has caused a second situation. While I still trust my friend I know that he could still get frightened and need some help helping me. Since I&amp;#39;ve lied to my parents about this if they got word I was lying they wouldn&amp;#39;t trust me on this subject again. They would constantly be treating me in a manner that made me so much worse the last time it happened. \nI&amp;#39;m not much of a risk taker if you can tell. I&amp;#39;m not at all willing to risk that happening because I know it would push me even deeper into where I am than I already am, but I need help. \nI need advice on how to approach my friend so that he understands the situation I got myself into and how fucked I am if it goes wrong.\nI&amp;#39;m a fucking wreck right now, I can see it in the mirror every morning and I have no idea how no one notices. I feel so worthless but I don&amp;#39;t feel comfortable putting everything on the line like this. Please help me out of this hole I dug myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know if this even belongs here but I'm having those feelings really strongly again so I guess theres no better place to post this.\nSo you might have seen me here before. If you read my last post I was a bit lost. Well I took some time to gather my thoughts. I found out my school doesn't have a counselor. Closest we have is a health teacher, but shes more medical than psychological. I also cleared up in my own mind why I don't want to talk to my friend. \nThe whole situation with my parents finding out has caused a second situation. While I still trust my friend I know that he could still get frightened and need some help helping me. Since I've lied to my parents about this if they got word I was lying they wouldn't trust me on this subject again. They would constantly be treating me in a manner that made me so much worse the last time it happened. \nI'm not much of a risk taker if you can tell. I'm not at all willing to risk that happening because I know it would push me even deeper into where I am than I already am, but I need help. \nI need advice on how to approach my friend so that he understands the situation I got myself into and how fucked I am if it goes wrong.\nI'm a fucking wreck right now, I can see it in the mirror every morning and I have no idea how no one notices. I feel so worthless but I don't feel comfortable putting everything on the line like this. Please help me out of this hole I dug myself.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24xbek", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "dingledogs", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24xbek/i_need_some_advice_badly/", "name": "t3_24xbek", "created": 1399463786.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24xbek/i_need_some_advice_badly/", "author_flair_text": null, "title": "I need some advice, badly.", "created_utc": 1399434986.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]