[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ill try to be brief &lt;/p&gt;\n\n&lt;p&gt;So much awful things go on in my life, and like a broken record player, they repeat themselves over and over and over again in a sick pattern that has no end in sight. Most of this comes from the treatment from my parents towards me. These are summaries..there are so many details that it would take me forever to elaborate &lt;/p&gt;\n\n&lt;p&gt;My mom: Always cold towards me, doesn&amp;#39;t feel the need to give me any warmth or positive attention, only cares about my schoolwork. When I tell her I&amp;#39;m feeling sad she tells me to shut up and forget about it. If I ask her to talk to me about it she blames me for trying to judge her actions.&lt;/p&gt;\n\n&lt;p&gt;My dad: Manipulates me constantly, forces me into doing things for him, always screams at me and criticizes everything I do, threatens me in all kinds of ways, very aggressive, very rude and cruel in how he acts and talks to me (says he wishes he never had me, says he wishes I was gone, wishes I was never born, that I would die)&lt;/p&gt;\n\n&lt;p&gt;Some would say in a year I can move out and have freedom, but they have set me up for dependency until I&amp;#39;m in my 30s. I want to go into medicine. They are doctors. I need their connections and status to get ahead. I can&amp;#39;t handle $250,000 in college debt by myself, they promised to pay my tuition. Sorry to be frank, but I was raised in a certain lifestyle, there is now way I can go from living in the top 1% to supporting myself completely. I would be fucked in that situation. So I have to choose between my parents&amp;#39; constant, unwavering, undying, unchanging, everlasting abuse towards me or deal with trying to support myself in a realm in which I have zero experience. I&amp;#39;m stuck between two walls and I don&amp;#39;t want to deal with either scenario. &lt;/p&gt;\n\n&lt;p&gt;my life is not going the way I want it to. Even if it has the possibility of changing, I know exactly the position I&amp;#39;m going to be in until I can graduate from medical school or finish my training....either I&amp;#39;m a broke struggling student with zero life experience or connections trying to make it in an extremely competitive field OR I&amp;#39;m a well connected, advantaged, financially- taken-care-of student with a clear shot at becoming a physician...who has to deal with 10-12 more years of constant abuse. My parents only offer to cover my ass because they want to keep me around to hurt, they derive an awful pleasure out of hurting people. They are two very power hungry individuals. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The main point&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I think that, if nothing else, I&amp;#39;m at least entitled to deciding whether or not I want to live or die. I should be able to say, I don&amp;#39;t want to live anymore, I can find some peace in dying and I&amp;#39;d like to pursue it. I don&amp;#39;t have any close friends at school, people like me but I choose not to make friendships, and like I said my parents literally told me they wished I wasn&amp;#39;t born. I have no encumbrances, I can die right now and nobody will care. Even if my parents &amp;quot;don&amp;#39;t mean it&amp;quot;, I feel as if they say it enough and with such nonchalantness that they deserve it. It&amp;#39;s a win win for everyone. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ill try to be brief \n\nSo much awful things go on in my life, and like a broken record player, they repeat themselves over and over and over again in a sick pattern that has no end in sight. Most of this comes from the treatment from my parents towards me. These are summaries..there are so many details that it would take me forever to elaborate \n\nMy mom: Always cold towards me, doesn't feel the need to give me any warmth or positive attention, only cares about my schoolwork. When I tell her I'm feeling sad she tells me to shut up and forget about it. If I ask her to talk to me about it she blames me for trying to judge her actions.\n\nMy dad: Manipulates me constantly, forces me into doing things for him, always screams at me and criticizes everything I do, threatens me in all kinds of ways, very aggressive, very rude and cruel in how he acts and talks to me (says he wishes he never had me, says he wishes I was gone, wishes I was never born, that I would die)\n\nSome would say in a year I can move out and have freedom, but they have set me up for dependency until I'm in my 30s. I want to go into medicine. They are doctors. I need their connections and status to get ahead. I can't handle $250,000 in college debt by myself, they promised to pay my tuition. Sorry to be frank, but I was raised in a certain lifestyle, there is now way I can go from living in the top 1% to supporting myself completely. I would be fucked in that situation. So I have to choose between my parents' constant, unwavering, undying, unchanging, everlasting abuse towards me or deal with trying to support myself in a realm in which I have zero experience. I'm stuck between two walls and I don't want to deal with either scenario. \n\nmy life is not going the way I want it to. Even if it has the possibility of changing, I know exactly the position I'm going to be in until I can graduate from medical school or finish my training....either I'm a broke struggling student with zero life experience or connections trying to make it in an extremely competitive field OR I'm a well connected, advantaged, financially- taken-care-of student with a clear shot at becoming a physician...who has to deal with 10-12 more years of constant abuse. My parents only offer to cover my ass because they want to keep me around to hurt, they derive an awful pleasure out of hurting people. They are two very power hungry individuals. \n\n\n**The main point**\n\nI think that, if nothing else, I'm at least entitled to deciding whether or not I want to live or die. I should be able to say, I don't want to live anymore, I can find some peace in dying and I'd like to pursue it. I don't have any close friends at school, people like me but I choose not to make friendships, and like I said my parents literally told me they wished I wasn't born. I have no encumbrances, I can die right now and nobody will care. Even if my parents \"don't mean it\", I feel as if they say it enough and with such nonchalantness that they deserve it. It's a win win for everyone. \n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "253d93", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "imsponge", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/253d93/i_need_to_die_immediately/", "name": "t3_253d93", "created": 1399628454.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/253d93/i_need_to_die_immediately/", "author_flair_text": null, "title": "I need to die, immediately", "created_utc": 1399599654.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd9rck", "gilded": 0, "author": "imsponge", "parent_id": "t3_253d93", "approved_by": null, "body": "I feel like you might approach my story with suspicion--maybe I seem like a whiney, spoiled, teenager. \n\n But **please** leave your convictions aside. If only you could see how they act, you'd understand why I need so desperately to escape them. I could fill a novel with elaboration and evidence, but my hands and head are numb, my eyes are watery and strained and I don't have it in me to type it. You can see my first post in my post history for a more detailed idea and if you want I can elaborate further. They are just evil evil people and I can't put up with them for 10-12 more years, and I can't escape them and try living on my own either. I have to escape my situation some how, and I am completely ready to end my life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like you might approach my story with suspicion--maybe I seem like a whiney, spoiled, teenager. &lt;/p&gt;\n\n&lt;p&gt;But &lt;strong&gt;please&lt;/strong&gt; leave your convictions aside. If only you could see how they act, you&amp;#39;d understand why I need so desperately to escape them. I could fill a novel with elaboration and evidence, but my hands and head are numb, my eyes are watery and strained and I don&amp;#39;t have it in me to type it. You can see my first post in my post history for a more detailed idea and if you want I can elaborate further. They are just evil evil people and I can&amp;#39;t put up with them for 10-12 more years, and I can&amp;#39;t escape them and try living on my own either. I have to escape my situation some how, and I am completely ready to end my life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253d93", "score_hidden": false, "name": "t1_chd9rck", "created": 1399628650.0, "author_flair_text": null, "created_utc": 1399599850.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheqjn1", "gilded": 0, "author": "imsponge", "parent_id": "t1_chdcp05", "approved_by": null, "body": "Thank you for your reply \n\nBut I have 2 choices, at least for the next 10 years\n\n1. Stay with my parents. \n\nI can enjoy their money and connections and advantages but their awful treatment won't stop and it keeps getting worse. \n\n2. Try to live on my own. \n\nIt will be nearly impossible for me survive in school and in work while trying to provide for myself, I have zero experience or anything, I won't get to live the lifestyle I'm attached to\n\nNeither options sounds good to me. I already hate the first 18 years of my life and now I have to ruin the next 10. That's not fair for me, I just want out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply &lt;/p&gt;\n\n&lt;p&gt;But I have 2 choices, at least for the next 10 years&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Stay with my parents. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I can enjoy their money and connections and advantages but their awful treatment won&amp;#39;t stop and it keeps getting worse. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Try to live on my own. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It will be nearly impossible for me survive in school and in work while trying to provide for myself, I have zero experience or anything, I won&amp;#39;t get to live the lifestyle I&amp;#39;m attached to&lt;/p&gt;\n\n&lt;p&gt;Neither options sounds good to me. I already hate the first 18 years of my life and now I have to ruin the next 10. That&amp;#39;s not fair for me, I just want out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253d93", "score_hidden": false, "name": "t1_cheqjn1", "created": 1399789621.0, "author_flair_text": null, "created_utc": 1399760821.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdcp05", "gilded": 0, "author": "maxwellanderson", "parent_id": "t3_253d93", "approved_by": null, "body": "I would be absolutely distraught to see a life cut short because of the bullying of anyone, let alone by their own parents. :/ I don't think you're whiny or spoiled. I think anyone who would write this or anything like it off as that are willfully ignoring a bigger issue.\n\nNow, I understand COMPLETELY why you feel the way you do, and cede that it is valid. However, while I'm not trying at all to suggest to you what to do, in my experience socioeconomic status is absolutely no replacement for a healthy environment, nor are the broke necessarily less happy than the wealthy. Of course, I understand why nobody would willingly leave such an economic level. On the other hand, I know that if I were in such a situation, and I was ready to kill myself, I'd at least take a chance on striking out on my own. After all, the difference between being rich and miserable and being poor and less miserable is much, much greater than being rich and dead and being poor and dead.\n\nThe bottom line here is that you're not out of options, not yet.\n\nI care about your life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would be absolutely distraught to see a life cut short because of the bullying of anyone, let alone by their own parents. :/ I don&amp;#39;t think you&amp;#39;re whiny or spoiled. I think anyone who would write this or anything like it off as that are willfully ignoring a bigger issue.&lt;/p&gt;\n\n&lt;p&gt;Now, I understand COMPLETELY why you feel the way you do, and cede that it is valid. However, while I&amp;#39;m not trying at all to suggest to you what to do, in my experience socioeconomic status is absolutely no replacement for a healthy environment, nor are the broke necessarily less happy than the wealthy. Of course, I understand why nobody would willingly leave such an economic level. On the other hand, I know that if I were in such a situation, and I was ready to kill myself, I&amp;#39;d at least take a chance on striking out on my own. After all, the difference between being rich and miserable and being poor and less miserable is much, much greater than being rich and dead and being poor and dead.&lt;/p&gt;\n\n&lt;p&gt;The bottom line here is that you&amp;#39;re not out of options, not yet.&lt;/p&gt;\n\n&lt;p&gt;I care about your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253d93", "score_hidden": false, "name": "t1_chdcp05", "created": 1399634847.0, "author_flair_text": null, "created_utc": 1399606047.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]