[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;ve been suicidal since..........I don&amp;#39;t know. Ever. Even as a child. My first suicide attempt were on april 2009 when I was 16. Just before I deprived myself of food (but I&amp;#39;m not anorexic) and burnt me twice with sulfuric acid in chemistry class. My parents put me in a psychiatric hospital; it was so awful I won&amp;#39;t ever ever go back (no separation between men and women or even children and adults, I was bonded to my bed and yelled at and treated like a beast...). I then started to drink heavily and sometimes add meds to it. My second serious suicide attempt was on october 2012. Then august 2013. Between these two I cut myself five times and burnt me with my cig six times, one of them really bad. Lately, a few days later, I cut myself 18 times - by the way I only count the cuts which will lead to lifetime scars. My boyfriend will be back in a few days and if he finds out he will go mad. I failed my college year. I can&amp;#39;t be a good trainee in my company. I can&amp;#39;t go to a doctor because I can&amp;#39;t be locked again in a psychiatric hospital it would break me. So what do I do? I&amp;#39;m also an alcoholic, I drink 2 liters a day. It&amp;#39;s about three or four bottles of wine. What do I do? I planned on killing myself with alcohol and a box of antidepressive pills tomorrow. Dunno if it will kill me since I&amp;#39;m used to meds. So maybe I&amp;#39;ll put a plastic bag around my head, cut my wrists and stay under a hot shower. Dunno if I&amp;#39;ll make it. Dunno why I tell you this. I&amp;#39;m empty as fuck. &lt;/p&gt;\n\n&lt;p&gt;PS: forgive my language mistakes, English isn&amp;#39;t my mother tongue.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I've been suicidal since..........I don't know. Ever. Even as a child. My first suicide attempt were on april 2009 when I was 16. Just before I deprived myself of food (but I'm not anorexic) and burnt me twice with sulfuric acid in chemistry class. My parents put me in a psychiatric hospital; it was so awful I won't ever ever go back (no separation between men and women or even children and adults, I was bonded to my bed and yelled at and treated like a beast...). I then started to drink heavily and sometimes add meds to it. My second serious suicide attempt was on october 2012. Then august 2013. Between these two I cut myself five times and burnt me with my cig six times, one of them really bad. Lately, a few days later, I cut myself 18 times - by the way I only count the cuts which will lead to lifetime scars. My boyfriend will be back in a few days and if he finds out he will go mad. I failed my college year. I can't be a good trainee in my company. I can't go to a doctor because I can't be locked again in a psychiatric hospital it would break me. So what do I do? I'm also an alcoholic, I drink 2 liters a day. It's about three or four bottles of wine. What do I do? I planned on killing myself with alcohol and a box of antidepressive pills tomorrow. Dunno if it will kill me since I'm used to meds. So maybe I'll put a plastic bag around my head, cut my wrists and stay under a hot shower. Dunno if I'll make it. Dunno why I tell you this. I'm empty as fuck. \n\nPS: forgive my language mistakes, English isn't my mother tongue.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2533gd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Payinghug", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2533gd/i_plan_on_dying_tomorrow_night/", "name": "t3_2533gd", "created": 1399621636.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2533gd/i_plan_on_dying_tomorrow_night/", "author_flair_text": null, "title": "I plan on dying tomorrow night", "created_utc": 1399592836.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd78g7", "gilded": 0, "author": "maxwellanderson", "parent_id": "t3_2533gd", "approved_by": null, "body": "I am so sorry for what you're going through. :/ Do you want to talk to me about it? If not, I understand. If so, I hope I could at least give you some solace with my story.\n\nThank you for reaching out, either way.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry for what you&amp;#39;re going through. :/ Do you want to talk to me about it? If not, I understand. If so, I hope I could at least give you some solace with my story.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reaching out, either way.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2533gd", "score_hidden": false, "name": "t1_chd78g7", "created": 1399623747.0, "author_flair_text": null, "created_utc": 1399594947.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdbilq", "gilded": 0, "author": "infec1988", "parent_id": "t3_2533gd", "approved_by": null, "body": "The best thing is talking, talking with your boyfriend, he will not be mad, he will seem to be mad but he will understand. Talking is a medicine for everybody. like maxwellanderson said, you can talk to him or me, if you rather talk about this too not so known people. (like you see english is also not my native language ;) )\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best thing is talking, talking with your boyfriend, he will not be mad, he will seem to be mad but he will understand. Talking is a medicine for everybody. like maxwellanderson said, you can talk to him or me, if you rather talk about this too not so known people. (like you see english is also not my native language ;) )&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2533gd", "score_hidden": false, "name": "t1_chdbilq", "created": 1399632051.0, "author_flair_text": null, "created_utc": 1399603251.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdbn53", "gilded": 0, "author": "Zaphod_042", "parent_id": "t3_2533gd", "approved_by": null, "body": "I will not pretend to understand the situation you have.  Joining AA might be a good place to start.  You'll find support there and I suspect the alcohol only makes your problems worse.  You have courage to come here and try to get help.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will not pretend to understand the situation you have.  Joining AA might be a good place to start.  You&amp;#39;ll find support there and I suspect the alcohol only makes your problems worse.  You have courage to come here and try to get help.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2533gd", "score_hidden": false, "name": "t1_chdbn53", "created": 1399632314.0, "author_flair_text": null, "created_utc": 1399603514.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]