[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I failed all my classes this semester. I didn&amp;#39;t even go to the finals. &lt;/p&gt;\n\n&lt;p&gt;This was supposed to be a new start after getting removed from my university for my mental health. Everything was supposed to be better, I was supposed to do something that my parents would be proud of for once. I fucked it all up.&lt;/p&gt;\n\n&lt;p&gt;I started skipping my classes when the panic attacks started setting in again, when the thoughts of uselessness and worthlessness settled and I realized that I couldn&amp;#39;t fucking put myself through those classes for a major I hate. I would hide in the bathroom and cry like the loser I am, I&amp;#39;d want to hide and never have to deal with any of this again.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t tell my parents any of it though. I didn&amp;#39;t want them to be disappointed with me. I didn&amp;#39;t want them to hate me. I didn&amp;#39;t want them to know that I made them waste $2000 for fucking nothing. &lt;/p&gt;\n\n&lt;p&gt;Now here I am. The weight of all of this shit just came crashing down on me and I&amp;#39;m sitting in my room crying and cutting because I know this was the last straw. I know this is when they&amp;#39;ll fucking give up on me entirely and realize how much of an utter and complete fuck up I really am. This is where I realize that the only way out is by going out myself. Where I realize that I really wasn&amp;#39;t even fucking meant to be alive in the first place. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t stand to see them when they find out what I&amp;#39;ve done for this semester, after telling them everything was okay and I was passing my classes. I didn&amp;#39;t want to hurt them. I didn&amp;#39;t want to make them fight more than they already do. &lt;/p&gt;\n\n&lt;p&gt;And here I am. Knowing that they&amp;#39;re going to find out and then treat me like the terrible fucking human I am. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Everyone, thank you so much. I really appreciate the help and kind words. Just trying to calm down now and take my mind off of it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I failed all my classes this semester. I didn't even go to the finals. \n\nThis was supposed to be a new start after getting removed from my university for my mental health. Everything was supposed to be better, I was supposed to do something that my parents would be proud of for once. I fucked it all up.\n\nI started skipping my classes when the panic attacks started setting in again, when the thoughts of uselessness and worthlessness settled and I realized that I couldn't fucking put myself through those classes for a major I hate. I would hide in the bathroom and cry like the loser I am, I'd want to hide and never have to deal with any of this again.\n\nI didn't tell my parents any of it though. I didn't want them to be disappointed with me. I didn't want them to hate me. I didn't want them to know that I made them waste $2000 for fucking nothing. \n\nNow here I am. The weight of all of this shit just came crashing down on me and I'm sitting in my room crying and cutting because I know this was the last straw. I know this is when they'll fucking give up on me entirely and realize how much of an utter and complete fuck up I really am. This is where I realize that the only way out is by going out myself. Where I realize that I really wasn't even fucking meant to be alive in the first place. \n\nI can't stand to see them when they find out what I've done for this semester, after telling them everything was okay and I was passing my classes. I didn't want to hurt them. I didn't want to make them fight more than they already do. \n\nAnd here I am. Knowing that they're going to find out and then treat me like the terrible fucking human I am. \n\nEDIT: Everyone, thank you so much. I really appreciate the help and kind words. Just trying to calm down now and take my mind off of it. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2557e9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ForwardTwo", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399680402.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2557e9/i_really_fucked_up_i_have_managed_to_screw_up/", "name": "t3_2557e9", "created": 1399685993.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2557e9/i_really_fucked_up_i_have_managed_to_screw_up/", "author_flair_text": null, "title": "I really fucked up. I have managed to screw up everything.", "created_utc": 1399657193.0, "ups": 13, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdwpjx", "gilded": 0, "author": "Contranine", "parent_id": "t3_2557e9", "approved_by": null, "body": "I was in exactly your position when I hit my early 20's.  I crashed and burned out of university, got depressed, blew a bunch of money and ended up in a very dark place; not in that order, all at once really.\n\nIt felt like I was the family fuckup, and they were just going to toss me to the side because that was my last chance.\n\nBut your family probably expected college because it's what they did, and it's what school always told you was the next goal, so it's what you told your parents your goal was.  If you had told them ytou had wanted to be a bee keeper for the last 10 years; they'd probably have supported you doing that.  Now your life plan is off course, and you feel like a fuckup with no future.  You are not a fuckup, and you have a future.  Anyway, it's the 21st century.  There are lots of options for learning, online courses, evening classes and so on.  There is always more than one route up the metaphorical mountain.\n\nMoney is numbers and paper.  Forget about that for now.  Absolute worst thing, you get a job and start paying it back.\n\nBut first thing.\n\nYou need to talk to your family.  It won't be an easy conversation, but know I have been in your exact shoes, and I'll be there in spirit beside you.  \n\nJust please; do not kill yourself over this.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in exactly your position when I hit my early 20&amp;#39;s.  I crashed and burned out of university, got depressed, blew a bunch of money and ended up in a very dark place; not in that order, all at once really.&lt;/p&gt;\n\n&lt;p&gt;It felt like I was the family fuckup, and they were just going to toss me to the side because that was my last chance.&lt;/p&gt;\n\n&lt;p&gt;But your family probably expected college because it&amp;#39;s what they did, and it&amp;#39;s what school always told you was the next goal, so it&amp;#39;s what you told your parents your goal was.  If you had told them ytou had wanted to be a bee keeper for the last 10 years; they&amp;#39;d probably have supported you doing that.  Now your life plan is off course, and you feel like a fuckup with no future.  You are not a fuckup, and you have a future.  Anyway, it&amp;#39;s the 21st century.  There are lots of options for learning, online courses, evening classes and so on.  There is always more than one route up the metaphorical mountain.&lt;/p&gt;\n\n&lt;p&gt;Money is numbers and paper.  Forget about that for now.  Absolute worst thing, you get a job and start paying it back.&lt;/p&gt;\n\n&lt;p&gt;But first thing.&lt;/p&gt;\n\n&lt;p&gt;You need to talk to your family.  It won&amp;#39;t be an easy conversation, but know I have been in your exact shoes, and I&amp;#39;ll be there in spirit beside you.  &lt;/p&gt;\n\n&lt;p&gt;Just please; do not kill yourself over this.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_chdwpjx", "created": 1399694685.0, "author_flair_text": null, "created_utc": 1399665885.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che0jpi", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t1_chduv56", "approved_by": null, "body": "If your parents care more about the 2000$ than your health you should with them to run under a bus, anyway.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your parents care more about the 2000$ than your health you should with them to run under a bus, anyway.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_che0jpi", "created": 1399703445.0, "author_flair_text": null, "created_utc": 1399674645.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chduv56", "gilded": 0, "author": "whiskers_biskers", "parent_id": "t3_2557e9", "approved_by": null, "body": "It sounds like college is not for you and that is okay.  It's not the path that everyone is meant to take.  It doesn't mean that you're a failure or any less of a person.  Hell, if you would be happy working in the produce section of your grocery store the rest of your life then do that!  You don't have to live up to someone else's standards.  I know it will be tough to tell your parents but once you do you will feel much better.  Even if they react poorly it will still be a weight off your shoulders.  Just be honest with them.   It sounds like they know you have issues with anxiety so this won't be a total shock to them.  Also, how old are you?  Sounds like you might be in your early 20's.  Did you know that being afraid of disappointing your parents is a really common thing?  What you're feeling is natural.  Fight or flight.  I heard someone give a talk one time about how we all have our closets to come out of whether you're gay or straight.  It just comes down to a hard conversation.  That is all it is.  No matter how hard it is for the words to come out of your mouth it will be for the better.  Just because this path didn't work doesn't mean there aren't hundreds of other paths to go down. You can offer to pay back the 2000 with payment plans if needed.  They are your parents and what it comes down to is they want you to be happy and succeed.  Your job is to tell them what will make you happy and feel successful.  Once you're on the same page then conversations become a lot easier.  Good luck to you in this crazy world called life.    We're all in this together.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like college is not for you and that is okay.  It&amp;#39;s not the path that everyone is meant to take.  It doesn&amp;#39;t mean that you&amp;#39;re a failure or any less of a person.  Hell, if you would be happy working in the produce section of your grocery store the rest of your life then do that!  You don&amp;#39;t have to live up to someone else&amp;#39;s standards.  I know it will be tough to tell your parents but once you do you will feel much better.  Even if they react poorly it will still be a weight off your shoulders.  Just be honest with them.   It sounds like they know you have issues with anxiety so this won&amp;#39;t be a total shock to them.  Also, how old are you?  Sounds like you might be in your early 20&amp;#39;s.  Did you know that being afraid of disappointing your parents is a really common thing?  What you&amp;#39;re feeling is natural.  Fight or flight.  I heard someone give a talk one time about how we all have our closets to come out of whether you&amp;#39;re gay or straight.  It just comes down to a hard conversation.  That is all it is.  No matter how hard it is for the words to come out of your mouth it will be for the better.  Just because this path didn&amp;#39;t work doesn&amp;#39;t mean there aren&amp;#39;t hundreds of other paths to go down. You can offer to pay back the 2000 with payment plans if needed.  They are your parents and what it comes down to is they want you to be happy and succeed.  Your job is to tell them what will make you happy and feel successful.  Once you&amp;#39;re on the same page then conversations become a lot easier.  Good luck to you in this crazy world called life.    We&amp;#39;re all in this together.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_chduv56", "created": 1399690863.0, "author_flair_text": null, "created_utc": 1399662063.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdwany", "gilded": 0, "author": "KRAUSE1", "parent_id": "t3_2557e9", "approved_by": null, "body": "People make it seem like you need to go to a university to be successful. It's not true at all. Your path might be much different than what your parents expect. Make your choices for you and not your parents. Don't give up yet. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People make it seem like you need to go to a university to be successful. It&amp;#39;s not true at all. Your path might be much different than what your parents expect. Make your choices for you and not your parents. Don&amp;#39;t give up yet. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_chdwany", "created": 1399693813.0, "author_flair_text": null, "created_utc": 1399665013.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdye9d", "gilded": 0, "author": "lilsunnybee", "parent_id": "t3_2557e9", "approved_by": null, "body": "Taking a break from school is a pretty simple process. There's usually just one form to fill out, and you can take a semester, or two, or more off if that's what you need to feel ready to come back. Just don't hate yourself for failing when there's so much you're dealing with emotionally. If your brain's not up to it, college is impossible.\n\nYou do probably need to come clean to your parents, but they need to know what you're going through mentally too in addition to the classes thing. Maybe they can help, at least financially or with insurance for meds / therapy, etc.\n\nOr fuck it, if you have any friends you could live with, and find a part-time job to at least cover rent, you can just be on your own doing your own thing for a while. Besides the job, only spend your free time doing stuff you like to do, and you won't have to worry about studying or tests or your future or anything like that until you're feeling healthier.\n\nJust don't give up yet! There's a lot of us out here that have gone through the same thing (or similar at least) and want to help.\n\nEDIT: Oh and sometimes you can even do a reverse medical leave with the school, if you have some additional documentation, which would cancel out the F's and allow you to take those classes again in the future (if you want!). Not even doing the finals is actually pretty good evidence you had something more serious going on, and that the F's weren't indicative of your normal performance or best effort.\n\n", "edited": 1399669758.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Taking a break from school is a pretty simple process. There&amp;#39;s usually just one form to fill out, and you can take a semester, or two, or more off if that&amp;#39;s what you need to feel ready to come back. Just don&amp;#39;t hate yourself for failing when there&amp;#39;s so much you&amp;#39;re dealing with emotionally. If your brain&amp;#39;s not up to it, college is impossible.&lt;/p&gt;\n\n&lt;p&gt;You do probably need to come clean to your parents, but they need to know what you&amp;#39;re going through mentally too in addition to the classes thing. Maybe they can help, at least financially or with insurance for meds / therapy, etc.&lt;/p&gt;\n\n&lt;p&gt;Or fuck it, if you have any friends you could live with, and find a part-time job to at least cover rent, you can just be on your own doing your own thing for a while. Besides the job, only spend your free time doing stuff you like to do, and you won&amp;#39;t have to worry about studying or tests or your future or anything like that until you&amp;#39;re feeling healthier.&lt;/p&gt;\n\n&lt;p&gt;Just don&amp;#39;t give up yet! There&amp;#39;s a lot of us out here that have gone through the same thing (or similar at least) and want to help.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Oh and sometimes you can even do a reverse medical leave with the school, if you have some additional documentation, which would cancel out the F&amp;#39;s and allow you to take those classes again in the future (if you want!). Not even doing the finals is actually pretty good evidence you had something more serious going on, and that the F&amp;#39;s weren&amp;#39;t indicative of your normal performance or best effort.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_chdye9d", "created": 1399698344.0, "author_flair_text": null, "created_utc": 1399669544.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che1jcf", "gilded": 0, "author": "iredditi", "parent_id": "t3_2557e9", "approved_by": null, "body": "I did what you did. \n\nI lied--I was ashamed--I was in denial. I survived. But I kept fucking up in other ways. \n\nI wish I had advice; I had sympathy. Here's what I'll tell you--if they're worth a damn, they will understand if you tell them what you told us. \n\nTell them it became overwhelming and you were too ashamed to tell them. \n\nI wish you well. I'll tell you, you are one of thousands of students that reach a new low in college or the \"wrong\" major.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did what you did. &lt;/p&gt;\n\n&lt;p&gt;I lied--I was ashamed--I was in denial. I survived. But I kept fucking up in other ways. &lt;/p&gt;\n\n&lt;p&gt;I wish I had advice; I had sympathy. Here&amp;#39;s what I&amp;#39;ll tell you--if they&amp;#39;re worth a damn, they will understand if you tell them what you told us. &lt;/p&gt;\n\n&lt;p&gt;Tell them it became overwhelming and you were too ashamed to tell them. &lt;/p&gt;\n\n&lt;p&gt;I wish you well. I&amp;#39;ll tell you, you are one of thousands of students that reach a new low in college or the &amp;quot;wrong&amp;quot; major.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_che1jcf", "created": 1399705917.0, "author_flair_text": null, "created_utc": 1399677117.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che2sps", "gilded": 0, "author": "merespeckofdust", "parent_id": "t3_2557e9", "approved_by": null, "body": "Fuck scho, its supposed to give you confidence not put you down like this. Don' worry everyone sucks at school at some point, you'll climb back dont worry dude.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck scho, its supposed to give you confidence not put you down like this. Don&amp;#39; worry everyone sucks at school at some point, you&amp;#39;ll climb back dont worry dude.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_che2sps", "created": 1399708947.0, "author_flair_text": null, "created_utc": 1399680147.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che0ge4", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t3_2557e9", "approved_by": null, "body": "It sounds like your parents are fucking idiots. I left uni too, because of the panic attacks and depression. I don't blame myself, I blame whoever fucking gave me panic attacks and depression because I wasn't like that before. Fuck them. Fuck them all. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your parents are fucking idiots. I left uni too, because of the panic attacks and depression. I don&amp;#39;t blame myself, I blame whoever fucking gave me panic attacks and depression because I wasn&amp;#39;t like that before. Fuck them. Fuck them all. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2557e9", "score_hidden": false, "name": "t1_che0ge4", "created": 1399703225.0, "author_flair_text": null, "created_utc": 1399674425.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]