[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel I deserve happiness.  I&amp;#39;ve caused other people in my life hurt and sadness to the point where they have told me I&amp;#39;m the worst thing that&amp;#39;s ever happened to them.  My girlfriend is mad at me and me closest friend is drifting a part from me and is angry at me a lot.  I&amp;#39;m from a privelged family and have lots of life options, but I&amp;#39;m not happy.  I&amp;#39;m 22, study at university and live at home. I bitch and moan to my mom and dad and have no respect for myself or them.  I&amp;#39;m constantly angry and irritated and anxious.  There are times like now where I want to rid myself from this Earth.  I feel the main thing I cause to other&amp;#39;s is pain.  My depression is hard on my mother, girlfriend, and friend.  All my girlfriend wants is for me to be happy and I can&amp;#39;t even do that.  I am extremely ashamed of myself as a boyfriend, friend, and son, but most of all as a human being.  My girlfriend, mother, and friend are the most caring people ever.  I don&amp;#39;t feel I can ever live up to the type of people they are.  I don&amp;#39;t ever think I will ever change.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I&amp;#39;m so scared my girlfriend will leave me since I&amp;#39;m pushing her away on how I&amp;#39;m acting.  She always asks how I am.  Her last semester at university is almost done and I&amp;#39;m afraid she&amp;#39;ll leave me because she&amp;#39;ll be applying to grad school possibly and things will be changing.  I don&amp;#39;t want that to happen&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't feel I deserve happiness.  I've caused other people in my life hurt and sadness to the point where they have told me I'm the worst thing that's ever happened to them.  My girlfriend is mad at me and me closest friend is drifting a part from me and is angry at me a lot.  I'm from a privelged family and have lots of life options, but I'm not happy.  I'm 22, study at university and live at home. I bitch and moan to my mom and dad and have no respect for myself or them.  I'm constantly angry and irritated and anxious.  There are times like now where I want to rid myself from this Earth.  I feel the main thing I cause to other's is pain.  My depression is hard on my mother, girlfriend, and friend.  All my girlfriend wants is for me to be happy and I can't even do that.  I am extremely ashamed of myself as a boyfriend, friend, and son, but most of all as a human being.  My girlfriend, mother, and friend are the most caring people ever.  I don't feel I can ever live up to the type of people they are.  I don't ever think I will ever change.\n\nEDIT: I'm so scared my girlfriend will leave me since I'm pushing her away on how I'm acting.  She always asks how I am.  Her last semester at university is almost done and I'm afraid she'll leave me because she'll be applying to grad school possibly and things will be changing.  I don't want that to happen", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ubak", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "donny101", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399354553.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ubak/i_really_want_to_die/", "name": "t3_24ubak", "created": 1399382552.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ubak/i_really_want_to_die/", "author_flair_text": null, "title": "i really want to die.", "created_utc": 1399353752.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chazby8", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24ubak", "approved_by": null, "body": "Don't be ashamed of yourself for this. Would you be ashamed if you had cancer and were dying from it? I don't think you would, depression is the same way and it is killing you on the inside. You might want to look into a therapist or doctor or someone to just talk to. If you don't want to go get medical help maybe just try to talk to your girlfriend about it.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be ashamed of yourself for this. Would you be ashamed if you had cancer and were dying from it? I don&amp;#39;t think you would, depression is the same way and it is killing you on the inside. You might want to look into a therapist or doctor or someone to just talk to. If you don&amp;#39;t want to go get medical help maybe just try to talk to your girlfriend about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ubak", "score_hidden": false, "name": "t1_chazby8", "created": 1399393344.0, "author_flair_text": null, "created_utc": 1399389744.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]