[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;This could get long, so if you are t interested in reading a short essay on reddit, feel free to click away. I do not and will not blame you&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Just for background, I&amp;#39;ve been depressed before. I was bullied a lot when I was younger, and it has had an affect on me; I am extremely self conscious and have shitty self esteem, even though I hide it. I got past this, but it&amp;#39;s come back. And I thought I knew what depression was before, but I know realize I had no idea what it is really like back then. &lt;/p&gt;\n\n&lt;p&gt;All of my life, I&amp;#39;ve managed to become the disposable friend. I&amp;#39;m just there, never the best friend, never the second best, the third best, the fourth; I&amp;#39;m just there. In every group of friends I join, I always end up being the targeted one. The one who doesn&amp;#39;t need to be around. I&amp;#39;m pretty sure this is because I don&amp;#39;t talk much, and because I just take all the insults instead of dishing them back. If I asked everyone around me who their top 3 people to hang around with are, I wouldn&amp;#39;t make it on anyone&amp;#39;s list in the school. It sucks. It sucks really bad. As you can imagine, this makes me feel down. But this isn&amp;#39;t the only reason.&lt;/p&gt;\n\n&lt;p&gt;Unrequited love. I&amp;#39;ve been hit hard with it. I didn&amp;#39;t realize how much it hurts. I could write thousands of words about this person, and what they make me feel. But I&amp;#39;ll try my best and summarize it:&lt;/p&gt;\n\n&lt;p&gt;This person makes me feel so happy. This person is talented, funny, caring, persistant, outgoing and so, so fucking beautiful. This person has flaws, as anyone does, but the positives just make the negatives invisible. This person is also killing me. The fact is, I don&amp;#39;t have a single chance with them and I never did. They are happy with their current relationship, and even if they gave up on this relationship I wouldn&amp;#39;t be their plan a, b, c, all the way to z. It hurts so much knowing that I can never be there for them, talk to them, be with them all the time. Because it&amp;#39;s all I want to do. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost my appetite, I&amp;#39;ve stopped sleeping properly, I&amp;#39;ve stopped going places in hopes this person will invite me somewhere, and much more. Every time I get a message from this person, I feel incredible. But then, when they don&amp;#39;t reply, the pain of this empty feeling hits hard. Everytime I am with this person, I feel a little bit happier. When I see this person taking to other people, and ignoring me, I somehow feel even more broken.&lt;/p&gt;\n\n&lt;p&gt;But I go through all this pain, because all i want is for this person to be happy. I would live through this misery for ever and ever, just to make sure they have a perfect life. And I can&amp;#39;t help them be happy, which makes this so much worse.&lt;/p&gt;\n\n&lt;p&gt;This person doesn&amp;#39;t need me to be happy. But I need them to be happy. And I&amp;#39;m not going to get that. I have felt pain before, but no where near this. This is eating me alive. It kills. It&amp;#39;s not just mental torment, my chest feels tight all the time. The pain is all I feel.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in school, and I&amp;#39;m still quite young. I won&amp;#39;t give an exact age, for the sake of remaining completely anonymous, but I&amp;#39;m young. This is my whole world at the moment. And I can&amp;#39;t escape it.&lt;/p&gt;\n\n&lt;p&gt;I could try and wait it out. The more I don&amp;#39;t see them, the faster I will move on, yeah? Except, I see this person everyday. They are one of my closest friends, and to let ANY of this information get out could spell disaster. I can&amp;#39;t risk losing the only person I trust anymore, and the only person that makes me happy. I have to keep it all in.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s where the title comes in. I don&amp;#39;t know how much longer I can do this. I don&amp;#39;t know how much longer I can keep it all in. It hurts too much. But if I don&amp;#39;t, I&amp;#39;m probably going to ruin everything. I don&amp;#39;t know how I have been doing this for so long (only 8 months so far). I really don&amp;#39;t. And I don&amp;#39;t see a way out. Like I said, I&amp;#39;m young, this is my whole life at the moment.&lt;/p&gt;\n\n&lt;p&gt;I will never commit suicide; I couldn&amp;#39;t. The pain it would cause my family is terrible, and I will never do it. But I&amp;#39;m scared I&amp;#39;m going to do something else, like cutting or something. I have no other way to cope. I&amp;#39;m trapped. &lt;/p&gt;\n\n&lt;p&gt;Any advice, and I mean ANY advice is appreciated. A single comment is appreciated. Thank you for taking your time to read this. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**This could get long, so if you are t interested in reading a short essay on reddit, feel free to click away. I do not and will not blame you**\n\nJust for background, I've been depressed before. I was bullied a lot when I was younger, and it has had an affect on me; I am extremely self conscious and have shitty self esteem, even though I hide it. I got past this, but it's come back. And I thought I knew what depression was before, but I know realize I had no idea what it is really like back then. \n\nAll of my life, I've managed to become the disposable friend. I'm just there, never the best friend, never the second best, the third best, the fourth; I'm just there. In every group of friends I join, I always end up being the targeted one. The one who doesn't need to be around. I'm pretty sure this is because I don't talk much, and because I just take all the insults instead of dishing them back. If I asked everyone around me who their top 3 people to hang around with are, I wouldn't make it on anyone's list in the school. It sucks. It sucks really bad. As you can imagine, this makes me feel down. But this isn't the only reason.\n\nUnrequited love. I've been hit hard with it. I didn't realize how much it hurts. I could write thousands of words about this person, and what they make me feel. But I'll try my best and summarize it:\n\nThis person makes me feel so happy. This person is talented, funny, caring, persistant, outgoing and so, so fucking beautiful. This person has flaws, as anyone does, but the positives just make the negatives invisible. This person is also killing me. The fact is, I don't have a single chance with them and I never did. They are happy with their current relationship, and even if they gave up on this relationship I wouldn't be their plan a, b, c, all the way to z. It hurts so much knowing that I can never be there for them, talk to them, be with them all the time. Because it's all I want to do. \n\nI've lost my appetite, I've stopped sleeping properly, I've stopped going places in hopes this person will invite me somewhere, and much more. Every time I get a message from this person, I feel incredible. But then, when they don't reply, the pain of this empty feeling hits hard. Everytime I am with this person, I feel a little bit happier. When I see this person taking to other people, and ignoring me, I somehow feel even more broken.\n\nBut I go through all this pain, because all i want is for this person to be happy. I would live through this misery for ever and ever, just to make sure they have a perfect life. And I can't help them be happy, which makes this so much worse.\n\nThis person doesn't need me to be happy. But I need them to be happy. And I'm not going to get that. I have felt pain before, but no where near this. This is eating me alive. It kills. It's not just mental torment, my chest feels tight all the time. The pain is all I feel.\n\nI'm in school, and I'm still quite young. I won't give an exact age, for the sake of remaining completely anonymous, but I'm young. This is my whole world at the moment. And I can't escape it.\n\nI could try and wait it out. The more I don't see them, the faster I will move on, yeah? Except, I see this person everyday. They are one of my closest friends, and to let ANY of this information get out could spell disaster. I can't risk losing the only person I trust anymore, and the only person that makes me happy. I have to keep it all in.\n\nAnd that's where the title comes in. I don't know how much longer I can do this. I don't know how much longer I can keep it all in. It hurts too much. But if I don't, I'm probably going to ruin everything. I don't know how I have been doing this for so long (only 8 months so far). I really don't. And I don't see a way out. Like I said, I'm young, this is my whole life at the moment.\n\nI will never commit suicide; I couldn't. The pain it would cause my family is terrible, and I will never do it. But I'm scared I'm going to do something else, like cutting or something. I have no other way to cope. I'm trapped. \n\nAny advice, and I mean ANY advice is appreciated. A single comment is appreciated. Thank you for taking your time to read this. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249f0c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "phtbockaahtttirtkol", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249f0c/i_seriously_dont_know_how_much_longer_i_can_keep/", "name": "t3_249f0c", "created": 1398786723.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249f0c/i_seriously_dont_know_how_much_longer_i_can_keep/", "author_flair_text": null, "title": "I seriously don't know how much longer I can keep doing this...", "created_utc": 1398757923.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch597up", "gilded": 0, "author": "Mr_JK", "parent_id": "t1_ch4wm7i", "approved_by": null, "body": "I know the feeling, and overtime it can dissipate. I don't know how I did it so I'm sorry I don't really have specific advice on getting over unrequited love but what I can say is that the feelings can disappear over time. You need to realize no matter how hung up you are on the now that there is a future. And this is just one story of the rest of your life. Don't get stuck on the belief that this is your whole life at the moment. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know the feeling, and overtime it can dissipate. I don&amp;#39;t know how I did it so I&amp;#39;m sorry I don&amp;#39;t really have specific advice on getting over unrequited love but what I can say is that the feelings can disappear over time. You need to realize no matter how hung up you are on the now that there is a future. And this is just one story of the rest of your life. Don&amp;#39;t get stuck on the belief that this is your whole life at the moment. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249f0c", "score_hidden": false, "name": "t1_ch597up", "created": 1398826232.0, "author_flair_text": null, "created_utc": 1398797432.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4wm7i", "gilded": 0, "author": "phtbockaahtttirtkol", "parent_id": "t1_ch4wgk2", "approved_by": null, "body": "I'm not 100% sure how the American school system works (I'm Australian) so I don't know if I'm in high school for you guys yet. If not, I'd only be a year off probably.\n\nI just feel to down to do anything to make myself feel better. Every single day I have to go to school, and every single time I look at this person it's like I run into a brick wall. I get slammed with emotions of pain and love. It's really hard to describe, but it's hard to cope with.\n\nI have great grades, and a supportive family, so I do have stuff to look forward to in the future. But all I can see is what is happening right now. I'm completely stuck. And it hurts.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not 100% sure how the American school system works (I&amp;#39;m Australian) so I don&amp;#39;t know if I&amp;#39;m in high school for you guys yet. If not, I&amp;#39;d only be a year off probably.&lt;/p&gt;\n\n&lt;p&gt;I just feel to down to do anything to make myself feel better. Every single day I have to go to school, and every single time I look at this person it&amp;#39;s like I run into a brick wall. I get slammed with emotions of pain and love. It&amp;#39;s really hard to describe, but it&amp;#39;s hard to cope with.&lt;/p&gt;\n\n&lt;p&gt;I have great grades, and a supportive family, so I do have stuff to look forward to in the future. But all I can see is what is happening right now. I&amp;#39;m completely stuck. And it hurts.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249f0c", "score_hidden": false, "name": "t1_ch4wm7i", "created": 1398789474.0, "author_flair_text": null, "created_utc": 1398760674.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4wgk2", "gilded": 0, "author": "Mr_JK", "parent_id": "t3_249f0c", "approved_by": null, "body": "I'm sorta like you I don't know if I fall into anyone's best friend list or top people to hang out with list and I've been in love with girls who did not love me back in the past. I'm gonna go on a hunch and say you're in high school. I'm not gonna say life gets better and just push on through but what I will say that it is possible to make it better. Your young and assuming you're in high school you have the time to make the right choices in life to make your life better and you definitely have the time to move on. Self harm is only temporary relief from feeling depressed, the long term solution requires hard work to build yourself up mentally and physically. But you have time so work on those traits and you'll see these problems disappear.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorta like you I don&amp;#39;t know if I fall into anyone&amp;#39;s best friend list or top people to hang out with list and I&amp;#39;ve been in love with girls who did not love me back in the past. I&amp;#39;m gonna go on a hunch and say you&amp;#39;re in high school. I&amp;#39;m not gonna say life gets better and just push on through but what I will say that it is possible to make it better. Your young and assuming you&amp;#39;re in high school you have the time to make the right choices in life to make your life better and you definitely have the time to move on. Self harm is only temporary relief from feeling depressed, the long term solution requires hard work to build yourself up mentally and physically. But you have time so work on those traits and you&amp;#39;ll see these problems disappear.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249f0c", "score_hidden": false, "name": "t1_ch4wgk2", "created": 1398788539.0, "author_flair_text": null, "created_utc": 1398759739.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]