[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 20 years old. About to &amp;quot;finish&amp;quot; my short time in college, though I stopped bothering to attend classes about 2 months ago. There&amp;#39;s no money left.&lt;/p&gt;\n\n&lt;p&gt;I live with my mother. My dad died 3 years ago. I attended a state university for 3 semesters, failed a few classes, can&amp;#39;t afford any more. I went to an advanced and fairly prestigious high school, but I&amp;#39;ve always been lazy and felt outpaced by my peers. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been looking for a job for a while now, because my mom&amp;#39;s salary is not enough. I feel horrible for being a burden on her and wasting such an immense amount of money on school. I had a 2 week job at the end of last year, given to me by a friend of my mother&amp;#39;s, a temp job at an office basically, doing a menial task. It was always temporary and had no potential to lead to anything. Since then I&amp;#39;ve applied online to several entry level jobs at stores (Target, pet store, etc) and gotten no responses. I&amp;#39;ve done one interview, at a grocery store, that was a complete disaster.&lt;/p&gt;\n\n&lt;p&gt;I have severe social anxiety, I always have, but I feel it gets worse as I get older. Going to the grocery store is enough to spark a dozen shitty anxious feelings. But having to talk to anyone outside of my immediate family makes me blush bright red, feel sick, sweat, etc. That&amp;#39;s how I ruined the one interview I had a chance at, and why I&amp;#39;m completely incapable of doing a lot of jobs. And a good reason why I did badly in school.&lt;/p&gt;\n\n&lt;p&gt;I hate everything about myself. I have no good traits. I&amp;#39;m short, chubby, have horrible skin, basically everyone thinks I&amp;#39;m 14 (in the awkward looking teenager way, not a good way). I have no real skills, I&amp;#39;m incompetent at basically everything (didn&amp;#39;t learn to drive until i was 19, fail at most basic tasks that others manage to do with no problem) and don&amp;#39;t even have any geek talents like programming or computer work, despite using one all day I don&amp;#39;t really know shit.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what the fuck I&amp;#39;m writing. But I see no hope for myself. I can&amp;#39;t get a job, I can&amp;#39;t KEEP a job, I can&amp;#39;t go back to school. I have no real friends, I&amp;#39;ve never kissed a girl and never will. I&amp;#39;m smaller, weaker, dumber, and have less life experience than the vast majority of 12 year olds and I&amp;#39;m already 20. I wasted the part of life where you&amp;#39;re supposed to learn and get your shit together, now all I have left is the decline and I&amp;#39;m too far behind. I can&amp;#39;t imagine what my life could be like even 1 year from now other than dead. I can&amp;#39;t continue being a financial drain on my parent but I can&amp;#39;t support myself either. I&amp;#39;m such a disgusting person and I hate myself. I wish there was an easy way to just disappear without hurting anyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 20 years old. About to \"finish\" my short time in college, though I stopped bothering to attend classes about 2 months ago. There's no money left.\n\nI live with my mother. My dad died 3 years ago. I attended a state university for 3 semesters, failed a few classes, can't afford any more. I went to an advanced and fairly prestigious high school, but I've always been lazy and felt outpaced by my peers. \n\nI've been looking for a job for a while now, because my mom's salary is not enough. I feel horrible for being a burden on her and wasting such an immense amount of money on school. I had a 2 week job at the end of last year, given to me by a friend of my mother's, a temp job at an office basically, doing a menial task. It was always temporary and had no potential to lead to anything. Since then I've applied online to several entry level jobs at stores (Target, pet store, etc) and gotten no responses. I've done one interview, at a grocery store, that was a complete disaster.\n\nI have severe social anxiety, I always have, but I feel it gets worse as I get older. Going to the grocery store is enough to spark a dozen shitty anxious feelings. But having to talk to anyone outside of my immediate family makes me blush bright red, feel sick, sweat, etc. That's how I ruined the one interview I had a chance at, and why I'm completely incapable of doing a lot of jobs. And a good reason why I did badly in school.\n\nI hate everything about myself. I have no good traits. I'm short, chubby, have horrible skin, basically everyone thinks I'm 14 (in the awkward looking teenager way, not a good way). I have no real skills, I'm incompetent at basically everything (didn't learn to drive until i was 19, fail at most basic tasks that others manage to do with no problem) and don't even have any geek talents like programming or computer work, despite using one all day I don't really know shit.\n\nI don't know what the fuck I'm writing. But I see no hope for myself. I can't get a job, I can't KEEP a job, I can't go back to school. I have no real friends, I've never kissed a girl and never will. I'm smaller, weaker, dumber, and have less life experience than the vast majority of 12 year olds and I'm already 20. I wasted the part of life where you're supposed to learn and get your shit together, now all I have left is the decline and I'm too far behind. I can't imagine what my life could be like even 1 year from now other than dead. I can't continue being a financial drain on my parent but I can't support myself either. I'm such a disgusting person and I hate myself. I wish there was an easy way to just disappear without hurting anyone.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wqlv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ghostidiot", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wqlv/i_see_no_future_for_myself/", "name": "t3_24wqlv", "created": 1399449547.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wqlv/i_see_no_future_for_myself/", "author_flair_text": null, "title": "I see no future for myself", "created_utc": 1399420747.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbpaah", "gilded": 0, "author": "kwallcovina", "parent_id": "t3_24wqlv", "approved_by": null, "body": "I was there at 20. No friends except gf, thick coke bottle glasses, acne, terrible at multitasking, quit a dead end job due to anxiety. My first and so far only attempt was then.\n\nI'm 24 now and I still don't feel like I have my shit together. But I'm at my own pace, and so are you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was there at 20. No friends except gf, thick coke bottle glasses, acne, terrible at multitasking, quit a dead end job due to anxiety. My first and so far only attempt was then.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 24 now and I still don&amp;#39;t feel like I have my shit together. But I&amp;#39;m at my own pace, and so are you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wqlv", "score_hidden": false, "name": "t1_chbpaah", "created": 1399482548.0, "author_flair_text": null, "created_utc": 1399453748.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbmn88", "gilded": 0, "author": "PoppyCokc", "parent_id": "t1_chblna5", "approved_by": null, "body": "I'm sorry about your dad. I lost my favorite uncle when I was 16. I am now 22, but for a few YEARS I really struggled with his death, what happened was I closed myself up and didn't talk to anyone about it. I really downward spiraled and shit and I questioned life itself and how could such a nice funny warmhearted individual just suddenly die like that. Basically I realized that after 4 years of feeling depressed, negative and just overall like shit I was tired about it. Also during that time my grades suffered, I dropped out of community college and had no real direction in life. One day I just broke down to my mom and started bawling my eyes out and I cried for fucking ours just babbling on and on and all she did was sit there and listen to me. After this I felt a lot better. I dont know why but I felt like I released all of these emotions and this sadness building up inside me.   \n\nSorry for the fuckin essay ha.  \n\n  \nAnyways you could always join the military, get free travel, join a brotherhood, get in good shape, and get worldly experiences for a year or two, and get paid to do it. If you chose the right route in the military you could come out with some actual experience to apply to a job afterwards. Idk, for me military would be my option if my current plan goes south. I know that this toatally sounds like an ad for the military or something haha sorry.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry about your dad. I lost my favorite uncle when I was 16. I am now 22, but for a few YEARS I really struggled with his death, what happened was I closed myself up and didn&amp;#39;t talk to anyone about it. I really downward spiraled and shit and I questioned life itself and how could such a nice funny warmhearted individual just suddenly die like that. Basically I realized that after 4 years of feeling depressed, negative and just overall like shit I was tired about it. Also during that time my grades suffered, I dropped out of community college and had no real direction in life. One day I just broke down to my mom and started bawling my eyes out and I cried for fucking ours just babbling on and on and all she did was sit there and listen to me. After this I felt a lot better. I dont know why but I felt like I released all of these emotions and this sadness building up inside me.   &lt;/p&gt;\n\n&lt;p&gt;Sorry for the fuckin essay ha.  &lt;/p&gt;\n\n&lt;p&gt;Anyways you could always join the military, get free travel, join a brotherhood, get in good shape, and get worldly experiences for a year or two, and get paid to do it. If you chose the right route in the military you could come out with some actual experience to apply to a job afterwards. Idk, for me military would be my option if my current plan goes south. I know that this toatally sounds like an ad for the military or something haha sorry.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wqlv", "score_hidden": false, "name": "t1_chbmn88", "created": 1399469807.0, "author_flair_text": null, "created_utc": 1399441007.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chblna5", "gilded": 0, "author": "ghostidiot", "parent_id": "t1_chbf6nk", "approved_by": null, "body": "Thank you for trying. I wish I could travel and get life experience but, that takes a lot of money. I have none to spare. I'm completely trapped in my life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for trying. I wish I could travel and get life experience but, that takes a lot of money. I have none to spare. I&amp;#39;m completely trapped in my life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wqlv", "score_hidden": false, "name": "t1_chblna5", "created": 1399441419.0, "author_flair_text": null, "created_utc": 1399437819.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chbf6nk", "gilded": 0, "author": "Bamalamoh", "parent_id": "t3_24wqlv", "approved_by": null, "body": "I'm horrible at this stuff, but how would you feel about trying to gain more experience? I have manic depression, but after having traveled for a few years I felt surprisingly a lot better, like I had earned a place somewhere. I for once in my life had a goal; to gain money for traveling. I got to meet interesting people and gain actual opinions on things. Not being able to talk to people my own language made me have to *learn* to socialize better. Sorry if I sound like an asshole, I'm really bad at this.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m horrible at this stuff, but how would you feel about trying to gain more experience? I have manic depression, but after having traveled for a few years I felt surprisingly a lot better, like I had earned a place somewhere. I for once in my life had a goal; to gain money for traveling. I got to meet interesting people and gain actual opinions on things. Not being able to talk to people my own language made me have to &lt;em&gt;learn&lt;/em&gt; to socialize better. Sorry if I sound like an asshole, I&amp;#39;m really bad at this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wqlv", "score_hidden": false, "name": "t1_chbf6nk", "created": 1399451687.0, "author_flair_text": null, "created_utc": 1399422887.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]