[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was in a relationship that I thought would last for the rest of my life. The love I felt was deeper than I&amp;#39;ve ever felt before. We were together for 2 years. But things fell apart suddenly and she left me for someone else. \nI don&amp;#39;t feel like it&amp;#39;s a good reason to feel this way. Sure it&amp;#39;s sad but heartbreak is something everyone except the luckiest people have to go through. Lots of people I know are going through much more tragic ordeals in their lives. I&amp;#39;m ashamed to be so weak. I don&amp;#39;t feel like I deserve to feel like this. I have a good life. I have a successful career as a music producer, which is what I&amp;#39;ve always wanted to do since as far back as I can remember. Lots of people tell me they love what I do every day. But it doesn&amp;#39;t make me feel anything anymore. Music doesn&amp;#39;t make me feel anything. I get anxiety now when I&amp;#39;m about to push play, because I know I will feel nothing, which is completely unusual for me.\nIt feels like nothing matters without her. It&amp;#39;s been 2 months since we broke up. I feel completely worthless. I think about her every waking moment. I know she&amp;#39;s never going to take me back, and it makes me feel like there&amp;#39;s no reason to live. I know it&amp;#39;s irrational and I have a lot to live for and lots of people that love me but I just can&amp;#39;t seem to shake these feelings. I&amp;#39;ve never engaged in self-destructive behavior but I can&amp;#39;t stop thinking about cutting myself, or learning how to tie a noose. I can&amp;#39;t stop thinking about how worthless my life is. I&amp;#39;m glad I don&amp;#39;t own a gun because if I did I know I wouldn&amp;#39;t be able to resist ending my life.&lt;/p&gt;\n\n&lt;p&gt;Where I live right now I&amp;#39;m totally isolated. The closest friend I have is over an hour away. I know this isn&amp;#39;t healthy. I&amp;#39;m planning to move to LA and surround myself with people. And I&amp;#39;m going to see a psychiatrist to talk about getting prescribed with an anti-depressant. My friends tell me I shouldn&amp;#39;t but I know I can&amp;#39;t do this all on my own. I don&amp;#39;t want to end up acting on my feelings just because I&amp;#39;m too proud to take a medication. I&amp;#39;m better off medicated than dead.&lt;/p&gt;\n\n&lt;p&gt;Anyways, I just needed a place to vent about my feelings. It helps a lot to write all of this down and to know someone hears me.  Thanks for listening&lt;/p&gt;\n\n&lt;p&gt;edit: \nthank you so much for your responses. i cried reading them and felt the first positive emotions i&amp;#39;ve felt in a while. it really means everything to hear that I&amp;#39;m not alone and that I&amp;#39;m making the right decisions. you guys are really great :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was in a relationship that I thought would last for the rest of my life. The love I felt was deeper than I've ever felt before. We were together for 2 years. But things fell apart suddenly and she left me for someone else. \nI don't feel like it's a good reason to feel this way. Sure it's sad but heartbreak is something everyone except the luckiest people have to go through. Lots of people I know are going through much more tragic ordeals in their lives. I'm ashamed to be so weak. I don't feel like I deserve to feel like this. I have a good life. I have a successful career as a music producer, which is what I've always wanted to do since as far back as I can remember. Lots of people tell me they love what I do every day. But it doesn't make me feel anything anymore. Music doesn't make me feel anything. I get anxiety now when I'm about to push play, because I know I will feel nothing, which is completely unusual for me.\nIt feels like nothing matters without her. It's been 2 months since we broke up. I feel completely worthless. I think about her every waking moment. I know she's never going to take me back, and it makes me feel like there's no reason to live. I know it's irrational and I have a lot to live for and lots of people that love me but I just can't seem to shake these feelings. I've never engaged in self-destructive behavior but I can't stop thinking about cutting myself, or learning how to tie a noose. I can't stop thinking about how worthless my life is. I'm glad I don't own a gun because if I did I know I wouldn't be able to resist ending my life.\n\nWhere I live right now I'm totally isolated. The closest friend I have is over an hour away. I know this isn't healthy. I'm planning to move to LA and surround myself with people. And I'm going to see a psychiatrist to talk about getting prescribed with an anti-depressant. My friends tell me I shouldn't but I know I can't do this all on my own. I don't want to end up acting on my feelings just because I'm too proud to take a medication. I'm better off medicated than dead.\n\nAnyways, I just needed a place to vent about my feelings. It helps a lot to write all of this down and to know someone hears me.  Thanks for listening\n\nedit: \nthank you so much for your responses. i cried reading them and felt the first positive emotions i've felt in a while. it really means everything to hear that I'm not alone and that I'm making the right decisions. you guys are really great :)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24cw15", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ribboninthesea", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398858922.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24cw15/i_should_be_stronger_than_this/", "name": "t3_24cw15", "created": 1398883574.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24cw15/i_should_be_stronger_than_this/", "author_flair_text": null, "title": "I should be stronger than this", "created_utc": 1398854774.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5vkla", "gilded": 0, "author": "reaching-out", "parent_id": "t3_24cw15", "approved_by": null, "body": "I can relate to everything you have said, word for word (apart from being successful career-wise sadly!). Although some people perceive it as 'just' heartbreak it can trigger off vulnerabilities in ourselves and a grief process that is, relatively, just as painful as other horrible life ordeals. You're hurting, so please don't berate yourself for that. I wish I had better advice but currently I'm in therapy for the same very thing (heartbreak triggering underlying depression). I can say that the distressing thoughts do deplete slowly with time however.\n\nYou sound like you have incredible insight though and I can't commend you enough for finding that inner strength to want to move on (i.e. seeking help, moving away, etc.). It is this attitude that will propel you out of this dark hole. You shouldn't have to do it all on your own when there is support and help available. As far as medication is concerned, think of it perhaps as a way of getting yourself to a point of strength and greater independence again, a powerful tool amongst many. I wouldn't discount talking therapy as well if you have access.\n\nYou are heard :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate to everything you have said, word for word (apart from being successful career-wise sadly!). Although some people perceive it as &amp;#39;just&amp;#39; heartbreak it can trigger off vulnerabilities in ourselves and a grief process that is, relatively, just as painful as other horrible life ordeals. You&amp;#39;re hurting, so please don&amp;#39;t berate yourself for that. I wish I had better advice but currently I&amp;#39;m in therapy for the same very thing (heartbreak triggering underlying depression). I can say that the distressing thoughts do deplete slowly with time however.&lt;/p&gt;\n\n&lt;p&gt;You sound like you have incredible insight though and I can&amp;#39;t commend you enough for finding that inner strength to want to move on (i.e. seeking help, moving away, etc.). It is this attitude that will propel you out of this dark hole. You shouldn&amp;#39;t have to do it all on your own when there is support and help available. As far as medication is concerned, think of it perhaps as a way of getting yourself to a point of strength and greater independence again, a powerful tool amongst many. I wouldn&amp;#39;t discount talking therapy as well if you have access.&lt;/p&gt;\n\n&lt;p&gt;You are heard :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24cw15", "score_hidden": false, "name": "t1_ch5vkla", "created": 1398860271.0, "author_flair_text": null, "created_utc": 1398856671.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5vf7q", "gilded": 0, "author": "DarthKraze", "parent_id": "t3_24cw15", "approved_by": null, "body": "&gt; but I know I can't do this all on my own.\n\nNo one knows yourself better then you! Consider yourself listened to and supported!\n\nSometimes heartbreak just needs a little time, other times you may need a little push to help you get back on track. :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but I know I can&amp;#39;t do this all on my own.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No one knows yourself better then you! Consider yourself listened to and supported!&lt;/p&gt;\n\n&lt;p&gt;Sometimes heartbreak just needs a little time, other times you may need a little push to help you get back on track. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24cw15", "score_hidden": false, "name": "t1_ch5vf7q", "created": 1398884728.0, "author_flair_text": null, "created_utc": 1398855928.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5vhvn", "gilded": 0, "author": "thatlawyercat", "parent_id": "t3_24cw15", "approved_by": null, "body": "Maybe try taking a walk tomorrow, maybe in a nearby park. The sounds around you, which you could immerse yourself in, might help with inspiration. Personally when I see the trees it reminds me this that we are only here for a short time.\n\nTo stray to philosophy, the pain does fade away over time.  In the meanwhile, we might just have one go at this life, so savour. There's a reason why so many songs are rooted in loss... it's also the start of a new chapter, a chance to let your muse find you (in convinced they find you at the right time and but the other way around)... Love takes many forms and this world can surprise you. \n\nDon't be afraid to take some risks along the way.  Take yourself somewhere new, out if your comfort zone... there are few things worth doing that don't involve risk.\n\n And be ok feeling that pain. It means you are real.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe try taking a walk tomorrow, maybe in a nearby park. The sounds around you, which you could immerse yourself in, might help with inspiration. Personally when I see the trees it reminds me this that we are only here for a short time.&lt;/p&gt;\n\n&lt;p&gt;To stray to philosophy, the pain does fade away over time.  In the meanwhile, we might just have one go at this life, so savour. There&amp;#39;s a reason why so many songs are rooted in loss... it&amp;#39;s also the start of a new chapter, a chance to let your muse find you (in convinced they find you at the right time and but the other way around)... Love takes many forms and this world can surprise you. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to take some risks along the way.  Take yourself somewhere new, out if your comfort zone... there are few things worth doing that don&amp;#39;t involve risk.&lt;/p&gt;\n\n&lt;p&gt;And be ok feeling that pain. It means you are real.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24cw15", "score_hidden": false, "name": "t1_ch5vhvn", "created": 1398859907.0, "author_flair_text": null, "created_utc": 1398856307.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5x61s", "gilded": 0, "author": "almondbutter1", "parent_id": "t3_24cw15", "approved_by": null, "body": "Fuck the \"should\"", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck the &amp;quot;should&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24cw15", "score_hidden": false, "name": "t1_ch5x61s", "created": 1398866534.0, "author_flair_text": null, "created_utc": 1398862934.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]