[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think I have depression, but it comes and it goes. I&amp;#39;m not really good at anything, I&amp;#39;m 18 and this is pretty much the first time in my life I feel like I&amp;#39;ve had actual friends, I&amp;#39;ve never had a girlfriend, I think I&amp;#39;m going to fail university, I don&amp;#39;t have enough money to pay my rent for next year, and I really just don&amp;#39;t like myself very much. Most of the time I can sort of ignore all of this, but about once a week I&amp;#39;ll just break down and get really angry or upset at myself. I&amp;#39;m not rally sure if this fits here but I sort of just want to be able to vent, because I don&amp;#39;t really have anybody in my life I&amp;#39;d be willing to open up to about how I feel.&lt;/p&gt;\n\n&lt;p&gt;Most of yesterday evening I was pretty much fine. I was with friends, I was drunk, everybody was happy. Somewhere along the line I got too drunk and my friend ended up taking me home. From there I don&amp;#39;t know what exactly happened, but at about 3AM I threw up on the floor then left my flat and ended up aimlessly wandering through the streets crying and thinking of killing myself. At some point I tried to climb up a fence or a wall and fell off, which has left me with I think a broken hand and a shit load of cuts all over my body. At some point I tried to call my mum, brother and a girl I know who I&amp;#39;ve talked to about wanting to kill myself before to cry down the phone to them, but none of them picked up. This morning I found a half written, gibberish text on my phone to my mum telling her I love her and then just a load of random letters. As I&amp;#39;m writing this the girl I tried to call rang me and I made up some excuse about trying to call somebody else and tapping the wrong name which I&amp;#39;m fairly sure she didn&amp;#39;t buy for a second.&lt;/p&gt;\n\n&lt;p&gt;At some point I basically realized I have no idea where I was, but the entire area looked like somewhere I really shouldn&amp;#39;t be at whatever time it was, I was still bleeding and because I had no socks on the back of one of my ankles had been cut open. I ran into some guy and broke down crying to him about how I hate myself and I don&amp;#39;t know where I am, he said he&amp;#39;d help me get home and I got freaked out and ran away. Eventually I spotted a building a recognised about a mile away so walked until I got to a mcdonalds, where I bought some food and wiped some of the blood and dirt off me with napkins, then eventually I got home at I think 7 and collapsed. I woke up about 2 to find my bed covered in blood and dirt and vomit still on my floor. To top it off my shower&amp;#39;s broken and the vacuum&amp;#39;s on the floor upstairs and I really can&amp;#39;t face doing anything but lying in bed with my laptop for the rest of the day.&lt;/p&gt;\n\n&lt;p&gt;Looking back at what I&amp;#39;ve typed I really don&amp;#39;t know what my point is. The story&amp;#39;s pretty much &amp;quot;I got drunk and wandered around the streets for a few hours&amp;quot;, but I guess I just don&amp;#39;t want to keep all this to myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I think I have depression, but it comes and it goes. I'm not really good at anything, I'm 18 and this is pretty much the first time in my life I feel like I've had actual friends, I've never had a girlfriend, I think I'm going to fail university, I don't have enough money to pay my rent for next year, and I really just don't like myself very much. Most of the time I can sort of ignore all of this, but about once a week I'll just break down and get really angry or upset at myself. I'm not rally sure if this fits here but I sort of just want to be able to vent, because I don't really have anybody in my life I'd be willing to open up to about how I feel.\n\nMost of yesterday evening I was pretty much fine. I was with friends, I was drunk, everybody was happy. Somewhere along the line I got too drunk and my friend ended up taking me home. From there I don't know what exactly happened, but at about 3AM I threw up on the floor then left my flat and ended up aimlessly wandering through the streets crying and thinking of killing myself. At some point I tried to climb up a fence or a wall and fell off, which has left me with I think a broken hand and a shit load of cuts all over my body. At some point I tried to call my mum, brother and a girl I know who I've talked to about wanting to kill myself before to cry down the phone to them, but none of them picked up. This morning I found a half written, gibberish text on my phone to my mum telling her I love her and then just a load of random letters. As I'm writing this the girl I tried to call rang me and I made up some excuse about trying to call somebody else and tapping the wrong name which I'm fairly sure she didn't buy for a second.\n\nAt some point I basically realized I have no idea where I was, but the entire area looked like somewhere I really shouldn't be at whatever time it was, I was still bleeding and because I had no socks on the back of one of my ankles had been cut open. I ran into some guy and broke down crying to him about how I hate myself and I don't know where I am, he said he'd help me get home and I got freaked out and ran away. Eventually I spotted a building a recognised about a mile away so walked until I got to a mcdonalds, where I bought some food and wiped some of the blood and dirt off me with napkins, then eventually I got home at I think 7 and collapsed. I woke up about 2 to find my bed covered in blood and dirt and vomit still on my floor. To top it off my shower's broken and the vacuum's on the floor upstairs and I really can't face doing anything but lying in bed with my laptop for the rest of the day.\n\nLooking back at what I've typed I really don't know what my point is. The story's pretty much \"I got drunk and wandered around the streets for a few hours\", but I guess I just don't want to keep all this to myself.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "251yh7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "_FinestJellyBeansRaw", "media": null, "score": 13, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/251yh7/i_think_i_may_have_wanted_to_or_tried_to_kill/", "name": "t3_251yh7", "created": 1399596815.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/251yh7/i_think_i_may_have_wanted_to_or_tried_to_kill/", "author_flair_text": null, "title": "I think I may have wanted to or tried to kill myself last night", "created_utc": 1399568015.0, "ups": 15, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdxths", "gilded": 0, "author": "_FinestJellyBeansRaw", "parent_id": "t1_chdxedn", "approved_by": null, "body": "Still haven't showed up. Oh well.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Still haven&amp;#39;t showed up. Oh well.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251yh7", "score_hidden": false, "name": "t1_chdxths", "created": 1399697083.0, "author_flair_text": null, "created_utc": 1399668283.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chdxedn", "gilded": 0, "author": "lilsunnybee", "parent_id": "t1_chdbur7", "approved_by": null, "body": "Glad to help! Did you figure out about the other comments? Maybe they were still being typed?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to help! Did you figure out about the other comments? Maybe they were still being typed?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251yh7", "score_hidden": false, "name": "t1_chdxedn", "created": 1399696168.0, "author_flair_text": null, "created_utc": 1399667368.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdbur7", "gilded": 0, "author": "_FinestJellyBeansRaw", "parent_id": "t1_chcwtmm", "approved_by": null, "body": "&gt; Stay away from alcohol for a while?\n\nDefinitely.\n\n&gt;I'd strongly recommend you see a mental health counselor or therapist nearby for at least a handful of sessions. Your university probably provides these services for free as long as you're enrolled, but even if not, a lot of counselors / therapists provide sliding scale fees based on your ability to pay.\n\nI've looked it up and my university has a councillor, so I'm going to try and head over there tomorrow. \n\nThanks for the reply. For some reason reddit's telling me there's 3 comments but I can only see yours.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Stay away from alcohol for a while?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Definitely.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;d strongly recommend you see a mental health counselor or therapist nearby for at least a handful of sessions. Your university probably provides these services for free as long as you&amp;#39;re enrolled, but even if not, a lot of counselors / therapists provide sliding scale fees based on your ability to pay.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve looked it up and my university has a councillor, so I&amp;#39;m going to try and head over there tomorrow. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the reply. For some reason reddit&amp;#39;s telling me there&amp;#39;s 3 comments but I can only see yours.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251yh7", "score_hidden": false, "name": "t1_chdbur7", "created": 1399632970.0, "author_flair_text": null, "created_utc": 1399604170.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chcwtmm", "gilded": 0, "author": "lilsunnybee", "parent_id": "t3_251yh7", "approved_by": null, "body": "Stay away from alcohol for a while? Maybe it's just not a good drug for you, at least in your current state. What about pot instead? Or at the very least make sure you drink in moderation, if you don't think you have alcoholic tendencies that is.\n\nAlcohol can do strange stuff to people, locking them strongly into one emotional state or another and limiting their ability to reason through or out of it.\n\nI'd strongly recommend you see a mental health counselor or therapist nearby for at least a handful of sessions. Your university probably provides these services for free as long as you're enrolled, but even if not, a lot of counselors / therapists provide sliding scale fees based on your ability to pay. You at least need to process this event with someone qualified, and also maybe anything else that might be on your mind. Sounds like your self-esteem might need some work too.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stay away from alcohol for a while? Maybe it&amp;#39;s just not a good drug for you, at least in your current state. What about pot instead? Or at the very least make sure you drink in moderation, if you don&amp;#39;t think you have alcoholic tendencies that is.&lt;/p&gt;\n\n&lt;p&gt;Alcohol can do strange stuff to people, locking them strongly into one emotional state or another and limiting their ability to reason through or out of it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d strongly recommend you see a mental health counselor or therapist nearby for at least a handful of sessions. Your university probably provides these services for free as long as you&amp;#39;re enrolled, but even if not, a lot of counselors / therapists provide sliding scale fees based on your ability to pay. You at least need to process this event with someone qualified, and also maybe anything else that might be on your mind. Sounds like your self-esteem might need some work too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251yh7", "score_hidden": false, "name": "t1_chcwtmm", "created": 1399602232.0, "author_flair_text": null, "created_utc": 1399573432.0, "distinguished": null, "num_reports": null, "ups": 7}}], "after": null, "before": null}}]