[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My dad died of lung cancer in December. Since September my mom has been losing weight. She is down to 97lbs from 125. She has COPD but continues to smoke. They were married for over 48 years. It feels like she just doesn&amp;#39;t want to go on anymore. My dad died with a lot of debt. My husband and I are basically supporting her. She won&amp;#39;t go to grief counseling. I don&amp;#39;t know how to get through to her. I&amp;#39;m frustrated. She has 4 children and 12 grandchildren with another on the way. &lt;/p&gt;\n\n&lt;p&gt;Should I push her to live on and see her grandchildren grow or allow her to just give up? Is it even possible to help? Does this happen a lot with older couples? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My dad died of lung cancer in December. Since September my mom has been losing weight. She is down to 97lbs from 125. She has COPD but continues to smoke. They were married for over 48 years. It feels like she just doesn't want to go on anymore. My dad died with a lot of debt. My husband and I are basically supporting her. She won't go to grief counseling. I don't know how to get through to her. I'm frustrated. She has 4 children and 12 grandchildren with another on the way. \n\nShould I push her to live on and see her grandchildren grow or allow her to just give up? Is it even possible to help? Does this happen a lot with older couples? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25dbte", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Tyacrush", "media": null, "score": 17, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25dbte/i_think_my_mom_is_trying_to_die/", "name": "t3_25dbte", "created": 1399941227.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25dbte/i_think_my_mom_is_trying_to_die/", "author_flair_text": null, "title": "I think my mom is trying to die", "created_utc": 1399912427.0, "ups": 18, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg2mqw", "gilded": 0, "author": "SQLwitch", "parent_id": "t3_25dbte", "approved_by": null, "body": "&gt; Should I push her to live on and see her grandchildren grow or allow her to just give up? \n\nI can see how right now it might feel like those are the only two choices, but usually it *is* possible to get someone to a place where they feel good enough that their will to live reasserts itself.\n\n&gt; I don't know how to get through to her.\n\nCan you tell us maybe a bit about what you've tried so far?\n\nI can only imagine how stressful this is for you.  You're going through your own grieving process, and you have your own life and your own responsibilities, and watching your mom basically give up and self-destruct must be incredibly painful and frustrating to watch.  It may be that you're too close to the situation to talk to her with the kind of detachment and perspective that she needs - maybe you can think of someone she trusts (friends her own age?) who might be able to get through to her that she needs (and deserves!) some help and support. \n\n&gt;Does this happen a lot with older couples? \n\nDefinitely.  And if there are practical issues (i.e. money problems) that occur as \"fallout\" from the spouse's death, it's extremely common for the survivor to spiral into despair.  But if the person can get connected with the right help, good long-term outcomes are also common.\n\nHugs to you.  I am sure this is all extremely rough going for you, too. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Should I push her to live on and see her grandchildren grow or allow her to just give up? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can see how right now it might feel like those are the only two choices, but usually it &lt;em&gt;is&lt;/em&gt; possible to get someone to a place where they feel good enough that their will to live reasserts itself.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know how to get through to her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you tell us maybe a bit about what you&amp;#39;ve tried so far?&lt;/p&gt;\n\n&lt;p&gt;I can only imagine how stressful this is for you.  You&amp;#39;re going through your own grieving process, and you have your own life and your own responsibilities, and watching your mom basically give up and self-destruct must be incredibly painful and frustrating to watch.  It may be that you&amp;#39;re too close to the situation to talk to her with the kind of detachment and perspective that she needs - maybe you can think of someone she trusts (friends her own age?) who might be able to get through to her that she needs (and deserves!) some help and support. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Does this happen a lot with older couples? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Definitely.  And if there are practical issues (i.e. money problems) that occur as &amp;quot;fallout&amp;quot; from the spouse&amp;#39;s death, it&amp;#39;s extremely common for the survivor to spiral into despair.  But if the person can get connected with the right help, good long-term outcomes are also common.&lt;/p&gt;\n\n&lt;p&gt;Hugs to you.  I am sure this is all extremely rough going for you, too. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chg2mqw", "created": 1399943543.0, "author_flair_text": null, "created_utc": 1399914743.0, "distinguished": "moderator", "num_reports": null, "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg7cmv", "gilded": 0, "author": "SQLwitch", "parent_id": "t1_chg6ypj", "approved_by": null, "body": "So the talking tips I was referring to are linked from our sidebar - no need to \"research\" - but there are some references at the bottom if you need more info.  \n\nBTW I work at a crisis line IRL, and some other members of the mod team have some connections in the social-work/mental-health universe so if you need help finding the best resources near her, shoot us a modmail.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So the talking tips I was referring to are linked from our sidebar - no need to &amp;quot;research&amp;quot; - but there are some references at the bottom if you need more info.  &lt;/p&gt;\n\n&lt;p&gt;BTW I work at a crisis line IRL, and some other members of the mod team have some connections in the social-work/mental-health universe so if you need help finding the best resources near her, shoot us a modmail.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chg7cmv", "created": 1399953235.0, "author_flair_text": null, "created_utc": 1399924435.0, "distinguished": "moderator", "num_reports": null, "ups": 8}}], "after": null, "before": null}}, "saved": false, "id": "chg6ypj", "gilded": 0, "author": "Tyacrush", "parent_id": "t1_chg4ovp", "approved_by": null, "body": "Wow. Thank you! I'm going to to some research on \"talking tips\" and see if there are any senior support services in her area. I'm done just flying by the seat of my pants. Great advice and much appreciated.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. Thank you! I&amp;#39;m going to to some research on &amp;quot;talking tips&amp;quot; and see if there are any senior support services in her area. I&amp;#39;m done just flying by the seat of my pants. Great advice and much appreciated.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chg6ypj", "created": 1399952469.0, "author_flair_text": null, "created_utc": 1399923669.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "chg4ovp", "gilded": 0, "author": "SQLwitch", "parent_id": "t1_chg349d", "approved_by": null, "body": "&gt; Her reply was \"I'm not ready yet\"   \n&gt; Her reply was \"you're right.\"\n\nYeah, that's exactly why the first section in our \"talking tips\" is \"Avoid Advice and Solutions\" because that's usually what you get.  \n\n&gt; There are times when she tells me she hasn't eaten in days or didn't get out of bed.\n\nIn a way, that's kind of good.  It's the self-preserving side of her that's telling you about the self-destructive side of her.\n\nDo you know of any friends of hers who've lost their spouses?  It sounds like she's isolating herself and what she probably needs above all else is understanding, which she's not going to get if she keeps isolating.\n\nAnother thought:  Are there any seniors' support agencies in her area?  Where I live you can send a social worker to do an informal welfare check - of course the senior doesn't *have* to cooperate, but the workers are really adept at gaining confidence and persuading them to take advantages of things like widowed spouses' support groups.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Her reply was &amp;quot;I&amp;#39;m not ready yet&amp;quot;&lt;br/&gt;\nHer reply was &amp;quot;you&amp;#39;re right.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, that&amp;#39;s exactly why the first section in our &amp;quot;talking tips&amp;quot; is &amp;quot;Avoid Advice and Solutions&amp;quot; because that&amp;#39;s usually what you get.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There are times when she tells me she hasn&amp;#39;t eaten in days or didn&amp;#39;t get out of bed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In a way, that&amp;#39;s kind of good.  It&amp;#39;s the self-preserving side of her that&amp;#39;s telling you about the self-destructive side of her.&lt;/p&gt;\n\n&lt;p&gt;Do you know of any friends of hers who&amp;#39;ve lost their spouses?  It sounds like she&amp;#39;s isolating herself and what she probably needs above all else is understanding, which she&amp;#39;s not going to get if she keeps isolating.&lt;/p&gt;\n\n&lt;p&gt;Another thought:  Are there any seniors&amp;#39; support agencies in her area?  Where I live you can send a social worker to do an informal welfare check - of course the senior doesn&amp;#39;t &lt;em&gt;have&lt;/em&gt; to cooperate, but the workers are really adept at gaining confidence and persuading them to take advantages of things like widowed spouses&amp;#39; support groups.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chg4ovp", "created": 1399947807.0, "author_flair_text": null, "created_utc": 1399919007.0, "distinguished": "moderator", "num_reports": null, "ups": 8}}], "after": null, "before": null}}, "saved": false, "id": "chg349d", "gilded": 0, "author": "Tyacrush", "parent_id": "t3_25dbte", "approved_by": null, "body": "I have tried to talk to her about grief counseling. Her reply was \"I'm not ready yet\" I've said that I think she should try to quit smoking. Her reply was \"you're right.\"  She gets angry and defensive if I am too confrontational. I'm afraid that if I push to hard that she will stop communicating with me all together. I don't think her doctor knows that she is still smoking. I am temped to share my concerns with him but I am afraid that she will see that as a betrayal and cut me out of her life. She lives an hour away. I try to get there at least twice a week but it is hard with a family of my own to get there more often. There are times when she tells me she hasn't eaten in days or didn't get out of bed. I'd like to move her closer but she is a grown woman. I can't force her to do anything. In a lot of ways she acts like a child but I still have to treat her like an adult.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have tried to talk to her about grief counseling. Her reply was &amp;quot;I&amp;#39;m not ready yet&amp;quot; I&amp;#39;ve said that I think she should try to quit smoking. Her reply was &amp;quot;you&amp;#39;re right.&amp;quot;  She gets angry and defensive if I am too confrontational. I&amp;#39;m afraid that if I push to hard that she will stop communicating with me all together. I don&amp;#39;t think her doctor knows that she is still smoking. I am temped to share my concerns with him but I am afraid that she will see that as a betrayal and cut me out of her life. She lives an hour away. I try to get there at least twice a week but it is hard with a family of my own to get there more often. There are times when she tells me she hasn&amp;#39;t eaten in days or didn&amp;#39;t get out of bed. I&amp;#39;d like to move her closer but she is a grown woman. I can&amp;#39;t force her to do anything. In a lot of ways she acts like a child but I still have to treat her like an adult.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chg349d", "created": 1399944538.0, "author_flair_text": null, "created_utc": 1399915738.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chga9k9", "gilded": 0, "author": "Slyx", "parent_id": "t3_25dbte", "approved_by": null, "body": "As far as food, can you get her some ensure (or similar product - I think costco has their own brand and it's pretty cheap). As someone that deals with anxiety and depression and rarely wants to eat, Ensure Plus is like 8oz and 350 calories and I drink it in one or two gulps. Look into it. Tell her to drink 3 a day or something..", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as food, can you get her some ensure (or similar product - I think costco has their own brand and it&amp;#39;s pretty cheap). As someone that deals with anxiety and depression and rarely wants to eat, Ensure Plus is like 8oz and 350 calories and I drink it in one or two gulps. Look into it. Tell her to drink 3 a day or something..&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dbte", "score_hidden": false, "name": "t1_chga9k9", "created": 1399959059.0, "author_flair_text": null, "created_utc": 1399930259.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]