[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t kill myself because it would crush my family, my spouse especially.  This is the only reason.  I am and have been doing all the proper things: medication, therapist visits--look, I&amp;#39;m even writing therapeutically to express my feelings.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m disappointed that I happened to be born.  My life is maybe like any other.  Some bad crap happened to me as a kid, but this isn&amp;#39;t that uncommon at all, and I have a wonderful loving family because it wasn&amp;#39;t familial.  And then later I lost weight, finished multiple degrees, got contacts, developed &amp;quot;coping skills&amp;quot;, improved everything about myself I thought might be totally unfixable.  All these things that people would suggest you do in a mental place like this.&lt;/p&gt;\n\n&lt;p&gt;So how many more years of this?  Continuing to exist because others need things from me? Doing things I dislike that need to get done? Performing all the actions one needs to do to ensure things go properly like they are supposed to in a &amp;quot;good life&amp;quot;?  Day after day of this until I get diagnosed with some terminal disease (duly going to my yearly physicals of course like I am supposed to.  Mammograms.  Getting that mole checked out.), or increasingly fade into dementia where I relive some terrifying moment every five minutes?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in crisis situations and I am always the calm, competent one, making sure others are safe and keeping in control, probably cause I don&amp;#39;t have any life-preservation fear to worry about.  Maybe there will be a time when this happens and I have no control about dying, and then I can just die and my family will mourn but it will be an explicable death, one that maybe they can come to terms with and this is the contenting thought I keep in my head now.    &lt;/p&gt;\n\n&lt;p&gt;Just keep doing the right things, like you&amp;#39;re supposed to do, like you&amp;#39;re very good at.  I&amp;#39;m good at them.  I&amp;#39;m good at a lot of things that I take no pleasure in at all.  I threw myself into one of my hobbies, I got great at it, I started selling my work, people like my art.  Now what.  I do another one?  Five?  The same mediocre cycle until I physically and mentally rot?&lt;/p&gt;\n\n&lt;p&gt;There are millions of others on the Earth and they all have their inner thoughts and struggles.  Many others have suffered unjust lives, died painfully and unhappily.  Those kids on the Korean ferry, those 200 girls kidnapped from their school and married off, a landslide in Afghanistan, Ukraine, Turkey, whatever else have I forgotten in the last what week.  Innocent people are being harmed all around the world and have been for generations, for as long as humans have possessed intelligence and emotion.  The world is a miserably sad place.&lt;/p&gt;\n\n&lt;p&gt;This is about where people suggest that there is also happiness in the world, and that by and large we progress forward and it balances on the good side overall.  Fine by me. There&amp;#39;s no way we could ever answer the question, but even on that assumption, I don&amp;#39;t see why I have to be here for any part of that aggregate of history.  If I did have to be here--that would be even worse, really.  Another thing to feel guilty and obliged to do.  And &amp;quot;obliged&amp;quot; is meaningless itself.  What about everyone who would have made a difference if only they hadn&amp;#39;t for some horrible and unjust reason not been able to?  There is still slavery, ffs.  As I write this, there are human slaves, looking out from where they&amp;#39;re kept to the sky, if they even have a window. &lt;/p&gt;\n\n&lt;p&gt;The thing I dream about is just blinking out of existence, like a black hole sucking me up, unnoticed and erased from the memories of everyone else.  I&amp;#39;ve never worried about being alone.  I wish I could be alone.  I was always so confused as a kid when people talked about &amp;quot;loneliness&amp;quot;.  I&amp;#39;ve never felt normal when I wasn&amp;#39;t alone.  This is where I get the condescending &amp;quot;but humans are a social species, nobody really wants to be alone.&amp;quot;  I don&amp;#39;t want to be a human anymore, even if I ever was one.&lt;/p&gt;\n\n&lt;p&gt;I want to walk out into the wilderness, 6000 miles from anyone else, and lay down in the snow and die alone.  It would be comfortable and I could look up and watch the shooting stars alone in that place, and that is a thought that makes me happy.  The sky would be a bit purple with the northern lights.  I&amp;#39;d be in a clearing in the boreal forest, some spindly trees around but mostly the flat untouched snow, that only I have touched to walk there.&lt;/p&gt;\n\n&lt;p&gt;And my loop finishes, because then I ask--what am I supposed to do now?  Always doing things, doing, doing.  Humans have to do, have to act, have to rationalize.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't kill myself because it would crush my family, my spouse especially.  This is the only reason.  I am and have been doing all the proper things: medication, therapist visits--look, I'm even writing therapeutically to express my feelings.\n\nI'm disappointed that I happened to be born.  My life is maybe like any other.  Some bad crap happened to me as a kid, but this isn't that uncommon at all, and I have a wonderful loving family because it wasn't familial.  And then later I lost weight, finished multiple degrees, got contacts, developed \"coping skills\", improved everything about myself I thought might be totally unfixable.  All these things that people would suggest you do in a mental place like this.\n\nSo how many more years of this?  Continuing to exist because others need things from me? Doing things I dislike that need to get done? Performing all the actions one needs to do to ensure things go properly like they are supposed to in a \"good life\"?  Day after day of this until I get diagnosed with some terminal disease (duly going to my yearly physicals of course like I am supposed to.  Mammograms.  Getting that mole checked out.), or increasingly fade into dementia where I relive some terrifying moment every five minutes?\n\nI've been in crisis situations and I am always the calm, competent one, making sure others are safe and keeping in control, probably cause I don't have any life-preservation fear to worry about.  Maybe there will be a time when this happens and I have no control about dying, and then I can just die and my family will mourn but it will be an explicable death, one that maybe they can come to terms with and this is the contenting thought I keep in my head now.    \n\nJust keep doing the right things, like you're supposed to do, like you're very good at.  I'm good at them.  I'm good at a lot of things that I take no pleasure in at all.  I threw myself into one of my hobbies, I got great at it, I started selling my work, people like my art.  Now what.  I do another one?  Five?  The same mediocre cycle until I physically and mentally rot?\n\nThere are millions of others on the Earth and they all have their inner thoughts and struggles.  Many others have suffered unjust lives, died painfully and unhappily.  Those kids on the Korean ferry, those 200 girls kidnapped from their school and married off, a landslide in Afghanistan, Ukraine, Turkey, whatever else have I forgotten in the last what week.  Innocent people are being harmed all around the world and have been for generations, for as long as humans have possessed intelligence and emotion.  The world is a miserably sad place.\n\nThis is about where people suggest that there is also happiness in the world, and that by and large we progress forward and it balances on the good side overall.  Fine by me. There's no way we could ever answer the question, but even on that assumption, I don't see why I have to be here for any part of that aggregate of history.  If I did have to be here--that would be even worse, really.  Another thing to feel guilty and obliged to do.  And \"obliged\" is meaningless itself.  What about everyone who would have made a difference if only they hadn't for some horrible and unjust reason not been able to?  There is still slavery, ffs.  As I write this, there are human slaves, looking out from where they're kept to the sky, if they even have a window. \n\nThe thing I dream about is just blinking out of existence, like a black hole sucking me up, unnoticed and erased from the memories of everyone else.  I've never worried about being alone.  I wish I could be alone.  I was always so confused as a kid when people talked about \"loneliness\".  I've never felt normal when I wasn't alone.  This is where I get the condescending \"but humans are a social species, nobody really wants to be alone.\"  I don't want to be a human anymore, even if I ever was one.\n\nI want to walk out into the wilderness, 6000 miles from anyone else, and lay down in the snow and die alone.  It would be comfortable and I could look up and watch the shooting stars alone in that place, and that is a thought that makes me happy.  The sky would be a bit purple with the northern lights.  I'd be in a clearing in the boreal forest, some spindly trees around but mostly the flat untouched snow, that only I have touched to walk there.\n\nAnd my loop finishes, because then I ask--what am I supposed to do now?  Always doing things, doing, doing.  Humans have to do, have to act, have to rationalize.\n\n\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24n4cc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throw49897", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24n4cc/i_think_i_am_more_troubled_now_then_i_ever_have/", "name": "t3_24n4cc", "created": 1399175173.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24n4cc/i_think_i_am_more_troubled_now_then_i_ever_have/", "author_flair_text": null, "title": "I think I am more troubled now then I ever have been", "created_utc": 1399146373.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8ro7n", "gilded": 0, "author": "VesperWae", "parent_id": "t3_24n4cc", "approved_by": null, "body": "I don't want to be a human either. I don't want to live in this world anymore. Thank you for sharing, now I know I'm not the only one thinking about all these things. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to be a human either. I don&amp;#39;t want to live in this world anymore. Thank you for sharing, now I know I&amp;#39;m not the only one thinking about all these things. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24n4cc", "score_hidden": false, "name": "t1_ch8ro7n", "created": 1399179861.0, "author_flair_text": null, "created_utc": 1399151061.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8ue5a", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24n4cc", "approved_by": null, "body": "You are right in that the world is an utterly misreable place for many of us, and I don't think that it's a matter of looking at the bright side. I think that sharing and talking about it gives us a sense of not-alone-ness and I think that this is more than just cathartic.\n\nGeneral acceptance and discussion of these kinds of thoughts is not a hopeless thing. I think that these thoughts and feelings are at the core of a lot of the problems we see in the world, - *not* that they are the cause, but rather that it is these things unaddressed, unspoken, repressed, that may be a major part of *why* things are so bad, now.\n\nYou can't get a job in customer service unless you're some kind of chipper. You're expected to be upbeat, \"positive\" incredibly stable, a tremendous amount of pressure for a world that has barely adjusted (if you can say we have adjusted at all) to the internet.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right in that the world is an utterly misreable place for many of us, and I don&amp;#39;t think that it&amp;#39;s a matter of looking at the bright side. I think that sharing and talking about it gives us a sense of not-alone-ness and I think that this is more than just cathartic.&lt;/p&gt;\n\n&lt;p&gt;General acceptance and discussion of these kinds of thoughts is not a hopeless thing. I think that these thoughts and feelings are at the core of a lot of the problems we see in the world, - &lt;em&gt;not&lt;/em&gt; that they are the cause, but rather that it is these things unaddressed, unspoken, repressed, that may be a major part of &lt;em&gt;why&lt;/em&gt; things are so bad, now.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t get a job in customer service unless you&amp;#39;re some kind of chipper. You&amp;#39;re expected to be upbeat, &amp;quot;positive&amp;quot; incredibly stable, a tremendous amount of pressure for a world that has barely adjusted (if you can say we have adjusted at all) to the internet.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24n4cc", "score_hidden": false, "name": "t1_ch8ue5a", "created": 1399187269.0, "author_flair_text": null, "created_utc": 1399158469.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]