[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve struggled with severe depression for years. I don&amp;#39;t feel like telling my whole story because I&amp;#39;ve told it too many times before, but in a nutshell, I&amp;#39;m a broke Marine Corps veteran, almost 30 years old, thousands of dollars in debt, expelled from college, alone, with a baby on the way who I won&amp;#39;t be able to see because my ex plans on using my mental illness and past suicide attempts to ensure that and I can&amp;#39;t afford a lawyer to fight it. I&amp;#39;ve tried to kill myself 5 times, but can never seem to complete it. I&amp;#39;m a failure in every way, even with suicide. I&amp;#39;m very intelligent and have many talents, but can&amp;#39;t get a job using any of them because I don&amp;#39;t have a degree. Can&amp;#39;t get my degree because I&amp;#39;ve been expelled for bad grades when I was young. Also I don&amp;#39;t have the financial means to finish school anyway because I can&amp;#39;t get a full time job here, despite searching/applying/interviewing for months. I&amp;#39;ve heard every argument regarding how &amp;quot;it will get better,&amp;quot; but... When? I&amp;#39;ve dealt with this shit for years and things get worse every day. Fuck getting better. It won&amp;#39;t. I&amp;#39;ve tried the VA Counseling and Veteran&amp;#39;s Suicide Line. Those are &lt;strong&gt;absolute bullshit&lt;/strong&gt;. They do nothing but try to get you &amp;quot;feeling better&amp;quot; so they can get rid of you. That&amp;#39;s WHEN you can actually get any help from them that they &lt;em&gt;say&lt;/em&gt; is so &amp;quot;readily available&amp;quot;. I teeter between just running away, getting in my car and never looking back, disappearing to somewhere across the country. Or just ending it all. I&amp;#39;ve tried hanging, cutting, overdosing. My body is god damn resilient. I figure CO poisoning should work, but hell, I don&amp;#39;t know. What the fuck do I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've struggled with severe depression for years. I don't feel like telling my whole story because I've told it too many times before, but in a nutshell, I'm a broke Marine Corps veteran, almost 30 years old, thousands of dollars in debt, expelled from college, alone, with a baby on the way who I won't be able to see because my ex plans on using my mental illness and past suicide attempts to ensure that and I can't afford a lawyer to fight it. I've tried to kill myself 5 times, but can never seem to complete it. I'm a failure in every way, even with suicide. I'm very intelligent and have many talents, but can't get a job using any of them because I don't have a degree. Can't get my degree because I've been expelled for bad grades when I was young. Also I don't have the financial means to finish school anyway because I can't get a full time job here, despite searching/applying/interviewing for months. I've heard every argument regarding how \"it will get better,\" but... When? I've dealt with this shit for years and things get worse every day. Fuck getting better. It won't. I've tried the VA Counseling and Veteran's Suicide Line. Those are **absolute bullshit**. They do nothing but try to get you \"feeling better\" so they can get rid of you. That's WHEN you can actually get any help from them that they *say* is so \"readily available\". I teeter between just running away, getting in my car and never looking back, disappearing to somewhere across the country. Or just ending it all. I've tried hanging, cutting, overdosing. My body is god damn resilient. I figure CO poisoning should work, but hell, I don't know. What the fuck do I do?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245lgp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Thisismy1Throwaway", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245lgp/i_think_im_finally_done/", "name": "t3_245lgp", "created": 1398681542.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245lgp/i_think_im_finally_done/", "author_flair_text": null, "title": "I think I'm finally done", "created_utc": 1398652742.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3tvq6", "gilded": 0, "author": "Killermedic66", "parent_id": "t3_245lgp", "approved_by": null, "body": "As someone who is currently in the military all I can say to you is don't give up. I'm currently struggling to but the only thing that keeps me going is that I know someday some how it'll get better. Stay strong battle. You are a hero as a service member. Find what you love to do and Pursue that instead of looking for just a random job. Soldier on. Hoorah ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who is currently in the military all I can say to you is don&amp;#39;t give up. I&amp;#39;m currently struggling to but the only thing that keeps me going is that I know someday some how it&amp;#39;ll get better. Stay strong battle. You are a hero as a service member. Find what you love to do and Pursue that instead of looking for just a random job. Soldier on. Hoorah &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245lgp", "score_hidden": false, "name": "t1_ch3tvq6", "created": 1398682627.0, "author_flair_text": null, "created_utc": 1398653827.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3ttea", "gilded": 0, "author": "yummycorndog", "parent_id": "t3_245lgp", "approved_by": null, "body": "That's craziness man.  It's crazy you're even making this post if you have commited suicide and 'died' that many times, technically. I don't know any valuable info about the veterans suicide line, but I do know that military veteran suicides were very high recently, I think the highest ever. Were your attempts documented at all? Did you go to the hospital or ER? Can you use your suicidal history as a sort of advantage to get financial assistance? Sorry if my advice is shitty. I'm just a guy. Not qualified.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s craziness man.  It&amp;#39;s crazy you&amp;#39;re even making this post if you have commited suicide and &amp;#39;died&amp;#39; that many times, technically. I don&amp;#39;t know any valuable info about the veterans suicide line, but I do know that military veteran suicides were very high recently, I think the highest ever. Were your attempts documented at all? Did you go to the hospital or ER? Can you use your suicidal history as a sort of advantage to get financial assistance? Sorry if my advice is shitty. I&amp;#39;m just a guy. Not qualified.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245lgp", "score_hidden": false, "name": "t1_ch3ttea", "created": 1398682485.0, "author_flair_text": null, "created_utc": 1398653685.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]