[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All my life, there have always been expectations. And every single time, I&amp;#39;ve failed to meet expectations. I can&amp;#39;t seem to be motivated or find any determination to do anything. I don&amp;#39;t want to suffer anymore. I just want it all to end.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have people I can trust, or rather, I can&amp;#39;t seem to open up or cry out for help. I am so tired of living because there is seemingly nothing out there for me. I have been laying around being a lazy lump of shit pitying myself. Why do we toil so hard only to be rewarded by death in the end anyway? All that pain and suffering that comes is so pointless to me and when there is no purpose in life, what good is it? &lt;/p&gt;\n\n&lt;p&gt;I was on the verge of graduating college with a bachelor&amp;#39;s this Spring, but of course I fucked it up and failed two courses. College has been one of the hardest things in my life, not because the classes themselves are hard, but because I can&amp;#39;t seem to motivate myself to complete the work on time. It&amp;#39;s been 6 long years in undergrad. It would be so much easier to just end everything now and be done with it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve heard inert gas asphyxiation is a painless way to go...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "All my life, there have always been expectations. And every single time, I've failed to meet expectations. I can't seem to be motivated or find any determination to do anything. I don't want to suffer anymore. I just want it all to end.\n\nI don't have people I can trust, or rather, I can't seem to open up or cry out for help. I am so tired of living because there is seemingly nothing out there for me. I have been laying around being a lazy lump of shit pitying myself. Why do we toil so hard only to be rewarded by death in the end anyway? All that pain and suffering that comes is so pointless to me and when there is no purpose in life, what good is it? \n\nI was on the verge of graduating college with a bachelor's this Spring, but of course I fucked it up and failed two courses. College has been one of the hardest things in my life, not because the classes themselves are hard, but because I can't seem to motivate myself to complete the work on time. It's been 6 long years in undergrad. It would be so much easier to just end everything now and be done with it. \n\nI've heard inert gas asphyxiation is a painless way to go...", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24azao", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwaway2422242", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24azao/i_think_im_done/", "name": "t3_24azao", "created": 1398830269.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24azao/i_think_im_done/", "author_flair_text": null, "title": "I think I'm done...", "created_utc": 1398801469.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5bgv9", "gilded": 0, "author": "CapAnson", "parent_id": "t3_24azao", "approved_by": null, "body": "Yeah it's hard.. I left college to go into the military..  hated it.. left the military to go back to college.. hated it..  got married.. hated it..  finally I've reached a point where I'm more self indulgent.. I read what I want to read about.. I do what I want to do.. I do things with friends.. or not do as a please.  I think this suits me much better..  might want to give self-indulgence a try.  You can always cash in your chips later on... ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s hard.. I left college to go into the military..  hated it.. left the military to go back to college.. hated it..  got married.. hated it..  finally I&amp;#39;ve reached a point where I&amp;#39;m more self indulgent.. I read what I want to read about.. I do what I want to do.. I do things with friends.. or not do as a please.  I think this suits me much better..  might want to give self-indulgence a try.  You can always cash in your chips later on... &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24azao", "score_hidden": false, "name": "t1_ch5bgv9", "created": 1398805286.0, "author_flair_text": null, "created_utc": 1398801686.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]