[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I told my friends about how I&amp;#39;m suicidal. They said &amp;quot;don&amp;#39;t worry about it, we&amp;#39;ll be here to help out whenever you need it.&amp;quot; Now they are constantly trying to avoid me. We used to be so close, and now they&amp;#39;ll make any excuse to end any conversation, or stop any plans from being made. I feel so alone and the thought of killing myself actually relieves my pain. I might just take my life soon because I see no point in living. My friends have left me and I&amp;#39;ve become such a loser. I&amp;#39;ve almost never left my comfort zone and it&amp;#39;s made me socially awkward. Why should I live? Most people would probably be happy or better off if I was gone. All I want is for the pain to stop. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I told my friends about how I'm suicidal. They said \"don't worry about it, we'll be here to help out whenever you need it.\" Now they are constantly trying to avoid me. We used to be so close, and now they'll make any excuse to end any conversation, or stop any plans from being made. I feel so alone and the thought of killing myself actually relieves my pain. I might just take my life soon because I see no point in living. My friends have left me and I've become such a loser. I've almost never left my comfort zone and it's made me socially awkward. Why should I live? Most people would probably be happy or better off if I was gone. All I want is for the pain to stop. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xsf2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "OptimisticNazi", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xsf2/i_told_my_best_friends_about_my_suicide_and_i/", "name": "t3_23xsf2", "created": 1398446085.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xsf2/i_told_my_best_friends_about_my_suicide_and_i/", "author_flair_text": null, "title": "I told my best friends about my suicide, and I feel worse now.", "created_utc": 1398417285.0, "ups": 5, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1lrji", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_23xsf2", "approved_by": null, "body": "The thing about friends is that it can sometimes be a come and go sort of thing - as we get older, the things we believe in and even allow ourselves to think about really divide us and move us further out. However, as things go on, it somewhat begins to make more sense as to why these divides exist. The short answer is that you'll find people who are more like you in the future - and that these people will be much better for you, and that you'll be able to grow with them in a much better way.\n\n- it sounds like your absolute worst fear was that they would leave you if you expressed what you felt, and it sounds like it may be that this is being reflected back to you.\n\nThe thing is, our experience of how things go, how time passes is a weird one. What I'm really saying is that - give it time. I know that's not the solution to your problems, but what I'm saying is - get to know where you want to go, where you want to be and what you want to do - figure out what it is like to be yourself in a way that you actually enjoy your own mind, your own emotions, and your own perspective in your body.\n\n(I absolutely know this is easier said than done. For me, a major piece of this was music and art. Writing and music probably saved my mind and my life.)\n\nThe feeling/experience of being a social outcast is absolutely one I have held for almost my entire life - to different degrees. I've suffered horrible mental problems, which I'm still getting through.\n\nWhat you begin to realize once you hit 21 is that people don't hold together over friend groups very easily unless they have a reason to be in a particular place that extends beyond the friend group - or at least, I think this is mostly the case.\n\nWhat a lot of people are still figuring out is their future and what they want to feel like, the people they truly want to be around\n\nIf they do not accept you, then I urge you to find people who you actually do feel good around, because it's doing that that bands new kinds of people together, and there's a form of progression to it.\n\nI hope this connects, I don't want to seem like I'm not here to hear what you're saying, I've just been through very similar things.\n\nIt may help a lot to just speak about what you feel and your thoughts with people, because it helps you get acceptance and receptivity that you otherwise don't have in the outside world - and makes it a little easier to connect\n\nTLDR: I feel like you need to find new places and new people to hang out with. It can help to have projects and personal goals of yours that you work on independently that mean something to you, i.e. developing your imagination and what matters to you.", "edited": 1398418175.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing about friends is that it can sometimes be a come and go sort of thing - as we get older, the things we believe in and even allow ourselves to think about really divide us and move us further out. However, as things go on, it somewhat begins to make more sense as to why these divides exist. The short answer is that you&amp;#39;ll find people who are more like you in the future - and that these people will be much better for you, and that you&amp;#39;ll be able to grow with them in a much better way.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;it sounds like your absolute worst fear was that they would leave you if you expressed what you felt, and it sounds like it may be that this is being reflected back to you.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The thing is, our experience of how things go, how time passes is a weird one. What I&amp;#39;m really saying is that - give it time. I know that&amp;#39;s not the solution to your problems, but what I&amp;#39;m saying is - get to know where you want to go, where you want to be and what you want to do - figure out what it is like to be yourself in a way that you actually enjoy your own mind, your own emotions, and your own perspective in your body.&lt;/p&gt;\n\n&lt;p&gt;(I absolutely know this is easier said than done. For me, a major piece of this was music and art. Writing and music probably saved my mind and my life.)&lt;/p&gt;\n\n&lt;p&gt;The feeling/experience of being a social outcast is absolutely one I have held for almost my entire life - to different degrees. I&amp;#39;ve suffered horrible mental problems, which I&amp;#39;m still getting through.&lt;/p&gt;\n\n&lt;p&gt;What you begin to realize once you hit 21 is that people don&amp;#39;t hold together over friend groups very easily unless they have a reason to be in a particular place that extends beyond the friend group - or at least, I think this is mostly the case.&lt;/p&gt;\n\n&lt;p&gt;What a lot of people are still figuring out is their future and what they want to feel like, the people they truly want to be around&lt;/p&gt;\n\n&lt;p&gt;If they do not accept you, then I urge you to find people who you actually do feel good around, because it&amp;#39;s doing that that bands new kinds of people together, and there&amp;#39;s a form of progression to it.&lt;/p&gt;\n\n&lt;p&gt;I hope this connects, I don&amp;#39;t want to seem like I&amp;#39;m not here to hear what you&amp;#39;re saying, I&amp;#39;ve just been through very similar things.&lt;/p&gt;\n\n&lt;p&gt;It may help a lot to just speak about what you feel and your thoughts with people, because it helps you get acceptance and receptivity that you otherwise don&amp;#39;t have in the outside world - and makes it a little easier to connect&lt;/p&gt;\n\n&lt;p&gt;TLDR: I feel like you need to find new places and new people to hang out with. It can help to have projects and personal goals of yours that you work on independently that mean something to you, i.e. developing your imagination and what matters to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xsf2", "score_hidden": false, "name": "t1_ch1lrji", "created": 1398421544.0, "author_flair_text": null, "created_utc": 1398417944.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]