[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the past few weeks i have quit my job, been through doctor after doctor, got diagnosed add, depressed, anxious, bi polar and also a couple other things. I want y&amp;#39;all to know that today I was at a breaking point and I came home and released all of my emotion into writing some lyrics that meant a lot to me and posted them on here for YOU guys. I love all of you for always being here for me whenever I am down, and I really enjoy everything you guys post. I have lurked/ made accounts i&amp;#39;ve forgot about for months, I mean shit i&amp;#39;m still waiting till one of y&amp;#39;all find the bastard who made us wait so long for that safe to be open and then come to find out it was only full of spiders and spiderwebs. I love you guys, and I think I can thank reedit for keeping me humble and in check with life. I would have made some dumb decisions today if it wasn&amp;#39;t for y&amp;#39;all. \nRandom rant: I believe why i care about y&amp;#39;all so much is because with life I am never satisfied, anything that comes my way i think is going to hurt me or leave me, but you guys have stayed behind me and always been here every time I come home to a computer, every time I come home to an empty home with an empty heart, i know i&amp;#39;ve got you filthy bastards to kick it with. Thanks again. It really means more than y&amp;#39;all know and more than y&amp;#39;all will ever realize. I also want you guys to know that i have showed some people i know that are going through rough times reedit and introduced them to this sub reddit. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In the past few weeks i have quit my job, been through doctor after doctor, got diagnosed add, depressed, anxious, bi polar and also a couple other things. I want y'all to know that today I was at a breaking point and I came home and released all of my emotion into writing some lyrics that meant a lot to me and posted them on here for YOU guys. I love all of you for always being here for me whenever I am down, and I really enjoy everything you guys post. I have lurked/ made accounts i've forgot about for months, I mean shit i'm still waiting till one of y'all find the bastard who made us wait so long for that safe to be open and then come to find out it was only full of spiders and spiderwebs. I love you guys, and I think I can thank reedit for keeping me humble and in check with life. I would have made some dumb decisions today if it wasn't for y'all. \nRandom rant: I believe why i care about y'all so much is because with life I am never satisfied, anything that comes my way i think is going to hurt me or leave me, but you guys have stayed behind me and always been here every time I come home to a computer, every time I come home to an empty home with an empty heart, i know i've got you filthy bastards to kick it with. Thanks again. It really means more than y'all know and more than y'all will ever realize. I also want you guys to know that i have showed some people i know that are going through rough times reedit and introduced them to this sub reddit. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24e4jl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayvocals", "media": null, "score": 23, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24e4jl/i_want_yall_to_know/", "name": "t3_24e4jl", "created": 1398914546.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24e4jl/i_want_yall_to_know/", "author_flair_text": null, "title": "I want y'all to know", "created_utc": 1398885746.0, "ups": 26, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6cf23", "gilded": 0, "author": "Redagon", "parent_id": "t3_24e4jl", "approved_by": null, "body": "I know what you mean.\n\nNo one ever really gets what's going on in your head. They assume the most plausible and least complicated scenario and tack it on. Then they search through their directory and find whatever little piece of \"advice\" they can throw your way that's meant to look like they're helping you when really they're just trying to make yourself feel better.\n\nThe thing about surrounding yourself with people who've gone through the same thing is they all know the common factor: The outside will never understand the inside unless they become one themselves.\n\nI'm glad you're feeling better, or attempting to.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean.&lt;/p&gt;\n\n&lt;p&gt;No one ever really gets what&amp;#39;s going on in your head. They assume the most plausible and least complicated scenario and tack it on. Then they search through their directory and find whatever little piece of &amp;quot;advice&amp;quot; they can throw your way that&amp;#39;s meant to look like they&amp;#39;re helping you when really they&amp;#39;re just trying to make yourself feel better.&lt;/p&gt;\n\n&lt;p&gt;The thing about surrounding yourself with people who&amp;#39;ve gone through the same thing is they all know the common factor: The outside will never understand the inside unless they become one themselves.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you&amp;#39;re feeling better, or attempting to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch6cf23", "created": 1398923985.0, "author_flair_text": null, "created_utc": 1398895185.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6east", "gilded": 0, "author": "throwawayvocals", "parent_id": "t3_24e4jl", "approved_by": null, "body": "I really mean it whenever i say that you guys are a life saver and i can't express with words how much it meant to have people there for you whenever you feel like you can't carry on anymore.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really mean it whenever i say that you guys are a life saver and i can&amp;#39;t express with words how much it meant to have people there for you whenever you feel like you can&amp;#39;t carry on anymore.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch6east", "created": 1398928149.0, "author_flair_text": null, "created_utc": 1398899349.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6efkw", "gilded": 0, "author": "throwawayvocals", "parent_id": "t1_ch6cf10", "approved_by": null, "body": "thanks a lot ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks a lot &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch6efkw", "created": 1398903246.0, "author_flair_text": null, "created_utc": 1398899646.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch6cf10", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_24e4jl", "approved_by": null, "body": "Wow! I'm really moved by this. I think reddit has two very different sides to it - one is very judgmental and closed-minded, while the other (especially in this forum) is very understanding and non-judgmental. I've felt much of the same way here. Something about the anonymity and the sheer amount of users allows people to connect with someone similar to themselves without fear of people knowing who they are. I'm so glad you have found a good resource in us here online, and I'm so happy we could support you through whatever crap life deals at you. I have personally found a lot of relief in venting, ranting, or just talking out my issues with others who have gone through similar things. Keep leaning on us, keep reaching out, keep connecting with others - I know I will be.\n\nAll the best\n\nedit: I just listened to your rap as well! Dude, you've got mad talent, and some amazing lyrics. You can definitely tell you pour your heart into it, and that it's really cathartic for you. Keep doing what you're doing, man. I'll keep tuning in to hear some quality rap!", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow! I&amp;#39;m really moved by this. I think reddit has two very different sides to it - one is very judgmental and closed-minded, while the other (especially in this forum) is very understanding and non-judgmental. I&amp;#39;ve felt much of the same way here. Something about the anonymity and the sheer amount of users allows people to connect with someone similar to themselves without fear of people knowing who they are. I&amp;#39;m so glad you have found a good resource in us here online, and I&amp;#39;m so happy we could support you through whatever crap life deals at you. I have personally found a lot of relief in venting, ranting, or just talking out my issues with others who have gone through similar things. Keep leaning on us, keep reaching out, keep connecting with others - I know I will be.&lt;/p&gt;\n\n&lt;p&gt;All the best&lt;/p&gt;\n\n&lt;p&gt;edit: I just listened to your rap as well! Dude, you&amp;#39;ve got mad talent, and some amazing lyrics. You can definitely tell you pour your heart into it, and that it&amp;#39;s really cathartic for you. Keep doing what you&amp;#39;re doing, man. I&amp;#39;ll keep tuning in to hear some quality rap!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch6cf10", "created": 1398923983.0, "author_flair_text": null, "created_utc": 1398895183.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch684pv", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24e4jl", "approved_by": null, "body": "I'm glad you've been able to find some support here man, and I just watched your video. It's really good, but incredible emotional lyrics man. I can see how much this means to you.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you&amp;#39;ve been able to find some support here man, and I just watched your video. It&amp;#39;s really good, but incredible emotional lyrics man. I can see how much this means to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch684pv", "created": 1398915419.0, "author_flair_text": null, "created_utc": 1398886619.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6m39x", "gilded": 0, "author": "maniacallore", "parent_id": "t3_24e4jl", "approved_by": null, "body": "Find what makes you constant. Fuck the final word.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find what makes you constant. Fuck the final word.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e4jl", "score_hidden": false, "name": "t1_ch6m39x", "created": 1398920342.0, "author_flair_text": null, "created_utc": 1398916742.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]