[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really just tired of living.  I&amp;#39;ve been depressed for 15 years now, I&amp;#39;m 27, and at this point it&amp;#39;s time to face the fact that things aren&amp;#39;t going to get better.  Not to mention the world is going to shit and life for all of us is going to get worse soon, I don&amp;#39;t want to be around for that and I might as well stop being a waste of water, oil, food, electricty, etc sooner rather than later.  Better to let someone who can actually enjoy life a bit use those things, somebody who isn&amp;#39;t an awful human being.  I&amp;#39;m literally hopeless and it&amp;#39;s all downhill from here, it&amp;#39;s been downhill for fifteen fucking shitty, bleak, pointless years of OCD, irritable bowel syndrome, watching family members die, trying to numb myself with drugs and alcohol, then exercise, then travel, then sex... well, surprise, none of it fucking worked.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve decided to end it, but because I&amp;#39;m a fucking coward jumping, hanging, shooting are out... I&amp;#39;d most likely fuck it up and end up a vegetable or disfigured and even more of an emotional/physical burden on everyone I know.  I just want a fucking bottle of nembutal or thiopental or something... what kind of fucked up country is this that doesn&amp;#39;t let people in pain euthanize themselves and yet tortures innocent people to death in its prisons and overseas?  I fucking hate America and I almost want to stay alive just to watch its leaders and corrupt oligarchs and celebrities burn, the fuckers.  But really hate isn&amp;#39;t enough to sustain oneself.  So I just want enough pills.  Maybe heroin will do the trick, pretty sure I can get that easily.  I just don&amp;#39;t want it to be painful.  That&amp;#39;s how much of a weak coward I am.  I just want to go to sleep and never wake up.  I&amp;#39;m looking forward to slipping off into that void as soon as I can, I haven&amp;#39;t had a good night&amp;#39;s sleep in fucking years.  If I had the means in front of me right now I&amp;#39;d fucking do it.  My mission for tomorrow is to see if I can make that happen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm really just tired of living.  I've been depressed for 15 years now, I'm 27, and at this point it's time to face the fact that things aren't going to get better.  Not to mention the world is going to shit and life for all of us is going to get worse soon, I don't want to be around for that and I might as well stop being a waste of water, oil, food, electricty, etc sooner rather than later.  Better to let someone who can actually enjoy life a bit use those things, somebody who isn't an awful human being.  I'm literally hopeless and it's all downhill from here, it's been downhill for fifteen fucking shitty, bleak, pointless years of OCD, irritable bowel syndrome, watching family members die, trying to numb myself with drugs and alcohol, then exercise, then travel, then sex... well, surprise, none of it fucking worked.\n\nI've decided to end it, but because I'm a fucking coward jumping, hanging, shooting are out... I'd most likely fuck it up and end up a vegetable or disfigured and even more of an emotional/physical burden on everyone I know.  I just want a fucking bottle of nembutal or thiopental or something... what kind of fucked up country is this that doesn't let people in pain euthanize themselves and yet tortures innocent people to death in its prisons and overseas?  I fucking hate America and I almost want to stay alive just to watch its leaders and corrupt oligarchs and celebrities burn, the fuckers.  But really hate isn't enough to sustain oneself.  So I just want enough pills.  Maybe heroin will do the trick, pretty sure I can get that easily.  I just don't want it to be painful.  That's how much of a weak coward I am.  I just want to go to sleep and never wake up.  I'm looking forward to slipping off into that void as soon as I can, I haven't had a good night's sleep in fucking years.  If I had the means in front of me right now I'd fucking do it.  My mission for tomorrow is to see if I can make that happen.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24objf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "exwalrus", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399181158.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24objf/i_want_to_know_what_it_feels_like_to_die/", "name": "t3_24objf", "created": 1399209729.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24objf/i_want_to_know_what_it_feels_like_to_die/", "author_flair_text": null, "title": "I want to know what it feels like to die.", "created_utc": 1399180929.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]