[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t even find the words to describe why. The free-fall I guess, too fucking broke to afford skydiving, or I&amp;#39;d just do that instead. Dumbest reason to kill myself but I want.. no..NEED some little thrill in my pointless life that going off the top of a building is going to be the only way to do it. People say money can&amp;#39;t buy happiness, but they&amp;#39;re full of shit. Haven&amp;#39;t had money to do anything in 5 years now.\nBetween sleeping in my car, using free wifi, getting temp work that lasts maybe 2 days, and then another 2 months until the next shitty 2 or 3 day temp job. 23, and I can&amp;#39;t find a fulltime job. I&amp;#39;ve put in at least A THOUSAND apps since I turned 18. That&amp;#39;s 5 years of being an oxygen wasting pos. My life has become the true meaning of pointless. At this point, I&amp;#39;m contributing nothing to society, and wasting oxygen for those that are. Maybe I just want advice.. But I need some kind of thrill.. something.. if only for a fleeting moment. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't even find the words to describe why. The free-fall I guess, too fucking broke to afford skydiving, or I'd just do that instead. Dumbest reason to kill myself but I want.. no..NEED some little thrill in my pointless life that going off the top of a building is going to be the only way to do it. People say money can't buy happiness, but they're full of shit. Haven't had money to do anything in 5 years now.\nBetween sleeping in my car, using free wifi, getting temp work that lasts maybe 2 days, and then another 2 months until the next shitty 2 or 3 day temp job. 23, and I can't find a fulltime job. I've put in at least A THOUSAND apps since I turned 18. That's 5 years of being an oxygen wasting pos. My life has become the true meaning of pointless. At this point, I'm contributing nothing to society, and wasting oxygen for those that are. Maybe I just want advice.. But I need some kind of thrill.. something.. if only for a fleeting moment. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243g2m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Cynic4l", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243g2m/i_want_to_jump/", "name": "t3_243g2m", "created": 1398620633.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243g2m/i_want_to_jump/", "author_flair_text": null, "title": "I want to jump.", "created_utc": 1398591833.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3a0a0", "gilded": 0, "author": "cuddlethisrebuttal", "parent_id": "t3_243g2m", "approved_by": null, "body": "You should check out www.workaway.info. travel around the world and meet new people. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should check out &lt;a href=\"http://www.workaway.info\"&gt;www.workaway.info&lt;/a&gt;. travel around the world and meet new people. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243g2m", "score_hidden": false, "name": "t1_ch3a0a0", "created": 1398610249.0, "author_flair_text": null, "created_utc": 1398606649.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3o82m", "gilded": 0, "author": "Seletial", "parent_id": "t3_243g2m", "approved_by": null, "body": "I am 100% certain that you are contributing to society, but I also realize that it has to be meaningful to you. My advice to you is to realize just how dedicated and determined you appear to be, based simply off of your post. You have traits that plenty of employers would value, but you haven't found the right way to market yourself yet, or you haven't found the right people that understand how diligent and productive you can be. \nAs for feeling like you are worthless, I would challenge you to create something, and I am not talking about spending money to do so. You obviously have the means to go online, which means that you have the capability of creating something permanent and important to many people. This very post is important don't you think? So create, and share it, and build a network of communication off of the feedback and responses that you get. Develop and cultivate that network, because that is the key to success. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 100% certain that you are contributing to society, but I also realize that it has to be meaningful to you. My advice to you is to realize just how dedicated and determined you appear to be, based simply off of your post. You have traits that plenty of employers would value, but you haven&amp;#39;t found the right way to market yourself yet, or you haven&amp;#39;t found the right people that understand how diligent and productive you can be. \nAs for feeling like you are worthless, I would challenge you to create something, and I am not talking about spending money to do so. You obviously have the means to go online, which means that you have the capability of creating something permanent and important to many people. This very post is important don&amp;#39;t you think? So create, and share it, and build a network of communication off of the feedback and responses that you get. Develop and cultivate that network, because that is the key to success. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243g2m", "score_hidden": false, "name": "t1_ch3o82m", "created": 1398644535.0, "author_flair_text": null, "created_utc": 1398640935.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38atv", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_243g2m", "approved_by": null, "body": "Damn. \n\n(In addition, you may want to look into a trade skill perhaps? Trade schools can be relatively inexpensive. Also, I have heard good things about unions, that they can train you and find you employment as well, but this is not from personal experience.)\n\nYou ever make music?\n\nMusic means a lot to me, I don't know how I would function without some of the bands that I know of - it helps me to find people who I can actually connect to.\n\nMetal probably saved my life. But it lets you be intense and making music with other people is intense, too. You can feel like a total nothing (like me) and have music and it gives you *something* to share with others and be socially accepted. (A mini travel guitar you can just haul around to wherever you go, bars, etc, can be awesome, and they don't have to be pricey.)", "edited": 1398599500.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn. &lt;/p&gt;\n\n&lt;p&gt;(In addition, you may want to look into a trade skill perhaps? Trade schools can be relatively inexpensive. Also, I have heard good things about unions, that they can train you and find you employment as well, but this is not from personal experience.)&lt;/p&gt;\n\n&lt;p&gt;You ever make music?&lt;/p&gt;\n\n&lt;p&gt;Music means a lot to me, I don&amp;#39;t know how I would function without some of the bands that I know of - it helps me to find people who I can actually connect to.&lt;/p&gt;\n\n&lt;p&gt;Metal probably saved my life. But it lets you be intense and making music with other people is intense, too. You can feel like a total nothing (like me) and have music and it gives you &lt;em&gt;something&lt;/em&gt; to share with others and be socially accepted. (A mini travel guitar you can just haul around to wherever you go, bars, etc, can be awesome, and they don&amp;#39;t have to be pricey.)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243g2m", "score_hidden": false, "name": "t1_ch38atv", "created": 1398602114.0, "author_flair_text": null, "created_utc": 1398598514.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yspm", "gilded": 0, "author": "ignorethename", "parent_id": "t3_243g2m", "approved_by": null, "body": "It does not matter that you don't work. There are billionaire heirs out there who do no work for more years than that, or never. No one tells them thwy are worthless. Rather our laws go out of their way to be nice to them in so many ways, not to mention all the good things money can buy. So forget about that part, about being not worth much. Don't allow anyone or any random thought to dictate your self worth.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It does not matter that you don&amp;#39;t work. There are billionaire heirs out there who do no work for more years than that, or never. No one tells them thwy are worthless. Rather our laws go out of their way to be nice to them in so many ways, not to mention all the good things money can buy. So forget about that part, about being not worth much. Don&amp;#39;t allow anyone or any random thought to dictate your self worth.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243g2m", "score_hidden": false, "name": "t1_ch3yspm", "created": 1398696765.0, "author_flair_text": null, "created_utc": 1398667965.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]