[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am seriously suicidal. I&amp;#39;m only here because I can&amp;#39;t betray my wife.\nMy depression has interfered with my career and virtually my entire self-esteem. I don&amp;#39;t think I can continue much longer and I find myself wishing I would just drop dead or die in a plan crash so I can free my wife to marry someone better than me.&lt;/p&gt;\n\n&lt;p&gt;I began keeping a diary online and maybe you guys are interested in reading. I posted it in r/depression but I think this forum might be better. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not a cry for help but more just an admission of my pain. I don&amp;#39;t really care if people disagree or try to convince me otherwise, since I&amp;#39;ve decided that I want to die from my own hand eventually. I just hope that maybe I can help some of the selfish people out there learn what their actions do to make people want to kill themselves.&lt;/p&gt;\n\n&lt;p&gt;my diary is at: thecircumstancesofmydeath.wordpress.com&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am seriously suicidal. I'm only here because I can't betray my wife.\nMy depression has interfered with my career and virtually my entire self-esteem. I don't think I can continue much longer and I find myself wishing I would just drop dead or die in a plan crash so I can free my wife to marry someone better than me.\n\nI began keeping a diary online and maybe you guys are interested in reading. I posted it in r/depression but I think this forum might be better. \n\nIt's not a cry for help but more just an admission of my pain. I don't really care if people disagree or try to convince me otherwise, since I've decided that I want to die from my own hand eventually. I just hope that maybe I can help some of the selfish people out there learn what their actions do to make people want to kill themselves.\n\nmy diary is at: thecircumstancesofmydeath.wordpress.com", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24twao", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "HalfAsianBob", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24twao/i_wanted_to_share_with_other_suicidal_people_my/", "name": "t3_24twao", "created": 1399371185.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24twao/i_wanted_to_share_with_other_suicidal_people_my/", "author_flair_text": null, "title": "I wanted to share with other suicidal people my pain, hope we can support each other whether or not we do it", "created_utc": 1399342385.0, "ups": 11, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chay4ib", "gilded": 0, "author": "HalfAsianBob", "parent_id": "t1_chamnfi", "approved_by": null, "body": "Thanks for both your comments.\n\nI love my wife VERY dearly. She is a VERY good woman, and it is hard to find one like her now.\n\nI would never hurt her like that, and as I said, the only thing that really keeps me going is her; I've devoted my entire life to her and live selflessly.\n\nThe way I conduct my life now is as if I were already dead, and that I am there only for her. This is a method of living that I've found to be most helpful in getting me through the days. \n\nAt my age I am very, very tired and most days are a huge struggle for me, but her smile is literally the only thing that gives me strength.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for both your comments.&lt;/p&gt;\n\n&lt;p&gt;I love my wife VERY dearly. She is a VERY good woman, and it is hard to find one like her now.&lt;/p&gt;\n\n&lt;p&gt;I would never hurt her like that, and as I said, the only thing that really keeps me going is her; I&amp;#39;ve devoted my entire life to her and live selflessly.&lt;/p&gt;\n\n&lt;p&gt;The way I conduct my life now is as if I were already dead, and that I am there only for her. This is a method of living that I&amp;#39;ve found to be most helpful in getting me through the days. &lt;/p&gt;\n\n&lt;p&gt;At my age I am very, very tired and most days are a huge struggle for me, but her smile is literally the only thing that gives me strength.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24twao", "score_hidden": false, "name": "t1_chay4ib", "created": 1399415679.0, "author_flair_text": null, "created_utc": 1399386879.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbe9kc", "gilded": 0, "author": "SQLwitch", "parent_id": "t1_chamnfi", "approved_by": null, "body": "Please do not deliver this kind of guilt-tripping message here.  Although it may help some people, it will make many others worse.  Your intent may be to prevent suicides, but if you keep doing this, you'll cause them.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do not deliver this kind of guilt-tripping message here.  Although it may help some people, it will make many others worse.  Your intent may be to prevent suicides, but if you keep doing this, you&amp;#39;ll cause them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24twao", "score_hidden": false, "name": "t1_chbe9kc", "created": 1399449624.0, "author_flair_text": null, "created_utc": 1399420824.0, "distinguished": "moderator", "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chamnfi", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24twao", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24twao", "score_hidden": false, "name": "t1_chamnfi", "created": 1399372194.0, "author_flair_text": null, "created_utc": 1399343394.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chauq4l", "gilded": 0, "author": "boobmuncher", "parent_id": "t3_24twao", "approved_by": null, "body": "Have you thought about seeking help? I know that some people may find opinions unwelcome, but personally, I try to think of suicide as a last resort. I know that when I first attempted suicide I hadn't yet tried anything to help myself, and I remember thinking at that final moment, \"what if?\" \n\nI'm in therapy at the moment and about to start medication, and I have gotten better. I'm not euphoric, or even un-sad, but I am less suicidal, less severely depressed. So I guess what I'm trying to say is that if you try therapy, or take medication, or just explore your options, then maybe there is a chance that you might get better. Even if you do decide to end your life you'd feel good knowing that at least you tried. \n\nAnd about your wife. Have you ever heard the saying that \"if you believe you aren't good enough for her, you definitely deserve her\"? That's not the exact quote but... you get the idea. Unless you're a wife beater or something like that, you are definitely good enough for her. If she loves you and you are good to her, **you are good enough**. Just the fact that you appreciate her shows that *you are good enough*. \n\nDepression can really be a bitch about interfering with rational thought, making you view your world in a biased manner. And we understand, or at least we're trying to. Talk to us (you can PM me if you want to) any time you would like somebody to talk to. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you thought about seeking help? I know that some people may find opinions unwelcome, but personally, I try to think of suicide as a last resort. I know that when I first attempted suicide I hadn&amp;#39;t yet tried anything to help myself, and I remember thinking at that final moment, &amp;quot;what if?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in therapy at the moment and about to start medication, and I have gotten better. I&amp;#39;m not euphoric, or even un-sad, but I am less suicidal, less severely depressed. So I guess what I&amp;#39;m trying to say is that if you try therapy, or take medication, or just explore your options, then maybe there is a chance that you might get better. Even if you do decide to end your life you&amp;#39;d feel good knowing that at least you tried. &lt;/p&gt;\n\n&lt;p&gt;And about your wife. Have you ever heard the saying that &amp;quot;if you believe you aren&amp;#39;t good enough for her, you definitely deserve her&amp;quot;? That&amp;#39;s not the exact quote but... you get the idea. Unless you&amp;#39;re a wife beater or something like that, you are definitely good enough for her. If she loves you and you are good to her, &lt;strong&gt;you are good enough&lt;/strong&gt;. Just the fact that you appreciate her shows that &lt;em&gt;you are good enough&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Depression can really be a bitch about interfering with rational thought, making you view your world in a biased manner. And we understand, or at least we&amp;#39;re trying to. Talk to us (you can PM me if you want to) any time you would like somebody to talk to. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24twao", "score_hidden": false, "name": "t1_chauq4l", "created": 1399403766.0, "author_flair_text": null, "created_utc": 1399374966.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]