[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A commercial helicopter pilot up in the northwest states, working for the forrest service or something. Helicopters are cool, and I have a plan to get there and everything; First I get my fixed wing private license, then instrumental rating, then commercial, get sucked into some flight job, probably mail or something, using salary to fund my helicopter training, build up hours, get the relative licenses and then apply for jobs, and get one. I have pilot connections in lots of places so I could do this...&lt;/p&gt;\n\n&lt;p&gt;That is if I didn&amp;#39;t fuck up my life. I&amp;#39;ve failed pretty much every class my last semester of high school, I can&amp;#39;t graduate now, since I needed to do the exact opposite of failing every class in order to graduate. It&amp;#39;s not like I couldn&amp;#39;t pass those classes, I just didn&amp;#39;t care, no motivation at all. I don&amp;#39;t want to do anything anymore, and this has been going on for pretty much the last few years (not doing anything). &lt;/p&gt;\n\n&lt;p&gt;I tried a professional help service, but it didn&amp;#39;t do much. The guy said get a therapist, but since I live with my parents and don&amp;#39;t have my driver&amp;#39;s license I have to go through them. He asked how long I&amp;#39;ve been having suicidal thoughts which has been since the beginning of the calendar year, he said that&amp;#39;s a long time to be in pain, but I&amp;#39;m not. I have no pain, I don&amp;#39;t feel anything, sad or happy. I want to cry, bawl my eyes out, like the pussy I am, but I can&amp;#39;t, I just can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;People hate talking to me, because I don&amp;#39;t give them anything back, just a stoic face with single syllable replies or grunts. They ask me if I even care to which I reply yea, &amp;quot;then demonstrate that&amp;quot; as they leave annoyed.&lt;/p&gt;\n\n&lt;p&gt;I had a backup plan for when I fail. That was to get my GED then go through a handful of college transfers to get somewhere decent. But now that&amp;#39;s not an option if I want to be a pilot. I do not want to go through another semester, I&amp;#39;ve seen the how the teachers talk down to the super-seniors. \n&amp;quot;How about you talk to your guidance counselor?&amp;quot; No. She is the worst, everyone around here knows this, she&amp;#39;s overly chipper and talks to you condescendingly when you want to do something she considers non-optimal (imagine the pink one from harry potter). Not only that but she&amp;#39;s a bit overweight, and she decides to put around the school and one of those scooters with a pompous smile on her face. She may genuinely need that, and I amend for her attitude despite her conditions, but man is she a @%!#.&lt;/p&gt;\n\n&lt;p&gt;No friends at all to speak of, no one anywhere near me to talk to, not that it&amp;#39;d do me any good, I even lie to strangers when there&amp;#39;s no reason to. I had friends once, but they just drifted away. Meh, no one wants me. There&amp;#39;s already been several suicides the past few years at this school, people flocked all over it, trying to associate themselves with the victim so to get their own seat on the sympathy train. I hope I my acquaintances are few enough that doesn&amp;#39;t happen. Then some people did this anti-suicide thing to help those thinking about it, didn&amp;#39;t do anything for me. One thing they did was compliment cards, people write compliments on these papers the. They get delivered to said person, or one could choose &amp;#39;random person&amp;#39;, hey random person! &amp;quot;You&amp;#39;re really smart!&amp;quot; Liars, you don&amp;#39;t know that for sure, that could have been given to anyone, it still would have said the same damn thing.&lt;/p&gt;\n\n&lt;p&gt;I lie a lot, to avoid doing various things, and to keep my figurative mask on. No one knows this, and I&amp;#39;ve been doing so long, that I don&amp;#39;t know if I could take it off if I wanted to. I &amp;quot;miss&amp;quot; tests then &amp;quot;forget&amp;quot; to make them up, then act surprised when confronted by my parents&lt;/p&gt;\n\n&lt;p&gt;To be honest I don&amp;#39;t know why I&amp;#39;m posting here, I&amp;#39;ve done it before, and it didn&amp;#39;t really do anything. I guess that I&amp;#39;m not ready to give up yet... well, I&amp;#39;ve already given up, I just haven&amp;#39;t left yet. Maybe I want advice, probably wont follow it. Maybe I want to talk, probably wont do anything. Don&amp;#39;t want to reach out to someone I know, I am deathly afraid of confrontation, hence the alternate account. Maybe I&amp;#39;m practicing talking to someone, gradually giving up my mask for when I want to speak my mind to someone in person. Bleh.&lt;/p&gt;\n\n&lt;p&gt;TL:DR: Tomatoes should not be classified as a fruit, then they&amp;#39;d start showing up as yogurt flavors.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A commercial helicopter pilot up in the northwest states, working for the forrest service or something. Helicopters are cool, and I have a plan to get there and everything; First I get my fixed wing private license, then instrumental rating, then commercial, get sucked into some flight job, probably mail or something, using salary to fund my helicopter training, build up hours, get the relative licenses and then apply for jobs, and get one. I have pilot connections in lots of places so I could do this...\n\nThat is if I didn't fuck up my life. I've failed pretty much every class my last semester of high school, I can't graduate now, since I needed to do the exact opposite of failing every class in order to graduate. It's not like I couldn't pass those classes, I just didn't care, no motivation at all. I don't want to do anything anymore, and this has been going on for pretty much the last few years (not doing anything). \n\nI tried a professional help service, but it didn't do much. The guy said get a therapist, but since I live with my parents and don't have my driver's license I have to go through them. He asked how long I've been having suicidal thoughts which has been since the beginning of the calendar year, he said that's a long time to be in pain, but I'm not. I have no pain, I don't feel anything, sad or happy. I want to cry, bawl my eyes out, like the pussy I am, but I can't, I just can't.\n\nPeople hate talking to me, because I don't give them anything back, just a stoic face with single syllable replies or grunts. They ask me if I even care to which I reply yea, \"then demonstrate that\" as they leave annoyed.\n\nI had a backup plan for when I fail. That was to get my GED then go through a handful of college transfers to get somewhere decent. But now that's not an option if I want to be a pilot. I do not want to go through another semester, I've seen the how the teachers talk down to the super-seniors. \n\"How about you talk to your guidance counselor?\" No. She is the worst, everyone around here knows this, she's overly chipper and talks to you condescendingly when you want to do something she considers non-optimal (imagine the pink one from harry potter). Not only that but she's a bit overweight, and she decides to put around the school and one of those scooters with a pompous smile on her face. She may genuinely need that, and I amend for her attitude despite her conditions, but man is she a @%!#.\n\nNo friends at all to speak of, no one anywhere near me to talk to, not that it'd do me any good, I even lie to strangers when there's no reason to. I had friends once, but they just drifted away. Meh, no one wants me. There's already been several suicides the past few years at this school, people flocked all over it, trying to associate themselves with the victim so to get their own seat on the sympathy train. I hope I my acquaintances are few enough that doesn't happen. Then some people did this anti-suicide thing to help those thinking about it, didn't do anything for me. One thing they did was compliment cards, people write compliments on these papers the. They get delivered to said person, or one could choose 'random person', hey random person! \"You're really smart!\" Liars, you don't know that for sure, that could have been given to anyone, it still would have said the same damn thing.\n\nI lie a lot, to avoid doing various things, and to keep my figurative mask on. No one knows this, and I've been doing so long, that I don't know if I could take it off if I wanted to. I \"miss\" tests then \"forget\" to make them up, then act surprised when confronted by my parents\n\nTo be honest I don't know why I'm posting here, I've done it before, and it didn't really do anything. I guess that I'm not ready to give up yet... well, I've already given up, I just haven't left yet. Maybe I want advice, probably wont follow it. Maybe I want to talk, probably wont do anything. Don't want to reach out to someone I know, I am deathly afraid of confrontation, hence the alternate account. Maybe I'm practicing talking to someone, gradually giving up my mask for when I want to speak my mind to someone in person. Bleh.\n\nTL:DR: Tomatoes should not be classified as a fruit, then they'd start showing up as yogurt flavors.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ibpw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ta4214", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ibpw/i_want_to_be_a_pilot/", "name": "t3_24ibpw", "created": 1399025007.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ibpw/i_want_to_be_a_pilot/", "author_flair_text": null, "title": "I want to be a pilot", "created_utc": 1398996207.0, "ups": 7, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7hxx2", "gilded": 0, "author": "nbd9000", "parent_id": "t3_24ibpw", "approved_by": null, "body": "hey. \nIm a professional airline pilot, and would be happy to help you get on your feet and follow your dreams. I went through some serious depression growing up, so i have a lot of perspective on what youre going through. If you want some help, send me a message. Ive helped a lot of people get where they wanted to go, and seriously, there is no obstacle that will keep you down- you just have to be prepared to get outside the box a little. \n\n\ntl;dr: if you want this to happen, i can help you make it happen. just drop me a line.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey. \nIm a professional airline pilot, and would be happy to help you get on your feet and follow your dreams. I went through some serious depression growing up, so i have a lot of perspective on what youre going through. If you want some help, send me a message. Ive helped a lot of people get where they wanted to go, and seriously, there is no obstacle that will keep you down- you just have to be prepared to get outside the box a little. &lt;/p&gt;\n\n&lt;p&gt;tl;dr: if you want this to happen, i can help you make it happen. just drop me a line.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ibpw", "score_hidden": false, "name": "t1_ch7hxx2", "created": 1399033502.0, "author_flair_text": null, "created_utc": 1399004702.0, "distinguished": null, "num_reports": null, "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7jea0", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24ibpw", "approved_by": null, "body": "It's astounding how common people in therapy positions can be that way. I have met some people in those positions who only proceeded to attempt to use power over me in strange ways, challenging me and insisting a great deal of superiority to me (People don't have to believe this, but it's very much been true for me). It's normal working people that have been much more therapeutic/kind to me!\n\n I have this thought that at one point it was easy for them to get into therapy positions, when the positions themselves were new or something.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s astounding how common people in therapy positions can be that way. I have met some people in those positions who only proceeded to attempt to use power over me in strange ways, challenging me and insisting a great deal of superiority to me (People don&amp;#39;t have to believe this, but it&amp;#39;s very much been true for me). It&amp;#39;s normal working people that have been much more therapeutic/kind to me!&lt;/p&gt;\n\n&lt;p&gt;I have this thought that at one point it was easy for them to get into therapy positions, when the positions themselves were new or something.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ibpw", "score_hidden": false, "name": "t1_ch7jea0", "created": 1399037956.0, "author_flair_text": null, "created_utc": 1399009156.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7vcdr", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24ibpw", "approved_by": null, "body": "&gt; There's already been several suicides the past few years at this school, people flocked all over it, trying to associate themselves with the victim so to get their own seat on the sympathy train.\n\nHoly ****ing yeah.\n\nI have witnessed this myself via social media. Holy wow. It's one thing when you are attempting to post your respects to someone who meant something to you. I think the majority of the people have this in mind.\n\nBut.. Yeah. I've absolutely seen that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s already been several suicides the past few years at this school, people flocked all over it, trying to associate themselves with the victim so to get their own seat on the sympathy train.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Holy ****ing yeah.&lt;/p&gt;\n\n&lt;p&gt;I have witnessed this myself via social media. Holy wow. It&amp;#39;s one thing when you are attempting to post your respects to someone who meant something to you. I think the majority of the people have this in mind.&lt;/p&gt;\n\n&lt;p&gt;But.. Yeah. I&amp;#39;ve absolutely seen that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ibpw", "score_hidden": false, "name": "t1_ch7vcdr", "created": 1399080295.0, "author_flair_text": null, "created_utc": 1399051495.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]