[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to die, it&amp;#39;s as simple as that. I&amp;#39;m not going to kill myself, not now at least. I&amp;#39;m too young, and I know to many people to do it. \nWhen I have the money, one day I&amp;#39;m just going to fuck off, go to some beautiful country, see all I want to see, do all I want to see, become invisible, I saw a picture of Venice today, it looked absolutely beautiful. Maybe there, I&amp;#39;ll forget everything, and go there. Leave everything behind, get a house and just live there for a few months as a no body, at least then being a no body would be my intention. Maybe then I&amp;#39;ll pack my shit and go somewhere else, maybe Croatia, or one of those old villages in China, then one day, once I&amp;#39;ve gone everywhere, and I&amp;#39;ve dropped all connections with everyone, I&amp;#39;ll travel one last time, this time by foot to somewhere where no one will find me, and kill myself. I&amp;#39;ll probably get really drunk and fall off a cliff, or just shoot myself, something that will leave me hidden for a while, then if and when someone finds me, hopefully my family will never find out that I&amp;#39;m gone for good. I&amp;#39;d rather them think I was still traveling than them know I was dead. Or at the very least, I&amp;#39;d rather them think it were an accident. I couldn&amp;#39;t do it now because I can&amp;#39;t stand the thought of what it&amp;#39;d do to my family or my girlfriend, or the few people who even give a shit about me. &lt;/p&gt;\n\n&lt;p&gt;Until then, I&amp;#39;ll just continue to exist, and do as I&amp;#39;m meant to. Get an education, a job, a house, pay taxes and bills and whatever... But one day I&amp;#39;ll see my opportunity, and I&amp;#39;ll just disappear without telling a soul, not even so much as saying bye.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I want to die, it's as simple as that. I'm not going to kill myself, not now at least. I'm too young, and I know to many people to do it. \nWhen I have the money, one day I'm just going to fuck off, go to some beautiful country, see all I want to see, do all I want to see, become invisible, I saw a picture of Venice today, it looked absolutely beautiful. Maybe there, I'll forget everything, and go there. Leave everything behind, get a house and just live there for a few months as a no body, at least then being a no body would be my intention. Maybe then I'll pack my shit and go somewhere else, maybe Croatia, or one of those old villages in China, then one day, once I've gone everywhere, and I've dropped all connections with everyone, I'll travel one last time, this time by foot to somewhere where no one will find me, and kill myself. I'll probably get really drunk and fall off a cliff, or just shoot myself, something that will leave me hidden for a while, then if and when someone finds me, hopefully my family will never find out that I'm gone for good. I'd rather them think I was still traveling than them know I was dead. Or at the very least, I'd rather them think it were an accident. I couldn't do it now because I can't stand the thought of what it'd do to my family or my girlfriend, or the few people who even give a shit about me. \n\nUntil then, I'll just continue to exist, and do as I'm meant to. Get an education, a job, a house, pay taxes and bills and whatever... But one day I'll see my opportunity, and I'll just disappear without telling a soul, not even so much as saying bye.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240qyn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NomOnBacon", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240qyn/i_want_to_get_out_of_this_country/", "name": "t3_240qyn", "created": 1398532464.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240qyn/i_want_to_get_out_of_this_country/", "author_flair_text": null, "title": "I want to get out of this country", "created_utc": 1398503664.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch34awx", "gilded": 0, "author": "NomOnBacon", "parent_id": "t1_ch2nsi2", "approved_by": null, "body": "That was a beautiful metaphor... ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was a beautiful metaphor... &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240qyn", "score_hidden": false, "name": "t1_ch34awx", "created": 1398580326.0, "author_flair_text": null, "created_utc": 1398576726.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2nsi2", "gilded": 0, "author": "nixon007", "parent_id": "t3_240qyn", "approved_by": null, "body": "There are seasons to life, in the season u are in it may be winter. But even winter melts into spring", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are seasons to life, in the season u are in it may be winter. But even winter melts into spring&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240qyn", "score_hidden": false, "name": "t1_ch2nsi2", "created": 1398536313.0, "author_flair_text": null, "created_utc": 1398532713.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]