[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I get occasional bursts of motivation to be fit, healthy, and learn to be more outgoing. It&amp;#39;s all an elaborate performance I con myself into hoping for. Even when I actively and routinely try and habitualize exercise and positive activities, I inevitably take 2 steps forward and 4 steps back. Every time I think I can become a person that has something to offer to the world, my subconscious mind tricks me into falling down even harder and punishing myself without mercy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 26.  My birthday&amp;#39;s in a couple months. I always thought the notion of the 27 club was an invented sensation for celebrity culture, but I am beginning to feel an increasingly real sense that I might fail to turn my life around and that this could be my last year alive. I don&amp;#39;t want this to become true, but I have a feeling in my bones that I&amp;#39;m very close to unintentionally ending my life as a result of trying to quell the chaos I can&amp;#39;t come to terms with inside my mind.&lt;/p&gt;\n\n&lt;p&gt;I am seeking help and have been for several weeks. I&amp;#39;m trying to stay motivated. But my body feels decades older than it is after all the punishment. &lt;/p&gt;\n\n&lt;p&gt;Comment if you want to; it probably won&amp;#39;t cheer me up. I&amp;#39;m not crying for help and am not currently suicidal. I just think I sealed my fate many years ago.&lt;/p&gt;\n\n&lt;p&gt;edt: Venting to strangers in faraway places of the interwebs was slightly anxiety reducing. This too shall pass. Or so they say.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I get occasional bursts of motivation to be fit, healthy, and learn to be more outgoing. It's all an elaborate performance I con myself into hoping for. Even when I actively and routinely try and habitualize exercise and positive activities, I inevitably take 2 steps forward and 4 steps back. Every time I think I can become a person that has something to offer to the world, my subconscious mind tricks me into falling down even harder and punishing myself without mercy.\n\nI'm 26.  My birthday's in a couple months. I always thought the notion of the 27 club was an invented sensation for celebrity culture, but I am beginning to feel an increasingly real sense that I might fail to turn my life around and that this could be my last year alive. I don't want this to become true, but I have a feeling in my bones that I'm very close to unintentionally ending my life as a result of trying to quell the chaos I can't come to terms with inside my mind.\n\nI am seeking help and have been for several weeks. I'm trying to stay motivated. But my body feels decades older than it is after all the punishment. \n\nComment if you want to; it probably won't cheer me up. I'm not crying for help and am not currently suicidal. I just think I sealed my fate many years ago.\n\nedt: Venting to strangers in faraway places of the interwebs was slightly anxiety reducing. This too shall pass. Or so they say.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25edjv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ienjoyopium", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399942818.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25edjv/i_want_to_live_consciously_that_is_but_cant_stop/", "name": "t3_25edjv", "created": 1399962979.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25edjv/i_want_to_live_consciously_that_is_but_cant_stop/", "author_flair_text": null, "title": "I want to live (consciously, that is), but can't stop slowly killing my health and sense of self. I'm a long-term addict, and honestly feel like less of a danger to myself when I'm not trying to get clean.", "created_utc": 1399934179.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgfvyj", "gilded": 0, "author": "sortinglife", "parent_id": "t1_chgfoiq", "approved_by": null, "body": "http://www.wwoof.net/", "edited": 1399992277.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.wwoof.net/\"&gt;http://www.wwoof.net/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25edjv", "score_hidden": false, "name": "t1_chgfvyj", "created": 1399971443.0, "author_flair_text": null, "created_utc": 1399942643.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgfoiq", "gilded": 0, "author": "ienjoyopium", "parent_id": "t1_chgekib", "approved_by": null, "body": "One major hurdle is the fact that I don't get any kind of feel-good chemicals from socializing anymore. I have grown tired of the nights out with friends, even the \"closest\" ones. I also have lost a sense of passion for anything I once lived for. Nothing inspires hope. I don't want to take the easy way out, but I'm not as resilient in my subconscious fight against my natural disposition to self harm and sabotage. In the past few weeks I have found that trying to make positive self talk come more naturally involves having to stop and correct 90% of my inner monologue.\n\nI've been on a manic episode for 2 or 3 days now. Have made some mistakes in that time that I can't understand because it felt like another person leading my actions. Many times I don't realize I'm in this type of violent mood swing until after it's begun to fade, and typically reflecting on it is shame inducing. I need to learn to forgive myself, but that statement is so cliche and non-specific. I've read a bunch of articles, watched TED talks, you name it, trying to find a better understanding of what forgiveness actually looks like when it's healthy and I just don't relate to people's personal methods of healing.\n\nSo many negative habits I want to replace with normalcy. It's easy to feel defeated with such a large list of shortcomings. \n\nEdit: should have used throwaway. I always feel like an ungrateful douchebag when I explain the way I am trained to see most things. Being positive should not be something that merits whining because it's hard to do.", "edited": 1399942380.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One major hurdle is the fact that I don&amp;#39;t get any kind of feel-good chemicals from socializing anymore. I have grown tired of the nights out with friends, even the &amp;quot;closest&amp;quot; ones. I also have lost a sense of passion for anything I once lived for. Nothing inspires hope. I don&amp;#39;t want to take the easy way out, but I&amp;#39;m not as resilient in my subconscious fight against my natural disposition to self harm and sabotage. In the past few weeks I have found that trying to make positive self talk come more naturally involves having to stop and correct 90% of my inner monologue.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been on a manic episode for 2 or 3 days now. Have made some mistakes in that time that I can&amp;#39;t understand because it felt like another person leading my actions. Many times I don&amp;#39;t realize I&amp;#39;m in this type of violent mood swing until after it&amp;#39;s begun to fade, and typically reflecting on it is shame inducing. I need to learn to forgive myself, but that statement is so cliche and non-specific. I&amp;#39;ve read a bunch of articles, watched TED talks, you name it, trying to find a better understanding of what forgiveness actually looks like when it&amp;#39;s healthy and I just don&amp;#39;t relate to people&amp;#39;s personal methods of healing.&lt;/p&gt;\n\n&lt;p&gt;So many negative habits I want to replace with normalcy. It&amp;#39;s easy to feel defeated with such a large list of shortcomings. &lt;/p&gt;\n\n&lt;p&gt;Edit: should have used throwaway. I always feel like an ungrateful douchebag when I explain the way I am trained to see most things. Being positive should not be something that merits whining because it&amp;#39;s hard to do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25edjv", "score_hidden": false, "name": "t1_chgfoiq", "created": 1399970992.0, "author_flair_text": null, "created_utc": 1399942192.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgekib", "gilded": 0, "author": "Tri4rius", "parent_id": "t3_25edjv", "approved_by": null, "body": "Wait, addict to what..? Explain the punishment, if possible. I might be able to give you some advice hopefully. :)\n\nSo there's some kind of a trigger event (or chain of events) that has caused you to believe what you believe. You need something from your first-person experience that gives you strength and courage. I don't know what that might be, but there must be something there. If there isn't, you need to invest in yourself (reading a book, exercising etc) and follow your own idea of what you should have been. You live your life for yourself, not for what others may think of you.\n\nYou describe the standard symptoms of depression and, even though I'm thankful you're not suicidal, it is alarming that you say you're dealing with health issues other than that of your depression...", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, addict to what..? Explain the punishment, if possible. I might be able to give you some advice hopefully. :)&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s some kind of a trigger event (or chain of events) that has caused you to believe what you believe. You need something from your first-person experience that gives you strength and courage. I don&amp;#39;t know what that might be, but there must be something there. If there isn&amp;#39;t, you need to invest in yourself (reading a book, exercising etc) and follow your own idea of what you should have been. You live your life for yourself, not for what others may think of you.&lt;/p&gt;\n\n&lt;p&gt;You describe the standard symptoms of depression and, even though I&amp;#39;m thankful you&amp;#39;re not suicidal, it is alarming that you say you&amp;#39;re dealing with health issues other than that of your depression...&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25edjv", "score_hidden": false, "name": "t1_chgekib", "created": 1399968547.0, "author_flair_text": null, "created_utc": 1399939747.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]