[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I opted for a rant instead of sleeping.&lt;/p&gt;\n\n&lt;p&gt;That said, I wish my mom had miscarried when she was pregnant with me. She would&amp;#39;ve been devastated, maybe, for a while, a year or two, but that would&amp;#39;ve been nothing compared to the pain she would now face if I were to off myself.&lt;/p&gt;\n\n&lt;p&gt;So I can&amp;#39;t. I&amp;#39;m trapped. Living, breathing, struggling to hold on to the remnants of my sanity, at the mercy of the anxiety my father tries but fails to understand. I can&amp;#39;t die, I mean too much to too many people - why haven&amp;#39;t I alienated them? Why have I allowed them to get attached to me? Even worse, the majority of them are people who won&amp;#39;t understand if I choose to die.&lt;/p&gt;\n\n&lt;p&gt;I remember being 15, 16, making weak attempts at my life, attempts that were mostly cries for help - &lt;em&gt;standing on the edge of the bed with a string around her neck, hoping for someone to stop her, waiting for someone to notice, for someone to help, waiting for rescue from the gnawing pain&lt;/em&gt; - or sometimes genuine death wishes - &lt;em&gt;being sure that she won&amp;#39;t see Monday, she ignores schoolwork and plans to end it on Saturday, to lie down in the snow and fall asleep, but the touch of a crush returns a vague will to live&lt;/em&gt; - but mostly, I felt that I wanted to live. I wanted the pain to end, but I didn&amp;#39;t want to quit &lt;em&gt;life&lt;/em&gt;. I wanted to experience things, enjoy things, love people. I wanted to get help, get better, and live. &lt;/p&gt;\n\n&lt;p&gt;Now I can&amp;#39;t imagine it. I can&amp;#39;t imagine anything that would return my will to live. All those things I used to dream of - being a mathematician, going on a road trip, backpacking across Europe, falling in love, studying, running, climbing - none of them seems to matter. At all. Perhaps when I&amp;#39;m feeling good - a phenomenon which is becoming increasingly rare - but most of the time, the thought of living just three years more seems inconceivable.&lt;/p&gt;\n\n&lt;p&gt;Where did I go so wrong? What is there in life that everyone gets but that I&amp;#39;m missing? How can people even want to live? Why would they? I can&amp;#39;t understand. Depression is a wall that blocks me from seeing this. As a friend told me after discussing this, &amp;quot;we&amp;#39;re fucked&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;My doctor is putting me in an adolescents&amp;#39; psych ward. I&amp;#39;m so frightened. At the same time, I&amp;#39;m kind of hopeful. But oh so frightened.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I opted for a rant instead of sleeping.\n\nThat said, I wish my mom had miscarried when she was pregnant with me. She would've been devastated, maybe, for a while, a year or two, but that would've been nothing compared to the pain she would now face if I were to off myself.\n\nSo I can't. I'm trapped. Living, breathing, struggling to hold on to the remnants of my sanity, at the mercy of the anxiety my father tries but fails to understand. I can't die, I mean too much to too many people - why haven't I alienated them? Why have I allowed them to get attached to me? Even worse, the majority of them are people who won't understand if I choose to die.\n\nI remember being 15, 16, making weak attempts at my life, attempts that were mostly cries for help - *standing on the edge of the bed with a string around her neck, hoping for someone to stop her, waiting for someone to notice, for someone to help, waiting for rescue from the gnawing pain* - or sometimes genuine death wishes - *being sure that she won't see Monday, she ignores schoolwork and plans to end it on Saturday, to lie down in the snow and fall asleep, but the touch of a crush returns a vague will to live* - but mostly, I felt that I wanted to live. I wanted the pain to end, but I didn't want to quit *life*. I wanted to experience things, enjoy things, love people. I wanted to get help, get better, and live. \n\nNow I can't imagine it. I can't imagine anything that would return my will to live. All those things I used to dream of - being a mathematician, going on a road trip, backpacking across Europe, falling in love, studying, running, climbing - none of them seems to matter. At all. Perhaps when I'm feeling good - a phenomenon which is becoming increasingly rare - but most of the time, the thought of living just three years more seems inconceivable.\n\nWhere did I go so wrong? What is there in life that everyone gets but that I'm missing? How can people even want to live? Why would they? I can't understand. Depression is a wall that blocks me from seeing this. As a friend told me after discussing this, \"we're fucked\".\n\nMy doctor is putting me in an adolescents' psych ward. I'm so frightened. At the same time, I'm kind of hopeful. But oh so frightened.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zfga", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Sir_Henry", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398501966.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zfga/i_wish_i_had_been_a_miscarriage_rant_not_acute/", "name": "t3_23zfga", "created": 1398489624.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zfga/i_wish_i_had_been_a_miscarriage_rant_not_acute/", "author_flair_text": null, "title": "i wish i had been a miscarriage [rant, not acute]", "created_utc": 1398460824.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]