[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;im so ready to die\nthe mechanisms that be, weather divine or literal have thrown me into some physics engine where my life choices, guided with good will, end in antagonistic outcomes. I seek the little pleasures in life, minute instances of gratification. Overall, I am unhappy, unenthused, and so incredible bored that I make up fantasies in my head of battles. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always hated myself. The little accomplishments I&amp;#39;ve made are trite and inconsiderable. I believe I&amp;#39;m an inteligent person, but incompetent in creating relationships with women. I am 21. I thought I&amp;#39;d be over this now, but deprresion is a bitch that fucks me more then the real ones. &lt;/p&gt;\n\n&lt;p&gt;Too many times i&amp;#39;ve seen myself fail. That&amp;#39;s the mechanism I&amp;#39;m referring to. This constant failure. This attempt at connecting, in good faith, that is let down as though gravity itself has the will to destroy me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been suicidal before. I told myself I lived the skateboard accident to pursue some destiny, meet some people, or become somone I desired. Instead, I waited as my emotional baggage unraveled seemesly accross the universe, percieved as an asshole and loser, replacing precious, intimate college experiences with a wrenching loneliness so dark and deep that words can only reference anything within miles of it. &lt;/p&gt;\n\n&lt;p&gt;I idealize girls because ultumately I can&amp;#39;t stand being alone. I&amp;#39;ve convinced myself I&amp;#39;m this beast, this ugly entity of self hate whose presnce brings a stink. Whose exhale lets ugliness seep the air. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired. I&amp;#39;m always tired. I try and tell myself I can be happy, if I am a happy fool there will be this &amp;quot;it&amp;quot;. This something, this day, this person, this moment, this year, this whatever the fuck that makes me feel like me and be happy. Instead i see repittion. This repitition of the same social dynamics that keep me restrained as fat tim. as a piece of shit. as some kid who finds himself stumbling home alone night after night, not even accompanied by male counterparts, pondering deep questions of humanity, politics, and whatever the fuck my brain decides to settple opon. I feel like I always have to reach. I&amp;#39;m always trying to reach for something because what I am, what I have, is so insifficent and irrelevant that it&amp;#39;s laughable. I wish I could genuinely laugh but holy fuck a man can only take so many days alone by himself staring a computer clicking refresh on reddit, waiting for some quick moment of fascination of an interesting youtube video, that when ends, puts me back here. &lt;/p&gt;\n\n&lt;p&gt;Here is something I don&amp;#39;t like. Here develops into the future, but the future ends up being a repittion of the past. I can&amp;#39;t get laid. Everyone can but me and it deives me cracy. Fucking Dr M has some bullshit of chilling out, but that doesn&amp;#39;t work, I feel like he just likes my money and the alcohol he can buy with it. &lt;/p&gt;\n\n&lt;p&gt;Weed is awesome. It&amp;#39;s been my only true friend. It lets me leave and play with the stars. Look at me. I&amp;#39;m in college and still writing depressing notes. Look at me and see a man, a boy, who has been given to much monetarily, but can barely express himself to a women without a shaking fear of having my whole paradign collapse on me, because I&amp;#39;m aware my emotional state is trench warfare. I&amp;#39;m triggerred by so much, I keep fearing and fearing and fearing this loneliness. It wins. and it loves to win. I&amp;#39;m better being a loser, I&amp;#39;m better being a fucking loser who can feel bad about himself. Achievement is boasting, happiness is fleeting and a chemical reaction in accordance to some bullshit situation coming into fruition where you&amp;#39;ve tricked yourself that your a good person and people love you. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m scared. I&amp;#39;m so fucking scared. It&amp;#39;s not a life of loneliness that scares me, it&amp;#39;s life itself. This weird creature of a thing that I don&amp;#39;t fit in. I really don&amp;#39;t. My head has beautiful, beautiful visions. They&amp;#39;re amazing. Cascading with desires, passion, vision and a want to taste the fruit of love. But life is different. It&amp;#39;s this mechanism, this physics engine, this video game, this reality where I think I&amp;#39;m in hell. &lt;/p&gt;\n\n&lt;p&gt;Nothing has ever really made sense and Wes defintely didn&amp;#39;t help. Why did I see what I saw? I was already lost, I needed real human interaction. I&amp;#39;ve convinced myself I need to have a career, get money, live in LA, become a &amp;quot;it&amp;quot;. But it&amp;#39;s all so petty. My bullshit gameplan is asinine and irrelevant. &lt;/p&gt;\n\n&lt;p&gt;I went to the art gallery on thursday and loved it yet hated it. Me and art, Me and myself. Me next to this alien, this breathing creature, this ogre. It wants to love, but it&amp;#39;s ugliness is rejected by society. If an indicidual in society were to reach out, they themself would be castracted. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what I feel so much, castrated. Literally, at times I feel my nuts being chopped, my manhood being severed and stolen. Someone is benefitting from this? I&amp;#39;m not sure. But fuck I&amp;#39;d love to kill myself. Slit my wrists, down the veins, and watch the blood, dark, red, beautiful, flow out like this river. It gives birth to flowers, mountains, the wind, the rain, the cycle. A universe would be born. Animals, ecosystems, biology would flourish from my blood. That&amp;#39;s what I want to give. Me, Tim ******, loves comedy because the pain needs to manifest somehow. How many nights alone will I blaze? How many times will girls lead me on and leave me for sometihing else. It hurts so bad. It&amp;#39;s so fucking painful. Alex told me she really liked me and it felt great. I felt so good, then tonight she ignores me. I should die. Maybe then people will at least give me some attention, and I will be remembered as that kid who killed himself, and my name, my existense will carry some weight somehwere because right now I&amp;#39;m a driting iceberg that is being denied by the continents, fed by dr m&amp;#39;s bullshit, and watching it&amp;#39;self slowly, and slowly sink into the ocean, as it should have happened originally. &lt;/p&gt;\n\n&lt;p&gt;I probably wont kill myself. Something keeps me here. I hate it though. It&amp;#39;s torteous. I&amp;#39;ll meet a girl one day, love her, and then be left. I know the leaving will happen as it&amp;#39;s an extended moment that has defined my life. A slow motion car crash that leaves my limbs pinned under the wreckage, the fire chars, but doesn&amp;#39;t kill. The firemen watch but don&amp;#39;t respond. A crowd gathers, butters their popcorn, and watches like animals watching reality television. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "im so ready to die\nthe mechanisms that be, weather divine or literal have thrown me into some physics engine where my life choices, guided with good will, end in antagonistic outcomes. I seek the little pleasures in life, minute instances of gratification. Overall, I am unhappy, unenthused, and so incredible bored that I make up fantasies in my head of battles. \n\nI've always hated myself. The little accomplishments I've made are trite and inconsiderable. I believe I'm an inteligent person, but incompetent in creating relationships with women. I am 21. I thought I'd be over this now, but deprresion is a bitch that fucks me more then the real ones. \n\nToo many times i've seen myself fail. That's the mechanism I'm referring to. This constant failure. This attempt at connecting, in good faith, that is let down as though gravity itself has the will to destroy me. \n\nI've been suicidal before. I told myself I lived the skateboard accident to pursue some destiny, meet some people, or become somone I desired. Instead, I waited as my emotional baggage unraveled seemesly accross the universe, percieved as an asshole and loser, replacing precious, intimate college experiences with a wrenching loneliness so dark and deep that words can only reference anything within miles of it. \n\nI idealize girls because ultumately I can't stand being alone. I've convinced myself I'm this beast, this ugly entity of self hate whose presnce brings a stink. Whose exhale lets ugliness seep the air. \n\nI'm tired. I'm always tired. I try and tell myself I can be happy, if I am a happy fool there will be this \"it\". This something, this day, this person, this moment, this year, this whatever the fuck that makes me feel like me and be happy. Instead i see repittion. This repitition of the same social dynamics that keep me restrained as fat tim. as a piece of shit. as some kid who finds himself stumbling home alone night after night, not even accompanied by male counterparts, pondering deep questions of humanity, politics, and whatever the fuck my brain decides to settple opon. I feel like I always have to reach. I'm always trying to reach for something because what I am, what I have, is so insifficent and irrelevant that it's laughable. I wish I could genuinely laugh but holy fuck a man can only take so many days alone by himself staring a computer clicking refresh on reddit, waiting for some quick moment of fascination of an interesting youtube video, that when ends, puts me back here. \n\nHere is something I don't like. Here develops into the future, but the future ends up being a repittion of the past. I can't get laid. Everyone can but me and it deives me cracy. Fucking Dr M has some bullshit of chilling out, but that doesn't work, I feel like he just likes my money and the alcohol he can buy with it. \n\nWeed is awesome. It's been my only true friend. It lets me leave and play with the stars. Look at me. I'm in college and still writing depressing notes. Look at me and see a man, a boy, who has been given to much monetarily, but can barely express himself to a women without a shaking fear of having my whole paradign collapse on me, because I'm aware my emotional state is trench warfare. I'm triggerred by so much, I keep fearing and fearing and fearing this loneliness. It wins. and it loves to win. I'm better being a loser, I'm better being a fucking loser who can feel bad about himself. Achievement is boasting, happiness is fleeting and a chemical reaction in accordance to some bullshit situation coming into fruition where you've tricked yourself that your a good person and people love you. \n\nI'm scared. I'm so fucking scared. It's not a life of loneliness that scares me, it's life itself. This weird creature of a thing that I don't fit in. I really don't. My head has beautiful, beautiful visions. They're amazing. Cascading with desires, passion, vision and a want to taste the fruit of love. But life is different. It's this mechanism, this physics engine, this video game, this reality where I think I'm in hell. \n\nNothing has ever really made sense and Wes defintely didn't help. Why did I see what I saw? I was already lost, I needed real human interaction. I've convinced myself I need to have a career, get money, live in LA, become a \"it\". But it's all so petty. My bullshit gameplan is asinine and irrelevant. \n\nI went to the art gallery on thursday and loved it yet hated it. Me and art, Me and myself. Me next to this alien, this breathing creature, this ogre. It wants to love, but it's ugliness is rejected by society. If an indicidual in society were to reach out, they themself would be castracted. \n\nThat's what I feel so much, castrated. Literally, at times I feel my nuts being chopped, my manhood being severed and stolen. Someone is benefitting from this? I'm not sure. But fuck I'd love to kill myself. Slit my wrists, down the veins, and watch the blood, dark, red, beautiful, flow out like this river. It gives birth to flowers, mountains, the wind, the rain, the cycle. A universe would be born. Animals, ecosystems, biology would flourish from my blood. That's what I want to give. Me, Tim ******, loves comedy because the pain needs to manifest somehow. How many nights alone will I blaze? How many times will girls lead me on and leave me for sometihing else. It hurts so bad. It's so fucking painful. Alex told me she really liked me and it felt great. I felt so good, then tonight she ignores me. I should die. Maybe then people will at least give me some attention, and I will be remembered as that kid who killed himself, and my name, my existense will carry some weight somehwere because right now I'm a driting iceberg that is being denied by the continents, fed by dr m's bullshit, and watching it'self slowly, and slowly sink into the ocean, as it should have happened originally. \n\nI probably wont kill myself. Something keeps me here. I hate it though. It's torteous. I'll meet a girl one day, love her, and then be left. I know the leaving will happen as it's an extended moment that has defined my life. A slow motion car crash that leaves my limbs pinned under the wreckage, the fire chars, but doesn't kill. The firemen watch but don't respond. A crowd gathers, butters their popcorn, and watches like animals watching reality television. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24oncr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "mybeautifulfriend", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399197272.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24oncr/i_wrote_this_tonight_stream_of_consciousness/", "name": "t3_24oncr", "created": 1399225769.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24oncr/i_wrote_this_tonight_stream_of_consciousness/", "author_flair_text": null, "title": "i wrote this tonight, stream of consciousness.", "created_utc": 1399196969.0, "ups": 5, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9fyaz", "gilded": 0, "author": "Zyllber", "parent_id": "t1_ch9fml0", "approved_by": null, "body": "Were all in the same boat. Every one of us hides the same feelings:\n\nHopes, Wishes,\n\n\n*Dreams.*", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Were all in the same boat. Every one of us hides the same feelings:&lt;/p&gt;\n\n&lt;p&gt;Hopes, Wishes,&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Dreams.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oncr", "score_hidden": false, "name": "t1_ch9fyaz", "created": 1399260872.0, "author_flair_text": null, "created_utc": 1399232072.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9fml0", "gilded": 0, "author": "mybeautifulfriend", "parent_id": "t1_ch9ed9c", "approved_by": null, "body": "Thanks for the response. That seems to be a very true element of life. I've heard often times that holocaust survivors have the happiest embrace on life having lived through what they have, something I could never imagine. \n\nLuckily, last night was just something I consider an episode, and thank god for this forum for letting me spill it out. I'm at a time in life where I'm truly learning to love myself, not judge and really connect with the people around me and god damn, I feel like the movie limitless when bradley cooper takes the pill lol. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the response. That seems to be a very true element of life. I&amp;#39;ve heard often times that holocaust survivors have the happiest embrace on life having lived through what they have, something I could never imagine. &lt;/p&gt;\n\n&lt;p&gt;Luckily, last night was just something I consider an episode, and thank god for this forum for letting me spill it out. I&amp;#39;m at a time in life where I&amp;#39;m truly learning to love myself, not judge and really connect with the people around me and god damn, I feel like the movie limitless when bradley cooper takes the pill lol. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oncr", "score_hidden": false, "name": "t1_ch9fml0", "created": 1399260156.0, "author_flair_text": null, "created_utc": 1399231356.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9ed9c", "gilded": 0, "author": "Zyllber", "parent_id": "t3_24oncr", "approved_by": null, "body": "&gt; Something keeps me here. I hate it though. It's torteous.\n\n\nIm really not experienced at this, but I think that I can help you in a way. The whole Winter long, I was extremely miserable and sad, I dubbed the winter \"Unforgiving Cold\". Now, I hear birds sing in the Morning and it made me think:\n\n\nThe deeper one falls, the higher one can go. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Something keeps me here. I hate it though. It&amp;#39;s torteous.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Im really not experienced at this, but I think that I can help you in a way. The whole Winter long, I was extremely miserable and sad, I dubbed the winter &amp;quot;Unforgiving Cold&amp;quot;. Now, I hear birds sing in the Morning and it made me think:&lt;/p&gt;\n\n&lt;p&gt;The deeper one falls, the higher one can go. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oncr", "score_hidden": false, "name": "t1_ch9ed9c", "created": 1399257245.0, "author_flair_text": null, "created_utc": 1399228445.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9e0nt", "gilded": 0, "author": "mybeautifulfriend", "parent_id": "t1_ch9b2f9", "approved_by": null, "body": "ya it really helps get the shit out. thanks for reading!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ya it really helps get the shit out. thanks for reading!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oncr", "score_hidden": false, "name": "t1_ch9e0nt", "created": 1399231222.0, "author_flair_text": null, "created_utc": 1399227622.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9b2f9", "gilded": 0, "author": "ventimhere", "parent_id": "t3_24oncr", "approved_by": null, "body": "Hi. I want you to know that I read every word you posted. Do you tend to write down your feelings regularly?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I want you to know that I read every word you posted. Do you tend to write down your feelings regularly?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24oncr", "score_hidden": false, "name": "t1_ch9b2f9", "created": 1399224126.0, "author_flair_text": null, "created_utc": 1399220526.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]