[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First thing is, I don&amp;#39;t want to commit suicide. I wish it was just that simple though. There&amp;#39;s a lot to it. I&amp;#39;m definitely depressed, but I don&amp;#39;t want to end everything. I honestly just want to start over. Obviously, this can&amp;#39;t be done, so I just gotta deal with things how they are. Probably talking to a therapist would be all I&amp;#39;d need and maybe some medication if that was all. The weirdest and most annoying problem is the voices in my head. &lt;/p&gt;\n\n&lt;p&gt;I need to make it clear that these voices aren&amp;#39;t mine. They aren&amp;#39;t my thoughts, and I don&amp;#39;t know what they&amp;#39;re going to say before they say it. Generally I just converse with them and it&amp;#39;s like talking to someone else. Sometimes they are helpful. The biggest issue I have with these guys is that sometimes they don&amp;#39;t shut up when I need them too and I can&amp;#39;t focus or sleep, but otherwise it&amp;#39;s fine and I kind of enjoy their company. There&amp;#39;s one in particular though who&amp;#39;s very cruel. He doesn&amp;#39;t say much. He usually just tells me to kill myself. Whenever something bad happens, and I get upset, he just shows up and persists until I can fight him away. I&amp;#39;m not sure if this is Schizophrenia or what. I&amp;#39;m not an expert on psychological disorders, do I don&amp;#39;t want to assume. On two occasions, I have had strong visual hallucinations that might be related, and the second one was really pretty so I was cool with it (if anyone is curious, I&amp;#39;ll describe it. I like talking about it,) but I can&amp;#39;t really say what is wrong until I go see a doctor.&lt;/p&gt;\n\n&lt;p&gt;So for a while I&amp;#39;ve been doing okay with this. I&amp;#39;ve had a very supportive girlfriend (who I&amp;#39;ve been with for about a year and a half) and a few close friends who I&amp;#39;ve told. My girlfriend has been the main reason I&amp;#39;ve been able to hold on though. When the voice gets really bad, she&amp;#39;s been there to help me. This year has been a little stressful on our relationship though because I&amp;#39;ve been away at college. She&amp;#39;s younger than me by about a year and still lives at home with her mother. Despite this, she&amp;#39;s been there when I need her and we were feeling closer than ever. However, this changed yesterday when she told her mother about me. Her mother forced her to break up with me and forbid her from ever seeing me again because she is afraid I&amp;#39;ll do something to hurt her. I don&amp;#39;t know what to do without her. I know she won&amp;#39;t be living with her mother forever, but I don&amp;#39;t know how I&amp;#39;ll be able to deal with life without her until we can get back together (we do plan on this.) Things have been hard enough as it is, and she&amp;#39;s been the most helpful of all the people I know. I&amp;#39;m afraid that this will make push me over the edge eventually. I plan on getting therapy, but I don&amp;#39;t know if it will be enough. Does anyone know what I can do?&lt;/p&gt;\n\n&lt;p&gt;I know this post has been kind of all over the place and it&amp;#39;s really long. It&amp;#39;s just a weird, complicated situation and I really need help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First thing is, I don't want to commit suicide. I wish it was just that simple though. There's a lot to it. I'm definitely depressed, but I don't want to end everything. I honestly just want to start over. Obviously, this can't be done, so I just gotta deal with things how they are. Probably talking to a therapist would be all I'd need and maybe some medication if that was all. The weirdest and most annoying problem is the voices in my head. \n\nI need to make it clear that these voices aren't mine. They aren't my thoughts, and I don't know what they're going to say before they say it. Generally I just converse with them and it's like talking to someone else. Sometimes they are helpful. The biggest issue I have with these guys is that sometimes they don't shut up when I need them too and I can't focus or sleep, but otherwise it's fine and I kind of enjoy their company. There's one in particular though who's very cruel. He doesn't say much. He usually just tells me to kill myself. Whenever something bad happens, and I get upset, he just shows up and persists until I can fight him away. I'm not sure if this is Schizophrenia or what. I'm not an expert on psychological disorders, do I don't want to assume. On two occasions, I have had strong visual hallucinations that might be related, and the second one was really pretty so I was cool with it (if anyone is curious, I'll describe it. I like talking about it,) but I can't really say what is wrong until I go see a doctor.\n\nSo for a while I've been doing okay with this. I've had a very supportive girlfriend (who I've been with for about a year and a half) and a few close friends who I've told. My girlfriend has been the main reason I've been able to hold on though. When the voice gets really bad, she's been there to help me. This year has been a little stressful on our relationship though because I've been away at college. She's younger than me by about a year and still lives at home with her mother. Despite this, she's been there when I need her and we were feeling closer than ever. However, this changed yesterday when she told her mother about me. Her mother forced her to break up with me and forbid her from ever seeing me again because she is afraid I'll do something to hurt her. I don't know what to do without her. I know she won't be living with her mother forever, but I don't know how I'll be able to deal with life without her until we can get back together (we do plan on this.) Things have been hard enough as it is, and she's been the most helpful of all the people I know. I'm afraid that this will make push me over the edge eventually. I plan on getting therapy, but I don't know if it will be enough. Does anyone know what I can do?\n\nI know this post has been kind of all over the place and it's really long. It's just a weird, complicated situation and I really need help.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "246fb2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "spareredditaccount", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/246fb2/idk_stuff_is_all_weird_just_need_to_know_what_to/", "name": "t3_246fb2", "created": 1398712991.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/246fb2/idk_stuff_is_all_weird_just_need_to_know_what_to/", "author_flair_text": null, "title": "Idk, stuff is all weird. Just need to know what to do.", "created_utc": 1398684191.0, "ups": 5, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4dlsn", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4daar", "approved_by": null, "body": "They're there to help you, that's no bad thing. It may not be an ideal situation, but if you are able to let them help you, let them pay for the therapy for now, because honestly, therapy will help you to work these things out. But then when it gets to summer, hopefully you're doing a little better with this stuff, and if you get a job then you can pay them back. You're not a burden on them, they're just helping you out for a few weeks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re there to help you, that&amp;#39;s no bad thing. It may not be an ideal situation, but if you are able to let them help you, let them pay for the therapy for now, because honestly, therapy will help you to work these things out. But then when it gets to summer, hopefully you&amp;#39;re doing a little better with this stuff, and if you get a job then you can pay them back. You&amp;#39;re not a burden on them, they&amp;#39;re just helping you out for a few weeks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_246fb2", "score_hidden": false, "name": "t1_ch4dlsn", "created": 1398717671.0, "author_flair_text": null, "created_utc": 1398714071.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4psf9", "gilded": 0, "author": "circinia", "parent_id": "t1_ch4daar", "approved_by": null, "body": "If you think your parents will be understanding, it's nearly always helpful to tell them what's happening in your life--and it sounds like you would be really uncomfortable with continuing to keep this from them. You can always work out a way to help pay if it's a genuine financial hardship for them (but if it would be harder for you to pay for it yourself, please consider accepting their help; you're going through a rough time and completely deserve it).", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think your parents will be understanding, it&amp;#39;s nearly always helpful to tell them what&amp;#39;s happening in your life--and it sounds like you would be really uncomfortable with continuing to keep this from them. You can always work out a way to help pay if it&amp;#39;s a genuine financial hardship for them (but if it would be harder for you to pay for it yourself, please consider accepting their help; you&amp;#39;re going through a rough time and completely deserve it).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_246fb2", "score_hidden": false, "name": "t1_ch4psf9", "created": 1398742640.0, "author_flair_text": null, "created_utc": 1398739040.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4daar", "gilded": 0, "author": "spareredditaccount", "parent_id": "t1_ch46vot", "approved_by": null, "body": "Thanks, this made me feel better. I'm really afraid to tell my parents about this though. It's not that I don't think they'll be understanding, but they'll insist on paying for my therapy and I don't want to put more of a burden on them financially. Heck, they've done more than enough for me. I'm planning on getting a summer job and paying for the therapy myself, but I don't like hiding it from them.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, this made me feel better. I&amp;#39;m really afraid to tell my parents about this though. It&amp;#39;s not that I don&amp;#39;t think they&amp;#39;ll be understanding, but they&amp;#39;ll insist on paying for my therapy and I don&amp;#39;t want to put more of a burden on them financially. Heck, they&amp;#39;ve done more than enough for me. I&amp;#39;m planning on getting a summer job and paying for the therapy myself, but I don&amp;#39;t like hiding it from them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_246fb2", "score_hidden": false, "name": "t1_ch4daar", "created": 1398717035.0, "author_flair_text": null, "created_utc": 1398713435.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch46vot", "gilded": 0, "author": "circinia", "parent_id": "t3_246fb2", "approved_by": null, "body": "I'm sorry that these voices in your head have been bothering you so much, and that your girlfriend's mother has been giving you and her a hard time about this--you sound like a kind and considerate young person (as does your girlfriend!) and whatever is behind the voices you're experiencing doesn't change that. I hope you're able to keep in touch with each other even if it's harder for you to see each other now.\n\nYou're right on that therapy is a good first step for this, and talking to a psychiatrist is a really good idea as well. It sounds like you're thinking very well about what to do about this situation, and I think that's a good sign for you being able to navigate it successfully and build a happy life in spite of your struggle with these voices. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry that these voices in your head have been bothering you so much, and that your girlfriend&amp;#39;s mother has been giving you and her a hard time about this--you sound like a kind and considerate young person (as does your girlfriend!) and whatever is behind the voices you&amp;#39;re experiencing doesn&amp;#39;t change that. I hope you&amp;#39;re able to keep in touch with each other even if it&amp;#39;s harder for you to see each other now.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right on that therapy is a good first step for this, and talking to a psychiatrist is a really good idea as well. It sounds like you&amp;#39;re thinking very well about what to do about this situation, and I think that&amp;#39;s a good sign for you being able to navigate it successfully and build a happy life in spite of your struggle with these voices. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_246fb2", "score_hidden": false, "name": "t1_ch46vot", "created": 1398703893.0, "author_flair_text": null, "created_utc": 1398700293.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch41kok", "gilded": 0, "author": "spareredditaccount", "parent_id": "t3_246fb2", "approved_by": null, "body": "Nobody saw me accidentally comment on this with my real account, okay? So shhhhhhhhh! And if you see a post where the situation is more urgent, take care of that first. I'll be able to hold out here for a while.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nobody saw me accidentally comment on this with my real account, okay? So shhhhhhhhh! And if you see a post where the situation is more urgent, take care of that first. I&amp;#39;ll be able to hold out here for a while.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_246fb2", "score_hidden": false, "name": "t1_ch41kok", "created": 1398688057.0, "author_flair_text": null, "created_utc": 1398684457.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]