[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know how I&amp;#39;d do it. There&amp;#39;s a relatively busy road running by my house; it&amp;#39;d be simple to just step into traffic. Fuck the people driving by - they can learn to live with it, and I know it&amp;#39;s selfish, but I need to die. I&amp;#39;m a fat, ugly, stupid, unloveable, pile-of-shit waste of space - no one would miss me, and I don&amp;#39;t feel guilty at all about these thoughts because I don&amp;#39;t think a single person on the planet actually gives a fuck. I&amp;#39;d be forgotten in a month or two by most. My &amp;quot;best friend&amp;quot; might take four or five before she totally got over it. I love her so much, but to her, I&amp;#39;m just another random person that she sees sometimes. She&amp;#39;s nice to me, but not because she really cares: she&amp;#39;s just a nice person that way.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had an eating disorder for years, and my body is finally done with my shit and slowly shutting itself down. You know what&amp;#39;s the worst part? I&amp;#39;m actually jealous of the other people with EDs. I have bulimia and everything tastes like vomit and my throat hurts constantly and I have an ache that&amp;#39;s always just sitting in the pit of my stomach and my teeth are crumbing, and I&amp;#39;m STILL a massive fucking fatass. I&amp;#39;M HUGE. I&amp;#39;M FAT AND UGLY AND I FUCKING HATE MYSELF SO MUCH. I wish I had the discipline and self-control to be anorexic, but I fucking don&amp;#39;t, so instead I shove a toothbrush down my throat until I cough blood and then I just sit in the bathtub and cry until there&amp;#39;s blood and snot and vomit all over my body. I AM A FAT DISGUSTING PILE OF SHIT WHO CANNOT FUCKING STOP EATING EVERY SINGLE FUCKING THING GOD I HATE MYSELF WHY CAN&amp;#39;T I JUST FUCKING DIE ALREADY.&lt;/p&gt;\n\n&lt;p&gt;I know I&amp;#39;d fuck it up. I&amp;#39;d fuck it up and everyone would despise me even more than I already do. I&amp;#39;d sit in a hospital for months, and people would forget about me to the point where I might as well have died, except I&amp;#39;d still be alive and unable to escape the shitty, hateful meatsack that is me. I&amp;#39;m toying with the idea of trying it anyway, because I don&amp;#39;t know how I&amp;#39;m going to live another day as someone with ZERO redeeming traits who I hate more than everything I&amp;#39;ve ever hated combined.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I know how I'd do it. There's a relatively busy road running by my house; it'd be simple to just step into traffic. Fuck the people driving by - they can learn to live with it, and I know it's selfish, but I need to die. I'm a fat, ugly, stupid, unloveable, pile-of-shit waste of space - no one would miss me, and I don't feel guilty at all about these thoughts because I don't think a single person on the planet actually gives a fuck. I'd be forgotten in a month or two by most. My \"best friend\" might take four or five before she totally got over it. I love her so much, but to her, I'm just another random person that she sees sometimes. She's nice to me, but not because she really cares: she's just a nice person that way.\n\nI've had an eating disorder for years, and my body is finally done with my shit and slowly shutting itself down. You know what's the worst part? I'm actually jealous of the other people with EDs. I have bulimia and everything tastes like vomit and my throat hurts constantly and I have an ache that's always just sitting in the pit of my stomach and my teeth are crumbing, and I'm STILL a massive fucking fatass. I'M HUGE. I'M FAT AND UGLY AND I FUCKING HATE MYSELF SO MUCH. I wish I had the discipline and self-control to be anorexic, but I fucking don't, so instead I shove a toothbrush down my throat until I cough blood and then I just sit in the bathtub and cry until there's blood and snot and vomit all over my body. I AM A FAT DISGUSTING PILE OF SHIT WHO CANNOT FUCKING STOP EATING EVERY SINGLE FUCKING THING GOD I HATE MYSELF WHY CAN'T I JUST FUCKING DIE ALREADY.\n\nI know I'd fuck it up. I'd fuck it up and everyone would despise me even more than I already do. I'd sit in a hospital for months, and people would forget about me to the point where I might as well have died, except I'd still be alive and unable to escape the shitty, hateful meatsack that is me. I'm toying with the idea of trying it anyway, because I don't know how I'm going to live another day as someone with ZERO redeeming traits who I hate more than everything I've ever hated combined.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c0lv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "discarddd", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c0lv/if_i_werent_sure_id_fuck_it_up_id_have_done_it/", "name": "t3_24c0lv", "created": 1398852610.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c0lv/if_i_werent_sure_id_fuck_it_up_id_have_done_it/", "author_flair_text": null, "title": "If I weren't sure I'd fuck it up, I'd have done it already", "created_utc": 1398823810.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5mlon", "gilded": 0, "author": "SuburbanGirl", "parent_id": "t3_24c0lv", "approved_by": null, "body": "Thank you for sharing here. Reaching out in some way is a wonderful thing, and it shows me that you are still a good person. I know you have at least one redeeming trait, and that is the ability to reach out when you are in pain.\n\nI have an ED too, and today has been a really shit day for it, and a really shit week. I just try to remind myself that if I work for it then tomorrow will be better. I don't know if that will help you, but I wanted you to know that you are not alone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing here. Reaching out in some way is a wonderful thing, and it shows me that you are still a good person. I know you have at least one redeeming trait, and that is the ability to reach out when you are in pain.&lt;/p&gt;\n\n&lt;p&gt;I have an ED too, and today has been a really shit day for it, and a really shit week. I just try to remind myself that if I work for it then tomorrow will be better. I don&amp;#39;t know if that will help you, but I wanted you to know that you are not alone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c0lv", "score_hidden": false, "name": "t1_ch5mlon", "created": 1398828168.0, "author_flair_text": null, "created_utc": 1398824568.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5o8a6", "gilded": 0, "author": "Melanie133", "parent_id": "t3_24c0lv", "approved_by": null, "body": "I went through the same pain, anxiety and hopelessness when I was younger. I know it sounds like a clique but it does get better. There are people who LOVE you. I am sure your body is beautiful even if you do not think so. Beauty fades in the end and your personality is what people will admire..our society is so shallow and vain. Do not allow them the power over you. As the other commentor posted..you are not alone and never will be. Reach out to your friend. I am positive she will listen. Please reach out as you have here.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through the same pain, anxiety and hopelessness when I was younger. I know it sounds like a clique but it does get better. There are people who LOVE you. I am sure your body is beautiful even if you do not think so. Beauty fades in the end and your personality is what people will admire..our society is so shallow and vain. Do not allow them the power over you. As the other commentor posted..you are not alone and never will be. Reach out to your friend. I am positive she will listen. Please reach out as you have here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c0lv", "score_hidden": false, "name": "t1_ch5o8a6", "created": 1398831578.0, "author_flair_text": null, "created_utc": 1398827978.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]