[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. I&amp;#39;m 21 years old, and I feel alone. When I was 16 and in a relationship I didn&amp;#39;t want to be in, I was finding it hard to break up with the guy, and I remember being told &amp;quot;Be selfish for once&amp;quot; and breaking up with him and putting my feelings over his. This guy was completely devastated.&lt;/p&gt;\n\n&lt;p&gt;21 now, I&amp;#39;m met the &amp;quot;love of my life&amp;quot; so to speak, but all I know is how to fuck things up. Did I naively believe that by meeting the person I wanted to spend my life with, my problems would go away and we&amp;#39;d live a happy life together? Apparently so, but reality has showed me otherwise, because my anxiety is destroying any happiness in my relationship.&lt;/p&gt;\n\n&lt;p&gt;People can&amp;#39;t fathom or understand the idea that I literally do not care to seek help for myself. I don&amp;#39;t care to get better. I&amp;#39;m pretty dead set on the fact that suicide should be a personal choice, and not one others try to guilt you with (&amp;quot;you&amp;#39;ll be hurting others)&amp;quot;. I struggle the most with the concept that if I kill myself because I &lt;em&gt;chose&lt;/em&gt; to, I&amp;#39;ll be leaving a burden on others. I feel as if the people holding me back, the ones guilting me with their prospect of pain, are the selfish ones.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been to many therapists and psychologists, and as I found out quickly, to get better, you have to put in the effort and want to get better. I&amp;#39;ve never had that will. Maybe I see this state of being as a security blanket. No one likes being miserable, but I have zero desire or motivation to try to fight with (because it is a very hard battle, even if you fight it, as we all know). I just sit and dream of the state of nothing. I&amp;#39;d never have a wedding, a child, and I&amp;#39;d miss a lot of milestones in life, but if I&amp;#39;m dead, I won&amp;#39;t be there to worry about those missed opportunities. I&amp;#39;ll just be gone, and that&amp;#39;ll be it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Life is hard for everyone, suck it up.&amp;quot; But why do I have to suck it up? Life is hard, but why does the default choice have to be to keep going? What&amp;#39;s wrong with NOT sucking it up, to turn the other way and peace out? I&amp;#39;m happy for those that are strong and fight for happiness and find it, but why am I judged so bad for not wanting to go the same route? I don&amp;#39;t believe that it makes you a better person than me in any shape or form, but people are constantly putting down suicide victims &amp;quot;at least im not like that&amp;quot; as if that makes you a better person than the ones who chose to not keep living.&lt;/p&gt;\n\n&lt;p&gt;Maybe a lot of us want to have someone hear us out, someone to talk to us and support us and tell us things will be better when we ourselves don&amp;#39;t believe it, but in this point, all I&amp;#39;m really searching for is some kind of assurance, some validation that this choice is an okay one to make, that I won&amp;#39;t be judged for it. That it is understandable. That it is MY life, my choice, my struggle, and I alone am responsible for choosing this.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s so goddamn wrong about &amp;quot;giving up&amp;quot;? Why so much finger pointing and guilting? So what if I want to give up? Why does it matter to anyone else?&lt;/p&gt;\n\n&lt;p&gt;My only friend in the world is my boyfriend, I literally have zero friends aside from him. I thought I did, but the minute something goes wrong in my life (my SO and I broke up temporarily a couple months back), no one wants to talk to me, or check up to see if I&amp;#39;m doing okay, matter of fact they avoid me because they don&amp;#39;t want any potential sadness of mine to burden them or bring them down. That really does hurt.&lt;/p&gt;\n\n&lt;p&gt;But I can&amp;#39;t talk to my SO about this. I mean, I suppose I understand no one wants to hear about their gf thinking of offing themselves, but he just freaks out, shuts me down and says things to the extent of &amp;quot;Please stop talking like that, it makes me feel low.&amp;quot; Is it wrong that by him saying that, I feel guilty, as if my bad mood is at fault for him now being upset? So to avoid getting him upset, I don&amp;#39;t talk to him about my depressed feelings, because no one wants to hear about them, it hurts too much to hear about your loved one wanting to die. So once again, I feel alone, as if I can only talk to myself.&lt;/p&gt;\n\n&lt;p&gt;If I do it one day, I hope to leave a long note, hoping that maybe it will soothe the soul of those I hurt, and they can not guilt themselves, and come to a realization that life will go on for them without me, and this was my choice alone. Maybe one day they will accept that, that this wasn&amp;#39;t about them or what they could have done, and just about me and what I chose to do.&lt;/p&gt;\n\n&lt;p&gt;Maybe tonight, or tomorrow, I&amp;#39;ll find the guts to just pull the trigger and let it happen. I&amp;#39;d hope to do it in a way that wouldn&amp;#39;t cause someone too much trouble. What if I jumped off a bridge into the river? I can&amp;#39;t swim. What if I locked myself in a garage with a running car and hope to die from carbon monoxide? These seems like ways that wouldn&amp;#39;t involve too much of a mess or burden for someone to clean up with. The feeling of jsut shutting my eyes, taking one deep last breath, and knowing it will be the start of forever, is very soothing to me.&lt;/p&gt;\n\n&lt;p&gt;Thanks for listening, I guess.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi there. I'm 21 years old, and I feel alone. When I was 16 and in a relationship I didn't want to be in, I was finding it hard to break up with the guy, and I remember being told \"Be selfish for once\" and breaking up with him and putting my feelings over his. This guy was completely devastated.\n\n21 now, I'm met the \"love of my life\" so to speak, but all I know is how to fuck things up. Did I naively believe that by meeting the person I wanted to spend my life with, my problems would go away and we'd live a happy life together? Apparently so, but reality has showed me otherwise, because my anxiety is destroying any happiness in my relationship.\n\nPeople can't fathom or understand the idea that I literally do not care to seek help for myself. I don't care to get better. I'm pretty dead set on the fact that suicide should be a personal choice, and not one others try to guilt you with (\"you'll be hurting others)\". I struggle the most with the concept that if I kill myself because I *chose* to, I'll be leaving a burden on others. I feel as if the people holding me back, the ones guilting me with their prospect of pain, are the selfish ones.\n\nI've been to many therapists and psychologists, and as I found out quickly, to get better, you have to put in the effort and want to get better. I've never had that will. Maybe I see this state of being as a security blanket. No one likes being miserable, but I have zero desire or motivation to try to fight with (because it is a very hard battle, even if you fight it, as we all know). I just sit and dream of the state of nothing. I'd never have a wedding, a child, and I'd miss a lot of milestones in life, but if I'm dead, I won't be there to worry about those missed opportunities. I'll just be gone, and that'll be it.\n\n\"Life is hard for everyone, suck it up.\" But why do I have to suck it up? Life is hard, but why does the default choice have to be to keep going? What's wrong with NOT sucking it up, to turn the other way and peace out? I'm happy for those that are strong and fight for happiness and find it, but why am I judged so bad for not wanting to go the same route? I don't believe that it makes you a better person than me in any shape or form, but people are constantly putting down suicide victims \"at least im not like that\" as if that makes you a better person than the ones who chose to not keep living.\n\nMaybe a lot of us want to have someone hear us out, someone to talk to us and support us and tell us things will be better when we ourselves don't believe it, but in this point, all I'm really searching for is some kind of assurance, some validation that this choice is an okay one to make, that I won't be judged for it. That it is understandable. That it is MY life, my choice, my struggle, and I alone am responsible for choosing this.\n\nWhat's so goddamn wrong about \"giving up\"? Why so much finger pointing and guilting? So what if I want to give up? Why does it matter to anyone else?\n\nMy only friend in the world is my boyfriend, I literally have zero friends aside from him. I thought I did, but the minute something goes wrong in my life (my SO and I broke up temporarily a couple months back), no one wants to talk to me, or check up to see if I'm doing okay, matter of fact they avoid me because they don't want any potential sadness of mine to burden them or bring them down. That really does hurt.\n\nBut I can't talk to my SO about this. I mean, I suppose I understand no one wants to hear about their gf thinking of offing themselves, but he just freaks out, shuts me down and says things to the extent of \"Please stop talking like that, it makes me feel low.\" Is it wrong that by him saying that, I feel guilty, as if my bad mood is at fault for him now being upset? So to avoid getting him upset, I don't talk to him about my depressed feelings, because no one wants to hear about them, it hurts too much to hear about your loved one wanting to die. So once again, I feel alone, as if I can only talk to myself.\n\nIf I do it one day, I hope to leave a long note, hoping that maybe it will soothe the soul of those I hurt, and they can not guilt themselves, and come to a realization that life will go on for them without me, and this was my choice alone. Maybe one day they will accept that, that this wasn't about them or what they could have done, and just about me and what I chose to do.\n\nMaybe tonight, or tomorrow, I'll find the guts to just pull the trigger and let it happen. I'd hope to do it in a way that wouldn't cause someone too much trouble. What if I jumped off a bridge into the river? I can't swim. What if I locked myself in a garage with a running car and hope to die from carbon monoxide? These seems like ways that wouldn't involve too much of a mess or burden for someone to clean up with. The feeling of jsut shutting my eyes, taking one deep last breath, and knowing it will be the start of forever, is very soothing to me.\n\nThanks for listening, I guess.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ui53", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "selfishdeath", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399361371.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ui53/if_i_write_a_long_note_of_apology_will_it_help/", "name": "t3_24ui53", "created": 1399389878.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ui53/if_i_write_a_long_note_of_apology_will_it_help/", "author_flair_text": null, "title": "If I write a long note of apology, will it help out the ones I leave behind?", "created_utc": 1399361078.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chatckt", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_24ui53", "approved_by": null, "body": "Not everyone realizes that feeling sad can be like a security blanket.\n\nYour boyfriend also sounds like a security blanket, but I mean that in a mildly insulting sense. You want to talk about your problems and he won't. Maybe try again and make it clear to him that you need someone to talk to.\n\nSome people find writing notes therapeutic. You might feel better already just after putting this much down. Other people manage to convince themselves this way; up to you.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not everyone realizes that feeling sad can be like a security blanket.&lt;/p&gt;\n\n&lt;p&gt;Your boyfriend also sounds like a security blanket, but I mean that in a mildly insulting sense. You want to talk about your problems and he won&amp;#39;t. Maybe try again and make it clear to him that you need someone to talk to.&lt;/p&gt;\n\n&lt;p&gt;Some people find writing notes therapeutic. You might feel better already just after putting this much down. Other people manage to convince themselves this way; up to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ui53", "score_hidden": false, "name": "t1_chatckt", "created": 1399394738.0, "author_flair_text": null, "created_utc": 1399365938.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]