[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m tired of the struggle of being alive.  Whether it be the little things or the big things, the rewards are &lt;em&gt;never&lt;/em&gt; enough to justify continuing.  Most recently my bank account was overdrafted (I&amp;#39;m unemployed, I have no way to pay for the fucking added fee) and this isn&amp;#39;t the first time.  So nothing like having ruined credit when you&amp;#39;re 20, that&amp;#39;s fucking great.  Not to mention literally negative money.  As if some poor motherfucker like me needed to OWE a big bank some arbitrary fee.  &lt;/p&gt;\n\n&lt;p&gt;Another thing, is I&amp;#39;m about to be homeless in a few months.  My father is moving out with his girlfriend and as I&amp;#39;m still fucking unemployed, and I&amp;#39;m definitely going to get evicted as I can&amp;#39;t afford a fucking $825 a month lease on my own even if I do get a job.  Because when the minimum wage is 7.25, you bet your ass I won&amp;#39;t be making more than 9 as a 20 year old.    &lt;/p&gt;\n\n&lt;p&gt;I never brush my teeth anymore, I don&amp;#39;t give a shit about what I eat, and I get depressed when I see myself in the mirror.  My depression is largely a result of my environment and the reality I grew up in.  I feel like a parasite to my father, as he currently pays for everything and it is clearly taking its toll on him.  I have no interest in living like this anymore, and there is really no way out that I can see other than suicide.  It&amp;#39;s just such a beautiful and practical solution.  &lt;/p&gt;\n\n&lt;p&gt;When you have cancer, what do you do to fix it?  You remove/kill the cancer.  I &lt;em&gt;am&lt;/em&gt; the cancer.  I would be doing a service to my father and society by no longer sucking on their teets.  I&amp;#39;m a piece of shit.  I&amp;#39;m worthless.  I have no skills.  No way in hell I can afford to go to college.  When you look at the facts objectively, there is truly NO reason to not kill myself.  It just makes so much sense.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know when or how, but my days are absolutely very numbered.  I&amp;#39;ve been struggling with these thoughts for years, and every day I ask myself why I haven&amp;#39;t killed myself yet.  Because every day it just gets worse, and worse, and worse.  I need to quit while I&amp;#39;m only somewhat behind, rather than when I&amp;#39;ll be living on the streets.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure why I&amp;#39;m posting this, I guess I just want to get my story out there and get the message across that sometimes, people&amp;#39;s lives DO suck.  In our capitalist society for every winner there must be a loser.  I am a loser.  And I want to fold.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm tired of the struggle of being alive.  Whether it be the little things or the big things, the rewards are *never* enough to justify continuing.  Most recently my bank account was overdrafted (I'm unemployed, I have no way to pay for the fucking added fee) and this isn't the first time.  So nothing like having ruined credit when you're 20, that's fucking great.  Not to mention literally negative money.  As if some poor motherfucker like me needed to OWE a big bank some arbitrary fee.  \n\nAnother thing, is I'm about to be homeless in a few months.  My father is moving out with his girlfriend and as I'm still fucking unemployed, and I'm definitely going to get evicted as I can't afford a fucking $825 a month lease on my own even if I do get a job.  Because when the minimum wage is 7.25, you bet your ass I won't be making more than 9 as a 20 year old.    \n\nI never brush my teeth anymore, I don't give a shit about what I eat, and I get depressed when I see myself in the mirror.  My depression is largely a result of my environment and the reality I grew up in.  I feel like a parasite to my father, as he currently pays for everything and it is clearly taking its toll on him.  I have no interest in living like this anymore, and there is really no way out that I can see other than suicide.  It's just such a beautiful and practical solution.  \n\nWhen you have cancer, what do you do to fix it?  You remove/kill the cancer.  I *am* the cancer.  I would be doing a service to my father and society by no longer sucking on their teets.  I'm a piece of shit.  I'm worthless.  I have no skills.  No way in hell I can afford to go to college.  When you look at the facts objectively, there is truly NO reason to not kill myself.  It just makes so much sense.\n\nI don't know when or how, but my days are absolutely very numbered.  I've been struggling with these thoughts for years, and every day I ask myself why I haven't killed myself yet.  Because every day it just gets worse, and worse, and worse.  I need to quit while I'm only somewhat behind, rather than when I'll be living on the streets.  \n\nI'm not sure why I'm posting this, I guess I just want to get my story out there and get the message across that sometimes, people's lives DO suck.  In our capitalist society for every winner there must be a loser.  I am a loser.  And I want to fold.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2508of", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Brodellsky", "media": null, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2508of/if_life_keeps_dealing_me_a_shitty_hand_why_is_it/", "name": "t3_2508of", "created": 1399543192.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2508of/if_life_keeps_dealing_me_a_shitty_hand_why_is_it/", "author_flair_text": null, "title": "If life keeps dealing me a shitty hand, why is it frowned upon to fold?", "created_utc": 1399514392.0, "ups": 11, "num_comments": 13, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcemms", "gilded": 0, "author": "Killsranq", "parent_id": "t1_chce2zp", "approved_by": null, "body": "Is there nothing to hold on to?\n\nLook through the classfields. Sign up for a manual labor job.\n\nTrust me. Make it through, you will look back and be happy you didnt leave the purgatory called existence. There's still alot to go through. Dont quit now. \n\ntrust me on this, manual labor jobs like plumbing and fixing cars, just sign up somewhere and try to hit a job. get experience. These jobs pay good money too. Idk but the car mechanic next to the gas station pays $10/h. Pluming or HVAC, read up on it on a library. Theres still alot of options you can take.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there nothing to hold on to?&lt;/p&gt;\n\n&lt;p&gt;Look through the classfields. Sign up for a manual labor job.&lt;/p&gt;\n\n&lt;p&gt;Trust me. Make it through, you will look back and be happy you didnt leave the purgatory called existence. There&amp;#39;s still alot to go through. Dont quit now. &lt;/p&gt;\n\n&lt;p&gt;trust me on this, manual labor jobs like plumbing and fixing cars, just sign up somewhere and try to hit a job. get experience. These jobs pay good money too. Idk but the car mechanic next to the gas station pays $10/h. Pluming or HVAC, read up on it on a library. Theres still alot of options you can take.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcemms", "created": 1399545315.0, "author_flair_text": null, "created_utc": 1399516515.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chce2zp", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chcdvzv", "approved_by": null, "body": "I'm not so much concerned with people caring about me.  I don't even care about me.  What I am concerned with is how the odds are stacked against me.  That I'm fighting with a stick and everyone else has a gun.  The feeling that no matter how hard I try, I will never actually get anywhere.   Because believe me, I've tried.  I've done the whole antidepressant circus thing.  I've been there.  It's all a ruse, just doctors and insurance companies (I don't have insurance anymore, haven't taken my meds in 4-5 months now) looking to make a profit off of my misfortunes.  \n\nLife is about money.  I wasn't born into a family with it, and I wasn't born with the ability to attain it other than shitty minimum wage jobs THAT I CAN'T EVEN FUCKING GET.  I don't have any felonies, I'm white, I'm a 20 year old guy.  I'm not an idiot.  And yet, the world rejects me anyways.  I appreciate your words but I'm not sure I want to fight anymore.  I'm tired of fighting.  I've lost.  I want to leave this purgatory I call existence.  ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not so much concerned with people caring about me.  I don&amp;#39;t even care about me.  What I am concerned with is how the odds are stacked against me.  That I&amp;#39;m fighting with a stick and everyone else has a gun.  The feeling that no matter how hard I try, I will never actually get anywhere.   Because believe me, I&amp;#39;ve tried.  I&amp;#39;ve done the whole antidepressant circus thing.  I&amp;#39;ve been there.  It&amp;#39;s all a ruse, just doctors and insurance companies (I don&amp;#39;t have insurance anymore, haven&amp;#39;t taken my meds in 4-5 months now) looking to make a profit off of my misfortunes.  &lt;/p&gt;\n\n&lt;p&gt;Life is about money.  I wasn&amp;#39;t born into a family with it, and I wasn&amp;#39;t born with the ability to attain it other than shitty minimum wage jobs THAT I CAN&amp;#39;T EVEN FUCKING GET.  I don&amp;#39;t have any felonies, I&amp;#39;m white, I&amp;#39;m a 20 year old guy.  I&amp;#39;m not an idiot.  And yet, the world rejects me anyways.  I appreciate your words but I&amp;#39;m not sure I want to fight anymore.  I&amp;#39;m tired of fighting.  I&amp;#39;ve lost.  I want to leave this purgatory I call existence.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chce2zp", "created": 1399544072.0, "author_flair_text": null, "created_utc": 1399515272.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chcdvzv", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2508of", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcdvzv", "created": 1399543628.0, "author_flair_text": null, "created_utc": 1399514828.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chco4j6", "gilded": 0, "author": "colioptere", "parent_id": "t1_chcjuzp", "approved_by": null, "body": "Then, at least, I hope you're open with him about your plans, rather than make it a nasty surprise.\n\nDamn, I wish you didn't have to do this.  You deserve better.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then, at least, I hope you&amp;#39;re open with him about your plans, rather than make it a nasty surprise.&lt;/p&gt;\n\n&lt;p&gt;Damn, I wish you didn&amp;#39;t have to do this.  You deserve better.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chco4j6", "created": 1399583282.0, "author_flair_text": null, "created_utc": 1399554482.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcjuzp", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chcji8j", "approved_by": null, "body": "The wear is financial and by extension, emotional. I do help around the apartment when possible but unfortunately it isn't enough. And I've tried getting food stamps but living with him prevents that, when he moves out I could get them but it wouldn't matter because id be homeless. And the fact that he is leaving me here regardless of whether or jot I'll be able to handle it says a lot about how fed up he is and how little he thinks of me. I highly doubt my suicide would matter all that much. He has two other kids (my younger siblings) that he cares about much more. He takes them out to dinner and movies and all that and I dont get that same treatment. And I get it, the whole divorce kid competition thing. But I feel pretty worthless to him because I really am. I'm just a drain on his already mediocre bank account and really my death would be a welcome ease on his financial situation. He's suffered long enough, and so have I.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The wear is financial and by extension, emotional. I do help around the apartment when possible but unfortunately it isn&amp;#39;t enough. And I&amp;#39;ve tried getting food stamps but living with him prevents that, when he moves out I could get them but it wouldn&amp;#39;t matter because id be homeless. And the fact that he is leaving me here regardless of whether or jot I&amp;#39;ll be able to handle it says a lot about how fed up he is and how little he thinks of me. I highly doubt my suicide would matter all that much. He has two other kids (my younger siblings) that he cares about much more. He takes them out to dinner and movies and all that and I dont get that same treatment. And I get it, the whole divorce kid competition thing. But I feel pretty worthless to him because I really am. I&amp;#39;m just a drain on his already mediocre bank account and really my death would be a welcome ease on his financial situation. He&amp;#39;s suffered long enough, and so have I.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcjuzp", "created": 1399561056.0, "author_flair_text": null, "created_utc": 1399532256.0, "distinguished": null, "num_reports": null, "ups": 7}}], "after": null, "before": null}}, "saved": false, "id": "chcji8j", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chciyq8", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcji8j", "created": 1399559522.0, "author_flair_text": null, "created_utc": 1399530722.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chciyq8", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chcio10", "approved_by": null, "body": "I cannot rely on him much longer. As I said, its really wearing him down. I feel like worthless asshole. I want to be happy. I want to feel comfortable about my future. But I just really cant see it happening. I will be stuck in minimum wage jobs and the like for the rest of my life, as I have no skills and have no way or knowhow to attain them. I do appreciate your words but I'm not so sure that bing alive will help. Its only prolonging the inevitable and I dont see why I shouldn't just cut to the chase, you know?", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cannot rely on him much longer. As I said, its really wearing him down. I feel like worthless asshole. I want to be happy. I want to feel comfortable about my future. But I just really cant see it happening. I will be stuck in minimum wage jobs and the like for the rest of my life, as I have no skills and have no way or knowhow to attain them. I do appreciate your words but I&amp;#39;m not so sure that bing alive will help. Its only prolonging the inevitable and I dont see why I shouldn&amp;#39;t just cut to the chase, you know?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chciyq8", "created": 1399557356.0, "author_flair_text": null, "created_utc": 1399528556.0, "distinguished": null, "num_reports": null, "ups": 7}}], "after": null, "before": null}}, "saved": false, "id": "chcio10", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2508of", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcio10", "created": 1399556263.0, "author_flair_text": null, "created_utc": 1399527463.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcjzwk", "gilded": 0, "author": "specificallyforGates", "parent_id": "t3_2508of", "approved_by": null, "body": "I have a job and it just makes me feel worse about myself", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a job and it just makes me feel worse about myself&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcjzwk", "created": 1399561701.0, "author_flair_text": null, "created_utc": 1399532901.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chduhvl", "gilded": 0, "author": "Inquiringaboutthings", "parent_id": "t3_2508of", "approved_by": null, "body": "Because your hand is nowhere as bad as you make it out to be. I don't mean this in a patronizing way, you're the one who said: \"When you look at the facts objectively, there is truly no reason to not kill myself\"\n\nLet's look at the facts objectively then: \n\n- You admit that your depression is a result of your environment. Which means that you are NOT the cancer, as you've put it, but you are just broken by circumstances. So, your life COULD improve if your circumstances were to improve, correct?\n\n- You are able-bodied and twenty years old and, well, not to be blunt about it, but you're white. You said that: \"I'm fighting with a stick and everyone else has a gun\". No. There are millions of people fighting with pebbles all over the world. To them, your stick would be a luxury and something to covet. Again, objectively speaking, you are at a very advantaged position in life. Yes, you're not the son of an oil baron but you grew up with a roof over your head, you have access to a computer and clean water and you seem smarter than you give yourself credit for.\n\n- You CAN get a minimum wage job and get some roommates and find a place much cheaper than 825 a month. I live in Los Angeles, which is an exorbitantly expensive city, and I pay 400 dollars for my place. Would it be hard? Well, yes. But is it impossible? No. Maybe your father can help you get on your feet. I'm sure he sees that you are broken and would be happy to put you on a path to recovery. Again, I'm not selling you snake-oil, the objective fact that he has helped you so far signals me that he might be willing to do something like this if he sees that you are serious about improving your life.\n\n- You seem depressed, correct me if I'm wrong. Not, like, \"I'm sad\" depressed but seriously depressed. It is scientifically accurate that one of the symptoms of depression is the inability to see beyond your current predicament. That your life will never improve because you're stuck, getting sucked in by this black hole. But that's objectively wrong. Your life can improve. I'm sorry that anti-depressants haven't worked on you, but, hey, it takes people many years until they find the medicine that works for them.\n\n- Your attitude is defeatist, which is perfectly appropriate considering you're feeling defeated. But it is objectively true that you're much less likely to improve if you're emanating negative energy. I don't mean this in a totally cuckoo and The Secret-y, kinda way. Imagine you're going on two dates, will you pick the girl who is positive and smiling or the one who's somber and morose? Apply that to a job interview, which employee you're going to choose? So, objectively, if you want to improve your predicament, you should start adopting a positive attitude.\n\nWhich is easier said that done, I know. I know it's almost border-line comical for me to be like \"Be positive!\" when you're thinking about suicide. But little steps go a long way when a person is standing where you are right now. Watch a show that makes you laugh. Or start watching Lost or Game of Thrones. I mean, I'm projecting a little bit at this point because these are things I enjoy, but you get what I'm saying.\n\nActually, while we're getting personal... I empathize with you because I was born into a broken family. My first memory is my bi-polar mother ranting naked about how my dad tried to kill her and me. When I was 16, she tried to strangle me to death because I forgot to do my math homework. I tried killing myself when I was 17. I lost my virginity when I was 27 and I hadn't even kissed a girl until then. Now, this isn't some patronizing \"I did it, so you can too!\" lecture, I'm sure we're two very different people and I had some advantages that you don't and it's not like those thoughts don't try to creep into my head once in a while. What I'm saying is, how you feel right now isn't necessarily how you will feel in the future. \n\nYou seem tired to me, but not... lost. You still want things. (Hey, you said you went on a date yesterday on another thread, so you at least want something.) You definitely feel that the things you want are unattainable and that's depressing but you still want them. So follow your want. Little steps, little goals first. It's probably gonna get harder before it gets better, but as long as you want something, there is a reason to keep playing. And you're 20, come on, you shouldn't fold because the game barely started and you probably don't even know the rules yet. Not to be obnoxious but... this is also objectively true. You're 20. I bet you look back to to when you were 15 and think \"Man, I was a fucking idiot.\" Well, I assure you that you will look back the same way to when you were 20 when you will be 25. I hope you make it there.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because your hand is nowhere as bad as you make it out to be. I don&amp;#39;t mean this in a patronizing way, you&amp;#39;re the one who said: &amp;quot;When you look at the facts objectively, there is truly no reason to not kill myself&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s look at the facts objectively then: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;You admit that your depression is a result of your environment. Which means that you are NOT the cancer, as you&amp;#39;ve put it, but you are just broken by circumstances. So, your life COULD improve if your circumstances were to improve, correct?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You are able-bodied and twenty years old and, well, not to be blunt about it, but you&amp;#39;re white. You said that: &amp;quot;I&amp;#39;m fighting with a stick and everyone else has a gun&amp;quot;. No. There are millions of people fighting with pebbles all over the world. To them, your stick would be a luxury and something to covet. Again, objectively speaking, you are at a very advantaged position in life. Yes, you&amp;#39;re not the son of an oil baron but you grew up with a roof over your head, you have access to a computer and clean water and you seem smarter than you give yourself credit for.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You CAN get a minimum wage job and get some roommates and find a place much cheaper than 825 a month. I live in Los Angeles, which is an exorbitantly expensive city, and I pay 400 dollars for my place. Would it be hard? Well, yes. But is it impossible? No. Maybe your father can help you get on your feet. I&amp;#39;m sure he sees that you are broken and would be happy to put you on a path to recovery. Again, I&amp;#39;m not selling you snake-oil, the objective fact that he has helped you so far signals me that he might be willing to do something like this if he sees that you are serious about improving your life.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You seem depressed, correct me if I&amp;#39;m wrong. Not, like, &amp;quot;I&amp;#39;m sad&amp;quot; depressed but seriously depressed. It is scientifically accurate that one of the symptoms of depression is the inability to see beyond your current predicament. That your life will never improve because you&amp;#39;re stuck, getting sucked in by this black hole. But that&amp;#39;s objectively wrong. Your life can improve. I&amp;#39;m sorry that anti-depressants haven&amp;#39;t worked on you, but, hey, it takes people many years until they find the medicine that works for them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Your attitude is defeatist, which is perfectly appropriate considering you&amp;#39;re feeling defeated. But it is objectively true that you&amp;#39;re much less likely to improve if you&amp;#39;re emanating negative energy. I don&amp;#39;t mean this in a totally cuckoo and The Secret-y, kinda way. Imagine you&amp;#39;re going on two dates, will you pick the girl who is positive and smiling or the one who&amp;#39;s somber and morose? Apply that to a job interview, which employee you&amp;#39;re going to choose? So, objectively, if you want to improve your predicament, you should start adopting a positive attitude.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Which is easier said that done, I know. I know it&amp;#39;s almost border-line comical for me to be like &amp;quot;Be positive!&amp;quot; when you&amp;#39;re thinking about suicide. But little steps go a long way when a person is standing where you are right now. Watch a show that makes you laugh. Or start watching Lost or Game of Thrones. I mean, I&amp;#39;m projecting a little bit at this point because these are things I enjoy, but you get what I&amp;#39;m saying.&lt;/p&gt;\n\n&lt;p&gt;Actually, while we&amp;#39;re getting personal... I empathize with you because I was born into a broken family. My first memory is my bi-polar mother ranting naked about how my dad tried to kill her and me. When I was 16, she tried to strangle me to death because I forgot to do my math homework. I tried killing myself when I was 17. I lost my virginity when I was 27 and I hadn&amp;#39;t even kissed a girl until then. Now, this isn&amp;#39;t some patronizing &amp;quot;I did it, so you can too!&amp;quot; lecture, I&amp;#39;m sure we&amp;#39;re two very different people and I had some advantages that you don&amp;#39;t and it&amp;#39;s not like those thoughts don&amp;#39;t try to creep into my head once in a while. What I&amp;#39;m saying is, how you feel right now isn&amp;#39;t necessarily how you will feel in the future. &lt;/p&gt;\n\n&lt;p&gt;You seem tired to me, but not... lost. You still want things. (Hey, you said you went on a date yesterday on another thread, so you at least want something.) You definitely feel that the things you want are unattainable and that&amp;#39;s depressing but you still want them. So follow your want. Little steps, little goals first. It&amp;#39;s probably gonna get harder before it gets better, but as long as you want something, there is a reason to keep playing. And you&amp;#39;re 20, come on, you shouldn&amp;#39;t fold because the game barely started and you probably don&amp;#39;t even know the rules yet. Not to be obnoxious but... this is also objectively true. You&amp;#39;re 20. I bet you look back to to when you were 15 and think &amp;quot;Man, I was a fucking idiot.&amp;quot; Well, I assure you that you will look back the same way to when you were 20 when you will be 25. I hope you make it there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chduhvl", "created": 1399690101.0, "author_flair_text": null, "created_utc": 1399661301.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd1h33", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chcm2st", "approved_by": null, "body": "Yeah you nailed it.\n\n:(", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah you nailed it.&lt;/p&gt;\n\n&lt;p&gt;:(&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chd1h33", "created": 1399611285.0, "author_flair_text": null, "created_utc": 1399582485.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chcm2st", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chckcmu", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chcm2st", "created": 1399574328.0, "author_flair_text": null, "created_utc": 1399545528.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chckcmu", "gilded": 0, "author": "Bloodysick", "parent_id": "t3_2508of", "approved_by": null, "body": "I am from India, hundreds of people here literally die in winters because they are homeless and have to sleep on footpaths. Government doesn't give a shit about them. I am a human rights activist, I run a NGO. I have no way to fund it except for the volunteers who ask for the money at monuments just so we can provide for the blankets in the winters. But never, in the last 3.5 years had a person ever said to me. I just want to die. Believe me, they all want to live. Most of them stay the way they are, helpless, but some go through the pain, endure it and pass it by. \n\nYes the life deals shitty hands at times, and you may fold but dont get off the table just yet, there are many cards to be dealt many hands to be played. The future will be hard, but what it may bring can be influenced by you. May be you will have shittier life and may be something good will happen. You don't know yet. But there is always hope.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am from India, hundreds of people here literally die in winters because they are homeless and have to sleep on footpaths. Government doesn&amp;#39;t give a shit about them. I am a human rights activist, I run a NGO. I have no way to fund it except for the volunteers who ask for the money at monuments just so we can provide for the blankets in the winters. But never, in the last 3.5 years had a person ever said to me. I just want to die. Believe me, they all want to live. Most of them stay the way they are, helpless, but some go through the pain, endure it and pass it by. &lt;/p&gt;\n\n&lt;p&gt;Yes the life deals shitty hands at times, and you may fold but dont get off the table just yet, there are many cards to be dealt many hands to be played. The future will be hard, but what it may bring can be influenced by you. May be you will have shittier life and may be something good will happen. You don&amp;#39;t know yet. But there is always hope.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2508of", "score_hidden": false, "name": "t1_chckcmu", "created": 1399563502.0, "author_flair_text": null, "created_utc": 1399534702.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]