[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/suicidewatch\"&gt;/r/suicidewatch&lt;/a&gt;. I&amp;#39;ve been a redditor for over a year, but my friends know about my account so im using a throwaway. Now, where do I start with my problems? I would start off with my failing grades, me being reletively obese, my parents recent divorce, my Overprotective mom beginning to hate me, my closeted atheism, or my chronic masterbuation. Really the only thing that keeps me somewhat happy is my social life, movies and video games. That&amp;#39;s all I really rely on besides shows like Rick and Morty or game of thrones. Please just give me some help, I&amp;#39;ve been struggling with this depression for around 6 months now. Please.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey /r/suicidewatch. I've been a redditor for over a year, but my friends know about my account so im using a throwaway. Now, where do I start with my problems? I would start off with my failing grades, me being reletively obese, my parents recent divorce, my Overprotective mom beginning to hate me, my closeted atheism, or my chronic masterbuation. Really the only thing that keeps me somewhat happy is my social life, movies and video games. That's all I really rely on besides shows like Rick and Morty or game of thrones. Please just give me some help, I've been struggling with this depression for around 6 months now. Please.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2490gh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "13andsad", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 6, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2490gh/im_13_and_ive_been_struggling_with_depression_for/", "name": "t3_2490gh", "created": 1398772733.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2490gh/im_13_and_ive_been_struggling_with_depression_for/", "author_flair_text": null, "title": "I'm 13, and I've been struggling with depression for over 6 months now.", "created_utc": 1398743933.0, "ups": 17, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4wssv", "gilded": 0, "author": "Phobicity", "parent_id": "t3_2490gh", "approved_by": null, "body": "Since you're 13, you have a lot of time to change. Seeing that you know what some of your problems are, I would say you've already taken a small step forward.\n\nDon't over worry about some of the problems you've listed. Chronic masturbation isn't problem, just be discrete. Whatever you do, do **NOT** come out to your family as an atheist unless you are 100% sure they are supportive of atheism. There have been many cases of atheists being kicked out of religious families and that is not a path you want to go down. \n\nI won't tell you to study hard because I never did that, and there's no point giving advice that I didn't follow. But do make sure to make the right friends, people who you can count on. You'll feel better talking about stuff which you keep hidden from others, such as atheism. Get a job as soon as you legally can, and be **frugal**. As soon as you get a job, you'll have a lot more freedom and control. Learn to save, gym etc. \n\nAs for your obesity, take it slow. Take small steps away from any unhealthy foods that you are eating but don't suddenly go on a no sugar diet. If you frequently drink soft drinks, maybe start drinking fruit juice instead. Sure its still very sugary but its still better then soft drinks. If you always go maccas, try buying 2 burgers instead of a meal and cut out the chips and drinks. If there is somewhere close that you always go to, instead of asking for a lift, get on a bike or walk there. \n\nI would say, enjoy the things that make you happy, and take small steps to change. You're 13, take it slow.", "edited": 1398775488.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since you&amp;#39;re 13, you have a lot of time to change. Seeing that you know what some of your problems are, I would say you&amp;#39;ve already taken a small step forward.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t over worry about some of the problems you&amp;#39;ve listed. Chronic masturbation isn&amp;#39;t problem, just be discrete. Whatever you do, do &lt;strong&gt;NOT&lt;/strong&gt; come out to your family as an atheist unless you are 100% sure they are supportive of atheism. There have been many cases of atheists being kicked out of religious families and that is not a path you want to go down. &lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t tell you to study hard because I never did that, and there&amp;#39;s no point giving advice that I didn&amp;#39;t follow. But do make sure to make the right friends, people who you can count on. You&amp;#39;ll feel better talking about stuff which you keep hidden from others, such as atheism. Get a job as soon as you legally can, and be &lt;strong&gt;frugal&lt;/strong&gt;. As soon as you get a job, you&amp;#39;ll have a lot more freedom and control. Learn to save, gym etc. &lt;/p&gt;\n\n&lt;p&gt;As for your obesity, take it slow. Take small steps away from any unhealthy foods that you are eating but don&amp;#39;t suddenly go on a no sugar diet. If you frequently drink soft drinks, maybe start drinking fruit juice instead. Sure its still very sugary but its still better then soft drinks. If you always go maccas, try buying 2 burgers instead of a meal and cut out the chips and drinks. If there is somewhere close that you always go to, instead of asking for a lift, get on a bike or walk there. &lt;/p&gt;\n\n&lt;p&gt;I would say, enjoy the things that make you happy, and take small steps to change. You&amp;#39;re 13, take it slow.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2490gh", "score_hidden": false, "name": "t1_ch4wssv", "created": 1398790629.0, "author_flair_text": null, "created_utc": 1398761829.0, "distinguished": null, "num_reports": null, "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4tix6", "gilded": 0, "author": "moustachemall", "parent_id": "t3_2490gh", "approved_by": null, "body": "what video games do u play? I was a very depressed teenager that turned into a more or less positive adult. I play games about as much as ever its awesome", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what video games do u play? I was a very depressed teenager that turned into a more or less positive adult. I play games about as much as ever its awesome&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2490gh", "score_hidden": false, "name": "t1_ch4tix6", "created": 1398751076.0, "author_flair_text": null, "created_utc": 1398747476.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5at73", "gilded": 0, "author": "FsuRyne", "parent_id": "t3_2490gh", "approved_by": null, "body": "I went through similar things when I was a teen. I always found pleasure in discovering new hobbies and meeting new people. You are still so young that you have nothing but time, to fix what can be fixed, to learn different ways to deal with stress and depression, to love, to enjoy, to experience. Keep your head up and play it day by day. And if today sucks, just write it off and have a better tomorrow. Keep us posted!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through similar things when I was a teen. I always found pleasure in discovering new hobbies and meeting new people. You are still so young that you have nothing but time, to fix what can be fixed, to learn different ways to deal with stress and depression, to love, to enjoy, to experience. Keep your head up and play it day by day. And if today sucks, just write it off and have a better tomorrow. Keep us posted!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2490gh", "score_hidden": false, "name": "t1_ch5at73", "created": 1398829237.0, "author_flair_text": null, "created_utc": 1398800437.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]