[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Anxiety has been holding me back for too long. I get paralyzed when it comes out, and I can&amp;#39;t do anything like a normal person.&lt;/p&gt;\n\n&lt;p&gt;I grew up with abusive parents who were never a real part of my life other than providing basic essentials, and I turned into someone who was so clueless about certain things that I turned into a joke.&lt;/p&gt;\n\n&lt;p&gt;Regardless though, I was fine up until my senior year in high school. I was a very hard worker who got straight As, and I worked hard in many different clubs and activities. I also had several very good friends and felt a lot of meaning in my life.&lt;/p&gt;\n\n&lt;p&gt;I just voluntarily threw away all my confidence, work ethic, and social life though so that I could be apart of a group online that I was obsessed with at the time. I&amp;#39;m not going to go into specifics here, but it was very stupid. I was never really depressed or super anxious until then, and then I voluntarily became bad.&lt;/p&gt;\n\n&lt;p&gt;I started staying up until 2 in the morning when I had to get up at 5. I started a habit of mediocrity. I gained a lot of weight and didn&amp;#39;t care. I got addicted to video games. And the list goes on...&lt;/p&gt;\n\n&lt;p&gt;By the time came to go to college, I had applied for zero scholarships and instead of going to the school of my dreams (a state university, but the school of my dreams nonetheless), I went to community college where my laziness habit continued.&lt;/p&gt;\n\n&lt;p&gt;At that point, my self-worth was destroyed and has never recovered, and my anxiety about life has only gotten worse and worse. &lt;/p&gt;\n\n&lt;p&gt;At several points, I completely gave up on career paths because I was worried about how much I would have to interact with people, which = failure for me now.&lt;/p&gt;\n\n&lt;p&gt;I graduated from university with a degree in English, no internships, very little experience in anything, and an ok GPA, simply because I&amp;#39;ve only been taking the easy way out and avoiding everything out of fear.&lt;/p&gt;\n\n&lt;p&gt;Since I graduated, my anxiety and chances of ever getting a job have gotten worse and worse. It&amp;#39;s been four months now, and I am paralyzed just by talking to a clerk at the store. There is no way I am going to succeed at a job interview. &lt;/p&gt;\n\n&lt;p&gt;My mother has already disowned me for being lazy, and it is only a matter of time before my father does the same. And I don&amp;#39;t blame them. I am 23 and living with my parents with no job or car. I brought this all upon myself, and now the only way to solve it is through my death.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Anxiety has been holding me back for too long. I get paralyzed when it comes out, and I can't do anything like a normal person.\n\nI grew up with abusive parents who were never a real part of my life other than providing basic essentials, and I turned into someone who was so clueless about certain things that I turned into a joke.\n\nRegardless though, I was fine up until my senior year in high school. I was a very hard worker who got straight As, and I worked hard in many different clubs and activities. I also had several very good friends and felt a lot of meaning in my life.\n\nI just voluntarily threw away all my confidence, work ethic, and social life though so that I could be apart of a group online that I was obsessed with at the time. I'm not going to go into specifics here, but it was very stupid. I was never really depressed or super anxious until then, and then I voluntarily became bad.\n\nI started staying up until 2 in the morning when I had to get up at 5. I started a habit of mediocrity. I gained a lot of weight and didn't care. I got addicted to video games. And the list goes on...\n\nBy the time came to go to college, I had applied for zero scholarships and instead of going to the school of my dreams (a state university, but the school of my dreams nonetheless), I went to community college where my laziness habit continued.\n\nAt that point, my self-worth was destroyed and has never recovered, and my anxiety about life has only gotten worse and worse. \n\nAt several points, I completely gave up on career paths because I was worried about how much I would have to interact with people, which = failure for me now.\n\nI graduated from university with a degree in English, no internships, very little experience in anything, and an ok GPA, simply because I've only been taking the easy way out and avoiding everything out of fear.\n\nSince I graduated, my anxiety and chances of ever getting a job have gotten worse and worse. It's been four months now, and I am paralyzed just by talking to a clerk at the store. There is no way I am going to succeed at a job interview. \n\nMy mother has already disowned me for being lazy, and it is only a matter of time before my father does the same. And I don't blame them. I am 23 and living with my parents with no job or car. I brought this all upon myself, and now the only way to solve it is through my death.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248xm2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ghasopdighaspodgihsd", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248xm2/im_a_loser_and_death_is_the_only_way_out/", "name": "t3_248xm2", "created": 1398770730.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248xm2/im_a_loser_and_death_is_the_only_way_out/", "author_flair_text": null, "title": "I'm a loser, and death is the only way out", "created_utc": 1398741930.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch50ouh", "gilded": 0, "author": "ediciusTemp", "parent_id": "t3_248xm2", "approved_by": null, "body": "Just ignore the other poster-it is quite reasonable to feel the way you do simply because obviously many people start figuring out how to live on their own at that age-it sounds like you are a little bit late in figuring it out so you feel like you are trapped.  The one thing I can say is at least you got the degree- that gives you a huge step up compared to not having one.\n\nBtw I'm 30 and still live with my parents so I can relate to the way you feel about still living at home. Have your parents ever outright called you lazy or are you just assuming that?\n\nI hope you are able to figure things out so that you don't have to kill yourself as a part of the solution.  I'm suicidal myself so I know how tempting that can be.  \n\nBtw it sounds like you are a relatively good student.  What makes you think that won't translate into the job market?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just ignore the other poster-it is quite reasonable to feel the way you do simply because obviously many people start figuring out how to live on their own at that age-it sounds like you are a little bit late in figuring it out so you feel like you are trapped.  The one thing I can say is at least you got the degree- that gives you a huge step up compared to not having one.&lt;/p&gt;\n\n&lt;p&gt;Btw I&amp;#39;m 30 and still live with my parents so I can relate to the way you feel about still living at home. Have your parents ever outright called you lazy or are you just assuming that?&lt;/p&gt;\n\n&lt;p&gt;I hope you are able to figure things out so that you don&amp;#39;t have to kill yourself as a part of the solution.  I&amp;#39;m suicidal myself so I know how tempting that can be.  &lt;/p&gt;\n\n&lt;p&gt;Btw it sounds like you are a relatively good student.  What makes you think that won&amp;#39;t translate into the job market?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248xm2", "score_hidden": false, "name": "t1_ch50ouh", "created": 1398782919.0, "author_flair_text": null, "created_utc": 1398779319.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4v6aa", "gilded": 0, "author": "WorldsEndGirlfriend", "parent_id": "t3_248xm2", "approved_by": null, "body": "23 is nothing. You have multiple lifetimes to reinvent yourself. \n\nDid you know Asian countries would love to have you as an English teacher with your background? You could completely uproot yourself, move to an exciting new environment, and reinvent your life now that you're aware of your weakness? \n\nThat's just one possibility. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;23 is nothing. You have multiple lifetimes to reinvent yourself. &lt;/p&gt;\n\n&lt;p&gt;Did you know Asian countries would love to have you as an English teacher with your background? You could completely uproot yourself, move to an exciting new environment, and reinvent your life now that you&amp;#39;re aware of your weakness? &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s just one possibility. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248xm2", "score_hidden": false, "name": "t1_ch4v6aa", "created": 1398782147.0, "author_flair_text": null, "created_utc": 1398753347.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]