[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in I.T, I work with lads, I am female. I&amp;#39;m not skinny, slim I&amp;#39;m probably not even just chubby now, I am fat, yes depressingly sadly fat.&lt;/p&gt;\n\n&lt;p&gt;There is a lad who doesn&amp;#39;t even work in my department, my age (27), into body building etc.&lt;/p&gt;\n\n&lt;p&gt;Since I started this job...he hasn&amp;#39;t liked me. He has made it clear and said outright, he has no time for fat people.&lt;/p&gt;\n\n&lt;p&gt;He has said in front of people not at me but EVERYONE knew at lunch it was at me. That &amp;quot;some girls look like road kill&amp;quot;...silence in the room fill with awkwardness.&lt;/p&gt;\n\n&lt;p&gt;Today on my shift it was myself and 2 colleagues. He is the brother of one of my colleagues so the dread feels me when he comes in the office with him.&lt;/p&gt;\n\n&lt;p&gt;I get asked how much I weigh.&lt;/p&gt;\n\n&lt;p&gt;I get asked if my boyfriend only fucks me doggy so he doesn&amp;#39;t have to look at me.&lt;/p&gt;\n\n&lt;p&gt;I get told I should play in goal in football, lets face it, lets not beat around the bush your fat.&lt;/p&gt;\n\n&lt;p&gt;I felt humiliated and completely shit.&lt;/p&gt;\n\n&lt;p&gt;I know I&amp;#39;m fat and no I can&amp;#39;t hide it. It&amp;#39;s my issue that makes me hate myself to the point in actually wanting to die. I battle with my weight and at this point I think I am the biggest I&amp;#39;ve ever been. It probably doesn&amp;#39;t help I am rather short too.&lt;/p&gt;\n\n&lt;p&gt;I feel stupid for not confronting him but I am not a confrontational person. i feel embarrassed it was infront of people.&lt;/p&gt;\n\n&lt;p&gt;and what blew my mind more, is his brother is &amp;quot;fat&amp;quot; had eaten TWO mcdonalds double sausage and egg mcmuffins with TWO hash browns that morning!&lt;/p&gt;\n\n&lt;p&gt;This has played on my mind all day. I couldn&amp;#39;t wait to leave work, I just wanted to die. literally die.&lt;/p&gt;\n\n&lt;p&gt;I came home after dropping my daughter to a party and I just felt overwhelmed by emotion and couldn&amp;#39;t wait to see my boyfriend and to just feel safe, ok i don&amp;#39;t know i just wanted him.&lt;/p&gt;\n\n&lt;p&gt;In my battle of tears I rang him to just talk to someone, get it off my chest and I didn&amp;#39;t expect his reaction to be pissed off at me for not saying anything and i have turned him off me for being a &amp;quot;pussy&amp;quot; and not saying anything. and the fact I am getting &amp;quot;bullied&amp;quot; at work at my age. He has now switched his phone off and doesn&amp;#39;t want to see me.&lt;/p&gt;\n\n&lt;p&gt;I right now, feel complete and utter shit and hatred for myself. I feel sad for pissing him off. I feel frustrated for not sticking up for myself but i was in shock and like i say embarrassed and i just don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;I feel so pathetic for letting a nobody bother me. but it&amp;#39;s made me wonder does everyone have this thought about me? am i actually a laughing stock to everyone?&lt;/p&gt;\n\n&lt;p&gt;I hate myself all the time. I hate what I look like. I get told im stunning. yeah alright.&lt;/p&gt;\n\n&lt;p&gt;its got to a point regardless of this I am pushing EVERYONE away again.&lt;/p&gt;\n\n&lt;p&gt;I get really depressed a few times  year, like major where I have had 2/3months off of work each year for the past 3 years. I have only been in this new job for 6 months. i do love it and my co workers except this person who isnt even my department but appears all the time. when i spot him i just clam up and feel like a scared child. how pathetic am i?  i dont want to see anyone.\nI am a low ebb this has set me up on even more so. I feel everyone hates me and I just don&amp;#39;t know i am in a state of my own patheticness of a life.&lt;/p&gt;\n\n&lt;p&gt;I AM SO FRUSTRATED THAT I AM DISGUSTING.&lt;/p&gt;\n\n&lt;p&gt;I feel so ashamed of myself. i get told to get a grip and theres worse off people with proper problems. well to me this is a big problem my self hatred etc my looks it sounds pathetic i know it does. i just hate me.\nand feel i am not good enough to be around and right now i am obviously not good enough to be around my boyfriend.&lt;/p&gt;\n\n&lt;p&gt;I literally want to die right now. i don&amp;#39;t know what to do or think.&lt;/p&gt;\n\n&lt;p&gt;i am scared of how i am feeling again. i cant go through with dealing with this anymore or again and again. i try to lose weight but its so hard. i just cant explain it. \ni feel like i have to apologise to everyone how i feel and keep texting my boyfriend to say i sorry for making him mad im just sorry to everyone i bother. i even feel bad posing this and pathetic.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in I.T, I work with lads, I am female. I'm not skinny, slim I'm probably not even just chubby now, I am fat, yes depressingly sadly fat.\n\nThere is a lad who doesn't even work in my department, my age (27), into body building etc.\n\nSince I started this job...he hasn't liked me. He has made it clear and said outright, he has no time for fat people.\n\nHe has said in front of people not at me but EVERYONE knew at lunch it was at me. That \"some girls look like road kill\"...silence in the room fill with awkwardness.\n\nToday on my shift it was myself and 2 colleagues. He is the brother of one of my colleagues so the dread feels me when he comes in the office with him.\n\nI get asked how much I weigh.\n\nI get asked if my boyfriend only fucks me doggy so he doesn't have to look at me.\n\nI get told I should play in goal in football, lets face it, lets not beat around the bush your fat.\n\nI felt humiliated and completely shit.\n\nI know I'm fat and no I can't hide it. It's my issue that makes me hate myself to the point in actually wanting to die. I battle with my weight and at this point I think I am the biggest I've ever been. It probably doesn't help I am rather short too.\n\nI feel stupid for not confronting him but I am not a confrontational person. i feel embarrassed it was infront of people.\n\nand what blew my mind more, is his brother is \"fat\" had eaten TWO mcdonalds double sausage and egg mcmuffins with TWO hash browns that morning!\n\nThis has played on my mind all day. I couldn't wait to leave work, I just wanted to die. literally die.\n\nI came home after dropping my daughter to a party and I just felt overwhelmed by emotion and couldn't wait to see my boyfriend and to just feel safe, ok i don't know i just wanted him.\n\nIn my battle of tears I rang him to just talk to someone, get it off my chest and I didn't expect his reaction to be pissed off at me for not saying anything and i have turned him off me for being a \"pussy\" and not saying anything. and the fact I am getting \"bullied\" at work at my age. He has now switched his phone off and doesn't want to see me.\n\nI right now, feel complete and utter shit and hatred for myself. I feel sad for pissing him off. I feel frustrated for not sticking up for myself but i was in shock and like i say embarrassed and i just don't know.\n\nI feel so pathetic for letting a nobody bother me. but it's made me wonder does everyone have this thought about me? am i actually a laughing stock to everyone?\n\nI hate myself all the time. I hate what I look like. I get told im stunning. yeah alright.\n\nits got to a point regardless of this I am pushing EVERYONE away again.\n\nI get really depressed a few times  year, like major where I have had 2/3months off of work each year for the past 3 years. I have only been in this new job for 6 months. i do love it and my co workers except this person who isnt even my department but appears all the time. when i spot him i just clam up and feel like a scared child. how pathetic am i?  i dont want to see anyone.\nI am a low ebb this has set me up on even more so. I feel everyone hates me and I just don't know i am in a state of my own patheticness of a life.\n\nI AM SO FRUSTRATED THAT I AM DISGUSTING.\n\nI feel so ashamed of myself. i get told to get a grip and theres worse off people with proper problems. well to me this is a big problem my self hatred etc my looks it sounds pathetic i know it does. i just hate me.\nand feel i am not good enough to be around and right now i am obviously not good enough to be around my boyfriend.\n\nI literally want to die right now. i don't know what to do or think.\n\ni am scared of how i am feeling again. i cant go through with dealing with this anymore or again and again. i try to lose weight but its so hard. i just cant explain it. \ni feel like i have to apologise to everyone how i feel and keep texting my boyfriend to say i sorry for making him mad im just sorry to everyone i bother. i even feel bad posing this and pathetic.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241uyf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ginzeh", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398588633.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241uyf/im_at_a_dark_place_again/", "name": "t3_241uyf", "created": 1398570350.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241uyf/im_at_a_dark_place_again/", "author_flair_text": null, "title": "I'm at a dark place, again.", "created_utc": 1398541550.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2s4bx", "gilded": 0, "author": "wrotethis", "parent_id": "t3_241uyf", "approved_by": null, "body": "Girls have it rough. In a society that values only one thing from women it can be hard to maintain a sense of self-worth when you feel like you don't have that one thing that will make you a valuable part of the world. Guys can obtain self-worth more easily because society also values other things from them that they can turn to if their physical health becomes out of wack. The world is insane. People mock others to inflate their status and to bury their own self-hatred. It is constant cycle of hatred that feeds on itself and they are caught in it. Everybody is suffering. Looking to others for all your love, acceptance and meaning also feeds into a cycle when your expectations are not met. You reach out and fall and think of reaching farther out instead of just making the foundation more solid.  You can't look to others for meaning. it's a dead end. love for yourself and forgiveness for others despite all they may do is where you start the uphill climb.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Girls have it rough. In a society that values only one thing from women it can be hard to maintain a sense of self-worth when you feel like you don&amp;#39;t have that one thing that will make you a valuable part of the world. Guys can obtain self-worth more easily because society also values other things from them that they can turn to if their physical health becomes out of wack. The world is insane. People mock others to inflate their status and to bury their own self-hatred. It is constant cycle of hatred that feeds on itself and they are caught in it. Everybody is suffering. Looking to others for all your love, acceptance and meaning also feeds into a cycle when your expectations are not met. You reach out and fall and think of reaching farther out instead of just making the foundation more solid.  You can&amp;#39;t look to others for meaning. it&amp;#39;s a dead end. love for yourself and forgiveness for others despite all they may do is where you start the uphill climb.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241uyf", "score_hidden": false, "name": "t1_ch2s4bx", "created": 1398547411.0, "author_flair_text": null, "created_utc": 1398543811.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch31kpa", "gilded": 0, "author": "sofar1776", "parent_id": "t3_241uyf", "approved_by": null, "body": "First, never feel bad for posting here. It isn't your fault this fellow is a moron. He is the problem, not you. How the heck can he know if your size is the result of some condition, genetics,,etc? He has no right to be that way. Your bf isn't being a big help either. You can talk to loudmouth's brother, or to whoever manages your office. This boy needs training at the least, a new place to work might be better.  You were taken by surprise and are apparently not a person who happens to like arguing with idiots. It's like teaching a cat to sing. It wastes your time and annoys the cat. \n  \nI would really suggest you think about a little counseling though. The self hatred is really bad for you in so many ways. I am certainly not able to change that, but you can. A problem with self image is still a problem, and now is the time to deal with it. You have a daughter who needs her mom, and showing your daughter that problems can be handled can't be a bad thing. Please take care of yourself. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, never feel bad for posting here. It isn&amp;#39;t your fault this fellow is a moron. He is the problem, not you. How the heck can he know if your size is the result of some condition, genetics,,etc? He has no right to be that way. Your bf isn&amp;#39;t being a big help either. You can talk to loudmouth&amp;#39;s brother, or to whoever manages your office. This boy needs training at the least, a new place to work might be better.  You were taken by surprise and are apparently not a person who happens to like arguing with idiots. It&amp;#39;s like teaching a cat to sing. It wastes your time and annoys the cat. &lt;/p&gt;\n\n&lt;p&gt;I would really suggest you think about a little counseling though. The self hatred is really bad for you in so many ways. I am certainly not able to change that, but you can. A problem with self image is still a problem, and now is the time to deal with it. You have a daughter who needs her mom, and showing your daughter that problems can be handled can&amp;#39;t be a bad thing. Please take care of yourself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241uyf", "score_hidden": false, "name": "t1_ch31kpa", "created": 1398572475.0, "author_flair_text": null, "created_utc": 1398568875.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3eyix", "gilded": 0, "author": "Cyndaquil", "parent_id": "t3_241uyf", "approved_by": null, "body": "He is one disgusting, awful person. Just one person. He is not important, he is just an insecure little bully. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is one disgusting, awful person. Just one person. He is not important, he is just an insecure little bully. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241uyf", "score_hidden": false, "name": "t1_ch3eyix", "created": 1398623501.0, "author_flair_text": null, "created_utc": 1398619901.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yk2r", "gilded": 0, "author": "ginzeh", "parent_id": "t3_241uyf", "approved_by": null, "body": "Update; Yesterday after going to my boyfriends he decided to take it upon himself to ring my boss after my boss had txt me telling me to just ignore him he knows he gets at me. My Boyfriend made it clear I shouldn't have to ignore it. It went from ill be having a meeting with my boss this morning, to a meeting with him and his boss to now seeing the CEO of the company who wants to see me on my own just me and him. I just feel embarrassed and feel I will be branded a trouble maker. :( thanks for your comments guys x", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Update; Yesterday after going to my boyfriends he decided to take it upon himself to ring my boss after my boss had txt me telling me to just ignore him he knows he gets at me. My Boyfriend made it clear I shouldn&amp;#39;t have to ignore it. It went from ill be having a meeting with my boss this morning, to a meeting with him and his boss to now seeing the CEO of the company who wants to see me on my own just me and him. I just feel embarrassed and feel I will be branded a trouble maker. :( thanks for your comments guys x&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241uyf", "score_hidden": false, "name": "t1_ch3yk2r", "created": 1398670553.0, "author_flair_text": null, "created_utc": 1398666953.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]