[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 28 and have been struggling with self harm since I was 14 or so.  II&amp;#39;ve been so stressed lately. I just lost my job recently, I&amp;#39;m about to lose my car and I&amp;#39;m now homeless.  I hadn&amp;#39;t self harmed for over a year until last night and frankly im just tired of the constant &amp;quot;this crap ass luck will never end&amp;quot; feeling.  I feel like it&amp;#39;s never going to get better.  I&amp;#39;m going to be stuck in this shit ass fucking going nowhere reality for the rest of my life so why not  just hurry it up a bit. The worst part of all of this is that I have Noone to turn to to talk to.  I&amp;#39;ve screwed up every relationship I&amp;#39;ve ever had Whether it&amp;#39;s a girlfriend or just a friend and my family is just as bad off as I am.  I set up an appointment with a therapist for tomorrow, I guess I&amp;#39;ll see how that goes but all in all, I think I&amp;#39;m done I&amp;#39;ve been in therapy before and nothing ever came of it.  I&amp;#39;ve been feeling like this for far too long for it to go away in a few therapy sessions.   Fuck it right? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 28 and have been struggling with self harm since I was 14 or so.  II've been so stressed lately. I just lost my job recently, I'm about to lose my car and I'm now homeless.  I hadn't self harmed for over a year until last night and frankly im just tired of the constant \"this crap ass luck will never end\" feeling.  I feel like it's never going to get better.  I'm going to be stuck in this shit ass fucking going nowhere reality for the rest of my life so why not  just hurry it up a bit. The worst part of all of this is that I have Noone to turn to to talk to.  I've screwed up every relationship I've ever had Whether it's a girlfriend or just a friend and my family is just as bad off as I am.  I set up an appointment with a therapist for tomorrow, I guess I'll see how that goes but all in all, I think I'm done I've been in therapy before and nothing ever came of it.  I've been feeling like this for far too long for it to go away in a few therapy sessions.   Fuck it right? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24xpj4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "P57CHR74N", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24xpj4/im_almost_ready_to_throw_the_towel_in/", "name": "t3_24xpj4", "created": 1399477575.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24xpj4/im_almost_ready_to_throw_the_towel_in/", "author_flair_text": null, "title": "I'm almost ready to throw the towel in", "created_utc": 1399448775.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbor0w", "gilded": 0, "author": "larsinblack", "parent_id": "t3_24xpj4", "approved_by": null, "body": "Hey man, have you ever tried going into the E.R.? It sounds like your medication isn't working, so it needs to be changed immediately. In the ER they will have a psychiatrist who can help you with that immediately. I also suggest maybe telling them you're not well and cannot trust yourself right now. Maybe getting them to hold you for a few days isn't such a bad idea. They will take care of you, very nice people there, and give you a place to stay, food, and support. And afterward they will guide you to resources to help you with money and housing as well.\n\nThere is usually emergency funding available for you if you're about to lose your apartment or have the electricity cut off. Just need to go speak with welfare/social assistance. Tell them that if they can't keep you from going homeless, you're planning to kill yourself, tell them that you have no intention of living on the street. If you tell them clearly like that, they will not dismiss you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, have you ever tried going into the E.R.? It sounds like your medication isn&amp;#39;t working, so it needs to be changed immediately. In the ER they will have a psychiatrist who can help you with that immediately. I also suggest maybe telling them you&amp;#39;re not well and cannot trust yourself right now. Maybe getting them to hold you for a few days isn&amp;#39;t such a bad idea. They will take care of you, very nice people there, and give you a place to stay, food, and support. And afterward they will guide you to resources to help you with money and housing as well.&lt;/p&gt;\n\n&lt;p&gt;There is usually emergency funding available for you if you&amp;#39;re about to lose your apartment or have the electricity cut off. Just need to go speak with welfare/social assistance. Tell them that if they can&amp;#39;t keep you from going homeless, you&amp;#39;re planning to kill yourself, tell them that you have no intention of living on the street. If you tell them clearly like that, they will not dismiss you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xpj4", "score_hidden": false, "name": "t1_chbor0w", "created": 1399479197.0, "author_flair_text": null, "created_utc": 1399450397.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbozyr", "gilded": 0, "author": "P57CHR74N", "parent_id": "t1_chbon2h", "approved_by": null, "body": "Your right I do want to live but I also dont want to live in a constant state of self hatred  and shame for the rest of my life. To tell you the truth, im affraid of death.  The fact that im agnostic and dont really believe in the after life nor heaven makes me wonder or better yet fear what's next. But I also have to imagine that there has to be something else, something better than the constant paranoia and fear of social interactions or the major deppression that seems to never go away.  I've been living this way my whole life, that's atleast a good 20 years (that I can remember) that I have hated myself.  There has to be something else beyond life that makes more sense.  And if its just emptiness, well all the better.  \n\nI do however want to thank you for your reply to my post.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your right I do want to live but I also dont want to live in a constant state of self hatred  and shame for the rest of my life. To tell you the truth, im affraid of death.  The fact that im agnostic and dont really believe in the after life nor heaven makes me wonder or better yet fear what&amp;#39;s next. But I also have to imagine that there has to be something else, something better than the constant paranoia and fear of social interactions or the major deppression that seems to never go away.  I&amp;#39;ve been living this way my whole life, that&amp;#39;s atleast a good 20 years (that I can remember) that I have hated myself.  There has to be something else beyond life that makes more sense.  And if its just emptiness, well all the better.  &lt;/p&gt;\n\n&lt;p&gt;I do however want to thank you for your reply to my post.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xpj4", "score_hidden": false, "name": "t1_chbozyr", "created": 1399480715.0, "author_flair_text": null, "created_utc": 1399451915.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbon2h", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24xpj4", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24xpj4", "score_hidden": false, "name": "t1_chbon2h", "created": 1399478553.0, "author_flair_text": null, "created_utc": 1399449753.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]