[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in my final year of secondary school and only three weeks away from graduating. I should be happy right? Only I&amp;#39;m not. I&amp;#39;m freaking out. I have my final exams at the start of June and I&amp;#39;m fucked. I know nothing. I&amp;#39;ve done fuck all and now I&amp;#39;m boned. We&amp;#39;ve had the last two weeks off from school and all I&amp;#39;ve been able to do is sit around the house. I can&amp;#39;t do work anymore. No matter how hard I try I just can&amp;#39;t. I get up early to get a couple of hours of work done and I just can&amp;#39;t. I sit in front of a book and within minutes I&amp;#39;m crying and realising how much of a fucking worthless piece of shit I am. I&amp;#39;m beyond help now. I&amp;#39;ll probably do it tomorrow night. Just after my best friend&amp;#39;s birthday dinner. Gee fucking whiz&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm in my final year of secondary school and only three weeks away from graduating. I should be happy right? Only I'm not. I'm freaking out. I have my final exams at the start of June and I'm fucked. I know nothing. I've done fuck all and now I'm boned. We've had the last two weeks off from school and all I've been able to do is sit around the house. I can't do work anymore. No matter how hard I try I just can't. I get up early to get a couple of hours of work done and I just can't. I sit in front of a book and within minutes I'm crying and realising how much of a fucking worthless piece of shit I am. I'm beyond help now. I'll probably do it tomorrow night. Just after my best friend's birthday dinner. Gee fucking whiz", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241gpm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "legorockman", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241gpm/im_beyond_hope_im_too_tired_and_i_just_want_it_to/", "name": "t3_241gpm", "created": 1398560262.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241gpm/im_beyond_hope_im_too_tired_and_i_just_want_it_to/", "author_flair_text": null, "title": "I'm beyond hope. I'm too tired and I just want it to stop", "created_utc": 1398531462.0, "ups": 4, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2z2r9", "gilded": 0, "author": "Sad-Sappy-Sucker", "parent_id": "t3_241gpm", "approved_by": null, "body": "Do you remember being a little kid? Doing something bad or failing at test or forgetting to do your homework and it was the END of the world? I remember loosing sleep in elementary school! At the time those things caused me so much  stress but now nothing.  They are something you look back on now and laugh because in the grand scheme of things,  it didn't fucking matter! I really think there are always options for you.  So you Fuck up and have to take another year of high school or you don't get in to college and have to work a year or anything of the sort.  None of those things are detrimental.  They  may seem big now but one day they won't fucking matter.  Please give your self a chance to look back and laugh.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you remember being a little kid? Doing something bad or failing at test or forgetting to do your homework and it was the END of the world? I remember loosing sleep in elementary school! At the time those things caused me so much  stress but now nothing.  They are something you look back on now and laugh because in the grand scheme of things,  it didn&amp;#39;t fucking matter! I really think there are always options for you.  So you Fuck up and have to take another year of high school or you don&amp;#39;t get in to college and have to work a year or anything of the sort.  None of those things are detrimental.  They  may seem big now but one day they won&amp;#39;t fucking matter.  Please give your self a chance to look back and laugh.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241gpm", "score_hidden": false, "name": "t1_ch2z2r9", "created": 1398565713.0, "author_flair_text": null, "created_utc": 1398562113.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3r0eh", "gilded": 0, "author": "bear1000", "parent_id": "t3_241gpm", "approved_by": null, "body": "There will allways be a seccond chance at the exams if you fail mate but not if you don't stick about to take the chance. Keep on trying and you will get there in the end, message me.if u want to have a chat ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There will allways be a seccond chance at the exams if you fail mate but not if you don&amp;#39;t stick about to take the chance. Keep on trying and you will get there in the end, message me.if u want to have a chat &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241gpm", "score_hidden": false, "name": "t1_ch3r0eh", "created": 1398651126.0, "author_flair_text": null, "created_utc": 1398647526.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]