[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s reaching the point of me throwing the towel and end it all. My ex girlfriend, the only one I ever was close to and felt safe with, never wants to hear of me again. after barely three months she has a new boyfriend now. I supported her all the time while she ran away when I got depressed again (been depressed for six years now). I feel ugly, worthless, stupid, fat. It&amp;#39;s not going to get better. All my friends left me bc of this. They don&amp;#39;t want to talk to me, saying that I&amp;#39;m a pathetic whiny little loser. I have an appointment with a doctor on monday but I don&amp;#39;t know if I&amp;#39;ll make that. I just want all sadness to end and let me move on and be happy again. School isnt going good bc of it. my social life died bc of it. My love life is non-existing. It&amp;#39;s hopeless and my life is basically over. after 21 years, I only have myself left, no one else to depend on and I feel like I&amp;#39;m always bothering people when asking for help. I&amp;#39;m done with it. &lt;/p&gt;\n\n&lt;p&gt;Sometimes I feel so weak I just want to explode\nExplode and tear this town apart\nTake a knife and cut this pain from my heart&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's reaching the point of me throwing the towel and end it all. My ex girlfriend, the only one I ever was close to and felt safe with, never wants to hear of me again. after barely three months she has a new boyfriend now. I supported her all the time while she ran away when I got depressed again (been depressed for six years now). I feel ugly, worthless, stupid, fat. It's not going to get better. All my friends left me bc of this. They don't want to talk to me, saying that I'm a pathetic whiny little loser. I have an appointment with a doctor on monday but I don't know if I'll make that. I just want all sadness to end and let me move on and be happy again. School isnt going good bc of it. my social life died bc of it. My love life is non-existing. It's hopeless and my life is basically over. after 21 years, I only have myself left, no one else to depend on and I feel like I'm always bothering people when asking for help. I'm done with it. \n\nSometimes I feel so weak I just want to explode\nExplode and tear this town apart\nTake a knife and cut this pain from my heart", "likes": null, "secure_media": null, "link_flair_text": null, "id": "257f1d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "EnricoNL", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/257f1d/im_done_with_it/", "name": "t3_257f1d", "created": 1399757532.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/257f1d/im_done_with_it/", "author_flair_text": null, "title": "I'm done with it", "created_utc": 1399728732.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheih2x", "gilded": 0, "author": "toomuchidea", "parent_id": "t3_257f1d", "approved_by": null, "body": "There are 7 billion people in this world. Losing some and killing your self because of it doesn't really worth it. I got betrayed by my whole class, all my friends during my first year at high school. It's really hard for me, but at least I now know that they aren't trustworthy and move on.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are 7 billion people in this world. Losing some and killing your self because of it doesn&amp;#39;t really worth it. I got betrayed by my whole class, all my friends during my first year at high school. It&amp;#39;s really hard for me, but at least I now know that they aren&amp;#39;t trustworthy and move on.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_257f1d", "score_hidden": false, "name": "t1_cheih2x", "created": 1399768612.0, "author_flair_text": null, "created_utc": 1399739812.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheqj2r", "gilded": 0, "author": "paraflax", "parent_id": "t3_257f1d", "approved_by": null, "body": "Well, you might feel contrary, but I'd like to talk to you.  I do feel the same as you, although I think we are in very different situations... perhaps we can help each other. Do send me a pm if you feel like it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you might feel contrary, but I&amp;#39;d like to talk to you.  I do feel the same as you, although I think we are in very different situations... perhaps we can help each other. Do send me a pm if you feel like it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_257f1d", "score_hidden": false, "name": "t1_cheqj2r", "created": 1399789580.0, "author_flair_text": null, "created_utc": 1399760780.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]