[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 17 and I&amp;#39;ve just been fired for the second time from the second job I&amp;#39;ve ever had. I think that there is certainly something wrong with me if I can&amp;#39;t handle working at a shitty fast food place. There&amp;#39;s a pattern in my life that whenever good things happen something much worse comes along. I realise that in just a burden to everyone around me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 17 and I've just been fired for the second time from the second job I've ever had. I think that there is certainly something wrong with me if I can't handle working at a shitty fast food place. There's a pattern in my life that whenever good things happen something much worse comes along. I realise that in just a burden to everyone around me. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24nlrv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SirAlexofTardis", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24nlrv/im_definitely_going_to_do_it_tonight/", "name": "t3_24nlrv", "created": 1399187804.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24nlrv/im_definitely_going_to_do_it_tonight/", "author_flair_text": null, "title": "I'm definitely going to do it tonight.", "created_utc": 1399159004.0, "ups": 6, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8xfxk", "gilded": 0, "author": "thewolflord", "parent_id": "t3_24nlrv", "approved_by": null, "body": "I want to assure you that there is nothing wrong with you. Being fired from a fast food job at 17 is not going to screw your entire life over. And about being a burden, you're not. You're just not. In fact, you probably mean more to the people around you than they're willing to admit. A few friends of friends have died recently, and each time there was nothing but an outpouring of love and grief for them. So I always assume that a person is more cared about than they think for that reason.\n\nIt's ok to be in pain. It's ok to feel like shit. But you can't think that's all there is. There is more, I promise you.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to assure you that there is nothing wrong with you. Being fired from a fast food job at 17 is not going to screw your entire life over. And about being a burden, you&amp;#39;re not. You&amp;#39;re just not. In fact, you probably mean more to the people around you than they&amp;#39;re willing to admit. A few friends of friends have died recently, and each time there was nothing but an outpouring of love and grief for them. So I always assume that a person is more cared about than they think for that reason.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ok to be in pain. It&amp;#39;s ok to feel like shit. But you can&amp;#39;t think that&amp;#39;s all there is. There is more, I promise you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8xfxk", "created": 1399195749.0, "author_flair_text": null, "created_utc": 1399166949.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch93gop", "gilded": 0, "author": "99SoulsUp", "parent_id": "t1_ch8ynbp", "approved_by": null, "body": "Hey, my girlfriend has said to me that she's felt like I'm just with her out of obligation, but I certainly wasn't.  I'm sure you have friends for a reason.  Do you consider yourself shy?  Is it hard to hit it off with people for you?  I remember in high school for a while I didn't really get along well with anyone, but it definitely changed over time.  \n\nWhy do you think your parents think you are an obligation?  I'm sure they care about you, don't you think?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, my girlfriend has said to me that she&amp;#39;s felt like I&amp;#39;m just with her out of obligation, but I certainly wasn&amp;#39;t.  I&amp;#39;m sure you have friends for a reason.  Do you consider yourself shy?  Is it hard to hit it off with people for you?  I remember in high school for a while I didn&amp;#39;t really get along well with anyone, but it definitely changed over time.  &lt;/p&gt;\n\n&lt;p&gt;Why do you think your parents think you are an obligation?  I&amp;#39;m sure they care about you, don&amp;#39;t you think?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch93gop", "created": 1399214137.0, "author_flair_text": null, "created_utc": 1399185337.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chafetj", "gilded": 0, "author": "silent_tone", "parent_id": "t1_ch8ynbp", "approved_by": null, "body": "That firing was ridiculous.  Most people go to jobs everyday that they would like to quit.  Everybody working a job to pay for their college education, by definition, wants to quit.  That doesn't mean they deserve to get fired.  You just happened to be dealing with two dicks.  It's just safe not to always be so forthright around your coworkers.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That firing was ridiculous.  Most people go to jobs everyday that they would like to quit.  Everybody working a job to pay for their college education, by definition, wants to quit.  That doesn&amp;#39;t mean they deserve to get fired.  You just happened to be dealing with two dicks.  It&amp;#39;s just safe not to always be so forthright around your coworkers.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_chafetj", "created": 1399356428.0, "author_flair_text": null, "created_utc": 1399327628.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8ynbp", "gilded": 0, "author": "SirAlexofTardis", "parent_id": "t1_ch8xiwl", "approved_by": null, "body": "I got fired because I didn't get along with other employees &amp; I told a co worker privately that I wanted to quit &amp; he went behind my back &amp; told the manager that. My life really is worthless. All I am to my parents is something they have to spend money on &amp; my friends probably see me as some annoying person they have to spend time around. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got fired because I didn&amp;#39;t get along with other employees &amp;amp; I told a co worker privately that I wanted to quit &amp;amp; he went behind my back &amp;amp; told the manager that. My life really is worthless. All I am to my parents is something they have to spend money on &amp;amp; my friends probably see me as some annoying person they have to spend time around. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8ynbp", "created": 1399199151.0, "author_flair_text": null, "created_utc": 1399170351.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch8xiwl", "gilded": 0, "author": "99SoulsUp", "parent_id": "t3_24nlrv", "approved_by": null, "body": "Hey, it's okay if you get fired from two part time jobs.  There could be a number of reasons that aren't entirely your fault.  I know a lot of businesses will hire a lot of people and then cut down on staff later on. I don't know what your situation is, would you care to explain?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, it&amp;#39;s okay if you get fired from two part time jobs.  There could be a number of reasons that aren&amp;#39;t entirely your fault.  I know a lot of businesses will hire a lot of people and then cut down on staff later on. I don&amp;#39;t know what your situation is, would you care to explain?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8xiwl", "created": 1399195982.0, "author_flair_text": null, "created_utc": 1399167182.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9450t", "gilded": 0, "author": "ethtrem", "parent_id": "t3_24nlrv", "approved_by": null, "body": "I may sound like a creep for saying this, but I was browsing lgbteensgm and saw some of your posts and thought you were quite a good looker. I went to your page to see if you had posted anymore and I saw that you had written this... It kinda broke my heart. I mean, I don't know you on any sort of personal level and we've never even had any sort of interaction through comments, but I've been in your position before. Where you just feel like a burden to everyone and everything, hell, I lost EVERY SINGLE friend that I had (not even exaggerating) and almost ruined my relationship with my family. I hated myself to the point where I was ready to end it all and I even had it all planned out, but somehow managed to keep it together for long enough where I didn't. I thank myself for not doing it. My life still isn't the best, I'm gonna have to make all new friends, and in the next year or so I'll be moving and will be able to start all over. I'm excited for a second chance, and now that I'm given one I'm the happiest I've ever been. It's been seven hours since you posted this so I really hope I'm not too late. I had to say something when I saw this or I wouldn't be able to sleep at night. Just remember that no matter how insignificant or worthless you feel, there is at least one person who cares. One person that will hurt from this. You may say no one will, but that's just from your perspective. If you see this, please let me know. If you ever need to say something, I'll always be able to talk. (Also you're attractive.)\n\nP.s. I saw this video a while ago, when I was ready to end it, and this helped me understand how much it would effect people. I don't know if it will help you, but please just take a look.\nhttps://www.youtube.com/watch?v=zvkbHIrrrvU\n", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I may sound like a creep for saying this, but I was browsing lgbteensgm and saw some of your posts and thought you were quite a good looker. I went to your page to see if you had posted anymore and I saw that you had written this... It kinda broke my heart. I mean, I don&amp;#39;t know you on any sort of personal level and we&amp;#39;ve never even had any sort of interaction through comments, but I&amp;#39;ve been in your position before. Where you just feel like a burden to everyone and everything, hell, I lost EVERY SINGLE friend that I had (not even exaggerating) and almost ruined my relationship with my family. I hated myself to the point where I was ready to end it all and I even had it all planned out, but somehow managed to keep it together for long enough where I didn&amp;#39;t. I thank myself for not doing it. My life still isn&amp;#39;t the best, I&amp;#39;m gonna have to make all new friends, and in the next year or so I&amp;#39;ll be moving and will be able to start all over. I&amp;#39;m excited for a second chance, and now that I&amp;#39;m given one I&amp;#39;m the happiest I&amp;#39;ve ever been. It&amp;#39;s been seven hours since you posted this so I really hope I&amp;#39;m not too late. I had to say something when I saw this or I wouldn&amp;#39;t be able to sleep at night. Just remember that no matter how insignificant or worthless you feel, there is at least one person who cares. One person that will hurt from this. You may say no one will, but that&amp;#39;s just from your perspective. If you see this, please let me know. If you ever need to say something, I&amp;#39;ll always be able to talk. (Also you&amp;#39;re attractive.)&lt;/p&gt;\n\n&lt;p&gt;P.s. I saw this video a while ago, when I was ready to end it, and this helped me understand how much it would effect people. I don&amp;#39;t know if it will help you, but please just take a look.\n&lt;a href=\"https://www.youtube.com/watch?v=zvkbHIrrrvU\"&gt;https://www.youtube.com/watch?v=zvkbHIrrrvU&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch9450t", "created": 1399217207.0, "author_flair_text": null, "created_utc": 1399188407.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8vy57", "gilded": 0, "author": "SoberDreams", "parent_id": "t1_ch8voax", "approved_by": null, "body": "why were you fired? Care to go into detail? Or you're just gonna off yourself because you've been fired from a fast food joint at 17 years old. Come on man, life sucks. Everyone knows it. But you've only seen a lousy 17 years of it, and the tern years are mostly the hardest. Give it a little bit more of a chance ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why were you fired? Care to go into detail? Or you&amp;#39;re just gonna off yourself because you&amp;#39;ve been fired from a fast food joint at 17 years old. Come on man, life sucks. Everyone knows it. But you&amp;#39;ve only seen a lousy 17 years of it, and the tern years are mostly the hardest. Give it a little bit more of a chance &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8vy57", "created": 1399191519.0, "author_flair_text": null, "created_utc": 1399162719.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch8voax", "gilded": 0, "author": "SirAlexofTardis", "parent_id": "t1_ch8vf9t", "approved_by": null, "body": "Not yet ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not yet &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8voax", "created": 1399190755.0, "author_flair_text": null, "created_utc": 1399161955.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch8vf9t", "gilded": 0, "author": "canadavan", "parent_id": "t3_24nlrv", "approved_by": null, "body": "Did u do it yet?", "edited": false, "author_flair_css_class": null, "downs": 9, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did u do it yet?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24nlrv", "score_hidden": false, "name": "t1_ch8vf9t", "created": 1399190050.0, "author_flair_text": null, "created_utc": 1399161250.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]