[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All my life i have been suicidal. One of my first memories is a 3 year old me grabbing knifes getting ready to kill myself. I&amp;#39;ve never had any friends and have no education as I dropped out of school. I have gotten help from tons of people, but it has never helped me. Im 17 now, and I am trying to make friends but it just makes me feel worse. When im with people I feel ugly and out of the loop, ive never had a girlfriend, ive not even held hands with a girl. when im with other boys girls just crowd round them and i get left out and now im losing confidence on silly petty things like is my penis small. I have no talent and enjoy nothing. i have joined every club you could imagine. i have been diagnosed with acute anxiety disorder and depression which i take tablets for. im getting to the point of killing myself, the only thing stopping me is im scared of pain. i dont know what to do anymore i just have nothing in my life except questions, am i ugly, is my penis small, does anyone like me, will i ever be happy, is there any point of life anymore, was there any point in the first place or was i just not meant to be. And dont say theres light at the end of the tunnel coz i get told that alot and all it does is make it worse. (btw im 17 but dont say im still young coz im still feeling this stuff)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "All my life i have been suicidal. One of my first memories is a 3 year old me grabbing knifes getting ready to kill myself. I've never had any friends and have no education as I dropped out of school. I have gotten help from tons of people, but it has never helped me. Im 17 now, and I am trying to make friends but it just makes me feel worse. When im with people I feel ugly and out of the loop, ive never had a girlfriend, ive not even held hands with a girl. when im with other boys girls just crowd round them and i get left out and now im losing confidence on silly petty things like is my penis small. I have no talent and enjoy nothing. i have joined every club you could imagine. i have been diagnosed with acute anxiety disorder and depression which i take tablets for. im getting to the point of killing myself, the only thing stopping me is im scared of pain. i dont know what to do anymore i just have nothing in my life except questions, am i ugly, is my penis small, does anyone like me, will i ever be happy, is there any point of life anymore, was there any point in the first place or was i just not meant to be. And dont say theres light at the end of the tunnel coz i get told that alot and all it does is make it worse. (btw im 17 but dont say im still young coz im still feeling this stuff)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241zyn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "KurtisGG", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241zyn/im_extremely_unhappy_depressed_and_suicidal/", "name": "t3_241zyn", "created": 1398573888.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241zyn/im_extremely_unhappy_depressed_and_suicidal/", "author_flair_text": null, "title": "Im extremely unhappy, depressed and suicidal.", "created_utc": 1398545088.0, "ups": 6, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3wh75", "gilded": 0, "author": "offmymoobs", "parent_id": "t3_241zyn", "approved_by": null, "body": "**When I was 18:**\n\n-Terrible case of gynecomastia (manboobs)\n\n-Overweight, on track to become obese\n\n-Never kissed a girl, obviously a virgin\n\n-No friends, played video games all day, ate dinner in my room\n\n-Stretch marks over my entire body from gaining weight\n\n-Small dick\n\n-Terrible fashion sense (oversized hoodies and sweatpants)\n\n**Today, one week away from my 19th birthday:**\n\n-5'11 height weighing 165 lbs (lost alot of weight, looking better)\n\n-No more gynecomastia after surgery, still have some loose skin but I can wear a t-shirt without it looking different from others\n\n-Kissed girls, made out with girls, gotten a blowjob and had sex 2 times\n\n-1 really close friend I can open up to and say anything to and a few casual friends\n\n-Still have terrible stretch marks so lights are off if I have sex\n\n-Still a small dick, but it grew half an inch from losing weight (lost fat around the pelvis area)\n\n-Get complimented on my clothes often, dressing much better\n\nWhat i'm trying to tell you is that my life is far from perfect now and I still have huge insecurities and I am still depressed. \"Will she think my dick is small? If she does, will she tell her friends? Does she notice the stretch marks? Shit, i'm laying in a position where the loose skin on my chest shows..\" But I am doing so much better right now. Even though my life isn't exactly where I want it to be and I still have some suicide thoughts, I just think back at where I used to be and look at all the improvement and change I made in a year. Who knows what could be the case 1 year from now, right?\n\n\nSo just keep on trying, there is a light in the end of the tunnel. I know it's hard to see and it's easy to just dismiss it, but it's the truth. We are different and my problems weren't and isn't the same as yours, but we can both fight against what makes us hate life and within a year, if you really try, I promise that you will look back and at least tell yourself \"wow, 1 year ago I hadn't held a girls hand, never kissed a girl, was a virgin, didn't have any hobbies and couldn't function socially. Now I have held hands with a girl, gotten my first kiss and even made out with a girl, I might still be a virgin but I got to second base with Stacey. I am also slowly getting better at basketball and while most girls are still crowding around my other friends I still get some attention from time to time\"\n\nUnderstand? It is the small battles that win the war in the end. Feel free to PM me if you ever wanna talk btw, and good luck with everything :) I hope it works out. ", "edited": 1398660336.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;When I was 18:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-Terrible case of gynecomastia (manboobs)&lt;/p&gt;\n\n&lt;p&gt;-Overweight, on track to become obese&lt;/p&gt;\n\n&lt;p&gt;-Never kissed a girl, obviously a virgin&lt;/p&gt;\n\n&lt;p&gt;-No friends, played video games all day, ate dinner in my room&lt;/p&gt;\n\n&lt;p&gt;-Stretch marks over my entire body from gaining weight&lt;/p&gt;\n\n&lt;p&gt;-Small dick&lt;/p&gt;\n\n&lt;p&gt;-Terrible fashion sense (oversized hoodies and sweatpants)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Today, one week away from my 19th birthday:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-5&amp;#39;11 height weighing 165 lbs (lost alot of weight, looking better)&lt;/p&gt;\n\n&lt;p&gt;-No more gynecomastia after surgery, still have some loose skin but I can wear a t-shirt without it looking different from others&lt;/p&gt;\n\n&lt;p&gt;-Kissed girls, made out with girls, gotten a blowjob and had sex 2 times&lt;/p&gt;\n\n&lt;p&gt;-1 really close friend I can open up to and say anything to and a few casual friends&lt;/p&gt;\n\n&lt;p&gt;-Still have terrible stretch marks so lights are off if I have sex&lt;/p&gt;\n\n&lt;p&gt;-Still a small dick, but it grew half an inch from losing weight (lost fat around the pelvis area)&lt;/p&gt;\n\n&lt;p&gt;-Get complimented on my clothes often, dressing much better&lt;/p&gt;\n\n&lt;p&gt;What i&amp;#39;m trying to tell you is that my life is far from perfect now and I still have huge insecurities and I am still depressed. &amp;quot;Will she think my dick is small? If she does, will she tell her friends? Does she notice the stretch marks? Shit, i&amp;#39;m laying in a position where the loose skin on my chest shows..&amp;quot; But I am doing so much better right now. Even though my life isn&amp;#39;t exactly where I want it to be and I still have some suicide thoughts, I just think back at where I used to be and look at all the improvement and change I made in a year. Who knows what could be the case 1 year from now, right?&lt;/p&gt;\n\n&lt;p&gt;So just keep on trying, there is a light in the end of the tunnel. I know it&amp;#39;s hard to see and it&amp;#39;s easy to just dismiss it, but it&amp;#39;s the truth. We are different and my problems weren&amp;#39;t and isn&amp;#39;t the same as yours, but we can both fight against what makes us hate life and within a year, if you really try, I promise that you will look back and at least tell yourself &amp;quot;wow, 1 year ago I hadn&amp;#39;t held a girls hand, never kissed a girl, was a virgin, didn&amp;#39;t have any hobbies and couldn&amp;#39;t function socially. Now I have held hands with a girl, gotten my first kiss and even made out with a girl, I might still be a virgin but I got to second base with Stacey. I am also slowly getting better at basketball and while most girls are still crowding around my other friends I still get some attention from time to time&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Understand? It is the small battles that win the war in the end. Feel free to PM me if you ever wanna talk btw, and good luck with everything :) I hope it works out. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch3wh75", "created": 1398663711.0, "author_flair_text": null, "created_utc": 1398660111.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yeyy", "gilded": 0, "author": "bluesky020", "parent_id": "t1_ch3i9fv", "approved_by": null, "body": "Ah well I'm glad you've tried it though, even if it didn't work out so well for you. What else are you interested in that perhaps you could join a club or attend a group for? It doesn't need to be therapeutic but something that will keep your mind off things. Do you have any goals that you'd like to accomplish or talents you want to develop? Such as learning an instrument or learning to cook? I'm sure you can think of something that you want to do rather than sleep. Is there anything you can look forward to when you're unhappy? \n\nWhen you attended the art therapy group and the others were depressed did you find yourself wanting to help them? Why do you think you were affected by how they felt? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah well I&amp;#39;m glad you&amp;#39;ve tried it though, even if it didn&amp;#39;t work out so well for you. What else are you interested in that perhaps you could join a club or attend a group for? It doesn&amp;#39;t need to be therapeutic but something that will keep your mind off things. Do you have any goals that you&amp;#39;d like to accomplish or talents you want to develop? Such as learning an instrument or learning to cook? I&amp;#39;m sure you can think of something that you want to do rather than sleep. Is there anything you can look forward to when you&amp;#39;re unhappy? &lt;/p&gt;\n\n&lt;p&gt;When you attended the art therapy group and the others were depressed did you find yourself wanting to help them? Why do you think you were affected by how they felt? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch3yeyy", "created": 1398669975.0, "author_flair_text": null, "created_utc": 1398666375.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3i9fv", "gilded": 0, "author": "KurtisGG", "parent_id": "t1_ch3hmxa", "approved_by": null, "body": "the only thing i do is sleep and go on reddit but i barely do that now. i was in an art therapy group but that made me more depressed coz every1 else was. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the only thing i do is sleep and go on reddit but i barely do that now. i was in an art therapy group but that made me more depressed coz every1 else was. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch3i9fv", "created": 1398656297.0, "author_flair_text": null, "created_utc": 1398627497.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3hmxa", "gilded": 0, "author": "bluesky020", "parent_id": "t1_ch3fqsp", "approved_by": null, "body": "Not even a favorite TV show, movie, or book that you can turn to when you need it? You could also consider taking a class (not just school but like cooking or art) just to give yourself something scheduled to do that will get you out of bed. Reddit counts as a hobby too! One of my favourite subreddits is r/uglyduckling because it's amazing to see how people improve on their self esteem over time even though they were so insecure in the past. This new confidence and happiness could be something to look forward to in the future. Have you tried a group or phone line? Or some form of peer support? I know you're tired of trying but sometimes it helps knowing you've done everything you could for help. There are so many possibilities out there and finding the thing that gives you meaning or reason to continue could be what you spend the rest of your life doing. \n\nI'm not very religious but I do think everyone has their own purpose in their lifetime, whether or not the person believes so. You've made an impact on someone's life, including my own, and even if you do decide to take your own life I hope you come to the realization that although life isn't glamorous you can still do something for other people when you believe you don't deserve any happiness yourself. How do you think your family may feel if you are gone? Your friends? Or even just the cashier at the grocery store that you frequent? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not even a favorite TV show, movie, or book that you can turn to when you need it? You could also consider taking a class (not just school but like cooking or art) just to give yourself something scheduled to do that will get you out of bed. Reddit counts as a hobby too! One of my favourite subreddits is r/uglyduckling because it&amp;#39;s amazing to see how people improve on their self esteem over time even though they were so insecure in the past. This new confidence and happiness could be something to look forward to in the future. Have you tried a group or phone line? Or some form of peer support? I know you&amp;#39;re tired of trying but sometimes it helps knowing you&amp;#39;ve done everything you could for help. There are so many possibilities out there and finding the thing that gives you meaning or reason to continue could be what you spend the rest of your life doing. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not very religious but I do think everyone has their own purpose in their lifetime, whether or not the person believes so. You&amp;#39;ve made an impact on someone&amp;#39;s life, including my own, and even if you do decide to take your own life I hope you come to the realization that although life isn&amp;#39;t glamorous you can still do something for other people when you believe you don&amp;#39;t deserve any happiness yourself. How do you think your family may feel if you are gone? Your friends? Or even just the cashier at the grocery store that you frequent? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch3hmxa", "created": 1398654870.0, "author_flair_text": null, "created_utc": 1398626070.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3fqsp", "gilded": 0, "author": "KurtisGG", "parent_id": "t1_ch36jlp", "approved_by": null, "body": "i dont have any hobbies, everything makes me unhappy. ive tried tons of things out but nothing helps. i do talk to my family but there is only so much they can do to help and i have exhausted all the professional help coz they just send me on to the next person like im a lost cause. i feel like its as if godmakes mistakes sometimes but doesn't let them be born but some how i was (im not christian but thats how i feel).", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i dont have any hobbies, everything makes me unhappy. ive tried tons of things out but nothing helps. i do talk to my family but there is only so much they can do to help and i have exhausted all the professional help coz they just send me on to the next person like im a lost cause. i feel like its as if godmakes mistakes sometimes but doesn&amp;#39;t let them be born but some how i was (im not christian but thats how i feel).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch3fqsp", "created": 1398650535.0, "author_flair_text": null, "created_utc": 1398621735.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch36jlp", "gilded": 0, "author": "bluesky020", "parent_id": "t3_241zyn", "approved_by": null, "body": "Thanks for sharing with us what you have been going through. It isn't easy to talk about insecurities even though they seem to fill our minds to the point that we might not be able to think about anything else. I noticed you discussed a lot about what you don't like about yourself or question but I was wondering if here was anything you like, or what your hobbies or talents are. Everyone has something positive about themselves amongst all of the negative and even if it may seem small it still can make a huge difference. The negative things do not make YOU a bad person but they happen to be parts of who you are or reflect some negative thinking you may have but it doesn't make you any less of a human being. Do you have any other supports that you can reach out to such as family or friends? Or community counselling and resources? Sometimes doing a bit of research or communicating to others can really clear up your mind a bit. I find that whenever I'm feeling down just reading other people's stories can really help me work through my own thoughts. It is normal to feel hopelessness or sadness or anger but if you think it's taking a toll on you then consider getting help whichever way works best for you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for sharing with us what you have been going through. It isn&amp;#39;t easy to talk about insecurities even though they seem to fill our minds to the point that we might not be able to think about anything else. I noticed you discussed a lot about what you don&amp;#39;t like about yourself or question but I was wondering if here was anything you like, or what your hobbies or talents are. Everyone has something positive about themselves amongst all of the negative and even if it may seem small it still can make a huge difference. The negative things do not make YOU a bad person but they happen to be parts of who you are or reflect some negative thinking you may have but it doesn&amp;#39;t make you any less of a human being. Do you have any other supports that you can reach out to such as family or friends? Or community counselling and resources? Sometimes doing a bit of research or communicating to others can really clear up your mind a bit. I find that whenever I&amp;#39;m feeling down just reading other people&amp;#39;s stories can really help me work through my own thoughts. It is normal to feel hopelessness or sadness or anger but if you think it&amp;#39;s taking a toll on you then consider getting help whichever way works best for you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241zyn", "score_hidden": false, "name": "t1_ch36jlp", "created": 1398615548.0, "author_flair_text": null, "created_utc": 1398586748.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]