[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometime maybe last year or two years ago I tried to kill myself because I was in a bad place in life. I thought I moved on. I got a new boyfriend, moved out of my house, found a job. But I fear I&amp;#39;m back in a place where I&amp;#39;m losing control and direction of my life.&lt;/p&gt;\n\n&lt;p&gt;My relationship is falling apart leaving me with an apartment I can&amp;#39;t afford. I work in a fast food place which I used to love because I love customer service but the new management and the customers are really stressing me out to the point of where I feel sick to my stomach at the thought of going to work. I&amp;#39;ve been applying to several places but for months I&amp;#39;ve got nothing.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any friends to go to. Nor do I have any family. I&amp;#39;ve been kicked out of my house several times because I don&amp;#39;t get along with my stepmother and my father will never defend me even if she says crazy things or he knows for a fact that she&amp;#39;s lying. He&amp;#39;s rather &amp;quot;keep peace&amp;quot; so I have to suffer in silence until it gets to be too much.&lt;/p&gt;\n\n&lt;p&gt;I quit school because I don&amp;#39;t have any mode of transportation to get there so I don&amp;#39;t even have that. I really don&amp;#39;t know what to do anymore. I feel stressed, depressed, I&amp;#39;ve been crying more often that not. I have nothing and no one. I feel trapped and I can&amp;#39;t think of any other options.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sometime maybe last year or two years ago I tried to kill myself because I was in a bad place in life. I thought I moved on. I got a new boyfriend, moved out of my house, found a job. But I fear I'm back in a place where I'm losing control and direction of my life.\n\nMy relationship is falling apart leaving me with an apartment I can't afford. I work in a fast food place which I used to love because I love customer service but the new management and the customers are really stressing me out to the point of where I feel sick to my stomach at the thought of going to work. I've been applying to several places but for months I've got nothing.\n\nI don't have any friends to go to. Nor do I have any family. I've been kicked out of my house several times because I don't get along with my stepmother and my father will never defend me even if she says crazy things or he knows for a fact that she's lying. He's rather \"keep peace\" so I have to suffer in silence until it gets to be too much.\n\nI quit school because I don't have any mode of transportation to get there so I don't even have that. I really don't know what to do anymore. I feel stressed, depressed, I've been crying more often that not. I have nothing and no one. I feel trapped and I can't think of any other options.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252n4e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sameplace", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252n4e/im_falling_into_the_same_hole/", "name": "t3_252n4e", "created": 1399611299.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252n4e/im_falling_into_the_same_hole/", "author_flair_text": null, "title": "I'm falling into the same hole", "created_utc": 1399582499.0, "ups": 8, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdh62z", "gilded": 0, "author": "sameplace", "parent_id": "t1_chdgv8a", "approved_by": null, "body": "Well I took a hot bath and it really calmed me down along with the encouraging replies. My boyfriend said he wanted to take a break and will go back to his mother's house and will help with the rent for now. I'm going to keep on looking for a job and will look for a holiday location to work at. \n\nHopefully I can get my life together. I'll come back if I'm feeling overwhelmed again or just to give an update. Thank you again for being here for my breakdown. I appreciate it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I took a hot bath and it really calmed me down along with the encouraging replies. My boyfriend said he wanted to take a break and will go back to his mother&amp;#39;s house and will help with the rent for now. I&amp;#39;m going to keep on looking for a job and will look for a holiday location to work at. &lt;/p&gt;\n\n&lt;p&gt;Hopefully I can get my life together. I&amp;#39;ll come back if I&amp;#39;m feeling overwhelmed again or just to give an update. Thank you again for being here for my breakdown. I appreciate it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chdh62z", "created": 1399649316.0, "author_flair_text": null, "created_utc": 1399620516.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdgv8a", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t1_chda01c", "approved_by": null, "body": "Please keep us informed how things go. We care to know. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please keep us informed how things go. We care to know. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chdgv8a", "created": 1399647896.0, "author_flair_text": null, "created_utc": 1399619096.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chda01c", "gilded": 0, "author": "sameplace", "parent_id": "t1_chd3pyy", "approved_by": null, "body": "Thank you. I'll definitely look into finding a job at a holiday location. That might just be better for me. I'd love to move. I thought of it for a long time but I would have to save up for it first.\n\nThank you for your response it helped me feel better about things.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I&amp;#39;ll definitely look into finding a job at a holiday location. That might just be better for me. I&amp;#39;d love to move. I thought of it for a long time but I would have to save up for it first.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your response it helped me feel better about things.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chda01c", "created": 1399629096.0, "author_flair_text": null, "created_utc": 1399600296.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd3pyy", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t3_252n4e", "approved_by": null, "body": "From the sound of it your family is really not very nice. As for leaving school, sometimes people don't understand how many teenagers have to leave school for real material reasons. It's not always \"you want to study or you don't\". Life is not black or white.\n\nThere are options out there. You can change job, change house, change city, change boyfriend, change life. But you don't have to. You have a job, I know it's stressful right now, but try to hang in there a bit longer, until you find something else. Maybe take a few days holiday if you can, just to relax a bit and have more time for the job hunt.\n\nThings will get better. It's a bad time, but bad times don't last forever. If you find yourself without a place to live, couchsurfing could help, but be very careful if you're young and new to this kind of stuff. If you like customer service you should try to find a job in a holiday location. Often they offer accomodation and customers are more relaxed on vacation.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From the sound of it your family is really not very nice. As for leaving school, sometimes people don&amp;#39;t understand how many teenagers have to leave school for real material reasons. It&amp;#39;s not always &amp;quot;you want to study or you don&amp;#39;t&amp;quot;. Life is not black or white.&lt;/p&gt;\n\n&lt;p&gt;There are options out there. You can change job, change house, change city, change boyfriend, change life. But you don&amp;#39;t have to. You have a job, I know it&amp;#39;s stressful right now, but try to hang in there a bit longer, until you find something else. Maybe take a few days holiday if you can, just to relax a bit and have more time for the job hunt.&lt;/p&gt;\n\n&lt;p&gt;Things will get better. It&amp;#39;s a bad time, but bad times don&amp;#39;t last forever. If you find yourself without a place to live, couchsurfing could help, but be very careful if you&amp;#39;re young and new to this kind of stuff. If you like customer service you should try to find a job in a holiday location. Often they offer accomodation and customers are more relaxed on vacation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chd3pyy", "created": 1399615978.0, "author_flair_text": null, "created_utc": 1399587178.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chda1zd", "gilded": 0, "author": "sameplace", "parent_id": "t1_chd8caa", "approved_by": null, "body": "Thank you so much. That actually offers a light of hope for me no matter how small.\n\nI would also like to talk to you. It's always better to have someone to relate too with these sort of things. I really appreciate it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. That actually offers a light of hope for me no matter how small.&lt;/p&gt;\n\n&lt;p&gt;I would also like to talk to you. It&amp;#39;s always better to have someone to relate too with these sort of things. I really appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chda1zd", "created": 1399629202.0, "author_flair_text": null, "created_utc": 1399600402.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd8caa", "gilded": 0, "author": "maxwellanderson", "parent_id": "t3_252n4e", "approved_by": null, "body": "I feel that we're in similar situations. My heart goes out to you. :/ Do feel free to talk to me if you feel it might help. I'm horribly sorry that you're in a situation like that, and for what it's worth, I believe that you can get through this.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel that we&amp;#39;re in similar situations. My heart goes out to you. :/ Do feel free to talk to me if you feel it might help. I&amp;#39;m horribly sorry that you&amp;#39;re in a situation like that, and for what it&amp;#39;s worth, I believe that you can get through this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252n4e", "score_hidden": false, "name": "t1_chd8caa", "created": 1399625943.0, "author_flair_text": null, "created_utc": 1399597143.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]