[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a 13 year old boy and Im scared to come out. I don&amp;#39;t know if my parents will accept me because they&amp;#39;re indifferent to the idea of being gay. I just love them too much and I am considering commiting suicide because I don&amp;#39;t want to break their hearts.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am a 13 year old boy and Im scared to come out. I don't know if my parents will accept me because they're indifferent to the idea of being gay. I just love them too much and I am considering commiting suicide because I don't want to break their hearts.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24gdq7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "HelpMoi07", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24gdq7/im_gay_and_im_scared/", "name": "t3_24gdq7", "created": 1398980835.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24gdq7/im_gay_and_im_scared/", "author_flair_text": null, "title": "I'm gay and I'm scared.", "created_utc": 1398952035.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8aoo0", "gilded": 0, "author": "sadchan", "parent_id": "t1_ch6xmib", "approved_by": null, "body": "Of course. Good luck. Let me know how it goes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course. Good luck. Let me know how it goes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gdq7", "score_hidden": false, "name": "t1_ch8aoo0", "created": 1399092202.0, "author_flair_text": null, "created_utc": 1399088602.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6xmib", "gilded": 0, "author": "HelpMoi07", "parent_id": "t1_ch6wzno", "approved_by": null, "body": "Thank you so much for these words of advice. Its definitely gonna help me with this situation. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for these words of advice. Its definitely gonna help me with this situation. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gdq7", "score_hidden": false, "name": "t1_ch6xmib", "created": 1398963445.0, "author_flair_text": null, "created_utc": 1398959845.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6wzno", "gilded": 0, "author": "sadchan", "parent_id": "t3_24gdq7", "approved_by": null, "body": "To quote presidential first wife, Eleanor Roosevelt, “No one can make you feel inferior without your consent.” This essentially means that you can't let what others think about you, their judgements (cruel, insulting, or just plain hurtful), get in your head and make you feel small unless you let them. It is your choice to take offense to something, just as much as it is to take a compliment. Right now you're talking about your family and how you are afraid of upsetting them, but what of you? Aren't you allowed to be upset? Is your life not just as important? I say it's more. It's scary to think about but you'll have to accept this reality eventually. It's a lonely world. You come into it alone (blind, deaf and cold). You'll leave it alone. But on that passage from one existence to another the only person you're taking along for the ride is yourself. Not the people around you. Not your parents or your bullies or your friends. You have the option to impress people or to ignore them, this is your prerogative, and what you need to understand is that even if you hate someone, fear them, or love them, they don't matter as much as you do. It doesn't make you a bad person, or a good person, it just makes you human. Like everyone else. And we should all grant ourselves this same respect. The respect that we often don't allow ourselves when to get tangled in the web of issues of trying to be who we think others \"want\" us to be. Middle school was torture for me. No matter how hard I tried it seemed that nothing I did mattered. I never fit in, no matter what I wore, how I tried to look or act, or whom I associated with. I was never good enough. I spent my entire childhood devoting all of my efforts to appease the \"cool\" kids, some people who were attractive by a middle school standard. In the mean time I wasted my life, accomplished none of my goals, and for whom? To impress idols whose names I'd forget in just a handful of years? (Remember that, HelpMoi07. You might save yourself some stress)\n\nHelpMoi07, I know what it's like to be 13. To realise you're gay and loathe this part of yourself. But you know what? If you embrace it you not only help yourself, but you can help others, too. You are on this board considering suicide because you care too much. Think about all of the teens out there, whom you might meet someday struggling with their own identities. It can be difficult but also wonderfully rewarding to help others struggling to accept themselves, and fight their own insecurities and thoughts of suicide, all along reinforcing your own desire to keep on. (At least, this is what happened to me. In eighth grade I tried to kill myself, in ninth I made sure everyone knew my name and my cause)\n\nTalk to your parents. Come out. It might go over fine. It might not. This is just how life goes, but it's okay, it happens. It. Really. Isn't. The end of the world. It's not. They might freak out, maybe cry, maying storm off, not speaking to you for some time. Try not to take offence: it's a new concept they have to process. Maybe it won't be negative though. I don't know. But things will likely eventually blow over. You just have to give time for them to adjust to the idea. If they love you as much as you love them then I don't see why this scenario (e.g. you coming out to them) would go any other way). Maybe write up a letter, choose your words carefully, hell, you can read it when speaking to them. Not sure if you should mention the suicide part, but definitely the scared to come out because loving them part. If they try to change you and consider your being gay an illness, please come back to Reddit and find a gay section, because then you'll need new advice on how to maintain sanity.\n\nGood luck. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To quote presidential first wife, Eleanor Roosevelt, “No one can make you feel inferior without your consent.” This essentially means that you can&amp;#39;t let what others think about you, their judgements (cruel, insulting, or just plain hurtful), get in your head and make you feel small unless you let them. It is your choice to take offense to something, just as much as it is to take a compliment. Right now you&amp;#39;re talking about your family and how you are afraid of upsetting them, but what of you? Aren&amp;#39;t you allowed to be upset? Is your life not just as important? I say it&amp;#39;s more. It&amp;#39;s scary to think about but you&amp;#39;ll have to accept this reality eventually. It&amp;#39;s a lonely world. You come into it alone (blind, deaf and cold). You&amp;#39;ll leave it alone. But on that passage from one existence to another the only person you&amp;#39;re taking along for the ride is yourself. Not the people around you. Not your parents or your bullies or your friends. You have the option to impress people or to ignore them, this is your prerogative, and what you need to understand is that even if you hate someone, fear them, or love them, they don&amp;#39;t matter as much as you do. It doesn&amp;#39;t make you a bad person, or a good person, it just makes you human. Like everyone else. And we should all grant ourselves this same respect. The respect that we often don&amp;#39;t allow ourselves when to get tangled in the web of issues of trying to be who we think others &amp;quot;want&amp;quot; us to be. Middle school was torture for me. No matter how hard I tried it seemed that nothing I did mattered. I never fit in, no matter what I wore, how I tried to look or act, or whom I associated with. I was never good enough. I spent my entire childhood devoting all of my efforts to appease the &amp;quot;cool&amp;quot; kids, some people who were attractive by a middle school standard. In the mean time I wasted my life, accomplished none of my goals, and for whom? To impress idols whose names I&amp;#39;d forget in just a handful of years? (Remember that, HelpMoi07. You might save yourself some stress)&lt;/p&gt;\n\n&lt;p&gt;HelpMoi07, I know what it&amp;#39;s like to be 13. To realise you&amp;#39;re gay and loathe this part of yourself. But you know what? If you embrace it you not only help yourself, but you can help others, too. You are on this board considering suicide because you care too much. Think about all of the teens out there, whom you might meet someday struggling with their own identities. It can be difficult but also wonderfully rewarding to help others struggling to accept themselves, and fight their own insecurities and thoughts of suicide, all along reinforcing your own desire to keep on. (At least, this is what happened to me. In eighth grade I tried to kill myself, in ninth I made sure everyone knew my name and my cause)&lt;/p&gt;\n\n&lt;p&gt;Talk to your parents. Come out. It might go over fine. It might not. This is just how life goes, but it&amp;#39;s okay, it happens. It. Really. Isn&amp;#39;t. The end of the world. It&amp;#39;s not. They might freak out, maybe cry, maying storm off, not speaking to you for some time. Try not to take offence: it&amp;#39;s a new concept they have to process. Maybe it won&amp;#39;t be negative though. I don&amp;#39;t know. But things will likely eventually blow over. You just have to give time for them to adjust to the idea. If they love you as much as you love them then I don&amp;#39;t see why this scenario (e.g. you coming out to them) would go any other way). Maybe write up a letter, choose your words carefully, hell, you can read it when speaking to them. Not sure if you should mention the suicide part, but definitely the scared to come out because loving them part. If they try to change you and consider your being gay an illness, please come back to Reddit and find a gay section, because then you&amp;#39;ll need new advice on how to maintain sanity.&lt;/p&gt;\n\n&lt;p&gt;Good luck. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gdq7", "score_hidden": false, "name": "t1_ch6wzno", "created": 1398962079.0, "author_flair_text": null, "created_utc": 1398958479.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7c97e", "gilded": 0, "author": "DryPunt", "parent_id": "t1_ch6uv5n", "approved_by": null, "body": "I thought that, but I was kicked from the house and haven't seen them in years. Thankfully, my freind let me stay over at his house.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought that, but I was kicked from the house and haven&amp;#39;t seen them in years. Thankfully, my freind let me stay over at his house.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gdq7", "score_hidden": false, "name": "t1_ch7c97e", "created": 1399020121.0, "author_flair_text": null, "created_utc": 1398991321.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6uv5n", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24gdq7", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gdq7", "score_hidden": false, "name": "t1_ch6uv5n", "created": 1398982197.0, "author_flair_text": null, "created_utc": 1398953397.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]