[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 16 years old and im only 5 feet tall. I&amp;#39;m really skinny, weak, and look like a girl. I&amp;#39;m from a bad neighborhood and have been raped countless times and I don&amp;#39;t see a reason to live if this is all that&amp;#39;s going to happen to me. Give me one reason I shouldn&amp;#39;t kill myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 16 years old and im only 5 feet tall. I'm really skinny, weak, and look like a girl. I'm from a bad neighborhood and have been raped countless times and I don't see a reason to live if this is all that's going to happen to me. Give me one reason I shouldn't kill myself.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259mxg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SnugglyDassa", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259mxg/im_gonna_kill_myself/", "name": "t3_259mxg", "created": 1399822738.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259mxg/im_gonna_kill_myself/", "author_flair_text": null, "title": "I'm gonna kill myself", "created_utc": 1399793938.0, "ups": 5, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfnxvl", "gilded": 0, "author": "crazylighter", "parent_id": "t3_259mxg", "approved_by": null, "body": "If you don't mind me asking, what would your ideal life look like? If you could wave a magic wand and change anything, what would your life look like?\n\nMy answer would depend on that, to give you a good reason you shouldn't kill yourself.\n\nMany guys are what they call \"late bloomers\". Meaning your hormone levels aren't high enough yet, so you haven't developed sexually as much. So you are shorter, skinny, weak and look like a girl. Usually guys really start changing around your age, so in a few years you might look more like a guy- usually around your twenties you will transform.\n\nHave you ever sought counseling for the rape or your emotions? Going to therapy might help you sort out your life purpose and how to move on from those terrible experiences.\n\nHave you ever tried working out? I'm a short and skinny girl so I felt defenseless against guys who were stronger and after me. Weight lifting and joining martial arts gives you purpose, strength, confidence and helps you hold your own against those who have bad intentions. \n\nBeing from a bad neighborhood doesn't have to dictate your life's direction- just don't do drugs, get alcoholic, drop out of school or have sex without condoms. Those 4 things will ruin your life- leaving you in either jail or no future. \n\nGet an education- that's the way out of bad neighborhoods. Do good in high school and finish with that piece of paper. It's your ticket to higher education or at least an understanding of the world. Ask questions from your teachers, care about the topics, use the internet and books to find out how to get out of your shitty situation. \n\nYou have so many options at your disposal, if that helps change your mind. You have the power to change things, and I hope you can use them. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you don&amp;#39;t mind me asking, what would your ideal life look like? If you could wave a magic wand and change anything, what would your life look like?&lt;/p&gt;\n\n&lt;p&gt;My answer would depend on that, to give you a good reason you shouldn&amp;#39;t kill yourself.&lt;/p&gt;\n\n&lt;p&gt;Many guys are what they call &amp;quot;late bloomers&amp;quot;. Meaning your hormone levels aren&amp;#39;t high enough yet, so you haven&amp;#39;t developed sexually as much. So you are shorter, skinny, weak and look like a girl. Usually guys really start changing around your age, so in a few years you might look more like a guy- usually around your twenties you will transform.&lt;/p&gt;\n\n&lt;p&gt;Have you ever sought counseling for the rape or your emotions? Going to therapy might help you sort out your life purpose and how to move on from those terrible experiences.&lt;/p&gt;\n\n&lt;p&gt;Have you ever tried working out? I&amp;#39;m a short and skinny girl so I felt defenseless against guys who were stronger and after me. Weight lifting and joining martial arts gives you purpose, strength, confidence and helps you hold your own against those who have bad intentions. &lt;/p&gt;\n\n&lt;p&gt;Being from a bad neighborhood doesn&amp;#39;t have to dictate your life&amp;#39;s direction- just don&amp;#39;t do drugs, get alcoholic, drop out of school or have sex without condoms. Those 4 things will ruin your life- leaving you in either jail or no future. &lt;/p&gt;\n\n&lt;p&gt;Get an education- that&amp;#39;s the way out of bad neighborhoods. Do good in high school and finish with that piece of paper. It&amp;#39;s your ticket to higher education or at least an understanding of the world. Ask questions from your teachers, care about the topics, use the internet and books to find out how to get out of your shitty situation. &lt;/p&gt;\n\n&lt;p&gt;You have so many options at your disposal, if that helps change your mind. You have the power to change things, and I hope you can use them. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259mxg", "score_hidden": false, "name": "t1_chfnxvl", "created": 1399893223.0, "author_flair_text": null, "created_utc": 1399864423.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf1zhh", "gilded": 0, "author": "[deleted]", "parent_id": "t3_259mxg", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259mxg", "score_hidden": false, "name": "t1_chf1zhh", "created": 1399824984.0, "author_flair_text": null, "created_utc": 1399796184.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]