[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Another night where my thoughts cloud my mind, preventing any kind of clarity. I can&amp;#39;t sleep, I need to rest for work tomorrow. I already see another day of struggle. Is my car going to break down? Is some fuck face prick motherfucker going to cut me off and cause an accident while he has the money for a lawyer that will get him off. I&amp;#39;ll be given some random task at work that I have no clue whatsoever how to do. Why do they keep me here? I&amp;#39;m useless. I have no friends, no family. I can&amp;#39;t trust anyone due to experiences with the only people I thought I could trust. I&amp;#39;ll get fucked somehow. And no one gives a shit, they go on with their lives. They forget me. Like I&amp;#39;m nothing. &lt;/p&gt;\n\n&lt;p&gt;Fuck people, fuck humans and this skewed society. I&amp;#39;m dead inside. Black. Burned and distorted. I fucking hate this world. There is no way to describe how deep this feeling cuts into me. It&amp;#39;s like my very own existence is shitting on my soul. Life is a poison. And yet I&amp;#39;m forced to live with it, to deal with it. &amp;quot;You should get help&amp;quot; &amp;quot;seek therapy&amp;quot; I call bullshit. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a good example. &amp;quot;need therapy because of trust issues and financial problems.&amp;quot; I can&amp;#39;t trust a random therapist and therapy costs money. Story of my fucking life. Catch 22 and what is it all for? So I can grow old and watch my body fall apart while I spend more and more on healthcare. So I can go bald and blind until ultimate death. And anyone that says it&amp;#39;s the journey not the destination is full of shit. Life is struggle, that&amp;#39;s it. I have nothing. I don&amp;#39;t want anything, not even life. I dread another day in this sickening life. &lt;/p&gt;\n\n&lt;p&gt;So I sit here smoking more and more, playing out all the possibilities I can think if to end this. I&amp;#39;m suffering. I am not giving the world the satisfaction of meds and talking to some fuck that&amp;#39;s getting paid to tell me to think more positively. Why would suicide be so bad? If you had a dog that was suffering, wouldn&amp;#39;t you want to put it down? Take it out of misery? How is that fucking justified with an animal and not a human. Who the fuck are we to make that decision for something that feels and is alive but cannot speak for itself. At the same time, I can speak for myself. I know there is nothing here for me. I know I am suffering. Yet I&amp;#39;d be out in a fucking padded room and sedated so it&amp;#39;s completely out of my control. I&amp;#39;d be ducking forced to stay and suffer. How Gould you like that? What if I did that to your pet? Kept it alive as long as possible knowing it would be best to put it down.  Fuck this world and whoever thinks they can make that decision for me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to kill myself, wether tonight, tomorrow, a week from now, a month, a year. Fuck this place, and whatever insane excuse people come up with to justify a pointless short existence.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Another night where my thoughts cloud my mind, preventing any kind of clarity. I can't sleep, I need to rest for work tomorrow. I already see another day of struggle. Is my car going to break down? Is some fuck face prick motherfucker going to cut me off and cause an accident while he has the money for a lawyer that will get him off. I'll be given some random task at work that I have no clue whatsoever how to do. Why do they keep me here? I'm useless. I have no friends, no family. I can't trust anyone due to experiences with the only people I thought I could trust. I'll get fucked somehow. And no one gives a shit, they go on with their lives. They forget me. Like I'm nothing. \n\nFuck people, fuck humans and this skewed society. I'm dead inside. Black. Burned and distorted. I fucking hate this world. There is no way to describe how deep this feeling cuts into me. It's like my very own existence is shitting on my soul. Life is a poison. And yet I'm forced to live with it, to deal with it. \"You should get help\" \"seek therapy\" I call bullshit. \n\nHere's a good example. \"need therapy because of trust issues and financial problems.\" I can't trust a random therapist and therapy costs money. Story of my fucking life. Catch 22 and what is it all for? So I can grow old and watch my body fall apart while I spend more and more on healthcare. So I can go bald and blind until ultimate death. And anyone that says it's the journey not the destination is full of shit. Life is struggle, that's it. I have nothing. I don't want anything, not even life. I dread another day in this sickening life. \n\nSo I sit here smoking more and more, playing out all the possibilities I can think if to end this. I'm suffering. I am not giving the world the satisfaction of meds and talking to some fuck that's getting paid to tell me to think more positively. Why would suicide be so bad? If you had a dog that was suffering, wouldn't you want to put it down? Take it out of misery? How is that fucking justified with an animal and not a human. Who the fuck are we to make that decision for something that feels and is alive but cannot speak for itself. At the same time, I can speak for myself. I know there is nothing here for me. I know I am suffering. Yet I'd be out in a fucking padded room and sedated so it's completely out of my control. I'd be ducking forced to stay and suffer. How Gould you like that? What if I did that to your pet? Kept it alive as long as possible knowing it would be best to put it down.  Fuck this world and whoever thinks they can make that decision for me.\n\nI'm going to kill myself, wether tonight, tomorrow, a week from now, a month, a year. Fuck this place, and whatever insane excuse people come up with to justify a pointless short existence.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25c799", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Psychopsilocybin87", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25c799/im_going_to_kill_myself_wether_slowly_by_smoking/", "name": "t3_25c799", "created": 1399902189.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25c799/im_going_to_kill_myself_wether_slowly_by_smoking/", "author_flair_text": null, "title": "I'm going to kill myself, wether slowly by smoking, or stress and anxiety. Unless I figure out a quicker solution.", "created_utc": 1399873389.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfwg6e", "gilded": 0, "author": "meatrocket8", "parent_id": "t1_chfvzcl", "approved_by": null, "body": "I'm happy and sad at the same time for you saying that. Sad that you won't seek help, happy to know that if you do go and find the **right** doctor, get on the **right** medication you'll find the strengh to fight and win.\n\nThere are a few antidepressants, you might have to try out with the help of the doc to find what suits you. Also there are a shitty doctors yes i've known a few, don't let that make you give up on medicine. My 2 cents from personal experience.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m happy and sad at the same time for you saying that. Sad that you won&amp;#39;t seek help, happy to know that if you do go and find the &lt;strong&gt;right&lt;/strong&gt; doctor, get on the &lt;strong&gt;right&lt;/strong&gt; medication you&amp;#39;ll find the strengh to fight and win.&lt;/p&gt;\n\n&lt;p&gt;There are a few antidepressants, you might have to try out with the help of the doc to find what suits you. Also there are a shitty doctors yes i&amp;#39;ve known a few, don&amp;#39;t let that make you give up on medicine. My 2 cents from personal experience.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c799", "score_hidden": false, "name": "t1_chfwg6e", "created": 1399928739.0, "author_flair_text": null, "created_utc": 1399899939.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfvzcl", "gilded": 0, "author": "Psychopsilocybin87", "parent_id": "t1_chfs23y", "approved_by": null, "body": "Been there done that, fuck pills. Fuck phsyciatrists ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been there done that, fuck pills. Fuck phsyciatrists &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c799", "score_hidden": false, "name": "t1_chfvzcl", "created": 1399927054.0, "author_flair_text": null, "created_utc": 1399898254.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfs23y", "gilded": 0, "author": "meatrocket8", "parent_id": "t3_25c799", "approved_by": null, "body": "Well i understand your rage, hell i empathize to some extent. But not to it all. You seem like someone who's been in the darkness for long, and it has molded you.\n\n&gt; I'm suffering. I am not giving the world the satisfaction of meds and talking to some fuck that's getting paid to tell me to think more positively.\n\nYou were vague so i'm not sure what kind of help you have seeked. I'm not gonna tell you to pay someone to lay on a couch and talk while they look at a clock, fak psychologists. Now, you clearly need to see a psychiatrist. You'll probably get antidepressants and some benzo, you will sleep and you will see the world differently.\n\nLook there's no reality, only perspective. Understand this. What you see as a shitty world is beautiful to others and can be to you soon. Just don't do what i did and become still sick and addicted to pills.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well i understand your rage, hell i empathize to some extent. But not to it all. You seem like someone who&amp;#39;s been in the darkness for long, and it has molded you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m suffering. I am not giving the world the satisfaction of meds and talking to some fuck that&amp;#39;s getting paid to tell me to think more positively.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You were vague so i&amp;#39;m not sure what kind of help you have seeked. I&amp;#39;m not gonna tell you to pay someone to lay on a couch and talk while they look at a clock, fak psychologists. Now, you clearly need to see a psychiatrist. You&amp;#39;ll probably get antidepressants and some benzo, you will sleep and you will see the world differently.&lt;/p&gt;\n\n&lt;p&gt;Look there&amp;#39;s no reality, only perspective. Understand this. What you see as a shitty world is beautiful to others and can be to you soon. Just don&amp;#39;t do what i did and become still sick and addicted to pills.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c799", "score_hidden": false, "name": "t1_chfs23y", "created": 1399905955.0, "author_flair_text": null, "created_utc": 1399877155.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]