[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hate myself, I hate the life I live. I&amp;#39;m mentally retarded, I can&amp;#39;t form any form of proper friendship because I eventually push people I like away. The only relationships I can have are ones with people just as unstable as me, because they are the only ones that can understand me, but those end after a month in a great ball of fire. Usually I blame it on me because they aren&amp;#39;t getting what they want out of it. I failed college because I&amp;#39;m too retarded to submit work much less do it properly. My parents scold me for not being ready, they force me into a full time job at a construction company (work starts at 5 am all day but sunday) and then they tell me that I still don&amp;#39;t do enough for the family when I come home to just sit down after a hard day, they tell me to get another job for sunday because, &amp;quot;All I do is sit around and play video games.&amp;quot; While my dad is out of a job and living off welfare.&lt;/p&gt;\n\n&lt;p&gt;I really hope either they die or I do, because I know there isn&amp;#39;t any escaping these assholes otherwise.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hate myself, I hate the life I live. I'm mentally retarded, I can't form any form of proper friendship because I eventually push people I like away. The only relationships I can have are ones with people just as unstable as me, because they are the only ones that can understand me, but those end after a month in a great ball of fire. Usually I blame it on me because they aren't getting what they want out of it. I failed college because I'm too retarded to submit work much less do it properly. My parents scold me for not being ready, they force me into a full time job at a construction company (work starts at 5 am all day but sunday) and then they tell me that I still don't do enough for the family when I come home to just sit down after a hard day, they tell me to get another job for sunday because, \"All I do is sit around and play video games.\" While my dad is out of a job and living off welfare.\n\nI really hope either they die or I do, because I know there isn't any escaping these assholes otherwise.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24spi5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Dark-Castle", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24spi5/im_honestly_considering_it/", "name": "t3_24spi5", "created": 1399345110.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24spi5/im_honestly_considering_it/", "author_flair_text": null, "title": "I'm honestly considering it.", "created_utc": 1399316310.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaj6wg", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t1_chaiiaf", "approved_by": null, "body": "Hey O, Thanks for replying, and thank you for all your honestly as well :-)\n\nI think you made some really insightful comments, particularly looking into when your hobby becomes your work, using video games as escapism, and (most importantly in my opinion) the difficulty in finding what the true problem is. The first two I'm completely with you on, video games are great for escapism and sometimes we all need to escape from the world for a few hours :-) and when someone else is kinda semi crushing your passion because you have to do something their way is really horrible.\n\nAs for the third, I think you may be closer than you think, you certainly seem to have a good grasp of where you'd like changes in your life to take place :-) . Of course, only you can ever really know when it's true, but there're a couple of things you kept bringing up that I'd like to ask you a bit more about?\n\nOne of the things you kept mentioning was your work ethic, or your ability to finish something you start on. What do you feel is responsible for that? for example, what kind of thoughts and process goes through your brain that requires someone to, as you say, supervise you all the time?\n\nThe other thing that kept getting brought up a lot was your parents. There seems to be quite a lot of resentment there. I'm certain they love you very much, and only want whats best for you. Do you think they know you feel this way? Not just about them, but about the way you feel you struggle with completing things? What would you like to say to them, if you could say anything?\n\nThank you for taking the time to reply, your kind words really do mean a lot :-)\nJosh", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey O, Thanks for replying, and thank you for all your honestly as well :-)&lt;/p&gt;\n\n&lt;p&gt;I think you made some really insightful comments, particularly looking into when your hobby becomes your work, using video games as escapism, and (most importantly in my opinion) the difficulty in finding what the true problem is. The first two I&amp;#39;m completely with you on, video games are great for escapism and sometimes we all need to escape from the world for a few hours :-) and when someone else is kinda semi crushing your passion because you have to do something their way is really horrible.&lt;/p&gt;\n\n&lt;p&gt;As for the third, I think you may be closer than you think, you certainly seem to have a good grasp of where you&amp;#39;d like changes in your life to take place :-) . Of course, only you can ever really know when it&amp;#39;s true, but there&amp;#39;re a couple of things you kept bringing up that I&amp;#39;d like to ask you a bit more about?&lt;/p&gt;\n\n&lt;p&gt;One of the things you kept mentioning was your work ethic, or your ability to finish something you start on. What do you feel is responsible for that? for example, what kind of thoughts and process goes through your brain that requires someone to, as you say, supervise you all the time?&lt;/p&gt;\n\n&lt;p&gt;The other thing that kept getting brought up a lot was your parents. There seems to be quite a lot of resentment there. I&amp;#39;m certain they love you very much, and only want whats best for you. Do you think they know you feel this way? Not just about them, but about the way you feel you struggle with completing things? What would you like to say to them, if you could say anything?&lt;/p&gt;\n\n&lt;p&gt;Thank you for taking the time to reply, your kind words really do mean a lot :-)\nJosh&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24spi5", "score_hidden": false, "name": "t1_chaj6wg", "created": 1399364688.0, "author_flair_text": null, "created_utc": 1399335888.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chaiiaf", "gilded": 0, "author": "Dark-Castle", "parent_id": "t1_chahd0e", "approved_by": null, "body": "Hey josh. \n\nSure you saw the artwork, its really nice. You should see all the other ones I never finished or never started. Cause that's my mental challenge. I cant start work unless I have someone supervising me all the time. Thats why i failed college, cause i cant get homework done, even if i want to, i just give up.\n\nMy friendships usually end because I always say something that offends them or I do something that hurts them. Either that or I just lose contact with them. \n\nI studied Pre-Animation at Algonquin, mostly drawings. Sounds like fun, but its not. When the homework involves 20 drawings of someone else's ideas, or a room that has surgically precise measurements, or a photo-realistic drawing, all done within one week. You get pretty tired of what you love most. \n\nI guess I cant complain though, my dad and mom paid for college, even though I wasn't ready yet. They paid for a computer I never needed, and they paid for tutors I never needed. My parents now have leverage on me, I need to pay my dad back on everything since it was such a waste of money. \n\nThey sure do love me, so much that they threaten me with a miserable life if I failed college, cause they hate to see their son fail so what better way then to send them in unprepared and tell them there will be consequences if it gets the better of me. Its my fault though, I have ADHD, aspergers, and a terrible work ethic, so I deserve to have everything I've bought taken away from me because I couldn't meet their expectations. \n\nI want to be happy, and some times I am, but then I come home and instead of being asked how my day was, or why im not eating, they tell me I should have done this and that, things I never knew I needed to do cause they never bothered to help me further than, \"here's the task, do it. Dont fail.\" Its my fault though, I should have asked them what more they wanted me to do to help around the house before I go to work. Or in their eyes, \"All I do is play video games.\"\n\nVideo games, what a great invention, im addicted to it, ill admit. Ill play 2 hours a day or so, way too much time noticing the lawn or getting groceries.but I play video games because it makes me happy, why? Because I can escape. In a game of battlefield, I may be killed in combat, but my teammate is sure to help me up. When I save them, they thank me even if they don't know me. In video games, im a helping part of something, and im appreciated, they cant see the flaws of who I am so they take the face value of someone helping them with their goal. In video games, I can escape my life of being a dissapointment to worlds where im important.\n\nI think my problem is that I cant really find my true problem, and not knowing the answer to a question that bothers you every day quickly makes things hard. So far, though, you've helped me more than my parents. You want to listen instead of give me a solution. You want to hear what I have to say, something my parents fail to do.\n\nThanks, \n\nO", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey josh. &lt;/p&gt;\n\n&lt;p&gt;Sure you saw the artwork, its really nice. You should see all the other ones I never finished or never started. Cause that&amp;#39;s my mental challenge. I cant start work unless I have someone supervising me all the time. Thats why i failed college, cause i cant get homework done, even if i want to, i just give up.&lt;/p&gt;\n\n&lt;p&gt;My friendships usually end because I always say something that offends them or I do something that hurts them. Either that or I just lose contact with them. &lt;/p&gt;\n\n&lt;p&gt;I studied Pre-Animation at Algonquin, mostly drawings. Sounds like fun, but its not. When the homework involves 20 drawings of someone else&amp;#39;s ideas, or a room that has surgically precise measurements, or a photo-realistic drawing, all done within one week. You get pretty tired of what you love most. &lt;/p&gt;\n\n&lt;p&gt;I guess I cant complain though, my dad and mom paid for college, even though I wasn&amp;#39;t ready yet. They paid for a computer I never needed, and they paid for tutors I never needed. My parents now have leverage on me, I need to pay my dad back on everything since it was such a waste of money. &lt;/p&gt;\n\n&lt;p&gt;They sure do love me, so much that they threaten me with a miserable life if I failed college, cause they hate to see their son fail so what better way then to send them in unprepared and tell them there will be consequences if it gets the better of me. Its my fault though, I have ADHD, aspergers, and a terrible work ethic, so I deserve to have everything I&amp;#39;ve bought taken away from me because I couldn&amp;#39;t meet their expectations. &lt;/p&gt;\n\n&lt;p&gt;I want to be happy, and some times I am, but then I come home and instead of being asked how my day was, or why im not eating, they tell me I should have done this and that, things I never knew I needed to do cause they never bothered to help me further than, &amp;quot;here&amp;#39;s the task, do it. Dont fail.&amp;quot; Its my fault though, I should have asked them what more they wanted me to do to help around the house before I go to work. Or in their eyes, &amp;quot;All I do is play video games.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Video games, what a great invention, im addicted to it, ill admit. Ill play 2 hours a day or so, way too much time noticing the lawn or getting groceries.but I play video games because it makes me happy, why? Because I can escape. In a game of battlefield, I may be killed in combat, but my teammate is sure to help me up. When I save them, they thank me even if they don&amp;#39;t know me. In video games, im a helping part of something, and im appreciated, they cant see the flaws of who I am so they take the face value of someone helping them with their goal. In video games, I can escape my life of being a dissapointment to worlds where im important.&lt;/p&gt;\n\n&lt;p&gt;I think my problem is that I cant really find my true problem, and not knowing the answer to a question that bothers you every day quickly makes things hard. So far, though, you&amp;#39;ve helped me more than my parents. You want to listen instead of give me a solution. You want to hear what I have to say, something my parents fail to do.&lt;/p&gt;\n\n&lt;p&gt;Thanks, &lt;/p&gt;\n\n&lt;p&gt;O&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24spi5", "score_hidden": false, "name": "t1_chaiiaf", "created": 1399363164.0, "author_flair_text": null, "created_utc": 1399334364.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chahd0e", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t3_24spi5", "approved_by": null, "body": "Hi there Dark-Castle :-)\n\nCool pictures dude! I hope you don't mind but I had a quick stalk and looked through your deviantart page. I particularly like the IronBatman :-P It looks crazy awesome! Did you ever finish it?\n\nAfter looking through your artwork, you don't strike me as someone who's mentally retarded, you seem like a really creative person :-) What did you study in college? And what did you want to do If you had taken a year off before then?\n\nTell me a bit more about your life? What about your friendships do you feel pushes them away?\n\nJosh", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there Dark-Castle :-)&lt;/p&gt;\n\n&lt;p&gt;Cool pictures dude! I hope you don&amp;#39;t mind but I had a quick stalk and looked through your deviantart page. I particularly like the IronBatman :-P It looks crazy awesome! Did you ever finish it?&lt;/p&gt;\n\n&lt;p&gt;After looking through your artwork, you don&amp;#39;t strike me as someone who&amp;#39;s mentally retarded, you seem like a really creative person :-) What did you study in college? And what did you want to do If you had taken a year off before then?&lt;/p&gt;\n\n&lt;p&gt;Tell me a bit more about your life? What about your friendships do you feel pushes them away?&lt;/p&gt;\n\n&lt;p&gt;Josh&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24spi5", "score_hidden": false, "name": "t1_chahd0e", "created": 1399360641.0, "author_flair_text": null, "created_utc": 1399331841.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]