[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll start off by saying this: I don&amp;#39;t want to kill myself. Not today, anyway. Not tomorrow either. But I am, as I said, in crisis mode right now, and I don&amp;#39;t know who else to turn to.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m struggling with anxiety and depression. I&amp;#39;ve avoided getting help because I&amp;#39;m in the military, and I could lose my job for seeing a doctor or getting on medication. They try to tell you that&amp;#39;s not true, that the military wants to help you be healthy all-around, and that there are no repercussions to getting mental health help. Really, it depends on your job and the security clearance necessary to perform it. Not to mention they&amp;#39;re downsizing, and pushing out folks with diseases or disorders, either mental or physical, is an easy way to cut the fat. I&amp;#39;m pretty sure I&amp;#39;m fucked.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m fucked either way right now. Either my anxiety or my drinking habits (perhaps both) have given me chronic diarrhea, which generally pops off three or more times a day. In about a month and a half, I can count on one hand the amount of &amp;quot;normal&amp;quot; shits that I&amp;#39;ve had. This may seem completely irrelevant and entirely too much information, but it&amp;#39;s not.&lt;/p&gt;\n\n&lt;p&gt;I just moved to a new squadron. They immediately wanted to label me their golden child, same as the last one. In my new position, I can&amp;#39;t fuck up or fail anything, or else I&amp;#39;ll lose my credentials. This is a problem. I have a fitness assessment in four days. It includes a 1.5 mile run. I can&amp;#39;t run more than a mile (or play basketball or go horseback riding, things I used to enjoy) without getting an urgent need to go to the bathroom. If I step off the track, I&amp;#39;m done. Failed. I&amp;#39;ve seen people throw up during their run before, but never seen anyone shit their pants. I&amp;#39;m not willing to go that far.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ve been struggling with these issues for months now, and in a sick twist of fate, the outcome of my job and my life boils down to shit. It could almost be funny. But I&amp;#39;m not laughing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been contemplating injuring myself to avoid putting myself in this situation. Messing up a foot or an arm or something. In the meanwhile, I&amp;#39;ve just been getting drunk as often as possible.&lt;/p&gt;\n\n&lt;p&gt;Which isn&amp;#39;t new. Awful thoughts cloud my sober mind, completely unbidden. They interrupt normal thoughts, like &amp;quot;what should I make for dinner?&amp;quot; So abruptly it changes to &amp;quot;just slit your throat,&amp;quot; or other equally gruesome thoughts. They&amp;#39;re triggered by nothing, dulled only by alcohol.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry to push everything onto whoever reads this. It&amp;#39;s unfair. You have no obligations to help me. I&amp;#39;m just very alone (my SO is across the country until Wednesday) and this is my pathetic attempt at getting help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll start off by saying this: I don't want to kill myself. Not today, anyway. Not tomorrow either. But I am, as I said, in crisis mode right now, and I don't know who else to turn to.\n\nI'm struggling with anxiety and depression. I've avoided getting help because I'm in the military, and I could lose my job for seeing a doctor or getting on medication. They try to tell you that's not true, that the military wants to help you be healthy all-around, and that there are no repercussions to getting mental health help. Really, it depends on your job and the security clearance necessary to perform it. Not to mention they're downsizing, and pushing out folks with diseases or disorders, either mental or physical, is an easy way to cut the fat. I'm pretty sure I'm fucked.\n\nBut I'm fucked either way right now. Either my anxiety or my drinking habits (perhaps both) have given me chronic diarrhea, which generally pops off three or more times a day. In about a month and a half, I can count on one hand the amount of \"normal\" shits that I've had. This may seem completely irrelevant and entirely too much information, but it's not.\n\nI just moved to a new squadron. They immediately wanted to label me their golden child, same as the last one. In my new position, I can't fuck up or fail anything, or else I'll lose my credentials. This is a problem. I have a fitness assessment in four days. It includes a 1.5 mile run. I can't run more than a mile (or play basketball or go horseback riding, things I used to enjoy) without getting an urgent need to go to the bathroom. If I step off the track, I'm done. Failed. I've seen people throw up during their run before, but never seen anyone shit their pants. I'm not willing to go that far.\n\nSo I've been struggling with these issues for months now, and in a sick twist of fate, the outcome of my job and my life boils down to shit. It could almost be funny. But I'm not laughing.\n\nI've been contemplating injuring myself to avoid putting myself in this situation. Messing up a foot or an arm or something. In the meanwhile, I've just been getting drunk as often as possible.\n\nWhich isn't new. Awful thoughts cloud my sober mind, completely unbidden. They interrupt normal thoughts, like \"what should I make for dinner?\" So abruptly it changes to \"just slit your throat,\" or other equally gruesome thoughts. They're triggered by nothing, dulled only by alcohol.\n\nI'm sorry to push everything onto whoever reads this. It's unfair. You have no obligations to help me. I'm just very alone (my SO is across the country until Wednesday) and this is my pathetic attempt at getting help.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24lccd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "risky_throwaway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24lccd/im_in_crisis_mode/", "name": "t3_24lccd", "created": 1399111899.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24lccd/im_in_crisis_mode/", "author_flair_text": null, "title": "I'm in crisis mode.", "created_utc": 1399083099.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8abo4", "gilded": 0, "author": "risky_throwaway", "parent_id": "t1_ch89pl1", "approved_by": null, "body": "Thanks for reading. Yeah IBS seems like the culprit, and I know it often coincides with anxiety in particular. I do have an appointment with a (military) doctor for it on Monday. They are the only ones who can authorize documents stating what you can or can't do for physical training. I'm disinclined to believe they're going to cut me any slack for my fitness assessment though.\n\nIt's sad that I'll have to walk in and pretend that my physical symptoms are the only issues bothering me. Part of me is desperate to go in and say \"I'm a mess, I need rehab, therapy, and medication!\" But to do that would be to throw away this life that I've created for myself, which I still believe has been my best course of action ever.\n\nI don't have a backup plan. Not yet. My family back home can't support me; they're in dire straights putting my sister through college and dealing with medical expenses. My boyfriend and I have a strong relationship, but he's not about to make me a housewife.\n\nThis is it for me, and it's entirely too much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for reading. Yeah IBS seems like the culprit, and I know it often coincides with anxiety in particular. I do have an appointment with a (military) doctor for it on Monday. They are the only ones who can authorize documents stating what you can or can&amp;#39;t do for physical training. I&amp;#39;m disinclined to believe they&amp;#39;re going to cut me any slack for my fitness assessment though.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad that I&amp;#39;ll have to walk in and pretend that my physical symptoms are the only issues bothering me. Part of me is desperate to go in and say &amp;quot;I&amp;#39;m a mess, I need rehab, therapy, and medication!&amp;quot; But to do that would be to throw away this life that I&amp;#39;ve created for myself, which I still believe has been my best course of action ever.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have a backup plan. Not yet. My family back home can&amp;#39;t support me; they&amp;#39;re in dire straights putting my sister through college and dealing with medical expenses. My boyfriend and I have a strong relationship, but he&amp;#39;s not about to make me a housewife.&lt;/p&gt;\n\n&lt;p&gt;This is it for me, and it&amp;#39;s entirely too much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lccd", "score_hidden": false, "name": "t1_ch8abo4", "created": 1399116330.0, "author_flair_text": null, "created_utc": 1399087530.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch89pl1", "gilded": 0, "author": "imagine_if_you_can", "parent_id": "t3_24lccd", "approved_by": null, "body": "It sounds like you might have IBS.  Can you maybe go to a walk-in clinic, pay cash, and get medication for that part of it and work from there?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you might have IBS.  Can you maybe go to a walk-in clinic, pay cash, and get medication for that part of it and work from there?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lccd", "score_hidden": false, "name": "t1_ch89pl1", "created": 1399114627.0, "author_flair_text": null, "created_utc": 1399085827.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]