[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok, I&amp;#39;ve lurked on reddit for years, but this is my first post ever so if I do/say anything I&amp;#39;m not supposed to, I&amp;#39;m sorry in advance.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen this sub pop-up a few times, and noticed what it can do for people... how much it can help... and I just thought to myself &amp;quot;Gosh, &lt;em&gt;before&lt;/em&gt; I get drunk and write a suicide note to all my loved ones for the hundredth time (which I always end up hiding somewhere or throwing away the next morning), maybe I should bounce my ideas off those r/SW folks...&amp;quot;, so here I am.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 27. I have a loving family and boyfriend of almost 10 years. We have a house (albeit, a very cheap one in a bad neighborhood), 2 cats, and plans for the future. I&amp;#39;m one semester away from finishing my second AAS degree, and I had a good job up until a few weeks ago... so basically, I&amp;#39;m perfectly happy... except, I&amp;#39;m not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve taken antidepressants for over a decade. I had a mental collapse as a 16 year-old due to a rough childhood, and I was subsequently kidnapped for a week by someone I thought I could trust. This got me labeled as the &amp;quot;crazy&amp;quot; kid at my small-town school... But within a year I had gone through all the motions to convince everyone around me that I was totally fine and dandy. Rebounding from basically being a social pariah to being on the homecoming court was seriously difficult, but I had (and still have) such a fear of failure that I was able to push myself into what I thought was recovery.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always known I never &amp;quot;got better&amp;quot;. I start fights with my boyfriend about the dumbest things. I can go from being totally fine one minute to crying the next, over the smallest issue. Since I lost my job, I lost my health insurance, and even if I hadn&amp;#39;t, I don&amp;#39;t know that I would feel like talking to professionals. They have their lines, their &amp;quot;by the book&amp;quot; suggestions, that didn&amp;#39;t help me when I was 16, and sure as hell won&amp;#39;t help me now... but I digress... My real issue, and why I&amp;#39;m here, are my impulsive thoughts about killing myself. &lt;/p&gt;\n\n&lt;p&gt;I tried to talk to my family about it... they say things like &amp;quot;oh, everyone has bad days... it will all be ok.&amp;quot; I yell at my boyfriend about it and he says that I&amp;#39;m being manipulative by bringing it up (but never attempting  it or finding my own help)... My friends all think I&amp;#39;m nuts from my previous mental breakdown, so I wouldn&amp;#39;t dare speak to them... and I wonder, maybe if I just do it, everyone will be better off... &lt;/p&gt;\n\n&lt;p&gt;So then I have these images in my mind, anytime I feel emotionally out of control, of picking up the sharpest knife in my kitchen and plunging it deep into my ribcage... Or finding a tall bridge above some cold, moving water and just diving in. &lt;/p&gt;\n\n&lt;p&gt;And so I&amp;#39;ve been pushing people away for years... I&amp;#39;ve been hiding inside my own mind for years... and it&amp;#39;s starting to become more than I can handle. I feel like a failure, a liar, and I&amp;#39;m tired. A nice, loving note to the people I care about and a forever dirt-nap is beginning to creep into my future plans in a way that terrifies me. But, even as I&amp;#39;m writing this, inside my head is a voice saying &amp;quot;DEAR GOD DELETE ALL THAT! THEY WILL THINK YOU&amp;#39;RE CRAZY, A FAILURE, AND COMPLAINING ABOUT PROBLEMS THAT YOU DON&amp;#39;T HAVE! YOU ARE LUCKY, YOU HAVE MORE THAN MOST PEOPLE, SO GET OVER IT!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But I can&amp;#39;t get over it. No matter how hard I try. No matter who I talk to or what I do. It makes me think there is no room in the world for someone as broken as me. If I can&amp;#39;t handle life, even with all the good things I have, maybe I&amp;#39;m just meant to die? I feel like a monster.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Out of control emotions leading to impulsive thoughts about killing myself. I have written lots of notes but have yet to attempt it, and I&amp;#39;m afraid I might get up the courage soon.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ok, I've lurked on reddit for years, but this is my first post ever so if I do/say anything I'm not supposed to, I'm sorry in advance.\n\nI've seen this sub pop-up a few times, and noticed what it can do for people... how much it can help... and I just thought to myself \"Gosh, *before* I get drunk and write a suicide note to all my loved ones for the hundredth time (which I always end up hiding somewhere or throwing away the next morning), maybe I should bounce my ideas off those r/SW folks...\", so here I am.\n\nI'm 27. I have a loving family and boyfriend of almost 10 years. We have a house (albeit, a very cheap one in a bad neighborhood), 2 cats, and plans for the future. I'm one semester away from finishing my second AAS degree, and I had a good job up until a few weeks ago... so basically, I'm perfectly happy... except, I'm not.\n\nI've taken antidepressants for over a decade. I had a mental collapse as a 16 year-old due to a rough childhood, and I was subsequently kidnapped for a week by someone I thought I could trust. This got me labeled as the \"crazy\" kid at my small-town school... But within a year I had gone through all the motions to convince everyone around me that I was totally fine and dandy. Rebounding from basically being a social pariah to being on the homecoming court was seriously difficult, but I had (and still have) such a fear of failure that I was able to push myself into what I thought was recovery.\n\nI've always known I never \"got better\". I start fights with my boyfriend about the dumbest things. I can go from being totally fine one minute to crying the next, over the smallest issue. Since I lost my job, I lost my health insurance, and even if I hadn't, I don't know that I would feel like talking to professionals. They have their lines, their \"by the book\" suggestions, that didn't help me when I was 16, and sure as hell won't help me now... but I digress... My real issue, and why I'm here, are my impulsive thoughts about killing myself. \n\nI tried to talk to my family about it... they say things like \"oh, everyone has bad days... it will all be ok.\" I yell at my boyfriend about it and he says that I'm being manipulative by bringing it up (but never attempting  it or finding my own help)... My friends all think I'm nuts from my previous mental breakdown, so I wouldn't dare speak to them... and I wonder, maybe if I just do it, everyone will be better off... \n\nSo then I have these images in my mind, anytime I feel emotionally out of control, of picking up the sharpest knife in my kitchen and plunging it deep into my ribcage... Or finding a tall bridge above some cold, moving water and just diving in. \n\nAnd so I've been pushing people away for years... I've been hiding inside my own mind for years... and it's starting to become more than I can handle. I feel like a failure, a liar, and I'm tired. A nice, loving note to the people I care about and a forever dirt-nap is beginning to creep into my future plans in a way that terrifies me. But, even as I'm writing this, inside my head is a voice saying \"DEAR GOD DELETE ALL THAT! THEY WILL THINK YOU'RE CRAZY, A FAILURE, AND COMPLAINING ABOUT PROBLEMS THAT YOU DON'T HAVE! YOU ARE LUCKY, YOU HAVE MORE THAN MOST PEOPLE, SO GET OVER IT!\"\n\nBut I can't get over it. No matter how hard I try. No matter who I talk to or what I do. It makes me think there is no room in the world for someone as broken as me. If I can't handle life, even with all the good things I have, maybe I'm just meant to die? I feel like a monster.\n\n**TL;DR: Out of control emotions leading to impulsive thoughts about killing myself. I have written lots of notes but have yet to attempt it, and I'm afraid I might get up the courage soon.**", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24l5jo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thrownawayaway123", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24l5jo/im_just_so_tired/", "name": "t3_24l5jo", "created": 1399106453.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24l5jo/im_just_so_tired/", "author_flair_text": null, "title": "I'm just so tired", "created_utc": 1399077653.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch87y5r", "gilded": 0, "author": "pangie12", "parent_id": "t3_24l5jo", "approved_by": null, "body": "I know how you feel.I keep trying to push my boyfriend away from me. Since Ive gotten ill Ive been really depressed. But he keeps sticking to me. I heard somewhere once \"Your lucky to just be alive\" but it seems unreal. If you need someone to talk too I can listen and talk to you. Sometimes talking to someone can help", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know how you feel.I keep trying to push my boyfriend away from me. Since Ive gotten ill Ive been really depressed. But he keeps sticking to me. I heard somewhere once &amp;quot;Your lucky to just be alive&amp;quot; but it seems unreal. If you need someone to talk too I can listen and talk to you. Sometimes talking to someone can help&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l5jo", "score_hidden": false, "name": "t1_ch87y5r", "created": 1399109938.0, "author_flair_text": null, "created_utc": 1399081138.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch88cli", "gilded": 0, "author": "roast_spud", "parent_id": "t3_24l5jo", "approved_by": null, "body": "Oh, sweetheart - well done for getting all of that out here. I had to reply, but I won't have any magical words that will make it all better, I'm afraid. \n\nI did laugh at your 'by the book' comment - that's exactly why I never registered as a psychologist. There was just no room for actually being a human, sitting there supporting another human.\n\n.. You sound just exhausted by life. And it's obviously not 'situational depression', since you have all that basic 'life stuff' under control. If you have the energy, I can only suggest you try to find a different medication.  What you are taking now isn't helping bring you out of that constant funk where it all feels hopeless. That's all the meds will do, just make existing a little easier.  It's still up to you to find a reason to keep living.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, sweetheart - well done for getting all of that out here. I had to reply, but I won&amp;#39;t have any magical words that will make it all better, I&amp;#39;m afraid. &lt;/p&gt;\n\n&lt;p&gt;I did laugh at your &amp;#39;by the book&amp;#39; comment - that&amp;#39;s exactly why I never registered as a psychologist. There was just no room for actually being a human, sitting there supporting another human.&lt;/p&gt;\n\n&lt;p&gt;.. You sound just exhausted by life. And it&amp;#39;s obviously not &amp;#39;situational depression&amp;#39;, since you have all that basic &amp;#39;life stuff&amp;#39; under control. If you have the energy, I can only suggest you try to find a different medication.  What you are taking now isn&amp;#39;t helping bring you out of that constant funk where it all feels hopeless. That&amp;#39;s all the meds will do, just make existing a little easier.  It&amp;#39;s still up to you to find a reason to keep living.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l5jo", "score_hidden": false, "name": "t1_ch88cli", "created": 1399111046.0, "author_flair_text": null, "created_utc": 1399082246.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]