[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll keep this brief, even on this subreddit the topic of suicide and depression is often met with irritation, skepticism, and the diminished seriousness of it&amp;#39;s claim.&lt;/p&gt;\n\n&lt;p&gt;I have sought out help, and have been to a psychiatrist. As expected, I was diagnosed with Bipolar I and Social Anxiety Disorder. I showed up to the appointments for 6 months only to be met with disbelief for not putting on a display of emotion. I am a male, and I&amp;#39;ve fought this for over ten years. It has won. I do not have the tools or mental health necessary to cope with day to day life. I do not want consoling remarks that things will get better.&lt;/p&gt;\n\n&lt;p&gt;I have made my preparations, I have eliminated my debts, and around six months ago eliminated what little social contact I had. I have a small tent, and a small stable grill. I&amp;#39;m going to be using untreated charcoal. I hope to succeed without failure. &lt;/p&gt;\n\n&lt;p&gt;The one problem I am having is that of initiation. I do not want to leave a note, as I have no one necessary to leave it for. Each day is a reminder that I have no reason to procrastinate further. However, I feel as though I need something as a trigger, a catalyst to help me feel that I have closure.&lt;/p&gt;\n\n&lt;p&gt;Any advice on how to pick a time? Should I approach this with a scheduled date? or just do it spur of the moment.&lt;/p&gt;\n\n&lt;p&gt;Again, let me reiterate, if it&amp;#39;s not today it will be soon. This is not going to get better, in a world of 7 billion there are going to be those who cannot function properly. I am one of those people, and I am determined to see it end.&lt;/p&gt;\n\n&lt;p&gt;Edit for clarity: I&amp;#39;m in my late 20&amp;#39;s and the bouts of depression have been over a year in their intervals. Like many on here, I struggled with it when I was younger but it has become more established in the last 4 or 5 years. I&amp;#39;m stuck with this long term, the notion that the right combination of ssri&amp;#39;s or benzo&amp;#39;s could be a viable solution for the indefinite future does not seem practical.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll keep this brief, even on this subreddit the topic of suicide and depression is often met with irritation, skepticism, and the diminished seriousness of it's claim.\n\nI have sought out help, and have been to a psychiatrist. As expected, I was diagnosed with Bipolar I and Social Anxiety Disorder. I showed up to the appointments for 6 months only to be met with disbelief for not putting on a display of emotion. I am a male, and I've fought this for over ten years. It has won. I do not have the tools or mental health necessary to cope with day to day life. I do not want consoling remarks that things will get better.\n\nI have made my preparations, I have eliminated my debts, and around six months ago eliminated what little social contact I had. I have a small tent, and a small stable grill. I'm going to be using untreated charcoal. I hope to succeed without failure. \n\nThe one problem I am having is that of initiation. I do not want to leave a note, as I have no one necessary to leave it for. Each day is a reminder that I have no reason to procrastinate further. However, I feel as though I need something as a trigger, a catalyst to help me feel that I have closure.\n\nAny advice on how to pick a time? Should I approach this with a scheduled date? or just do it spur of the moment.\n\nAgain, let me reiterate, if it's not today it will be soon. This is not going to get better, in a world of 7 billion there are going to be those who cannot function properly. I am one of those people, and I am determined to see it end.\n\nEdit for clarity: I'm in my late 20's and the bouts of depression have been over a year in their intervals. Like many on here, I struggled with it when I was younger but it has become more established in the last 4 or 5 years. I'm stuck with this long term, the notion that the right combination of ssri's or benzo's could be a viable solution for the indefinite future does not seem practical.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23ufbf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway8636", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398329847.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23ufbf/im_looking_for_help_committing/", "name": "t3_23ufbf", "created": 1398357715.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23ufbf/im_looking_for_help_committing/", "author_flair_text": null, "title": "I'm looking for help committing.", "created_utc": 1398328915.0, "ups": 4, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0ore1", "gilded": 0, "author": "Eternal123", "parent_id": "t3_23ufbf", "approved_by": null, "body": "As someone who can relate to you... I hope you don't.. There's a light I always strive for in my life and I don't want to go out till I get that light. My light is happiness. You seem like you've been through a lot. I'm still young so I don't know how to handle all my social anxiety and etc. Do you have close family or anyone you can talk to? I'm here for you,\n\nI'm 18 and my name is Walli ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who can relate to you... I hope you don&amp;#39;t.. There&amp;#39;s a light I always strive for in my life and I don&amp;#39;t want to go out till I get that light. My light is happiness. You seem like you&amp;#39;ve been through a lot. I&amp;#39;m still young so I don&amp;#39;t know how to handle all my social anxiety and etc. Do you have close family or anyone you can talk to? I&amp;#39;m here for you,&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 18 and my name is Walli &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0ore1", "created": 1398358696.0, "author_flair_text": null, "created_utc": 1398329896.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0p0o0", "gilded": 0, "author": "throwaway8636", "parent_id": "t1_ch0ovko", "approved_by": null, "body": "I wish I could find the motivation to pursue some random inclination. If I am awol for too long either the army or my civilian job will start to look for me. In the movie \"American Beauty\" the main protagonist attempts to relieve his hardships by abandoning and reducing his responsibilities. While it was great in the movie, in reality it means digging your hole deeper. I just want to keep a low profile until this ends. I have had 4 large breakdowns in the past ten years, each one I tried to separate myself from everything and start over hoping to fix this. I've moved jobs, moved physically, rebuilt new circles of friends, used drugs, developed physical fitness, and nothing has helped.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could find the motivation to pursue some random inclination. If I am awol for too long either the army or my civilian job will start to look for me. In the movie &amp;quot;American Beauty&amp;quot; the main protagonist attempts to relieve his hardships by abandoning and reducing his responsibilities. While it was great in the movie, in reality it means digging your hole deeper. I just want to keep a low profile until this ends. I have had 4 large breakdowns in the past ten years, each one I tried to separate myself from everything and start over hoping to fix this. I&amp;#39;ve moved jobs, moved physically, rebuilt new circles of friends, used drugs, developed physical fitness, and nothing has helped.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0p0o0", "created": 1398335205.0, "author_flair_text": null, "created_utc": 1398331605.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0ovko", "gilded": 0, "author": "BroChillOut", "parent_id": "t3_23ufbf", "approved_by": null, "body": "The curiosity of tomorrow keeps me going. Every day brings something new if I seek it out. It's crazy to think that if I really wanted to, I could just walk to Oklahoma or something. I could walk all the way to the southern tip of Chile or the westernmost point of Alaska. It's crazy, but I really could do that if I had the inclination. I mean it's out there, right? This whole big crazy world is out there existing and here I am, in my cozy little room with my computer. My point, as vague as it is, is sometimes it's really easy to become myopic or really narrowly focused about your life or who you are or what you are doing. As if you need to type in some unknown cheat code to unlock life's benefits. And you're just pounding away trying different combinations at random hoping to magically get lucky and find one. I say screw that. Just push the buttons you want to push. I don't really know what the fuck I'm talking about, but hey, at the very least, it kept your attention for a minute or two. That's not so bad I suppose.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The curiosity of tomorrow keeps me going. Every day brings something new if I seek it out. It&amp;#39;s crazy to think that if I really wanted to, I could just walk to Oklahoma or something. I could walk all the way to the southern tip of Chile or the westernmost point of Alaska. It&amp;#39;s crazy, but I really could do that if I had the inclination. I mean it&amp;#39;s out there, right? This whole big crazy world is out there existing and here I am, in my cozy little room with my computer. My point, as vague as it is, is sometimes it&amp;#39;s really easy to become myopic or really narrowly focused about your life or who you are or what you are doing. As if you need to type in some unknown cheat code to unlock life&amp;#39;s benefits. And you&amp;#39;re just pounding away trying different combinations at random hoping to magically get lucky and find one. I say screw that. Just push the buttons you want to push. I don&amp;#39;t really know what the fuck I&amp;#39;m talking about, but hey, at the very least, it kept your attention for a minute or two. That&amp;#39;s not so bad I suppose.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0ovko", "created": 1398334260.0, "author_flair_text": null, "created_utc": 1398330660.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch118ic", "gilded": 0, "author": "egates09", "parent_id": "t3_23ufbf", "approved_by": null, "body": "Well, I read through your statements and from what I can tell you come across as a reasonably intelligent individual. Obviously I wouldn't recommend you go through with it, life is far too beautiful and unlikely to be wasted. What I think might help is a change of scenery. You said you managed to get your debt down to nothing, which is great. So why don't you pack up and move? Explore the world, go out into nature, SOMETHING.\n\nI understand what it's like to have social anxiety and low self esteem. I know what it feels like to hate yourself and feel worthless. But, here's the thing, if you don't have the slightest bit of respect for yourself then who will? As far as you know this life is the only life you will have, so why not just see where it goes? You do have something to offer. You just haven't discovered it yet. \n\nSo why not change? Take that tent and grill and go camping. Alone. Try to discover yourself, why you think about yourself the way you do, etc. Do what really make you happy. Have any hobbies? Pursue those instead of that meaningless job you've been working for. \n\nYou can't end on that note. Give it another chance. If all is said and done and you still feel shitty about living, then you can at least say you tried to improve. \n\nGood luck man. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I read through your statements and from what I can tell you come across as a reasonably intelligent individual. Obviously I wouldn&amp;#39;t recommend you go through with it, life is far too beautiful and unlikely to be wasted. What I think might help is a change of scenery. You said you managed to get your debt down to nothing, which is great. So why don&amp;#39;t you pack up and move? Explore the world, go out into nature, SOMETHING.&lt;/p&gt;\n\n&lt;p&gt;I understand what it&amp;#39;s like to have social anxiety and low self esteem. I know what it feels like to hate yourself and feel worthless. But, here&amp;#39;s the thing, if you don&amp;#39;t have the slightest bit of respect for yourself then who will? As far as you know this life is the only life you will have, so why not just see where it goes? You do have something to offer. You just haven&amp;#39;t discovered it yet. &lt;/p&gt;\n\n&lt;p&gt;So why not change? Take that tent and grill and go camping. Alone. Try to discover yourself, why you think about yourself the way you do, etc. Do what really make you happy. Have any hobbies? Pursue those instead of that meaningless job you&amp;#39;ve been working for. &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t end on that note. Give it another chance. If all is said and done and you still feel shitty about living, then you can at least say you tried to improve. &lt;/p&gt;\n\n&lt;p&gt;Good luck man. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch118ic", "created": 1398368977.0, "author_flair_text": null, "created_utc": 1398365377.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0p2de", "gilded": 0, "author": "TangentialThreat", "parent_id": "t1_ch0owys", "approved_by": null, "body": "I do not fully understand what other people think of me. I discovered that I did not know what respectability was; maybe things would have gone differently in a culture with clearer rules.\n\nI still don't know, at least not exactly. I settle for being entertaining and liked because that's all I can manage.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not fully understand what other people think of me. I discovered that I did not know what respectability was; maybe things would have gone differently in a culture with clearer rules.&lt;/p&gt;\n\n&lt;p&gt;I still don&amp;#39;t know, at least not exactly. I settle for being entertaining and liked because that&amp;#39;s all I can manage.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0p2de", "created": 1398335525.0, "author_flair_text": null, "created_utc": 1398331925.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0owys", "gilded": 0, "author": "throwaway8636", "parent_id": "t1_ch0osva", "approved_by": null, "body": "Somehow through all these years I have managed to keep good credit. I have considered just throwing it all into the wind. I have always managed to keep good jobs, but a few years into it, the crippling social anxiety and the apathy that comes from depression usually leads me to put in notice and quit. I have no self esteem, none. Yet keeping a responsible image has always been important to me. That is really the reason for leaving without debt. I have no hard feelings towards anyone. I just can't stand being myself, being alive.\n\nAnother issue I have is that of prejudice towards males when seeking treatment for mental health issues. Many here know that expressing concerns about depression are brushed aside by most as petty. Seeking help with social anxiety as a male is on another tier. That crushing claustrophobic feeling I get day in and day out is too much. I have empathy for anyone else out there going through similar symptoms.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Somehow through all these years I have managed to keep good credit. I have considered just throwing it all into the wind. I have always managed to keep good jobs, but a few years into it, the crippling social anxiety and the apathy that comes from depression usually leads me to put in notice and quit. I have no self esteem, none. Yet keeping a responsible image has always been important to me. That is really the reason for leaving without debt. I have no hard feelings towards anyone. I just can&amp;#39;t stand being myself, being alive.&lt;/p&gt;\n\n&lt;p&gt;Another issue I have is that of prejudice towards males when seeking treatment for mental health issues. Many here know that expressing concerns about depression are brushed aside by most as petty. Seeking help with social anxiety as a male is on another tier. That crushing claustrophobic feeling I get day in and day out is too much. I have empathy for anyone else out there going through similar symptoms.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0owys", "created": 1398334511.0, "author_flair_text": null, "created_utc": 1398330911.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0osva", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_23ufbf", "approved_by": null, "body": "Settling your debts is interesting. I intend to die owing as much money as possible to as many assholes as possible.\n\nI know revenge is a shitty thing to live for but please, you could have petty revenge on Bank of America. Max your cards. Get one of those predatory payday loans and burn the collateral. Plan this years in advance and take out a reverse mortgage at a cruel interest rate. \n\nIf you need help spending the money from defrauding the wicked then I have medical bills.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Settling your debts is interesting. I intend to die owing as much money as possible to as many assholes as possible.&lt;/p&gt;\n\n&lt;p&gt;I know revenge is a shitty thing to live for but please, you could have petty revenge on Bank of America. Max your cards. Get one of those predatory payday loans and burn the collateral. Plan this years in advance and take out a reverse mortgage at a cruel interest rate. &lt;/p&gt;\n\n&lt;p&gt;If you need help spending the money from defrauding the wicked then I have medical bills.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ufbf", "score_hidden": false, "name": "t1_ch0osva", "created": 1398333764.0, "author_flair_text": null, "created_utc": 1398330164.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]