[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway account...&lt;/p&gt;\n\n&lt;p&gt;I could go into all the reasons for why I&amp;#39;m like this, but I don&amp;#39;t see the point.  I&amp;#39;ve dealt with severe depression for nearly a decade, I&amp;#39;ve tried every goddamn thing I can think of (medicine, therapy, yoga, lifestyle changes, even moving across the country).  It doesn&amp;#39;t matter, at some point I come back to this intense feeling of being unlovable.  That I&amp;#39;m tired of being alive.  Yes, I know it&amp;#39;s wrong to think that and I even understand there are people who would be affected by my death, but I&amp;#39;m getting to that point again where that realization has little affect on me.  It&amp;#39;s not that I don&amp;#39;t care about them, but I do think they would get over it.  And I&amp;#39;m tired of staying miserably alive just to keep someone else from going through a grief process that they&amp;#39;d move on from.  Before I get called too selfish, consider I&amp;#39;m a teacher, so I&amp;#39;ve held off all school year from doing anything harmful.  What I think is I could leave the state and do it over the summer so the kids wouldn&amp;#39;t ever find out.  They&amp;#39;d just think I moved away.  &lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t know how to do it.  I don&amp;#39;t want to just make myself worse by botching an attempt.  Even with a gun, I once listened to a recording somewhere online of a guy who shot himself in the head and obviously lived.  I don&amp;#39;t want to turn into a vegetable and be a financial burden on someone else.  Every time I try to find a method that would surely work I see some problem with it.  I&amp;#39;m thinking right now if I overdosed and combined it with alcohol that&amp;#39;d might work.  Or strangle myself.  &lt;/p&gt;\n\n&lt;p&gt;I feel bad writing this because I know my mom would be devastated.  But I&amp;#39;m so tired of living like this.  I&amp;#39;ve done so much to try to change my life and it always comes back to me feeling so utterly trapped.  The worst part is you of course can&amp;#39;t actually talk about this with anyone you know.  They&amp;#39;d be upset, and then if you don&amp;#39;t kill yourself, they&amp;#39;ll think you were just looking for attention, or they&amp;#39;d resent you for making them worry.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Throwaway account...\n\nI could go into all the reasons for why I'm like this, but I don't see the point.  I've dealt with severe depression for nearly a decade, I've tried every goddamn thing I can think of (medicine, therapy, yoga, lifestyle changes, even moving across the country).  It doesn't matter, at some point I come back to this intense feeling of being unlovable.  That I'm tired of being alive.  Yes, I know it's wrong to think that and I even understand there are people who would be affected by my death, but I'm getting to that point again where that realization has little affect on me.  It's not that I don't care about them, but I do think they would get over it.  And I'm tired of staying miserably alive just to keep someone else from going through a grief process that they'd move on from.  Before I get called too selfish, consider I'm a teacher, so I've held off all school year from doing anything harmful.  What I think is I could leave the state and do it over the summer so the kids wouldn't ever find out.  They'd just think I moved away.  \n\nBut I don't know how to do it.  I don't want to just make myself worse by botching an attempt.  Even with a gun, I once listened to a recording somewhere online of a guy who shot himself in the head and obviously lived.  I don't want to turn into a vegetable and be a financial burden on someone else.  Every time I try to find a method that would surely work I see some problem with it.  I'm thinking right now if I overdosed and combined it with alcohol that'd might work.  Or strangle myself.  \n\nI feel bad writing this because I know my mom would be devastated.  But I'm so tired of living like this.  I've done so much to try to change my life and it always comes back to me feeling so utterly trapped.  The worst part is you of course can't actually talk about this with anyone you know.  They'd be upset, and then if you don't kill yourself, they'll think you were just looking for attention, or they'd resent you for making them worry.  \n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bssp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TAworldcomingdown", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bssp/im_making_plans_but_i_cant_figure_out_the_method/", "name": "t3_25bssp", "created": 1399890374.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bssp/im_making_plans_but_i_cant_figure_out_the_method/", "author_flair_text": null, "title": "I'm making plans, but I can't figure out the method", "created_utc": 1399861574.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfqkmp", "gilded": 0, "author": "TAworldcomingdown", "parent_id": "t1_chfn5a4", "approved_by": null, "body": "i hesitate to try to answer the cause of the depression.  other people go through far worse than i ever have in life and deal with it just fine.  rationally, i understand that life is not about being \"happy\" but about accepting the good and bad equally.  I get that, but it doesn't change how I feel.  I think there's something wrong with my brain that leads to depression.  A trigger seems to be loneliness.  Different kinds of loneliness.  But lately it's stress of job, relationship, isolation...everything and I feel like I'm trapped in certain areas.  The thought of just getting up and moving and trying something new has occurred to me, but at this point I figure I'll just come back to feeling like this again.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i hesitate to try to answer the cause of the depression.  other people go through far worse than i ever have in life and deal with it just fine.  rationally, i understand that life is not about being &amp;quot;happy&amp;quot; but about accepting the good and bad equally.  I get that, but it doesn&amp;#39;t change how I feel.  I think there&amp;#39;s something wrong with my brain that leads to depression.  A trigger seems to be loneliness.  Different kinds of loneliness.  But lately it&amp;#39;s stress of job, relationship, isolation...everything and I feel like I&amp;#39;m trapped in certain areas.  The thought of just getting up and moving and trying something new has occurred to me, but at this point I figure I&amp;#39;ll just come back to feeling like this again.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bssp", "score_hidden": false, "name": "t1_chfqkmp", "created": 1399900551.0, "author_flair_text": null, "created_utc": 1399871751.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfn5a4", "gilded": 0, "author": "enkidu76", "parent_id": "t3_25bssp", "approved_by": null, "body": "hey, i don't know if i can be any use, but i'm writing cause i'm a teacher too, though out of work for a while. i've been having some major issues myself and i don't judge you for your decision. i don't think anyone here will give you tips on how to carry out the act, though i assume you're smart enough to plan it properly. do you know the cause of the depression if i may ask?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey, i don&amp;#39;t know if i can be any use, but i&amp;#39;m writing cause i&amp;#39;m a teacher too, though out of work for a while. i&amp;#39;ve been having some major issues myself and i don&amp;#39;t judge you for your decision. i don&amp;#39;t think anyone here will give you tips on how to carry out the act, though i assume you&amp;#39;re smart enough to plan it properly. do you know the cause of the depression if i may ask?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bssp", "score_hidden": false, "name": "t1_chfn5a4", "created": 1399891349.0, "author_flair_text": null, "created_utc": 1399862549.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgohhm", "gilded": 0, "author": "TAworldcomingdown", "parent_id": "t3_25bssp", "approved_by": null, "body": "someone responded to my post, asking me to PM them.  I wanted to wait until returning from work today, and now the message is deleted.  I have no idea how to contact them, or why they deleted what seemed an empathetic message.  This hurts.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;someone responded to my post, asking me to PM them.  I wanted to wait until returning from work today, and now the message is deleted.  I have no idea how to contact them, or why they deleted what seemed an empathetic message.  This hurts.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bssp", "score_hidden": false, "name": "t1_chgohhm", "created": 1399994985.0, "author_flair_text": null, "created_utc": 1399966185.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]