[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m exhasuted.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a 27-year-old female.  I know that in the grand scheme I&amp;#39;m rather young, but I feel like I&amp;#39;ve made a ton of mistakes in my life up to this point.&lt;/p&gt;\n\n&lt;p&gt;When I was in school, I didn&amp;#39;t have many friends.  I participated in sports and clubs, but I didn&amp;#39;t go out much and was mostly a loner.  In college I broke out of my shell a bit and made some good friends and ended up having sex a couple times, but I never had an actual relationship.   As soon as I graduated, I moved back to my hometown and have been more or less suffering ever since.&lt;/p&gt;\n\n&lt;p&gt;A lot of people tell me that I don&amp;#39;t have &amp;quot;real&amp;quot; problems; my immediate family is all alive and doing well for themselves.  I have a job and I have decent health.  But I have no real connections with people.  I don&amp;#39;t know how.  I go out sometimes, but I don&amp;#39;t make friendships with people despite being talkative and social.  I live alone and I spend most of my nights alone.  I buy nice things for my apartment even though no one ever comes over (so coming home ends up a reminder of how lonely I am).  I don&amp;#39;t have people I feel comfortable to just call up who would go out and do things with me.  I haven&amp;#39;t had sex since college.  I haven&amp;#39;t dated since college.  At work I am constantly being talked to about coming across as negative or not smiling enough and am on the verge of being fired despite getting my work done well and on time, and I&amp;#39;ve worked at this job for three years (only in the last year did it start going downhill like this).  Whenever I fix a problem, they tell me I&amp;#39;m doing something else wrong.  This job pays exceptionally well and has benefits that I need, so quitting isn&amp;#39;t an option unless I find something good to replace it, which I haven&amp;#39;t yet (I recently interviewed at a nice place but was denied the position).&lt;/p&gt;\n\n&lt;p&gt;Basically - I&amp;#39;m tired of feeling abnormal. I&amp;#39;m tired of being alone all the time. And most of all I&amp;#39;m tired of having so many people tell me what I&amp;#39;m doing wrong.  I don&amp;#39;t want to be like this forever, but considering I&amp;#39;ve been like this most of my life (with the exception of some parts of college) I don&amp;#39;t forsee much changing.  I&amp;#39;m broken, and the only reason I don&amp;#39;t just off myself is because it would make my parents upset.  It&amp;#39;s harder and harder to interact with people because I have to fake happiness and lie about what I spend my time doing (&amp;quot;Oh I was home alone last night!&amp;quot;).  &lt;/p&gt;\n\n&lt;p&gt;I just want to feel like I&amp;#39;m doing things the right way. I want to feel wanted by other people.  I want to feel like I&amp;#39;m living my life well.  I&amp;#39;m tired of getting shit on by work and my social life and my lack of relationship (when I&amp;#39;m almost 30 years old).&lt;/p&gt;\n\n&lt;p&gt;This is stupid. Life is stupid. Life is really fucking stupid.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm exhasuted.\n\nI'm a 27-year-old female.  I know that in the grand scheme I'm rather young, but I feel like I've made a ton of mistakes in my life up to this point.\n\nWhen I was in school, I didn't have many friends.  I participated in sports and clubs, but I didn't go out much and was mostly a loner.  In college I broke out of my shell a bit and made some good friends and ended up having sex a couple times, but I never had an actual relationship.   As soon as I graduated, I moved back to my hometown and have been more or less suffering ever since.\n\nA lot of people tell me that I don't have \"real\" problems; my immediate family is all alive and doing well for themselves.  I have a job and I have decent health.  But I have no real connections with people.  I don't know how.  I go out sometimes, but I don't make friendships with people despite being talkative and social.  I live alone and I spend most of my nights alone.  I buy nice things for my apartment even though no one ever comes over (so coming home ends up a reminder of how lonely I am).  I don't have people I feel comfortable to just call up who would go out and do things with me.  I haven't had sex since college.  I haven't dated since college.  At work I am constantly being talked to about coming across as negative or not smiling enough and am on the verge of being fired despite getting my work done well and on time, and I've worked at this job for three years (only in the last year did it start going downhill like this).  Whenever I fix a problem, they tell me I'm doing something else wrong.  This job pays exceptionally well and has benefits that I need, so quitting isn't an option unless I find something good to replace it, which I haven't yet (I recently interviewed at a nice place but was denied the position).\n\nBasically - I'm tired of feeling abnormal. I'm tired of being alone all the time. And most of all I'm tired of having so many people tell me what I'm doing wrong.  I don't want to be like this forever, but considering I've been like this most of my life (with the exception of some parts of college) I don't forsee much changing.  I'm broken, and the only reason I don't just off myself is because it would make my parents upset.  It's harder and harder to interact with people because I have to fake happiness and lie about what I spend my time doing (\"Oh I was home alone last night!\").  \n\nI just want to feel like I'm doing things the right way. I want to feel wanted by other people.  I want to feel like I'm living my life well.  I'm tired of getting shit on by work and my social life and my lack of relationship (when I'm almost 30 years old).\n\nThis is stupid. Life is stupid. Life is really fucking stupid.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ldd2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Dontthrowmeawayok", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ldd2/im_negative_and_all_i_get_is_negativity/", "name": "t3_24ldd2", "created": 1399112735.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ldd2/im_negative_and_all_i_get_is_negativity/", "author_flair_text": null, "title": "I'm negative and all I get is negativity", "created_utc": 1399083935.0, "ups": 7, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch89rq6", "gilded": 0, "author": "pangie12", "parent_id": "t1_ch89pm9", "approved_by": null, "body": "I will be your friend. I know its the internet and words dont help much. But Im stilll a human being and Id like to be your friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will be your friend. I know its the internet and words dont help much. But Im stilll a human being and Id like to be your friend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch89rq6", "created": 1399114789.0, "author_flair_text": null, "created_utc": 1399085989.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch89pm9", "gilded": 0, "author": "Dontthrowmeawayok", "parent_id": "t1_ch89gxc", "approved_by": null, "body": "Of course I'd like a friend.  But I don't have them. I go to work and everyone is making plans and I'm the weird \"negative\" one with the action plan and the problems who goes home alone at night.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course I&amp;#39;d like a friend.  But I don&amp;#39;t have them. I go to work and everyone is making plans and I&amp;#39;m the weird &amp;quot;negative&amp;quot; one with the action plan and the problems who goes home alone at night.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch89pm9", "created": 1399114630.0, "author_flair_text": null, "created_utc": 1399085830.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch89gxc", "gilded": 0, "author": "pangie12", "parent_id": "t3_24ldd2", "approved_by": null, "body": "Your right. Life is stupid and we all are tired. But somehow we keep living. Weird right? I think you need a friend or someone who will love you or talk to you. Would you like a friend?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your right. Life is stupid and we all are tired. But somehow we keep living. Weird right? I think you need a friend or someone who will love you or talk to you. Would you like a friend?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch89gxc", "created": 1399113994.0, "author_flair_text": null, "created_utc": 1399085194.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8ag6w", "gilded": 0, "author": "Sirtet", "parent_id": "t1_ch8a7lj", "approved_by": null, "body": "Not a big dog, The Slut-mut is only 20lbs, big enough to hold and cuddly with, small enough to take anywhere I want to go.. His real name is Murph E,Dog.. This is a no no here. but the trip FB account might still be up. I used a fake last name..*don't need unwanted followers following me home lol* But Its *jerry Murphy matney* the photo is of old cartoon characters  droopy and drooper, I think most of the photos from the trip should still be up. i did the trip two years ago enjoy.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not a big dog, The Slut-mut is only 20lbs, big enough to hold and cuddly with, small enough to take anywhere I want to go.. His real name is Murph E,Dog.. This is a no no here. but the trip FB account might still be up. I used a fake last name..&lt;em&gt;don&amp;#39;t need unwanted followers following me home lol&lt;/em&gt; But Its &lt;em&gt;jerry Murphy matney&lt;/em&gt; the photo is of old cartoon characters  droopy and drooper, I think most of the photos from the trip should still be up. i did the trip two years ago enjoy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch8ag6w", "created": 1399116694.0, "author_flair_text": null, "created_utc": 1399087894.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8a7lj", "gilded": 0, "author": "Dontthrowmeawayok", "parent_id": "t1_ch8a0wg", "approved_by": null, "body": "I'll look into it.  I definitely need something positive and fulfilling in my life.  Thanks.  Hopefully I don't fuck it up like I have with so much else in my life, but it seems to be working for you.  I'll have to get a dog too.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll look into it.  I definitely need something positive and fulfilling in my life.  Thanks.  Hopefully I don&amp;#39;t fuck it up like I have with so much else in my life, but it seems to be working for you.  I&amp;#39;ll have to get a dog too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch8a7lj", "created": 1399116019.0, "author_flair_text": null, "created_utc": 1399087219.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch8a0wg", "gilded": 0, "author": "Sirtet", "parent_id": "t1_ch89rw1", "approved_by": null, "body": "On the contrary, many female have done the trip alone. Go to Adventure cycling as I stated, and go to r/biketouring. also there are sitewhere you can find folks to ride with ***OR*** go on a Adventure cycling group tour. They provide a van to carry your items, while you peddle your heart out to the next camp spot.\n\nDo me a favor.. look it up, look into it. You don't have to go 4k miles, anything over 100 miles is considered a tour. And you don't need a $800 bike to do it, Mine was and still is a P.O.S. but it rides well enough to get me around on warm days.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the contrary, many female have done the trip alone. Go to Adventure cycling as I stated, and go to r/biketouring. also there are sitewhere you can find folks to ride with &lt;strong&gt;&lt;em&gt;OR&lt;/em&gt;&lt;/strong&gt; go on a Adventure cycling group tour. They provide a van to carry your items, while you peddle your heart out to the next camp spot.&lt;/p&gt;\n\n&lt;p&gt;Do me a favor.. look it up, look into it. You don&amp;#39;t have to go 4k miles, anything over 100 miles is considered a tour. And you don&amp;#39;t need a $800 bike to do it, Mine was and still is a P.O.S. but it rides well enough to get me around on warm days.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch8a0wg", "created": 1399115500.0, "author_flair_text": null, "created_utc": 1399086700.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch89rw1", "gilded": 0, "author": "Dontthrowmeawayok", "parent_id": "t1_ch89gy1", "approved_by": null, "body": "That sounds really exciting, actually, and I'm very happy that you found something to give your life meaning.  It sucks that you're this far along and have had to suffer so much.  No one deserves this kind of life.\n\nI'd really like to take a journey alone, but it's not as easy for a female.  \n\nAnd I do hate lonely adventures.\n\nThank you, though!  I bet you could write a pretty nice book about your experiences in life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds really exciting, actually, and I&amp;#39;m very happy that you found something to give your life meaning.  It sucks that you&amp;#39;re this far along and have had to suffer so much.  No one deserves this kind of life.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d really like to take a journey alone, but it&amp;#39;s not as easy for a female.  &lt;/p&gt;\n\n&lt;p&gt;And I do hate lonely adventures.&lt;/p&gt;\n\n&lt;p&gt;Thank you, though!  I bet you could write a pretty nice book about your experiences in life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch89rw1", "created": 1399114801.0, "author_flair_text": null, "created_utc": 1399086001.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch89gy1", "gilded": 0, "author": "Sirtet", "parent_id": "t3_24ldd2", "approved_by": null, "body": "If it wasn't for the *I'm 27 female* part I'd swear your in my head all the way to the 3rd paragraph. But Im over 40 and male. I get the same shit from people everyday.. except from one VERY important person in my life..My dog. He's my happiness, He doesn't bitch to much, he likes long walk anywhere, so much so,we did a cross country bike ride, but only made it to the Mississippi river from Yorktown Va. \n\nI've been this way for so long, Its all I know. and to be truthful, sitting this far back. you really get to see peoples true colors. I'm to the point I dont want to even socialize with the ladies at work,when I say ladies I don't mean females. I mean a bunch of guys that act like heckling hens at a gin rummy party. They call me weird, They say *Hey don't you ever smile?* My reply is. give me a reason to. Of course someone states *your alive*, yea but I'm not living. If I was younger, I'd be living. Now I'm broken and tired. My mind still has the drive, but the body is starting to crap out. However, I'm going to finish that trip. even if it kills me. That trip..My dog and i alone on the road, yes there were many other cyclist I met along the way, But man what a way to see life in a whole new way. There were days that it was scary, but when the sun came up I Knew I was alive!!\n\nAdventure Cycling.. route 76, 4,246 mile of open road and hundreds of beautiful people and places to see..Look it up! Then go to /r/biketouring and ask questions. they helped me prepare for it.. Baby girl i know you don't know me from Adams cat, But your over due for a journey, and your soul is telling you it and the signs are all over the place. Just like they were for me.\n\nStop living someone else dream, live your own, do it now while your young....***GO HAVE FUN*** regardless of what someone else thinks. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it wasn&amp;#39;t for the &lt;em&gt;I&amp;#39;m 27 female&lt;/em&gt; part I&amp;#39;d swear your in my head all the way to the 3rd paragraph. But Im over 40 and male. I get the same shit from people everyday.. except from one VERY important person in my life..My dog. He&amp;#39;s my happiness, He doesn&amp;#39;t bitch to much, he likes long walk anywhere, so much so,we did a cross country bike ride, but only made it to the Mississippi river from Yorktown Va. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been this way for so long, Its all I know. and to be truthful, sitting this far back. you really get to see peoples true colors. I&amp;#39;m to the point I dont want to even socialize with the ladies at work,when I say ladies I don&amp;#39;t mean females. I mean a bunch of guys that act like heckling hens at a gin rummy party. They call me weird, They say &lt;em&gt;Hey don&amp;#39;t you ever smile?&lt;/em&gt; My reply is. give me a reason to. Of course someone states &lt;em&gt;your alive&lt;/em&gt;, yea but I&amp;#39;m not living. If I was younger, I&amp;#39;d be living. Now I&amp;#39;m broken and tired. My mind still has the drive, but the body is starting to crap out. However, I&amp;#39;m going to finish that trip. even if it kills me. That trip..My dog and i alone on the road, yes there were many other cyclist I met along the way, But man what a way to see life in a whole new way. There were days that it was scary, but when the sun came up I Knew I was alive!!&lt;/p&gt;\n\n&lt;p&gt;Adventure Cycling.. route 76, 4,246 mile of open road and hundreds of beautiful people and places to see..Look it up! Then go to &lt;a href=\"/r/biketouring\"&gt;/r/biketouring&lt;/a&gt; and ask questions. they helped me prepare for it.. Baby girl i know you don&amp;#39;t know me from Adams cat, But your over due for a journey, and your soul is telling you it and the signs are all over the place. Just like they were for me.&lt;/p&gt;\n\n&lt;p&gt;Stop living someone else dream, live your own, do it now while your young....&lt;strong&gt;&lt;em&gt;GO HAVE FUN&lt;/em&gt;&lt;/strong&gt; regardless of what someone else thinks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ldd2", "score_hidden": false, "name": "t1_ch89gy1", "created": 1399113995.0, "author_flair_text": null, "created_utc": 1399085195.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]