[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been texting with a girl I met online for a while, and now shes started to open up and talking about considering suicide. I just want to get the fuck out but she seems really obsessed about me and I feel like if I leave now that might just push her over the edge. I&amp;#39;ve told her to talk to a professional. What can I do? Please help. We live in totally different parts of the world aswell.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been texting with a girl I met online for a while, and now shes started to open up and talking about considering suicide. I just want to get the fuck out but she seems really obsessed about me and I feel like if I leave now that might just push her over the edge. I've told her to talk to a professional. What can I do? Please help. We live in totally different parts of the world aswell.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241kez", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwaway2131245", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241kez/im_not_equipped_to_deal_with_this/", "name": "t3_241kez", "created": 1398562865.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241kez/im_not_equipped_to_deal_with_this/", "author_flair_text": null, "title": "I'm not equipped to deal with this.", "created_utc": 1398534065.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2xsed", "gilded": 0, "author": "the_splatt", "parent_id": "t3_241kez", "approved_by": null, "body": "Remember that you're not responsible for her.  That's the most important thing here IMO, because it can be very easy to feel guilt and responsibility for a person who's feeling this way even when you shouldn't have to.\n\nWhy do you want to stop speaking with her?  Is that about the situation being too difficult for you to cope with, or some other reason?  It's tricky, because she seems to have concluded that you're a safe and trustworthy person to release her thoughts to, but if you don't want to be that person and you simply walk away it could very well be the last straw for her.  On the other side of the coin, it might not be and it might encourage her to get help.\n\nIn this situation I would ask myself whether I just don't want to talk to her anymore or whether it's her opening up to me tha I'm wanting to stop.  Is it worth just being straight with her - that you don't have the capacity to help her and you need to stop to protect yourself?  Or can your friendship be salvaged somehow if you give her a bit of support - tell her you care and that you'd like her t get help from somebody who can actually help her?\n\nThe problem with these situations is that you can easily become the only person she speaks to about this, and every single conversation can end up being about her and her depression, which can be exhausting for you, particularly if you have nothing invested in the friendship.\n\nThink about why you want to stop speaking with her, think about whether you can offer support without feeling responsible for her actions, and be as honest as you can about it if you decide to stop interacting with her.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember that you&amp;#39;re not responsible for her.  That&amp;#39;s the most important thing here IMO, because it can be very easy to feel guilt and responsibility for a person who&amp;#39;s feeling this way even when you shouldn&amp;#39;t have to.&lt;/p&gt;\n\n&lt;p&gt;Why do you want to stop speaking with her?  Is that about the situation being too difficult for you to cope with, or some other reason?  It&amp;#39;s tricky, because she seems to have concluded that you&amp;#39;re a safe and trustworthy person to release her thoughts to, but if you don&amp;#39;t want to be that person and you simply walk away it could very well be the last straw for her.  On the other side of the coin, it might not be and it might encourage her to get help.&lt;/p&gt;\n\n&lt;p&gt;In this situation I would ask myself whether I just don&amp;#39;t want to talk to her anymore or whether it&amp;#39;s her opening up to me tha I&amp;#39;m wanting to stop.  Is it worth just being straight with her - that you don&amp;#39;t have the capacity to help her and you need to stop to protect yourself?  Or can your friendship be salvaged somehow if you give her a bit of support - tell her you care and that you&amp;#39;d like her t get help from somebody who can actually help her?&lt;/p&gt;\n\n&lt;p&gt;The problem with these situations is that you can easily become the only person she speaks to about this, and every single conversation can end up being about her and her depression, which can be exhausting for you, particularly if you have nothing invested in the friendship.&lt;/p&gt;\n\n&lt;p&gt;Think about why you want to stop speaking with her, think about whether you can offer support without feeling responsible for her actions, and be as honest as you can about it if you decide to stop interacting with her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241kez", "score_hidden": false, "name": "t1_ch2xsed", "created": 1398562221.0, "author_flair_text": null, "created_utc": 1398558621.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]