[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might not be the best subreddit for this. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had suicidal ideations since I was 6 -- mostly the product of an unstable home environment -- so as far back as I can remember it was my backup plan for any conflict. Whenever something went wrong I&amp;#39;d think about how I could just die and not have to deal with anything anymore. Obviously this hasn&amp;#39;t happened, but I&amp;#39;ve tried twice.&lt;/p&gt;\n\n&lt;p&gt;I honestly don&amp;#39;t know what it&amp;#39;s like to not have that on your radar, or at least a general sense that your life can be ended that easily. It&amp;#39;s a little unreal to me that many people don&amp;#39;t think about it at all. I see a shrink for this (and related issues) and I guess the most disheartening part is that he&amp;#39;s told me it might just be something I experience for the rest of my life, and could only minimize or ignore. &lt;/p&gt;\n\n&lt;p&gt;Anyway, maybe someone on this sub can relate a little to growing up with that perspective. I had really hoped that through therapy I&amp;#39;d be &amp;#39;fixed&amp;#39; and suicide wouldn&amp;#39;t be on my mind anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This might not be the best subreddit for this. \n\nI've had suicidal ideations since I was 6 -- mostly the product of an unstable home environment -- so as far back as I can remember it was my backup plan for any conflict. Whenever something went wrong I'd think about how I could just die and not have to deal with anything anymore. Obviously this hasn't happened, but I've tried twice.\n\n\nI honestly don't know what it's like to not have that on your radar, or at least a general sense that your life can be ended that easily. It's a little unreal to me that many people don't think about it at all. I see a shrink for this (and related issues) and I guess the most disheartening part is that he's told me it might just be something I experience for the rest of my life, and could only minimize or ignore. \n\nAnyway, maybe someone on this sub can relate a little to growing up with that perspective. I had really hoped that through therapy I'd be 'fixed' and suicide wouldn't be on my mind anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24r94l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway05052014", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24r94l/im_not_a_suicide_risk_atm_just_might_have_these/", "name": "t3_24r94l", "created": 1399300611.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24r94l/im_not_a_suicide_risk_atm_just_might_have_these/", "author_flair_text": null, "title": "I'm not a suicide risk atm, just might have these thoughts forever and I feel pretty bummed about it", "created_utc": 1399271811.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9xryj", "gilded": 0, "author": "electric-six", "parent_id": "t3_24r94l", "approved_by": null, "body": "It wasn't on my mind as a child. But as an adult, serious relationship break ups have driven suicide high to my agenda. I just don't wish to feel the pain anymore. all you can do is struggle as hard as you can. \n\nthe only person who ever loves you, is yourself. That's all you can do.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t on my mind as a child. But as an adult, serious relationship break ups have driven suicide high to my agenda. I just don&amp;#39;t wish to feel the pain anymore. all you can do is struggle as hard as you can. &lt;/p&gt;\n\n&lt;p&gt;the only person who ever loves you, is yourself. That&amp;#39;s all you can do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r94l", "score_hidden": false, "name": "t1_ch9xryj", "created": 1399311486.0, "author_flair_text": null, "created_utc": 1399282686.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]