[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not angry, I feel rather peaceful, actually. To give a back story, I&amp;#39;ve had major depressive disorder since I was young, I&amp;#39;m now 22. My birthday was Friday, which reminds me, I hate my birthday. Anyways, last year I was prescribed fluoxitine and abilify. Im now on bristillex (spelling?) as well which I was just prescribed on Wednesday for being suicidal. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost all feelings of connection from my husband and daughter. I told my husband about a month ago I no longer loved him. I began to have a sexual affair for a week to sabotage our relationship to show him just how awful I was and that he would be better off without me. He still loves me and I almost pity him. I know he can and will find someone better if he just tried. I&amp;#39;d like a better mother for my daughter as well, I&amp;#39;m just so screwed up, I don&amp;#39;t want the same thing happening to her. I can&amp;#39;t just leave though which you&amp;#39;ll see why soon.&lt;/p&gt;\n\n&lt;p&gt;I tried but failed committing suicide a month ago. It just physically hurt too much. I tried cutting my wrists and my husband walked in. Every sharp object in our house has been confiscated. &lt;/p&gt;\n\n&lt;p&gt;I have a new plan. My husband plans on starting school this fall and in two years he should have a degree. When I move on, I want him and my daughter to be well off. He basically has a good job lined up for him once he finishes but he won&amp;#39;t be able to attend school unless I&amp;#39;m around to help. As you see, I have plenty of time to get all my affairs together. Down the road I&amp;#39;ll pick a date. &lt;/p&gt;\n\n&lt;p&gt;My family tried to have me committed last weekend. I convinced them not to. It would ruin my career if I ever was. I work with vulnerable adults. &lt;/p&gt;\n\n&lt;p&gt;I have not talked to any of my friends. At this point, when I try, I&amp;#39;m ignored or hide my feelings. I&amp;#39;ve lost all connections to most people I know and I continue to ignore anyone that reaches out. Eventually they will stop trying and resent me. I want my death to be a weight that&amp;#39;s lifted rather than burdened. &lt;/p&gt;\n\n&lt;p&gt;I guess, I want to know if anyone has ever felt losing connection to everyone they once loved before. It&amp;#39;s something I&amp;#39;ve never felt. Well, absence of feeling anyway. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so alone. Sometimes I wish I had people to go. Maybe find a chance to better my life but most of my time I just know I&amp;#39;m ready to go. I have a while to get my affairs I&amp;#39;m order and plenty of time to change my mind, maybe, if anything ever changes. Not to be dramatic but just existing, living and breathing, is exhausting. I&amp;#39;m so incredibly numb to everything. I&amp;#39;ll just live like it&amp;#39;s my job to. &lt;/p&gt;\n\n&lt;p&gt;Thanks for reading if you did. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not angry, I feel rather peaceful, actually. To give a back story, I've had major depressive disorder since I was young, I'm now 22. My birthday was Friday, which reminds me, I hate my birthday. Anyways, last year I was prescribed fluoxitine and abilify. Im now on bristillex (spelling?) as well which I was just prescribed on Wednesday for being suicidal. \n\nI've lost all feelings of connection from my husband and daughter. I told my husband about a month ago I no longer loved him. I began to have a sexual affair for a week to sabotage our relationship to show him just how awful I was and that he would be better off without me. He still loves me and I almost pity him. I know he can and will find someone better if he just tried. I'd like a better mother for my daughter as well, I'm just so screwed up, I don't want the same thing happening to her. I can't just leave though which you'll see why soon.\n\nI tried but failed committing suicide a month ago. It just physically hurt too much. I tried cutting my wrists and my husband walked in. Every sharp object in our house has been confiscated. \n\nI have a new plan. My husband plans on starting school this fall and in two years he should have a degree. When I move on, I want him and my daughter to be well off. He basically has a good job lined up for him once he finishes but he won't be able to attend school unless I'm around to help. As you see, I have plenty of time to get all my affairs together. Down the road I'll pick a date. \n\nMy family tried to have me committed last weekend. I convinced them not to. It would ruin my career if I ever was. I work with vulnerable adults. \n\nI have not talked to any of my friends. At this point, when I try, I'm ignored or hide my feelings. I've lost all connections to most people I know and I continue to ignore anyone that reaches out. Eventually they will stop trying and resent me. I want my death to be a weight that's lifted rather than burdened. \n\nI guess, I want to know if anyone has ever felt losing connection to everyone they once loved before. It's something I've never felt. Well, absence of feeling anyway. \n\nI'm so alone. Sometimes I wish I had people to go. Maybe find a chance to better my life but most of my time I just know I'm ready to go. I have a while to get my affairs I'm order and plenty of time to change my mind, maybe, if anything ever changes. Not to be dramatic but just existing, living and breathing, is exhausting. I'm so incredibly numb to everything. I'll just live like it's my job to. \n\nThanks for reading if you did. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "244eoj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Bwhite0425", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/244eoj/im_not_sure_what_i_want/", "name": "t3_244eoj", "created": 1398653332.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/244eoj/im_not_sure_what_i_want/", "author_flair_text": null, "title": "I'm not sure what I want", "created_utc": 1398624532.0, "ups": 7, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4m7w5", "gilded": 0, "author": "Bwhite0425", "parent_id": "t1_ch3ihpe", "approved_by": null, "body": "Thank you. I think I'm going to give the 5 year plan a try and maybe set up some goals for myself. I thought about it all day yesterday and it made me feel slightly more hopeful that maybe I could have a future. \n\n My  husband and I have our very first day of marriage counseling this Friday. I hope it at least gets the ball rolling in some sort of direction. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I think I&amp;#39;m going to give the 5 year plan a try and maybe set up some goals for myself. I thought about it all day yesterday and it made me feel slightly more hopeful that maybe I could have a future. &lt;/p&gt;\n\n&lt;p&gt;My  husband and I have our very first day of marriage counseling this Friday. I hope it at least gets the ball rolling in some sort of direction. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244eoj", "score_hidden": false, "name": "t1_ch4m7w5", "created": 1398735586.0, "author_flair_text": null, "created_utc": 1398731986.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3ihpe", "gilded": 0, "author": "Toitles_Are_Awesome", "parent_id": "t3_244eoj", "approved_by": null, "body": "It sounds like your daughter is a big part of your world, as she should be.\nI don't have any kids myself, but I feel if I did, they would certainly be the center of my universe.\n\nIt's okay not to love someone anymore. In a situation like this, I think there two things that you need to pay mind to. First, the happiness of your daughter. And second, your happiness. \n\nI'm not saying you need to divorce, but if you think the only way to get your life together, and at the same time being a part of your daughter's, is by getting a divorce, then perhaps it should be of consideration.\n\nIf you have the ability, take a weekend off to formulate a 5, 10, 15 year plan. Determine what you want to do, who you want to do it with, and do your best to stick with it.\n\nFrom what you've posted, there are people who are willing to help you. Your husband and family love you and want to help you. Don't be afraid to ask for their help with issues.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your daughter is a big part of your world, as she should be.\nI don&amp;#39;t have any kids myself, but I feel if I did, they would certainly be the center of my universe.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s okay not to love someone anymore. In a situation like this, I think there two things that you need to pay mind to. First, the happiness of your daughter. And second, your happiness. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you need to divorce, but if you think the only way to get your life together, and at the same time being a part of your daughter&amp;#39;s, is by getting a divorce, then perhaps it should be of consideration.&lt;/p&gt;\n\n&lt;p&gt;If you have the ability, take a weekend off to formulate a 5, 10, 15 year plan. Determine what you want to do, who you want to do it with, and do your best to stick with it.&lt;/p&gt;\n\n&lt;p&gt;From what you&amp;#39;ve posted, there are people who are willing to help you. Your husband and family love you and want to help you. Don&amp;#39;t be afraid to ask for their help with issues.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244eoj", "score_hidden": false, "name": "t1_ch3ihpe", "created": 1398656813.0, "author_flair_text": null, "created_utc": 1398628013.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]