[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 19 yrs old (male), have no job, have no close friends or anybody to hang with.&lt;/p&gt;\n\n&lt;p&gt;I live in my room, I&amp;#39;m skrawny as fuck (which is where my depression started from, I hate my body and myself) I&amp;#39;m gonna turn 20 this year and I can&amp;#39;t handle watching the world progress, while I rest in my thorns.&lt;/p&gt;\n\n&lt;p&gt;My life from the start was a unhealthy start.&lt;/p&gt;\n\n&lt;p&gt;My mother drank her problems away while at my young age, watching her by the side lines, I always told her to stop because I HATED when she drank. I hated when she&amp;#39;d become this tipsy person that I didn&amp;#39;t understand, but my tears didn&amp;#39;t really show that I was hurt... apparently.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not gonna put all my life&amp;#39;s mental/physical problems on her though, she has gone through a lot too. She lost a LONG loved sister that she could barely spend a day without. Then she ends up losing a father to a heart attack (an abusive-alcoholic-father really) but she ended up losing a father she loved. She loses a sister in law who she clicks with, to a man that was drunk on the highway as she tried to walk drunkenly to her son who was visiting at grandmothers... she takes a tumble under a van that took her life. &lt;/p&gt;\n\n&lt;p&gt;Friends come and go, but Best Friends come so often.&lt;/p&gt;\n\n&lt;p&gt;I was raped as a child. I didn&amp;#39;t know that having sex at 5 years old was wrong. You know you have to get erect to perform such actions right?... and I did, I did... don&amp;#39;t get me wrong I liked it... But at the time, I didn&amp;#39;t know how much this would affect myself esteem and self image in the later years.&lt;/p&gt;\n\n&lt;p&gt;I struggle throughout high school then dropped out of school in grade 11 (I know, JUST ONE MORE YEAR!) but someone as depressed as I was and is right now, knows, I ain&amp;#39;t gonna get shit done...&lt;/p&gt;\n\n&lt;p&gt;I grew up without a dad.&lt;/p&gt;\n\n&lt;p&gt;I grew up with a mentally unhealthy mother.&lt;/p&gt;\n\n&lt;p&gt;I grew up with a dark secret, me, my sister and her older friends share. (I was 5, my sister 10 and her friend a year older or so)&lt;/p&gt;\n\n&lt;p&gt;I have thoughts of suicide, but to me suicide is an option I&amp;#39;m not going to grab right away. I want to live too, I look at other people&amp;#39;s lives, then compare it to mine then I realize how small I am. It&amp;#39;s unhealthy, no one in my family understands cause they are used to being this low (and they don&amp;#39;t see that much of a problem with it) I want to be that person that is the first Canadian Native to be successful and mainstream. :) ah, I love dreaming about it.&lt;/p&gt;\n\n&lt;p&gt;I still think about just checking out every now and then, but I try to remind myself I want to be known and I want to leave a mark on this world, cause I haven&amp;#39;t heard much of a famous actor who is a MAINSTREAM first nations cree native... haha... will I see the day :D&lt;/p&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;p&gt;Sorry if I&amp;#39;m uncoordinated and shooting everywhere, I just want to get this out. (I&amp;#39;m drunk right now! HOLLA!!!)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m depressed and scared I&amp;#39;ll hurt myself someday, but I won&amp;#39;t anytime soon, but one of the compliments that keeps me alive is HOT WOMAN FIND ME VERY VERY HANDSOME! :D Thank you ladies!! Love you too!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 19 yrs old (male), have no job, have no close friends or anybody to hang with.\n\nI live in my room, I'm skrawny as fuck (which is where my depression started from, I hate my body and myself) I'm gonna turn 20 this year and I can't handle watching the world progress, while I rest in my thorns.\n\nMy life from the start was a unhealthy start.\n\nMy mother drank her problems away while at my young age, watching her by the side lines, I always told her to stop because I HATED when she drank. I hated when she'd become this tipsy person that I didn't understand, but my tears didn't really show that I was hurt... apparently.\n\nI'm not gonna put all my life's mental/physical problems on her though, she has gone through a lot too. She lost a LONG loved sister that she could barely spend a day without. Then she ends up losing a father to a heart attack (an abusive-alcoholic-father really) but she ended up losing a father she loved. She loses a sister in law who she clicks with, to a man that was drunk on the highway as she tried to walk drunkenly to her son who was visiting at grandmothers... she takes a tumble under a van that took her life. \n\nFriends come and go, but Best Friends come so often.\n\nI was raped as a child. I didn't know that having sex at 5 years old was wrong. You know you have to get erect to perform such actions right?... and I did, I did... don't get me wrong I liked it... But at the time, I didn't know how much this would affect myself esteem and self image in the later years.\n\nI struggle throughout high school then dropped out of school in grade 11 (I know, JUST ONE MORE YEAR!) but someone as depressed as I was and is right now, knows, I ain't gonna get shit done...\n\nI grew up without a dad.\n\nI grew up with a mentally unhealthy mother.\n\nI grew up with a dark secret, me, my sister and her older friends share. (I was 5, my sister 10 and her friend a year older or so)\n\nI have thoughts of suicide, but to me suicide is an option I'm not going to grab right away. I want to live too, I look at other people's lives, then compare it to mine then I realize how small I am. It's unhealthy, no one in my family understands cause they are used to being this low (and they don't see that much of a problem with it) I want to be that person that is the first Canadian Native to be successful and mainstream. :) ah, I love dreaming about it.\n\nI still think about just checking out every now and then, but I try to remind myself I want to be known and I want to leave a mark on this world, cause I haven't heard much of a famous actor who is a MAINSTREAM first nations cree native... haha... will I see the day :D\n\n...\n\nSorry if I'm uncoordinated and shooting everywhere, I just want to get this out. (I'm drunk right now! HOLLA!!!)\n\nI'm depressed and scared I'll hurt myself someday, but I won't anytime soon, but one of the compliments that keeps me alive is HOT WOMAN FIND ME VERY VERY HANDSOME! :D Thank you ladies!! Love you too!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24df22", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "simplistic_Throwaway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24df22/im_nobody_i_have_no_friends_ive_been_inside_my/", "name": "t3_24df22", "created": 1398899694.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24df22/im_nobody_i_have_no_friends_ive_been_inside_my/", "author_flair_text": null, "title": "I'm nobody, I have no friends, I've been inside my home for a long time and I think this is \"almost\" my goodbye...", "created_utc": 1398870894.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch60lee", "gilded": 0, "author": "thefrontpageofreddit", "parent_id": "t3_24df22", "approved_by": null, "body": "I'm your friend :). I'm here for you. If you would like you could PM me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m your friend :). I&amp;#39;m here for you. If you would like you could PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24df22", "score_hidden": false, "name": "t1_ch60lee", "created": 1398874954.0, "author_flair_text": null, "created_utc": 1398871354.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch610j2", "gilded": 0, "author": "powerrangers98", "parent_id": "t3_24df22", "approved_by": null, "body": "Hombre, seeking help is an already great thing to do.  Talking and writing about it will help you understand yourself better.  \n  \nNow, as far as comparing to other people, not only that you shouldn't, you probably should never.  All those successful people didn't get rape, most of them have mentally healthy parents, have a dad.  You are totally at the bottom man, you gotta get up.  All of us fall down and hurt our butt, but someone carried you in their arms and that person fell in the well, and now you grew and have to climb up.  You can't compare yourself to me, or anyone else.  You can only compare yourself to yourself, from now and your past.  It will be long years for you in the future, but guess what?  The harder you fight, the sweeter is your victory.  I hope you do well my friend.  Success stories are great to hear, I hope you become one of them.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hombre, seeking help is an already great thing to do.  Talking and writing about it will help you understand yourself better.  &lt;/p&gt;\n\n&lt;p&gt;Now, as far as comparing to other people, not only that you shouldn&amp;#39;t, you probably should never.  All those successful people didn&amp;#39;t get rape, most of them have mentally healthy parents, have a dad.  You are totally at the bottom man, you gotta get up.  All of us fall down and hurt our butt, but someone carried you in their arms and that person fell in the well, and now you grew and have to climb up.  You can&amp;#39;t compare yourself to me, or anyone else.  You can only compare yourself to yourself, from now and your past.  It will be long years for you in the future, but guess what?  The harder you fight, the sweeter is your victory.  I hope you do well my friend.  Success stories are great to hear, I hope you become one of them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24df22", "score_hidden": false, "name": "t1_ch610j2", "created": 1398901013.0, "author_flair_text": null, "created_utc": 1398872213.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch63inj", "gilded": 0, "author": "BenTproductionz", "parent_id": "t3_24df22", "approved_by": null, "body": "Have you tried counseling? It sounds like you have some deep issues you need to work out. At the very least, Im here to talk, if you need to vent. Venting is good.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried counseling? It sounds like you have some deep issues you need to work out. At the very least, Im here to talk, if you need to vent. Venting is good.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24df22", "score_hidden": false, "name": "t1_ch63inj", "created": 1398906021.0, "author_flair_text": null, "created_utc": 1398877221.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch63s69", "gilded": 0, "author": "texas_pride", "parent_id": "t3_24df22", "approved_by": null, "body": "PM me if you want to talk. I have a secret similar to yours and yeah....it is damaging to your outlook on life.  I can relate to a lot of the things you mentioned. Im not going to say much more here but im open to talk privately.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PM me if you want to talk. I have a secret similar to yours and yeah....it is damaging to your outlook on life.  I can relate to a lot of the things you mentioned. Im not going to say much more here but im open to talk privately.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24df22", "score_hidden": false, "name": "t1_ch63s69", "created": 1398906567.0, "author_flair_text": null, "created_utc": 1398877767.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]