[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to try to leave out personal details, but because of the necessary specifics it probably would not be hard to find out who I am. Please do not.&lt;/p&gt;\n\n&lt;p&gt;I am 16, almost 17, and male. I have some problems, but I&amp;#39;ll try to focus on whats really been bothering me.&lt;/p&gt;\n\n&lt;p&gt;My dad is really old considering my age. One of my half sisters is 30 years older than me. My dad was super influential in the creation of the internet. I don&amp;#39;t want to give specifics, but he had the first company of its kind in the early 80s. He&amp;#39;s a genius. Albeit mostly forgotten, but a truly amazing man. He wants me to be him. I don&amp;#39;t see what he sees in me, but I feel like I need to invent the next internet in the next two years to please him, and I constantly feel guilty for letting him down.&lt;/p&gt;\n\n&lt;p&gt;I get shitty grades. My weighted is a 3.0 on a 4.0 scale. All of my four siblings did better than that. It&amp;#39;s not the material, its the work. I just can&amp;#39;t focus on homework enough, getting in essays, studying on time etc. My parents revealed that they had me tested and found I have severe ADD, but didn&amp;#39;t tell me because they didn&amp;#39;t want me medicated. Once they realized I was suicidal, they put me on a stimulant. While it helped, I hate taking it. I feel like it makes me different. I only take it at school, sometimes, because I want to be myself at home. Unfortunately I really have trouble staying on task at home, where I&amp;#39;d probably get the most benefit. Schoolwork reminds me of how behind I am, and I seek comfort instead of confronting that I am destined to be homeless at this point. It&amp;#39;s not just laziness. At first when I started taking pills, I had hope, and pulled off nearly strait A&amp;#39;s for a quarter. I don&amp;#39;t know what happened, but those disappeared, and I am scared again. My parents actually promised I could get guitar lessons if I kept it up (I always wanted to play something) but those talks quickly vanished. &lt;/p&gt;\n\n&lt;p&gt;I started programming about a year ago. My tutor thinks I&amp;#39;m a fast learner, but in my AP comp sci class I miss deadlines simply because I find pages of gridworld too painfully monotonous to go through when I am miles ahead of the class. (simply because I came in with experience, I&amp;#39;m not a natural hacker). &lt;/p&gt;\n\n&lt;p&gt;I actually pretended to be a hacker in middle school in an online scam, and though I am kind of proud for making some decent cash and getting 100,000 views (ironically largely to satisfy my dad&amp;#39;s expectations of me) I realized I could never show him, as it is a shameful and illegal thing that only a 12 year old sociopath would consider a source of pride. I regret that this is something I consider a large part of my identity. &lt;/p&gt;\n\n&lt;p&gt;Back in October I took on a very very complicated project for the jailbreak community, over at &lt;a href=\"/r/jailbreak\"&gt;/r/jailbreak&lt;/a&gt;, and &lt;a href=\"/r/iosthemes\"&gt;/r/iosthemes&lt;/a&gt;. I realize doxxing is going to be easy, please don&amp;#39;t mention it if you manage to figure out who I am. People were so excited when I gave progress updates, the breakthroughs made me feel like I had a chance at meeting my father&amp;#39;s expectations. Tons of people seemed genuinely impressed with my work. The first release got a few hundred downloads, it felt great. My parents were sure that this and my SAT scores would compensate my GPA. I spent months of hard work on the next version, which got around 5 upvotes. I had one person constantly hounding me for updates, it became just another class with a angry disappointed teacher, telling me I was wasting my potential. Nobody cared, except for one freaking person, who was more upset at my lack of updates and breaking self-set deadlines that I made just to get some space than appreciative of what I had done. I stopped working on it. Everytime I see some fucker with a [developer] flair, I get a pain in my chest. They never gave me one.&lt;/p&gt;\n\n&lt;p&gt;I worked on a &amp;quot;theme&amp;quot; (see &lt;a href=\"/r/iosthemes\"&gt;/r/iosthemes&lt;/a&gt; for a definition) and it got tons of appreciation from the screenshots I posted. I spent forever on it. I pirated adobe CS6 and have taught myself basic AE and Flash, but am decent at Illustrator and Photoshop. My theme got rejected from the major Cydia repo, modmyi.com. At this point (sometime in January) I am constantly thinking of suicide. My escape from these thoughts had become another source of them. School was depressing, and this odd little slice of the internet had turned on me. Now I have become a vegetable, no longer producing, only consuming media online. I&amp;#39;m too afraid to even open up my IDE, and am behind in every class. I have dissapointed everyone, my dad, mom, brother, sisters, etc. They all just feel bad for me, as a socially awkward weirdo, except my mom who is just angry at me for not turning out right. Being the only one from her current marriage, I just get the feeling that I am just a regret to her, and my dad is as well. &lt;/p&gt;\n\n&lt;p&gt;I just failed my driving test. I just had spring break, and going into it I planned to catch up on things, but I didn&amp;#39;t. I wasted it on a 1,500 mile road trip to visit engineering schools with my dad that I won&amp;#39;t get into. I wasted it masturbating for the short high that almost brings me to happy again. I wasted it watching and playing minecraft, putting off reading my books (not that I could ever read a page without my mind wandering) and studying and writing. I&amp;#39;m a failure and I just can&amp;#39;t be motivated to face reality. &lt;/p&gt;\n\n&lt;p&gt;I have always almost seen suicide as a positive thing, a way to escape having to see my dad die disappointed because I didn&amp;#39;t change the world. Now I see it as the only viable option.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr I can&amp;#39;t meet my parents expectations, I suck at school, I come to reddit to escape, reddit community isn&amp;#39;t satisfied with what I wasted thousands of hours doing, I am useless and behind. &lt;/p&gt;\n\n&lt;p&gt;Edit: That was way longer than I intended, I&amp;#39;m sorry. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm going to try to leave out personal details, but because of the necessary specifics it probably would not be hard to find out who I am. Please do not.\n\nI am 16, almost 17, and male. I have some problems, but I'll try to focus on whats really been bothering me.\n\nMy dad is really old considering my age. One of my half sisters is 30 years older than me. My dad was super influential in the creation of the internet. I don't want to give specifics, but he had the first company of its kind in the early 80s. He's a genius. Albeit mostly forgotten, but a truly amazing man. He wants me to be him. I don't see what he sees in me, but I feel like I need to invent the next internet in the next two years to please him, and I constantly feel guilty for letting him down.\n\nI get shitty grades. My weighted is a 3.0 on a 4.0 scale. All of my four siblings did better than that. It's not the material, its the work. I just can't focus on homework enough, getting in essays, studying on time etc. My parents revealed that they had me tested and found I have severe ADD, but didn't tell me because they didn't want me medicated. Once they realized I was suicidal, they put me on a stimulant. While it helped, I hate taking it. I feel like it makes me different. I only take it at school, sometimes, because I want to be myself at home. Unfortunately I really have trouble staying on task at home, where I'd probably get the most benefit. Schoolwork reminds me of how behind I am, and I seek comfort instead of confronting that I am destined to be homeless at this point. It's not just laziness. At first when I started taking pills, I had hope, and pulled off nearly strait A's for a quarter. I don't know what happened, but those disappeared, and I am scared again. My parents actually promised I could get guitar lessons if I kept it up (I always wanted to play something) but those talks quickly vanished. \n\nI started programming about a year ago. My tutor thinks I'm a fast learner, but in my AP comp sci class I miss deadlines simply because I find pages of gridworld too painfully monotonous to go through when I am miles ahead of the class. (simply because I came in with experience, I'm not a natural hacker). \n\nI actually pretended to be a hacker in middle school in an online scam, and though I am kind of proud for making some decent cash and getting 100,000 views (ironically largely to satisfy my dad's expectations of me) I realized I could never show him, as it is a shameful and illegal thing that only a 12 year old sociopath would consider a source of pride. I regret that this is something I consider a large part of my identity. \n\nBack in October I took on a very very complicated project for the jailbreak community, over at /r/jailbreak, and /r/iosthemes. I realize doxxing is going to be easy, please don't mention it if you manage to figure out who I am. People were so excited when I gave progress updates, the breakthroughs made me feel like I had a chance at meeting my father's expectations. Tons of people seemed genuinely impressed with my work. The first release got a few hundred downloads, it felt great. My parents were sure that this and my SAT scores would compensate my GPA. I spent months of hard work on the next version, which got around 5 upvotes. I had one person constantly hounding me for updates, it became just another class with a angry disappointed teacher, telling me I was wasting my potential. Nobody cared, except for one freaking person, who was more upset at my lack of updates and breaking self-set deadlines that I made just to get some space than appreciative of what I had done. I stopped working on it. Everytime I see some fucker with a [developer] flair, I get a pain in my chest. They never gave me one.\n\nI worked on a \"theme\" (see /r/iosthemes for a definition) and it got tons of appreciation from the screenshots I posted. I spent forever on it. I pirated adobe CS6 and have taught myself basic AE and Flash, but am decent at Illustrator and Photoshop. My theme got rejected from the major Cydia repo, modmyi.com. At this point (sometime in January) I am constantly thinking of suicide. My escape from these thoughts had become another source of them. School was depressing, and this odd little slice of the internet had turned on me. Now I have become a vegetable, no longer producing, only consuming media online. I'm too afraid to even open up my IDE, and am behind in every class. I have dissapointed everyone, my dad, mom, brother, sisters, etc. They all just feel bad for me, as a socially awkward weirdo, except my mom who is just angry at me for not turning out right. Being the only one from her current marriage, I just get the feeling that I am just a regret to her, and my dad is as well. \n\nI just failed my driving test. I just had spring break, and going into it I planned to catch up on things, but I didn't. I wasted it on a 1,500 mile road trip to visit engineering schools with my dad that I won't get into. I wasted it masturbating for the short high that almost brings me to happy again. I wasted it watching and playing minecraft, putting off reading my books (not that I could ever read a page without my mind wandering) and studying and writing. I'm a failure and I just can't be motivated to face reality. \n\nI have always almost seen suicide as a positive thing, a way to escape having to see my dad die disappointed because I didn't change the world. Now I see it as the only viable option.\n\nTl;dr I can't meet my parents expectations, I suck at school, I come to reddit to escape, reddit community isn't satisfied with what I wasted thousands of hours doing, I am useless and behind. \n\nEdit: That was way longer than I intended, I'm sorry. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245o4g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "k4f7j", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245o4g/im_not_a_lost_cause_but_things_are_going_downhill/", "name": "t3_245o4g", "created": 1398683372.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245o4g/im_not_a_lost_cause_but_things_are_going_downhill/", "author_flair_text": null, "title": "I'm not a lost cause, but things are going downhill fast. I could really use some help.", "created_utc": 1398654572.0, "ups": 8, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbz1op", "gilded": 0, "author": "nowthatsenough", "parent_id": "t1_ch61j1p", "approved_by": null, "body": "Glad to hear you're doing a bit better! I recommend switching to T-Mobiles prepaid plan and picking up a nexus 5/moto g from either googles sight or swappa.com. On the prepaid plan, you get unlimited text, data, but only $100 minutes for calls. But, it's 30 a month, you can cancel it any time since there aren't any contracts, and the moto g/nexus 5 are great for development (nexus 5 especially), and are pretty cheap off contract. Also, if you need help in your current project, I could possibly help. I'm sorry to hear about that shitty dev, there are more than I'd like to admit among the mobile phone hacking community. Speaking of which, thanks for the thanks! I do what I can for a good cause. I'm also glad to hear you have some organization going for you. That's going to be very helpful for you, but I'm sure you already knew that!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to hear you&amp;#39;re doing a bit better! I recommend switching to T-Mobiles prepaid plan and picking up a nexus 5/moto g from either googles sight or swappa.com. On the prepaid plan, you get unlimited text, data, but only $100 minutes for calls. But, it&amp;#39;s 30 a month, you can cancel it any time since there aren&amp;#39;t any contracts, and the moto g/nexus 5 are great for development (nexus 5 especially), and are pretty cheap off contract. Also, if you need help in your current project, I could possibly help. I&amp;#39;m sorry to hear about that shitty dev, there are more than I&amp;#39;d like to admit among the mobile phone hacking community. Speaking of which, thanks for the thanks! I do what I can for a good cause. I&amp;#39;m also glad to hear you have some organization going for you. That&amp;#39;s going to be very helpful for you, but I&amp;#39;m sure you already knew that!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_chbz1op", "created": 1399512530.0, "author_flair_text": null, "created_utc": 1399483730.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch61j1p", "gilded": 0, "author": "k4f7j", "parent_id": "t1_ch4swfg", "approved_by": null, "body": "Wow thanks for the super relevant reply. I am stuck with iOS for the foreseeable future, because I am locked into unlimited with an iPhone 5 on verizon, and i'd give up unlimited 4g to use an upgrade. I typically use over 10gb a month. I definitely will take your advice and branch out to other communities. I have a lot of time invested in my current project, and I am probably going to finish that up somewhat, and hopefully hand it off to someone else. I made icons for some guy's overpriced tweak and he went silent when it was time to pay me, so I really want to make a free version of it just because he's ripped so many people off for a $2 buggy tweak with stolen artwork. \n\nAlso, I know iOS hacking takes a ton of talent and gives little reward, and even if your role was minor, I have to thank you for your effort. \n\nI have been feeling a bit better just planning out a course of action instead of just avoiding everything and letting it pile up.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow thanks for the super relevant reply. I am stuck with iOS for the foreseeable future, because I am locked into unlimited with an iPhone 5 on verizon, and i&amp;#39;d give up unlimited 4g to use an upgrade. I typically use over 10gb a month. I definitely will take your advice and branch out to other communities. I have a lot of time invested in my current project, and I am probably going to finish that up somewhat, and hopefully hand it off to someone else. I made icons for some guy&amp;#39;s overpriced tweak and he went silent when it was time to pay me, so I really want to make a free version of it just because he&amp;#39;s ripped so many people off for a $2 buggy tweak with stolen artwork. &lt;/p&gt;\n\n&lt;p&gt;Also, I know iOS hacking takes a ton of talent and gives little reward, and even if your role was minor, I have to thank you for your effort. &lt;/p&gt;\n\n&lt;p&gt;I have been feeling a bit better just planning out a course of action instead of just avoiding everything and letting it pile up.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_ch61j1p", "created": 1398902032.0, "author_flair_text": null, "created_utc": 1398873232.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4swfg", "gilded": 0, "author": "nowthatsenough", "parent_id": "t3_245o4g", "approved_by": null, "body": "Hi, I worked with Green poison, back when that was still a thing. I am a member of the iOS, Android, and WP Dev community. Here is what I have learned after doing things for all 3 platforms.\n\niOS is one of the most frustrating platforms I have ever dealt with. They are so *entitled*. The WP community is grateful for whatever you give them, and the Android community, as long as it looks good, is happy, and doesn't beg too much. Here is what I say you should do. The chromecast is getting popular now, and the API is released for it now (I think... might be wrong), and if you can make a solid app for it, people will download it. Find out how to do something like f.lux for the chromecast and you will have so many downloads it will make your head spin. I see it hitting the front page of /r/Android already. Make the app (I will help as much as I can and give you all the credit), and if it doesn't go over well, then we can start over. It would be a shame that an iOS dev with not only good potential, but good observable talent, offed himself because the most greedy hacking community tore him down.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I worked with Green poison, back when that was still a thing. I am a member of the iOS, Android, and WP Dev community. Here is what I have learned after doing things for all 3 platforms.&lt;/p&gt;\n\n&lt;p&gt;iOS is one of the most frustrating platforms I have ever dealt with. They are so &lt;em&gt;entitled&lt;/em&gt;. The WP community is grateful for whatever you give them, and the Android community, as long as it looks good, is happy, and doesn&amp;#39;t beg too much. Here is what I say you should do. The chromecast is getting popular now, and the API is released for it now (I think... might be wrong), and if you can make a solid app for it, people will download it. Find out how to do something like f.lux for the chromecast and you will have so many downloads it will make your head spin. I see it hitting the front page of &lt;a href=\"/r/Android\"&gt;/r/Android&lt;/a&gt; already. Make the app (I will help as much as I can and give you all the credit), and if it doesn&amp;#39;t go over well, then we can start over. It would be a shame that an iOS dev with not only good potential, but good observable talent, offed himself because the most greedy hacking community tore him down.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_ch4swfg", "created": 1398774682.0, "author_flair_text": null, "created_utc": 1398745882.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch42mtz", "gilded": 0, "author": "ignorethename", "parent_id": "t1_ch3vgoa", "approved_by": null, "body": "I think you gravely misinterpret your dads love and pride for you. Whereas your dad seems to think that you will do great things because he loves you, you seem to think that he loves you on condition that you will do great things. You seem to have read the situation incorrectly. \n\nTry this. Try to understand things as they are. Observe how he talks with you. I seriously doubt that your father visited all those colleges for the colleges. I think he made that trip not for colleges but for you.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you gravely misinterpret your dads love and pride for you. Whereas your dad seems to think that you will do great things because he loves you, you seem to think that he loves you on condition that you will do great things. You seem to have read the situation incorrectly. &lt;/p&gt;\n\n&lt;p&gt;Try this. Try to understand things as they are. Observe how he talks with you. I seriously doubt that your father visited all those colleges for the colleges. I think he made that trip not for colleges but for you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_ch42mtz", "created": 1398717929.0, "author_flair_text": null, "created_utc": 1398689129.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3vgoa", "gilded": 0, "author": "k4f7j", "parent_id": "t1_ch3uun5", "approved_by": null, "body": "The 3.0 is weighted, my school doesn't do unweighted but it would be pretty bad because I override into honors and APs because I tend to do just as well in them as in CP classes. All of my math and science classes have been honors.\n\nI felt like I was out of space to say this, but I actually got a therapist. She really doesn't know exactly what to tell me, as I've told her everything pretty much, and she often just asks what she thinks I want her to tell me. Its kind of awkward, any idea of what I should say to her? I don't know what I need exactly, and she seems surprised by this. \n\nMy dad has unreasonable pride in me. He \"knows\" that I will get rich and/or be even more influential than him. My mom does not have the same faith, and she is showing resentment towards my dad, presumably partially because they have such contrasting opinions of me.\n\nThe drivers test wouldn't be a huge deal except I was considering asking a girl out if I got it, and my therapist actually said this was a good idea. I lack any sort of confidence to do this, but we get along great and its pretty obvious that shes looking for a similar relationship, and might even have mutual feelings. Unfortunately, I'd be a dick to ask her out without being mobile. \n\nI realize I could get into a college or two with my situation, but not the one's were looking at, and not anyone who isn't an embarrassment on a resume. I also am well aware of the necessity of going to a good school to get a good career. In my family/area, its expected that you go to a good school. I'm below the average druggie level of performance, and I lost most of my friends because I didn't want to do drugs. My mom makes fun of me for this, because apparently even she and my dad, and all of my siblings smoked weed and I pussied out. \n\nHonestly, as someone with no personal connection to me at all, do you really think it's not too late to make something of myself, as a junior in high school? I kind of set this break as a deadline and being that its nearly midnight on a Sunday I posted this as a last resort. I honestly feel like even if I fixed everything tonight I'd still end up flipping burgers, and as long as my dad would see that happen, I'd rather die tomorrow. \n\nEdit: had written a decently sized response, only to find the comments deleted. :-| I did find a lot of what you said [deleted] helpful though!", "edited": 1398660083.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The 3.0 is weighted, my school doesn&amp;#39;t do unweighted but it would be pretty bad because I override into honors and APs because I tend to do just as well in them as in CP classes. All of my math and science classes have been honors.&lt;/p&gt;\n\n&lt;p&gt;I felt like I was out of space to say this, but I actually got a therapist. She really doesn&amp;#39;t know exactly what to tell me, as I&amp;#39;ve told her everything pretty much, and she often just asks what she thinks I want her to tell me. Its kind of awkward, any idea of what I should say to her? I don&amp;#39;t know what I need exactly, and she seems surprised by this. &lt;/p&gt;\n\n&lt;p&gt;My dad has unreasonable pride in me. He &amp;quot;knows&amp;quot; that I will get rich and/or be even more influential than him. My mom does not have the same faith, and she is showing resentment towards my dad, presumably partially because they have such contrasting opinions of me.&lt;/p&gt;\n\n&lt;p&gt;The drivers test wouldn&amp;#39;t be a huge deal except I was considering asking a girl out if I got it, and my therapist actually said this was a good idea. I lack any sort of confidence to do this, but we get along great and its pretty obvious that shes looking for a similar relationship, and might even have mutual feelings. Unfortunately, I&amp;#39;d be a dick to ask her out without being mobile. &lt;/p&gt;\n\n&lt;p&gt;I realize I could get into a college or two with my situation, but not the one&amp;#39;s were looking at, and not anyone who isn&amp;#39;t an embarrassment on a resume. I also am well aware of the necessity of going to a good school to get a good career. In my family/area, its expected that you go to a good school. I&amp;#39;m below the average druggie level of performance, and I lost most of my friends because I didn&amp;#39;t want to do drugs. My mom makes fun of me for this, because apparently even she and my dad, and all of my siblings smoked weed and I pussied out. &lt;/p&gt;\n\n&lt;p&gt;Honestly, as someone with no personal connection to me at all, do you really think it&amp;#39;s not too late to make something of myself, as a junior in high school? I kind of set this break as a deadline and being that its nearly midnight on a Sunday I posted this as a last resort. I honestly feel like even if I fixed everything tonight I&amp;#39;d still end up flipping burgers, and as long as my dad would see that happen, I&amp;#39;d rather die tomorrow. &lt;/p&gt;\n\n&lt;p&gt;Edit: had written a decently sized response, only to find the comments deleted. :-| I did find a lot of what you said [deleted] helpful though!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_ch3vgoa", "created": 1398686305.0, "author_flair_text": null, "created_utc": 1398657505.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch3uun5", "gilded": 0, "author": "[deleted]", "parent_id": "t3_245o4g", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245o4g", "score_hidden": false, "name": "t1_ch3uun5", "created": 1398684805.0, "author_flair_text": null, "created_utc": 1398656005.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]