[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to go into too much detail here. I really want to kill myself. I fantasize about it often but I have a mom who loves me and I&amp;#39;d hate to hurt her. Right now I don&amp;#39;t think I&amp;#39;d do it, but I get more depressed by the day and can feel myself getting there. Sorry for the lack of information, it&amp;#39;s a really long story how I got to this point.\nI bought some running shoes and applied for a job (currently unemployed) and I&amp;#39;m hoping that helps. What&amp;#39;re some simple things to do to raise my self-esteem, and be happier in general? Any help would be much appreciated, I can&amp;#39;t go on like this and therapy is not an option right now. I&amp;#39;m 18 btw. Thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not going to go into too much detail here. I really want to kill myself. I fantasize about it often but I have a mom who loves me and I'd hate to hurt her. Right now I don't think I'd do it, but I get more depressed by the day and can feel myself getting there. Sorry for the lack of information, it's a really long story how I got to this point.\nI bought some running shoes and applied for a job (currently unemployed) and I'm hoping that helps. What're some simple things to do to raise my self-esteem, and be happier in general? Any help would be much appreciated, I can't go on like this and therapy is not an option right now. I'm 18 btw. Thanks in advance.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xo0g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ThrowawaSHGDD", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xo0g/im_not_seriously_suicidal_yet_but_i_can_feel/", "name": "t3_23xo0g", "created": 1398440278.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xo0g/im_not_seriously_suicidal_yet_but_i_can_feel/", "author_flair_text": null, "title": "I'm not seriously suicidal yet but I can feel myself getting there. Please help.", "created_utc": 1398411478.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1l5l6", "gilded": 0, "author": "ThrowawaSHGDD", "parent_id": "t1_ch1ktii", "approved_by": null, "body": "Thank you!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xo0g", "score_hidden": false, "name": "t1_ch1l5l6", "created": 1398417787.0, "author_flair_text": null, "created_utc": 1398414187.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1ktii", "gilded": 0, "author": "remington259", "parent_id": "t3_23xo0g", "approved_by": null, "body": "There are a million different things you can do. \n\nI assume from the running shoes you intend to get some sort of physical activity going in your life. That's a great start. Working out can definitely help relieve stress as well as having plenty of other benefits. \n\nI'm currently unemployed as well and I've got some years on you. Don't start getting down about that. Times are still rough. The economy is still pretty damn bad. That's not your fault. You'll find something in time.\n\nIn the meantime though, maybe try volunteering somewhere. Anything for your resume and will also give you something beneficial to do in your community.\n\nTry taking up some new hobbies. See what sticks and what doesn't. Cooking is one that'll impress a significant other so that's got a bonus to it. Photography perhaps or a musical instrument. Go on a nature hike and do some research on the native flora and fauna (plants and animals). The possibilities are endless.\n\nThings will get better friend. You mustn't let life get you so down when you're so young. You have a world out there waiting to be explored. So many things yet to be done. It may seem impossible...but it'll get better. Be strong and believe in yourself no matter how bleak things might become. There is always something good to be found. :-)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a million different things you can do. &lt;/p&gt;\n\n&lt;p&gt;I assume from the running shoes you intend to get some sort of physical activity going in your life. That&amp;#39;s a great start. Working out can definitely help relieve stress as well as having plenty of other benefits. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently unemployed as well and I&amp;#39;ve got some years on you. Don&amp;#39;t start getting down about that. Times are still rough. The economy is still pretty damn bad. That&amp;#39;s not your fault. You&amp;#39;ll find something in time.&lt;/p&gt;\n\n&lt;p&gt;In the meantime though, maybe try volunteering somewhere. Anything for your resume and will also give you something beneficial to do in your community.&lt;/p&gt;\n\n&lt;p&gt;Try taking up some new hobbies. See what sticks and what doesn&amp;#39;t. Cooking is one that&amp;#39;ll impress a significant other so that&amp;#39;s got a bonus to it. Photography perhaps or a musical instrument. Go on a nature hike and do some research on the native flora and fauna (plants and animals). The possibilities are endless.&lt;/p&gt;\n\n&lt;p&gt;Things will get better friend. You mustn&amp;#39;t let life get you so down when you&amp;#39;re so young. You have a world out there waiting to be explored. So many things yet to be done. It may seem impossible...but it&amp;#39;ll get better. Be strong and believe in yourself no matter how bleak things might become. There is always something good to be found. :-)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xo0g", "score_hidden": false, "name": "t1_ch1ktii", "created": 1398415947.0, "author_flair_text": null, "created_utc": 1398412347.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]