[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a graduate student in science. I&amp;#39;m so fed up with this shit. My project is a complete failure. I don&amp;#39;t see a thesis in my work. My boss is pushing it so she can get ahead in her own career. We are stretching the truth in all aspects of this project. It&amp;#39;s not science. All I do is work on the computer all day, writing papers and analyzing data. I absolutely hate doing both. I got into my particular field to get away from it.I work long hours, I have probably 2-3 hours to myself each day. I work 7 days a week. I haven&amp;#39;t had a good night sleep in over a month. I&amp;#39;m pushed so hard to stick with it and if I don&amp;#39;t I basically ruin my life. I can&amp;#39;t take it anymore. Life is not about working 24/7. I dread every day of my life. When this is over I get a job and my shity life continues. I can&amp;#39;t take it anymore. I have no joy in my life. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a graduate student in science. I'm so fed up with this shit. My project is a complete failure. I don't see a thesis in my work. My boss is pushing it so she can get ahead in her own career. We are stretching the truth in all aspects of this project. It's not science. All I do is work on the computer all day, writing papers and analyzing data. I absolutely hate doing both. I got into my particular field to get away from it.I work long hours, I have probably 2-3 hours to myself each day. I work 7 days a week. I haven't had a good night sleep in over a month. I'm pushed so hard to stick with it and if I don't I basically ruin my life. I can't take it anymore. Life is not about working 24/7. I dread every day of my life. When this is over I get a job and my shity life continues. I can't take it anymore. I have no joy in my life. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24eked", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NikeBitch", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24eked/im_over_life/", "name": "t3_24eked", "created": 1398923738.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24eked/im_over_life/", "author_flair_text": null, "title": "I'm over life", "created_utc": 1398894938.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6dx86", "gilded": 0, "author": "Nirette", "parent_id": "t3_24eked", "approved_by": null, "body": "This sounds shitty. Stress sucks, especially when it happens in something so needed like a job. I know this may sound stupid, but is this what you wanted to do with your life? Think back to when you were younger - is this what you dreamed about, or was this result of something else? It's never too late to change (sounds stupid also, but nothing is impossible). I know that if my career goes sour I'm dropping everything (even social connections) and moving to another town/province/country. I'm a nice person, but in the end, my top priority is my well-being. This is nothing to feel guilty about.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds shitty. Stress sucks, especially when it happens in something so needed like a job. I know this may sound stupid, but is this what you wanted to do with your life? Think back to when you were younger - is this what you dreamed about, or was this result of something else? It&amp;#39;s never too late to change (sounds stupid also, but nothing is impossible). I know that if my career goes sour I&amp;#39;m dropping everything (even social connections) and moving to another town/province/country. I&amp;#39;m a nice person, but in the end, my top priority is my well-being. This is nothing to feel guilty about.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24eked", "score_hidden": false, "name": "t1_ch6dx86", "created": 1398927299.0, "author_flair_text": null, "created_utc": 1398898499.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6g7qm", "gilded": 0, "author": "NikeBitch", "parent_id": "t3_24eked", "approved_by": null, "body": "It was my dream field but this project is complete bullshit. It sounded like my field at first but turned into something different, not really science. Our conclusions are false and my boss stretches the truth to make it sound legit. The worst part is that my old bosses got me this job so if I quit I lose all my connections. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was my dream field but this project is complete bullshit. It sounded like my field at first but turned into something different, not really science. Our conclusions are false and my boss stretches the truth to make it sound legit. The worst part is that my old bosses got me this job so if I quit I lose all my connections. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24eked", "score_hidden": false, "name": "t1_ch6g7qm", "created": 1398932527.0, "author_flair_text": null, "created_utc": 1398903727.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]