[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone,\njust passing through here.&lt;/p&gt;\n\n&lt;p&gt;I just wanted to share that I&amp;#39;m planning to suicide near my 22nd birthday.&lt;/p&gt;\n\n&lt;p&gt;I have everything that a man could hope for, a great family, great friends (and like 4-5 of them would die for me), I don&amp;#39;t feel either that bad as a person. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just that I&amp;#39;m unhappy. I don&amp;#39;t know why, but if there is one thing out there worth living for it seems like I can&amp;#39;t find it.\nI&amp;#39;m becoming a rather delusional person. I don&amp;#39;t even know what problems I&amp;#39;ve got. I&amp;#39;m just bored. Constantly bored at life.&lt;/p&gt;\n\n&lt;p&gt;Well, thanks for listening. In the end, I&amp;#39;m just doing the best I can do on these &amp;quot;last&amp;quot; days. Helping people around, enjoying my life to the fullest, and so on.&lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;ll change idea, I simply do not know. One thing that sometimes holds me back is thinking that maybe the after could be even worse than what I&amp;#39;ve got now.&lt;/p&gt;\n\n&lt;p&gt;One of my latent dreams is to ask God to unmake me.&lt;/p&gt;\n\n&lt;p&gt;Cute, isn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everyone,\njust passing through here.\n\nI just wanted to share that I'm planning to suicide near my 22nd birthday.\n\nI have everything that a man could hope for, a great family, great friends (and like 4-5 of them would die for me), I don't feel either that bad as a person. \n\nIt's just that I'm unhappy. I don't know why, but if there is one thing out there worth living for it seems like I can't find it.\nI'm becoming a rather delusional person. I don't even know what problems I've got. I'm just bored. Constantly bored at life.\n\n\nWell, thanks for listening. In the end, I'm just doing the best I can do on these \"last\" days. Helping people around, enjoying my life to the fullest, and so on.\n\nMaybe I'll change idea, I simply do not know. One thing that sometimes holds me back is thinking that maybe the after could be even worse than what I've got now.\n\nOne of my latent dreams is to ask God to unmake me.\n\nCute, isn't it?\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zp9k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Nemesis1992", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zp9k/im_planning_on_my_suicide/", "name": "t3_23zp9k", "created": 1398496155.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zp9k/im_planning_on_my_suicide/", "author_flair_text": null, "title": "I'm planning on my suicide.", "created_utc": 1398467355.0, "ups": 9, "num_comments": 15, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch25erd", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23zp9k", "approved_by": null, "body": "It sounds like you've got a little time here before you do anything, and I'm glad it sounds like you're planning on spending this time well. All I ask is that at the end of this time you look back at what you've done, the people you've been there for, and the things you've helped along and achieved, and maybe think again about all of this. Whatever happens feel free to message me at any time, it sounds like we might have a few things in common.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;ve got a little time here before you do anything, and I&amp;#39;m glad it sounds like you&amp;#39;re planning on spending this time well. All I ask is that at the end of this time you look back at what you&amp;#39;ve done, the people you&amp;#39;ve been there for, and the things you&amp;#39;ve helped along and achieved, and maybe think again about all of this. Whatever happens feel free to message me at any time, it sounds like we might have a few things in common.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch25erd", "created": 1398471297.0, "author_flair_text": null, "created_utc": 1398467697.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ql8q", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch2na4i", "approved_by": null, "body": "Thank you for your support and for your kind words. There are still 8 months left, it's not much but it's a start. Who knows, maybe life will actually surprise me...  Have a nice day!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your support and for your kind words. There are still 8 months left, it&amp;#39;s not much but it&amp;#39;s a start. Who knows, maybe life will actually surprise me...  Have a nice day!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch2ql8q", "created": 1398568662.0, "author_flair_text": null, "created_utc": 1398539862.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2na4i", "gilded": 0, "author": "mybloodyballentine", "parent_id": "t3_23zp9k", "approved_by": null, "body": "Holy crap, dude, I just read your response to another person in sw, and there were so many great things in there. I fell into a little google hole with \"PER ASPERA AD ASTRA.\" You became my new favorite redditor! Then I clicked on your name and saw this! I feel terrible. You seem like a really nice, smart, thoughtful, empathetic person. I'm so sorry you feel this way. I want you to have a fulfilling, satisfying life. We can't lose people like you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy crap, dude, I just read your response to another person in sw, and there were so many great things in there. I fell into a little google hole with &amp;quot;PER ASPERA AD ASTRA.&amp;quot; You became my new favorite redditor! Then I clicked on your name and saw this! I feel terrible. You seem like a really nice, smart, thoughtful, empathetic person. I&amp;#39;m so sorry you feel this way. I want you to have a fulfilling, satisfying life. We can&amp;#39;t lose people like you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch2na4i", "created": 1398560177.0, "author_flair_text": null, "created_utc": 1398531377.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2locv", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch2joai", "approved_by": null, "body": "Hi BuddhaJoker, thanks for answering. \n\nI actually envy you a bit. You have a \"healthy\" relationship with money. For me money is becoming everything that actually matters on life; I shouldn't say that, but when you lack it all the roads that are actually available in this life become closed.\n\nWhen you see people around you sacrificing themselves and their own needs to give you the money you need\\would like to spend to go out with friends you start to realize that if there is one thing that actually matters out there, well it is money.\n\nI've been kinda lucky with my friendships. When I was a kid I was starting to have bad \"companies\", if that's how you would define them. \nMy parents prevented and talked to me about these people and practically they prevented me from becoming a thug.\n\nBut... these days I feel like I got misguided. I'm tired. Really tired of everything. I mean, where I live, no one goes in prison. That's just the way it is. What I renounced to is a life full of money, darkest instinct, for a life that I actually do not like to embrace.\n\nI actually like your reference about these older people. But I got unlucky for some of the paths I would have liked to embrace but I wasn't able to. For example, I suffer of a great handicap (for me that is) that basically ruined my life expectation. I wanted to take a definite path that was prevented because I suffer of eye disfunction (basically, I'm really deep into the path of myopia). And I need laser. Wonder where this is going?\n\nI'm pissed. These days I'm experincing also a new kind of mood. I awake and I'm angry. Extremely angry. I felt injustice more than once and I was always silent because I couldn't do shit about it. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi BuddhaJoker, thanks for answering. &lt;/p&gt;\n\n&lt;p&gt;I actually envy you a bit. You have a &amp;quot;healthy&amp;quot; relationship with money. For me money is becoming everything that actually matters on life; I shouldn&amp;#39;t say that, but when you lack it all the roads that are actually available in this life become closed.&lt;/p&gt;\n\n&lt;p&gt;When you see people around you sacrificing themselves and their own needs to give you the money you need\\would like to spend to go out with friends you start to realize that if there is one thing that actually matters out there, well it is money.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been kinda lucky with my friendships. When I was a kid I was starting to have bad &amp;quot;companies&amp;quot;, if that&amp;#39;s how you would define them. \nMy parents prevented and talked to me about these people and practically they prevented me from becoming a thug.&lt;/p&gt;\n\n&lt;p&gt;But... these days I feel like I got misguided. I&amp;#39;m tired. Really tired of everything. I mean, where I live, no one goes in prison. That&amp;#39;s just the way it is. What I renounced to is a life full of money, darkest instinct, for a life that I actually do not like to embrace.&lt;/p&gt;\n\n&lt;p&gt;I actually like your reference about these older people. But I got unlucky for some of the paths I would have liked to embrace but I wasn&amp;#39;t able to. For example, I suffer of a great handicap (for me that is) that basically ruined my life expectation. I wanted to take a definite path that was prevented because I suffer of eye disfunction (basically, I&amp;#39;m really deep into the path of myopia). And I need laser. Wonder where this is going?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pissed. These days I&amp;#39;m experincing also a new kind of mood. I awake and I&amp;#39;m angry. Extremely angry. I felt injustice more than once and I was always silent because I couldn&amp;#39;t do shit about it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch2locv", "created": 1398555768.0, "author_flair_text": null, "created_utc": 1398526968.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2joai", "gilded": 0, "author": "BuhddaJoker", "parent_id": "t1_ch2h47a", "approved_by": null, "body": "(Just a side note: you are pretty normal, a million people are in the same condition as you (maybe myself?); a lot of them are here on reddit or any social media. If nothing, you have internet connection,so you can talk to us anytime. Don't let your limitations restrict your decisions, you can always step up.\n You are very young, and we all are indecise about the future. Talk to people and you will see every complex life is not perfect - as the question of meeting new people, of course it can be hard (I know how it is: I didn't speak to others when I was in school, because I have a trace of autism, if you will; I'm not nearly as being a social person even now, years later), but you need to drive your life, not the opposite; and really, talking to someone new is not too diferent than talking to someone here, just that you have a face in front of you (say 'hi', say 'i like your hair', you know how to do it).\n One more thing: be open-minded. Being poor is not an excuse, money shouldn't be a key to success (yes, I'm kinda poor too, and I travelled just once to outside of my country, after 5-6 years of saving money); Dreaming the impossible is just a part of doing your best, you don't need a 'purpose' to be here, to live, to try harder - you don't need to rush, it is totally fine to be who you are, but try everything before saying there's no passion for you. I know old people who still don't know what to do of their lifes, and seeing them working hard to achieve their objectives makes me want to work hard -for me that's already enough.\n\nKeep in touch. )", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Just a side note: you are pretty normal, a million people are in the same condition as you (maybe myself?); a lot of them are here on reddit or any social media. If nothing, you have internet connection,so you can talk to us anytime. Don&amp;#39;t let your limitations restrict your decisions, you can always step up.\n You are very young, and we all are indecise about the future. Talk to people and you will see every complex life is not perfect - as the question of meeting new people, of course it can be hard (I know how it is: I didn&amp;#39;t speak to others when I was in school, because I have a trace of autism, if you will; I&amp;#39;m not nearly as being a social person even now, years later), but you need to drive your life, not the opposite; and really, talking to someone new is not too diferent than talking to someone here, just that you have a face in front of you (say &amp;#39;hi&amp;#39;, say &amp;#39;i like your hair&amp;#39;, you know how to do it).\n One more thing: be open-minded. Being poor is not an excuse, money shouldn&amp;#39;t be a key to success (yes, I&amp;#39;m kinda poor too, and I travelled just once to outside of my country, after 5-6 years of saving money); Dreaming the impossible is just a part of doing your best, you don&amp;#39;t need a &amp;#39;purpose&amp;#39; to be here, to live, to try harder - you don&amp;#39;t need to rush, it is totally fine to be who you are, but try everything before saying there&amp;#39;s no passion for you. I know old people who still don&amp;#39;t know what to do of their lifes, and seeing them working hard to achieve their objectives makes me want to work hard -for me that&amp;#39;s already enough.&lt;/p&gt;\n\n&lt;p&gt;Keep in touch. )&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch2joai", "created": 1398549295.0, "author_flair_text": null, "created_utc": 1398520495.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2h47a", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_23zp9k", "approved_by": null, "body": "Hey Justonemorethrowaway,\nhow are you?\n\nNice to hear from you.\n\nI'm a 21 year old guy, really concerned with the future. I don't know about you, but I lack nothing. And you?\n\nWhat sincerely scares me is the fact that I will never be able to achieve my dreams. I live in a place that is full of corruption, I see no \"purpose\" on trying to do my best and be my best. Right now I'm studying law, but where I live you need a \"sponsor\" to be able to succeed.\n\nThe whole system disgust me. \n\nI also live in a (relatively) poor family. I can't travel (I was said to travel many times) and searching for work, especially in this time, in my nation is out of question.\n\nI'm rather angry at everything.\n\nSecond: I see people around me realized, happy, and content with their own life. It seems like they have something that drives them. What is it? I fail to realize it. \n\nThird: what about my sexual life?\nI do not have a sexual life, but I have chosen this road myself.\nSome of my friends lack my tenacity with girls; I was asked to have sex many many times but I denied them all. It's just that my first time has to be with one I love. Then the other times it could be even a sheep (this is an hyperbole but I guess you catched what I mean).\n\nForth thing: I know people of my age that are already marrying.\nWhat if I said you that I didn't even find one girl that hit me as genuine, truthful, nice, worth living for?\nI think that 90% of them out there would have no point talking with if it wasn't for their relatively female-assets (like the tits, pussy, and ass).\n\nFifth thing: I'm stuck in a muddle's pud. I'm not able to meet new people. I wish I could, but actually my group is composed of all the same people and meeting new people is \"hard\".\n\nHope that explained you some things.\n\nPlease, tell me about you.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Justonemorethrowaway,\nhow are you?&lt;/p&gt;\n\n&lt;p&gt;Nice to hear from you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a 21 year old guy, really concerned with the future. I don&amp;#39;t know about you, but I lack nothing. And you?&lt;/p&gt;\n\n&lt;p&gt;What sincerely scares me is the fact that I will never be able to achieve my dreams. I live in a place that is full of corruption, I see no &amp;quot;purpose&amp;quot; on trying to do my best and be my best. Right now I&amp;#39;m studying law, but where I live you need a &amp;quot;sponsor&amp;quot; to be able to succeed.&lt;/p&gt;\n\n&lt;p&gt;The whole system disgust me. &lt;/p&gt;\n\n&lt;p&gt;I also live in a (relatively) poor family. I can&amp;#39;t travel (I was said to travel many times) and searching for work, especially in this time, in my nation is out of question.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m rather angry at everything.&lt;/p&gt;\n\n&lt;p&gt;Second: I see people around me realized, happy, and content with their own life. It seems like they have something that drives them. What is it? I fail to realize it. &lt;/p&gt;\n\n&lt;p&gt;Third: what about my sexual life?\nI do not have a sexual life, but I have chosen this road myself.\nSome of my friends lack my tenacity with girls; I was asked to have sex many many times but I denied them all. It&amp;#39;s just that my first time has to be with one I love. Then the other times it could be even a sheep (this is an hyperbole but I guess you catched what I mean).&lt;/p&gt;\n\n&lt;p&gt;Forth thing: I know people of my age that are already marrying.\nWhat if I said you that I didn&amp;#39;t even find one girl that hit me as genuine, truthful, nice, worth living for?\nI think that 90% of them out there would have no point talking with if it wasn&amp;#39;t for their relatively female-assets (like the tits, pussy, and ass).&lt;/p&gt;\n\n&lt;p&gt;Fifth thing: I&amp;#39;m stuck in a muddle&amp;#39;s pud. I&amp;#39;m not able to meet new people. I wish I could, but actually my group is composed of all the same people and meeting new people is &amp;quot;hard&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Hope that explained you some things.&lt;/p&gt;\n\n&lt;p&gt;Please, tell me about you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch2h47a", "created": 1398535182.0, "author_flair_text": null, "created_utc": 1398506382.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3n2jr", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_23zp9k", "approved_by": null, "body": "Ehi guys, just a remind for what I'm planning to do.\n\nI will start staying in front of my computer less and less because I have to actually focus on my studies. \n\nI have to study for 5 years for university and I'm already behind of 1 year. \n\nWhat fucks me up is that I've also got one \"addiction\"; and the addiction involves the tool I'm currently using now to write this post. I have to use the computer to study, to make synthesis of my books, and so on. But it is also a tool to have great fun, as you may imagine.\n\nFrom tomorrow, I will definitely start my fight against my addiction. For anyone wondering how to fight an addiction, I recommend this post:\n\nhttp://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr\n\nI'll write another post concerning inside this topic next week. I hope you all that are reading the best week of your life :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ehi guys, just a remind for what I&amp;#39;m planning to do.&lt;/p&gt;\n\n&lt;p&gt;I will start staying in front of my computer less and less because I have to actually focus on my studies. &lt;/p&gt;\n\n&lt;p&gt;I have to study for 5 years for university and I&amp;#39;m already behind of 1 year. &lt;/p&gt;\n\n&lt;p&gt;What fucks me up is that I&amp;#39;ve also got one &amp;quot;addiction&amp;quot;; and the addiction involves the tool I&amp;#39;m currently using now to write this post. I have to use the computer to study, to make synthesis of my books, and so on. But it is also a tool to have great fun, as you may imagine.&lt;/p&gt;\n\n&lt;p&gt;From tomorrow, I will definitely start my fight against my addiction. For anyone wondering how to fight an addiction, I recommend this post:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr\"&gt;http://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll write another post concerning inside this topic next week. I hope you all that are reading the best week of your life :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch3n2jr", "created": 1398667035.0, "author_flair_text": null, "created_utc": 1398638235.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6cqi4", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch5jh98", "approved_by": null, "body": "I believe in you ;)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe in you ;)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch6cqi4", "created": 1398899474.0, "author_flair_text": null, "created_utc": 1398895874.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7mk38", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch5jh98", "approved_by": null, "body": "Ehi originalposter, how are you?\n\nBy the way, yesterday I've discovered that the relationship of the girl I loved so much, I thought it would be unending love, seems to be reaching an empasse. So basically, his boyfriend and her are going through a really bad period, to the point that they'll probably break up.\n\nActually, the cute fact is that I could try going to her, but I won't. Because she doesn't deserve me. She doesn't deserve all I've given her.\nWhen I think about love, I start to realize that love and hate are basically two faces of the same coin.\n\nI do not tell you to feed on your anger and hatred for her; that wouldn't be right. Just know that out there there is an exit. And I assure you, there are (few) - that's the way it is , they are few - beautiful girls around here worth sharing moments together.\n\nDo your best\n\nSergio\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ehi originalposter, how are you?&lt;/p&gt;\n\n&lt;p&gt;By the way, yesterday I&amp;#39;ve discovered that the relationship of the girl I loved so much, I thought it would be unending love, seems to be reaching an empasse. So basically, his boyfriend and her are going through a really bad period, to the point that they&amp;#39;ll probably break up.&lt;/p&gt;\n\n&lt;p&gt;Actually, the cute fact is that I could try going to her, but I won&amp;#39;t. Because she doesn&amp;#39;t deserve me. She doesn&amp;#39;t deserve all I&amp;#39;ve given her.\nWhen I think about love, I start to realize that love and hate are basically two faces of the same coin.&lt;/p&gt;\n\n&lt;p&gt;I do not tell you to feed on your anger and hatred for her; that wouldn&amp;#39;t be right. Just know that out there there is an exit. And I assure you, there are (few) - that&amp;#39;s the way it is , they are few - beautiful girls around here worth sharing moments together.&lt;/p&gt;\n\n&lt;p&gt;Do your best&lt;/p&gt;\n\n&lt;p&gt;Sergio&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch7mk38", "created": 1399054343.0, "author_flair_text": null, "created_utc": 1399025543.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5jh98", "gilded": 0, "author": "the0riginalposter", "parent_id": "t1_ch4zpzr", "approved_by": null, "body": "oh  man i wish i had it in me.   here i am eating pizza.  i couldnt fucking due it.  i hate it, myself.  i wish i could kill myself  2 days barely any food but i cant myself or kill myself.  please someone hit me so i dont know", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh  man i wish i had it in me.   here i am eating pizza.  i couldnt fucking due it.  i hate it, myself.  i wish i could kill myself  2 days barely any food but i cant myself or kill myself.  please someone hit me so i dont know&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch5jh98", "created": 1398846980.0, "author_flair_text": null, "created_utc": 1398818180.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4zpzr", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch4z8vp", "approved_by": null, "body": "You don't have to starve yourself. You'll just erode your will. Be constant on eating and eat well. I mean, three meals a day (just lower the quantity of the stuff you eat), with some sport and you'll be fine. \nResults will come naturally.\n\nI'm sorry to hear about what you said about your ex. I know what you felt. When the girl I loved talked to me about his friend, I felt like I was stabbed. She was just unable to understand what it meant.\n\nBy the way, do not drink tons of vodka. You don't need it. Your addiction is not physical, but mental. You started when your girlfriend left you. Just let it go. It is hard, but you'll feel better. I promise.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to starve yourself. You&amp;#39;ll just erode your will. Be constant on eating and eat well. I mean, three meals a day (just lower the quantity of the stuff you eat), with some sport and you&amp;#39;ll be fine. \nResults will come naturally.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry to hear about what you said about your ex. I know what you felt. When the girl I loved talked to me about his friend, I felt like I was stabbed. She was just unable to understand what it meant.&lt;/p&gt;\n\n&lt;p&gt;By the way, do not drink tons of vodka. You don&amp;#39;t need it. Your addiction is not physical, but mental. You started when your girlfriend left you. Just let it go. It is hard, but you&amp;#39;ll feel better. I promise.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch4zpzr", "created": 1398805372.0, "author_flair_text": null, "created_utc": 1398776572.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4z8vp", "gilded": 0, "author": "the0riginalposter", "parent_id": "t1_ch4yhmu", "approved_by": null, "body": "I am sad for you that a university is the reasoning.  I hope you reconsider that a university really doesn't impact your life and whatever it has to do with is very easily fixed.\n\nI started yesterday starving myself.  6 inch sandwhich and 13 beers.  I am going to switch to vodka tonight for the next few weeks just so i can shed this weight.  i am 6'1 and 275lbs.  i need to get down to 220 to feel good once again about myself.  i am only going to eat one meal a day for the next 6 weeks and have two snacks of fruit and granola bar and to satisfy so i dont get low on sugar tons of vodka.  if i can just get some of this weight off, i think i will start feeling better about myself.....man was it tough seeing that pic of my ex married on facebook.  i instantly felt like dying.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sad for you that a university is the reasoning.  I hope you reconsider that a university really doesn&amp;#39;t impact your life and whatever it has to do with is very easily fixed.&lt;/p&gt;\n\n&lt;p&gt;I started yesterday starving myself.  6 inch sandwhich and 13 beers.  I am going to switch to vodka tonight for the next few weeks just so i can shed this weight.  i am 6&amp;#39;1 and 275lbs.  i need to get down to 220 to feel good once again about myself.  i am only going to eat one meal a day for the next 6 weeks and have two snacks of fruit and granola bar and to satisfy so i dont get low on sugar tons of vodka.  if i can just get some of this weight off, i think i will start feeling better about myself.....man was it tough seeing that pic of my ex married on facebook.  i instantly felt like dying.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch4z8vp", "created": 1398803781.0, "author_flair_text": null, "created_utc": 1398774981.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4yhmu", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch4gdn1", "approved_by": null, "body": "Hi Originalposter,\n\nI thank you for the support ;). Actually, my choice about suicide is not written in the sand. It is mostly about what is going to happen with the university. I'm already stopping abusing computer, and I thank you for your assistance into driving me away from this bad habit.\nHow are you? Did you think about what I've said you ? \n\nSo, I wonder: will you follow your same tips? :P\nYou said me you think to be a fat fuck. I don't know your current status, so I will just tell you: what about beginning a new sport? I read around that you think your social skills, in all these years, got a bit neglected.\nSo a sport, according to me, is a nice chance to meet new people. Also, it is something that could help you removing some dust from your social skills.\n\nI advise you stuff like swimming or martial arts (Indeed, these are the sport I recommend the most because they rely on you improving as individual first, and as team second - friendly competivity with your teammates is great!)\n\nEither way, little steps to get out of depression. Things will get better, I promise you. I know it.\n\nAnd stop getting drunk. Start to enjoy life again. You can do it. I know it. \n\nYou can stop with the alcohol abuse. I know you can do it. I believe in you! \n\n\n\n", "edited": 1398773540.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi Originalposter,&lt;/p&gt;\n\n&lt;p&gt;I thank you for the support ;). Actually, my choice about suicide is not written in the sand. It is mostly about what is going to happen with the university. I&amp;#39;m already stopping abusing computer, and I thank you for your assistance into driving me away from this bad habit.\nHow are you? Did you think about what I&amp;#39;ve said you ? &lt;/p&gt;\n\n&lt;p&gt;So, I wonder: will you follow your same tips? :P\nYou said me you think to be a fat fuck. I don&amp;#39;t know your current status, so I will just tell you: what about beginning a new sport? I read around that you think your social skills, in all these years, got a bit neglected.\nSo a sport, according to me, is a nice chance to meet new people. Also, it is something that could help you removing some dust from your social skills.&lt;/p&gt;\n\n&lt;p&gt;I advise you stuff like swimming or martial arts (Indeed, these are the sport I recommend the most because they rely on you improving as individual first, and as team second - friendly competivity with your teammates is great!)&lt;/p&gt;\n\n&lt;p&gt;Either way, little steps to get out of depression. Things will get better, I promise you. I know it.&lt;/p&gt;\n\n&lt;p&gt;And stop getting drunk. Start to enjoy life again. You can do it. I know it. &lt;/p&gt;\n\n&lt;p&gt;You can stop with the alcohol abuse. I know you can do it. I believe in you! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch4yhmu", "created": 1398800670.0, "author_flair_text": null, "created_utc": 1398771870.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4gdn1", "gilded": 0, "author": "the0riginalposter", "parent_id": "t3_23zp9k", "approved_by": null, "body": "Hi nemesis,\n\nYou responded to my post the other day and I thought I would follow up to see a little more about you.  Remember I told you I am 33, a binge drinker and other substance abuser since I have been 26.  I am not going to lie to you.  I have had depression my who life.  But there are definitely ways to suppress it - I don't recommend substance, but it kept me alive.  You are a young man - we both have something in common - we sit in front of a computer too many hours in our lives.  \n\nCreate yourself some sort of calendar reminder for an hour or two and get the fuck away from the computer.  And don't go to the dummy tube either.  Go for a walk.  Put your head phones on.  Go throw a frisbee.  Find something - just give it a try.  You are too young and I have been down the road.  Don't end up like me a fat fuck who does nothing but be a corporate tool who gets drunk every night.  You can do it - I know you can - you reached out to me - you put everything you are for and fought it against me.  You have more to live and are a bigger piece of the puzzle - you just don't know it - I know it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi nemesis,&lt;/p&gt;\n\n&lt;p&gt;You responded to my post the other day and I thought I would follow up to see a little more about you.  Remember I told you I am 33, a binge drinker and other substance abuser since I have been 26.  I am not going to lie to you.  I have had depression my who life.  But there are definitely ways to suppress it - I don&amp;#39;t recommend substance, but it kept me alive.  You are a young man - we both have something in common - we sit in front of a computer too many hours in our lives.  &lt;/p&gt;\n\n&lt;p&gt;Create yourself some sort of calendar reminder for an hour or two and get the fuck away from the computer.  And don&amp;#39;t go to the dummy tube either.  Go for a walk.  Put your head phones on.  Go throw a frisbee.  Find something - just give it a try.  You are too young and I have been down the road.  Don&amp;#39;t end up like me a fat fuck who does nothing but be a corporate tool who gets drunk every night.  You can do it - I know you can - you reached out to me - you put everything you are for and fought it against me.  You have more to live and are a bigger piece of the puzzle - you just don&amp;#39;t know it - I know it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zp9k", "score_hidden": false, "name": "t1_ch4gdn1", "created": 1398748389.0, "author_flair_text": null, "created_utc": 1398719589.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]