[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not going to say how but I found my method.  Should be painless and very easy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been depressed all my life.  Always seeked validation from others to make me happy.  ALWAYS.  And that is my downfall as I age.  I don&amp;#39;t know how to find inner happiness.  Lived a very fun life but it also turned out to be very toxic.&lt;/p&gt;\n\n&lt;p&gt;Anyway I&amp;#39;ll spend the rest of my savings and end it whenever I want.  I think my family saw my severe depression but don&amp;#39;t know I&amp;#39;m suicidal.  I didn&amp;#39;t even know until I looked up the signs.  Quit my job 3 years ago haven&amp;#39;t worked since.  Gave away a lot of stuff, sold my prized possessions.  I don&amp;#39;t even know why the fuck I&amp;#39;m posting this right now.  Just happy I found my exit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Not going to say how but I found my method.  Should be painless and very easy.\n\nI've been depressed all my life.  Always seeked validation from others to make me happy.  ALWAYS.  And that is my downfall as I age.  I don't know how to find inner happiness.  Lived a very fun life but it also turned out to be very toxic.\n\nAnyway I'll spend the rest of my savings and end it whenever I want.  I think my family saw my severe depression but don't know I'm suicidal.  I didn't even know until I looked up the signs.  Quit my job 3 years ago haven't worked since.  Gave away a lot of stuff, sold my prized possessions.  I don't even know why the fuck I'm posting this right now.  Just happy I found my exit.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242w9n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Wheredigo", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242w9n/im_pretty_happy_today_found_my_method_of_exit/", "name": "t3_242w9n", "created": 1398598756.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242w9n/im_pretty_happy_today_found_my_method_of_exit/", "author_flair_text": null, "title": "I'm pretty happy today. Found my method of exit.", "created_utc": 1398569956.0, "ups": 2, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch39vyw", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t1_ch39ktk", "approved_by": null, "body": "I also think death is a solution, it shouldn't have to be but it is. A lot of people just don't want to live life. It's very hard to explain that on reddit without everyone hating your opinion, found that out the hard way ;)\n\nI really see where you are coming from and it makes sense to me. You really sound like how I imagine my 30 year old self to be, Though honestly I never really planned on living until then anyway.\n\nI think that if you have really considered dying for some time, have thought it through, not just when you are in a volatile, emotional state, then it should be fine. It's your life and if you really think you don't want to live any more, that should be your choice. I hate to see people do something so drastic spontaneously.\n\nWould you like to pm me?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also think death is a solution, it shouldn&amp;#39;t have to be but it is. A lot of people just don&amp;#39;t want to live life. It&amp;#39;s very hard to explain that on reddit without everyone hating your opinion, found that out the hard way ;)&lt;/p&gt;\n\n&lt;p&gt;I really see where you are coming from and it makes sense to me. You really sound like how I imagine my 30 year old self to be, Though honestly I never really planned on living until then anyway.&lt;/p&gt;\n\n&lt;p&gt;I think that if you have really considered dying for some time, have thought it through, not just when you are in a volatile, emotional state, then it should be fine. It&amp;#39;s your life and if you really think you don&amp;#39;t want to live any more, that should be your choice. I hate to see people do something so drastic spontaneously.&lt;/p&gt;\n\n&lt;p&gt;Would you like to pm me?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w9n", "score_hidden": false, "name": "t1_ch39vyw", "created": 1398609800.0, "author_flair_text": null, "created_utc": 1398606200.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch39ktk", "gilded": 0, "author": "Wheredigo", "parent_id": "t1_ch38amn", "approved_by": null, "body": "Thanks man.\n\nDeath is a solution in my opinion.  I believe it's not a bad thing.  It's just my philosophy.  It doesn't matter overall, we're all here just to fart around and die.\n\nI don't think I lived life \"wrong\", as there is no right or wrong way to live.  But there is a better way to live, if living long is your goal.  I only cared about myself growing up.  Very small family, not much socializing.  So mostly I only cared about money, materialistic things, and living a hedonistic life.  Looking back, it was a very empty life.  Toys only made me happy temporarily.  Lived a very superficial life.\n\nDue to my lifestyle and upbringing, it's very hard to make friends normally.  Hard to get a job.  It's over.  I mean it worked out when I was younger because people still believe you can make something of yourself.  Now I'm 30 and employers see that I'm not married, I abandoned my career, and they see the pattern.  Women don't see value in me either, as I haven't made anything of my life.  They're all correct.  I'm not that normal career oriented, family man.  All I do in life, and all I enjoy, is fucking around.\n\nSo like I said, it was fun when I was young, but now I realize how toxic my lifestyle is.  I don't enjoy settling down, so how can I?  I only enjoy being bad and dysfunctional.  That doesn't work out long term.\n\nWhen I quit my job I went traveling for a while.  Was hoping to get kidnapped or die along the way, never happened.  Ended up having fun.  Now I fully realize my life is not getting back on track, and I don't want a normal life, I'll just spend the rest of my savings and die.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks man.&lt;/p&gt;\n\n&lt;p&gt;Death is a solution in my opinion.  I believe it&amp;#39;s not a bad thing.  It&amp;#39;s just my philosophy.  It doesn&amp;#39;t matter overall, we&amp;#39;re all here just to fart around and die.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I lived life &amp;quot;wrong&amp;quot;, as there is no right or wrong way to live.  But there is a better way to live, if living long is your goal.  I only cared about myself growing up.  Very small family, not much socializing.  So mostly I only cared about money, materialistic things, and living a hedonistic life.  Looking back, it was a very empty life.  Toys only made me happy temporarily.  Lived a very superficial life.&lt;/p&gt;\n\n&lt;p&gt;Due to my lifestyle and upbringing, it&amp;#39;s very hard to make friends normally.  Hard to get a job.  It&amp;#39;s over.  I mean it worked out when I was younger because people still believe you can make something of yourself.  Now I&amp;#39;m 30 and employers see that I&amp;#39;m not married, I abandoned my career, and they see the pattern.  Women don&amp;#39;t see value in me either, as I haven&amp;#39;t made anything of my life.  They&amp;#39;re all correct.  I&amp;#39;m not that normal career oriented, family man.  All I do in life, and all I enjoy, is fucking around.&lt;/p&gt;\n\n&lt;p&gt;So like I said, it was fun when I was young, but now I realize how toxic my lifestyle is.  I don&amp;#39;t enjoy settling down, so how can I?  I only enjoy being bad and dysfunctional.  That doesn&amp;#39;t work out long term.&lt;/p&gt;\n\n&lt;p&gt;When I quit my job I went traveling for a while.  Was hoping to get kidnapped or die along the way, never happened.  Ended up having fun.  Now I fully realize my life is not getting back on track, and I don&amp;#39;t want a normal life, I&amp;#39;ll just spend the rest of my savings and die.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w9n", "score_hidden": false, "name": "t1_ch39ktk", "created": 1398608581.0, "author_flair_text": null, "created_utc": 1398604981.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch38amn", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t3_242w9n", "approved_by": null, "body": "This may be looked down upon by people here but I'm actually happy that you have found an exit that you are happy with. Many people go through a lot of pain wondering if they should, wondering how they will do it, wondering what will be waiting for them. I'm happy you doing what you think is right.\n\nHowever. I still think that death shouldn't be a solution. You made this 7 hours ago so I'm kind of worried you aren't even here any more. but if you are, could you explain more about your life? Could you tell us more about why you think suicide is the the solution?\n\nI really hope you are still well, I so I would just like to talk, maybe we could be friends :) . But if you are not, then good for you, and I hope you have found peace.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may be looked down upon by people here but I&amp;#39;m actually happy that you have found an exit that you are happy with. Many people go through a lot of pain wondering if they should, wondering how they will do it, wondering what will be waiting for them. I&amp;#39;m happy you doing what you think is right.&lt;/p&gt;\n\n&lt;p&gt;However. I still think that death shouldn&amp;#39;t be a solution. You made this 7 hours ago so I&amp;#39;m kind of worried you aren&amp;#39;t even here any more. but if you are, could you explain more about your life? Could you tell us more about why you think suicide is the the solution?&lt;/p&gt;\n\n&lt;p&gt;I really hope you are still well, I so I would just like to talk, maybe we could be friends :) . But if you are not, then good for you, and I hope you have found peace.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w9n", "score_hidden": false, "name": "t1_ch38amn", "created": 1398602077.0, "author_flair_text": null, "created_utc": 1398598477.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch39sy6", "gilded": 0, "author": "Wheredigo", "parent_id": "t1_ch324s6", "approved_by": null, "body": "Totally.  I agree small things help in life.  Also a sense of humor, I love it when things go wrong and everyone gets a laugh.  Unfortunately when my mood is bad, and I self reflect, all these funny moments come back in a different light.  It totally wrecks me.\n\nSome personalities mainly get happiness from external factors.  I need constant validation.  But it's harder to obtain as you age... your looks start to go, your career is judged more harshly, etc.  At this point, when an employer rejects me, I just stop hunting.  When a woman rejects me, I also give up.  It really affects me.\n\nToxic life in that I enjoy self destruction apparently.  I love laughing at myself, having others laugh at me.  Being a fuck up.  Always related to the loveable loser characters (George Costanza/Larry David, Chris Farley, etc).  If I succeeded at things, it wasn't funny, didn't entertain me, and I'd rather see myself burn.  Not a sadist, and I am too soft at heart to hurt anyone else, but I do enjoy seeing things go wrong.  This doesn't work out in the long term, as there's only so much you can destroy in life.  Even about my death, I hope my friends/family reaction would be \"I'm surprised he made it this far\" or \"That dude still owed me $100!\".  Or on my tombstone write \"Died from stubborness\".  That would be funny.\n\nI will take your advice and treat myself to some more things.  Maybe do some volunteer work too, since that makes me happy.  Hope the best for you.  Deep down inside I know I can improve, and so can you, but personally I have no reason to.  Die at 30 or 80, doesn't matter.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally.  I agree small things help in life.  Also a sense of humor, I love it when things go wrong and everyone gets a laugh.  Unfortunately when my mood is bad, and I self reflect, all these funny moments come back in a different light.  It totally wrecks me.&lt;/p&gt;\n\n&lt;p&gt;Some personalities mainly get happiness from external factors.  I need constant validation.  But it&amp;#39;s harder to obtain as you age... your looks start to go, your career is judged more harshly, etc.  At this point, when an employer rejects me, I just stop hunting.  When a woman rejects me, I also give up.  It really affects me.&lt;/p&gt;\n\n&lt;p&gt;Toxic life in that I enjoy self destruction apparently.  I love laughing at myself, having others laugh at me.  Being a fuck up.  Always related to the loveable loser characters (George Costanza/Larry David, Chris Farley, etc).  If I succeeded at things, it wasn&amp;#39;t funny, didn&amp;#39;t entertain me, and I&amp;#39;d rather see myself burn.  Not a sadist, and I am too soft at heart to hurt anyone else, but I do enjoy seeing things go wrong.  This doesn&amp;#39;t work out in the long term, as there&amp;#39;s only so much you can destroy in life.  Even about my death, I hope my friends/family reaction would be &amp;quot;I&amp;#39;m surprised he made it this far&amp;quot; or &amp;quot;That dude still owed me $100!&amp;quot;.  Or on my tombstone write &amp;quot;Died from stubborness&amp;quot;.  That would be funny.&lt;/p&gt;\n\n&lt;p&gt;I will take your advice and treat myself to some more things.  Maybe do some volunteer work too, since that makes me happy.  Hope the best for you.  Deep down inside I know I can improve, and so can you, but personally I have no reason to.  Die at 30 or 80, doesn&amp;#39;t matter.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w9n", "score_hidden": false, "name": "t1_ch39sy6", "created": 1398609492.0, "author_flair_text": null, "created_utc": 1398605892.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch324s6", "gilded": 0, "author": "[deleted]", "parent_id": "t3_242w9n", "approved_by": null, "body": "[deleted]", "edited": 1398570839.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242w9n", "score_hidden": false, "name": "t1_ch324s6", "created": 1398574034.0, "author_flair_text": null, "created_utc": 1398570434.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]