[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve been depressed for about four years. It started my freshman year in college when the group I hung out with basically made me the person everyone gave shit to. This ruined my self esteem to the point of no return. The endless ridicule with the guise of friendly banter. All I felt was rage on the inside and i do now. I feel like I can&amp;#39;t make a good social life for myself either because I&amp;#39;m too awkward or I&amp;#39;m just there to make people feel better about themselves. I&amp;#39;ve flunked out of three schools and am just starting to go back after being in rehab treatment for alcoholism since I used booze to numb the pain. Every day I get closer to accepting this is my life and it won&amp;#39;t change. I&amp;#39;m not ready to commit suicide yet but afraid I will if things don&amp;#39;t get better. Any advice? thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I've been depressed for about four years. It started my freshman year in college when the group I hung out with basically made me the person everyone gave shit to. This ruined my self esteem to the point of no return. The endless ridicule with the guise of friendly banter. All I felt was rage on the inside and i do now. I feel like I can't make a good social life for myself either because I'm too awkward or I'm just there to make people feel better about themselves. I've flunked out of three schools and am just starting to go back after being in rehab treatment for alcoholism since I used booze to numb the pain. Every day I get closer to accepting this is my life and it won't change. I'm not ready to commit suicide yet but afraid I will if things don't get better. Any advice? thanks", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252vgt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Adams241", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252vgt/im_really_ready_to_end_it/", "name": "t3_252vgt", "created": 1399616391.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252vgt/im_really_ready_to_end_it/", "author_flair_text": null, "title": "I'm really ready to end it.", "created_utc": 1399587591.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd7zto", "gilded": 0, "author": "Adams241", "parent_id": "t1_chd5wsc", "approved_by": null, "body": "In a lot of ways, I just lost all self esteem to make friends because I feel like everyone will automatically deem me someone not worthy of hanging out. I can't tell other people about these things because if I do it shows I can't handle things and am weak. My friends from my first school which was in baltimore, were mainly just throwing me under the bus to impress other people and if one person started it the whole group would join in where I had to keep quiet just to not get bullied. I am a political science major and am thinking of going to the UK either for a semester abroad or graduate school since it is a only a year and is cheaper. I transferred after the school in baltimore and thats when my I started to abuse alcohol. It just shut everything down all the thoughts I was worthless and just memories of getting ripped on constantly and preferred to stay in my dorm. The third school I just did the same but the alcoholism got to the point I went through the Dts and had to go to rehab so now Im going to community college transferring to a 4 year. I don't use the AA 12 steps because its too god focused so I'm doing smartrecovery and therapy. I worry about making friends anyone because I don't want to be ripped on. I can take banter well and can give it back its just when its globbed on to one person and it  seems its not joking anymore that it is a problem", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a lot of ways, I just lost all self esteem to make friends because I feel like everyone will automatically deem me someone not worthy of hanging out. I can&amp;#39;t tell other people about these things because if I do it shows I can&amp;#39;t handle things and am weak. My friends from my first school which was in baltimore, were mainly just throwing me under the bus to impress other people and if one person started it the whole group would join in where I had to keep quiet just to not get bullied. I am a political science major and am thinking of going to the UK either for a semester abroad or graduate school since it is a only a year and is cheaper. I transferred after the school in baltimore and thats when my I started to abuse alcohol. It just shut everything down all the thoughts I was worthless and just memories of getting ripped on constantly and preferred to stay in my dorm. The third school I just did the same but the alcoholism got to the point I went through the Dts and had to go to rehab so now Im going to community college transferring to a 4 year. I don&amp;#39;t use the AA 12 steps because its too god focused so I&amp;#39;m doing smartrecovery and therapy. I worry about making friends anyone because I don&amp;#39;t want to be ripped on. I can take banter well and can give it back its just when its globbed on to one person and it  seems its not joking anymore that it is a problem&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252vgt", "score_hidden": false, "name": "t1_chd7zto", "created": 1399625234.0, "author_flair_text": null, "created_utc": 1399596434.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd5wsc", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t3_252vgt", "approved_by": null, "body": "Hi there Adams241, it's a pleasure to meet you :-)\n\nI hope you don't mind, but I had a brief stalk through your reddit profile :-) It's wonderful to hear you're thinking of doing some study in the UK. I can't speak much for Manchester (i've never been!) But Birmingham is an amazing city! They have a fast food pie shop! It's incredible :-)\n\nThank you for posting on here and telling us about yourself. I'm sorry you feel the group you hung out with treated you the way they describe. What was it they were doing/saying that made you feel this way? It's perfectly fine to feel angry :-) What is it you feel most angry about? If you don't mind me asking of course.\n\nI'm very happy to hear you're making positive steps in your life regarding your alcoholism :-) I would love to hear how you got to that point in your life, and how you made the steps to fight it too?\n\nIt seems , from the other threads, that you are worried about making new friends over in England if you do decide to come study over here for a bit. What is it you study? I can promise you you will find groups of people with similar interests and hobbies over here :-)\n\nBeing able to post on here is a very brave and admirable thing to do, and you made your points very coherently and sensibly. To me, it doesn't seem like your too awkward :-) What about those three schools made you, in your words, flunk out?\n\nMuch Love\nJoshy", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there Adams241, it&amp;#39;s a pleasure to meet you :-)&lt;/p&gt;\n\n&lt;p&gt;I hope you don&amp;#39;t mind, but I had a brief stalk through your reddit profile :-) It&amp;#39;s wonderful to hear you&amp;#39;re thinking of doing some study in the UK. I can&amp;#39;t speak much for Manchester (i&amp;#39;ve never been!) But Birmingham is an amazing city! They have a fast food pie shop! It&amp;#39;s incredible :-)&lt;/p&gt;\n\n&lt;p&gt;Thank you for posting on here and telling us about yourself. I&amp;#39;m sorry you feel the group you hung out with treated you the way they describe. What was it they were doing/saying that made you feel this way? It&amp;#39;s perfectly fine to feel angry :-) What is it you feel most angry about? If you don&amp;#39;t mind me asking of course.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very happy to hear you&amp;#39;re making positive steps in your life regarding your alcoholism :-) I would love to hear how you got to that point in your life, and how you made the steps to fight it too?&lt;/p&gt;\n\n&lt;p&gt;It seems , from the other threads, that you are worried about making new friends over in England if you do decide to come study over here for a bit. What is it you study? I can promise you you will find groups of people with similar interests and hobbies over here :-)&lt;/p&gt;\n\n&lt;p&gt;Being able to post on here is a very brave and admirable thing to do, and you made your points very coherently and sensibly. To me, it doesn&amp;#39;t seem like your too awkward :-) What about those three schools made you, in your words, flunk out?&lt;/p&gt;\n\n&lt;p&gt;Much Love\nJoshy&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252vgt", "score_hidden": false, "name": "t1_chd5wsc", "created": 1399620903.0, "author_flair_text": null, "created_utc": 1399592103.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]