[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So i finally came to peace with my terms. I had plans for later in life, but i&amp;#39;m just too messed up to even consider them. No one will ever like me, no one will understand me. Who wants to get to know a freak? Who wants to know someone who has tried everything but still cant relate, still find happiness?  The clock is ticking. If you want to know anything else, go to my history. I wish i wasn&amp;#39;t like this, but hey. Life is unfair, and im willing to testify for that. Sorry to anyone who loved me. To my parents,(You&amp;#39;ll probably both read this)I&amp;#39;m sorry I wasn&amp;#39;t a good son. I never wanted to do this but I am alone, and always have been. my generation is unforgiving and cruel. To my friends and everyone else, see you on the other side.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So i finally came to peace with my terms. I had plans for later in life, but i'm just too messed up to even consider them. No one will ever like me, no one will understand me. Who wants to get to know a freak? Who wants to know someone who has tried everything but still cant relate, still find happiness?  The clock is ticking. If you want to know anything else, go to my history. I wish i wasn't like this, but hey. Life is unfair, and im willing to testify for that. Sorry to anyone who loved me. To my parents,(You'll probably both read this)I'm sorry I wasn't a good son. I never wanted to do this but I am alone, and always have been. my generation is unforgiving and cruel. To my friends and everyone else, see you on the other side.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23t920", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "coloradobro", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398296884.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23t920/im_ready_tonight_is_the_night/", "name": "t3_23t920", "created": 1398324481.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23t920/im_ready_tonight_is_the_night/", "author_flair_text": null, "title": "im ready, tonight is the night", "created_utc": 1398295681.0, "ups": 12, "num_comments": 25, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0f7dg", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0ezfs", "approved_by": null, "body": "I've been there before at 16 years old. Financial matters make the hospital a no go. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been there before at 16 years old. Financial matters make the hospital a no go. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0f7dg", "created": 1398330186.0, "author_flair_text": null, "created_utc": 1398301386.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0ezfs", "gilded": 0, "author": "Szymanski", "parent_id": "t1_ch0edri", "approved_by": null, "body": "Maybe you could look for a person or group in your area that would just listen to you. Just listen, not try to intervene, not try to do anything. Sometimes someone asking questions and you just answering them with whatever is on your mind is a really good way to balance your thoughts out.  \n\nAnother, more bold suggestion, is checking yourself into the hospital. It takes a ton of courage I know, and because hospitals are super strange environments, you might not want to. But I can assure you, they aren't as bad as the movies or tv make them out to be. They provide a safe environment and there are people there that are at your disposal 24/7. Nurses, Therapists, Doctors, Psychologists, Nutritionists. All there in an attempt to better yourself. Plus, you'll be surrounded with people going through some of the same things you are experiencing, giving you their perspectives on it and sympathizing with you along the way. A one week stay at the hosptial, or even a month long stay at a residential treatment center is a fantastic way to remove any outside stressors and allow you to focus on the most important part of life, you :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you could look for a person or group in your area that would just listen to you. Just listen, not try to intervene, not try to do anything. Sometimes someone asking questions and you just answering them with whatever is on your mind is a really good way to balance your thoughts out.  &lt;/p&gt;\n\n&lt;p&gt;Another, more bold suggestion, is checking yourself into the hospital. It takes a ton of courage I know, and because hospitals are super strange environments, you might not want to. But I can assure you, they aren&amp;#39;t as bad as the movies or tv make them out to be. They provide a safe environment and there are people there that are at your disposal 24/7. Nurses, Therapists, Doctors, Psychologists, Nutritionists. All there in an attempt to better yourself. Plus, you&amp;#39;ll be surrounded with people going through some of the same things you are experiencing, giving you their perspectives on it and sympathizing with you along the way. A one week stay at the hosptial, or even a month long stay at a residential treatment center is a fantastic way to remove any outside stressors and allow you to focus on the most important part of life, you :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0ezfs", "created": 1398329720.0, "author_flair_text": null, "created_utc": 1398300920.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0edri", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0dskd", "approved_by": null, "body": "Contacted my best friend. His girlfriend took over from there and has been prolonging my actions. My parents only ask why, and do not comprehend my pain. I was a triathlete, a semi pro disc golfer, writer, reader, hiker, and i loved researching architecture. Now, i am left with nothing but my bed and 10 bottles of pills.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Contacted my best friend. His girlfriend took over from there and has been prolonging my actions. My parents only ask why, and do not comprehend my pain. I was a triathlete, a semi pro disc golfer, writer, reader, hiker, and i loved researching architecture. Now, i am left with nothing but my bed and 10 bottles of pills.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0edri", "created": 1398328438.0, "author_flair_text": null, "created_utc": 1398299638.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch0dskd", "gilded": 0, "author": "Szymanski", "parent_id": "t1_ch0dc6e", "approved_by": null, "body": "I'm right here with you my man. It seems like you need to get out of the environment you are in, college needs to be put aside. As hard as it might be if you are super invested in school, you have to place your schooling on the back burner and focus on yourself. That is your number one priority. Have you tried talking to anyone close to you? Its super key that you get in touch with a friend or family member, even if its by phone or text. Tell them your situation.   \n\nAlso, what hobbies did you used to have that you have now lost interest in? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m right here with you my man. It seems like you need to get out of the environment you are in, college needs to be put aside. As hard as it might be if you are super invested in school, you have to place your schooling on the back burner and focus on yourself. That is your number one priority. Have you tried talking to anyone close to you? Its super key that you get in touch with a friend or family member, even if its by phone or text. Tell them your situation.   &lt;/p&gt;\n\n&lt;p&gt;Also, what hobbies did you used to have that you have now lost interest in? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0dskd", "created": 1398327170.0, "author_flair_text": null, "created_utc": 1398298370.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0fc8a", "gilded": 0, "author": "PillarsOfHeaven", "parent_id": "t1_ch0dc6e", "approved_by": null, "body": "It looks like therapy is what can help you push through these depressive barriers. These barriers are strengthened by the people around you that aren't appreciative of the fact that you are indeed suffering dark thoughts, don't let them and their misunderstandings make you think you're alone. I'm sure your parents and friends would help if they only knew how and they only know what you've told them and nothing deeper. If sharing your feelings with a group or a confidant, like a therapist, can help you discard your emotional walls leading to more supportive infrastructure within your own mind then it's worth a shot. Once you've died I cannot say what happens but the vast majority of people who've jumped off a bridge and lived reported the realization that every one of their problems could be fixed.\nPlease check into a hospital. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like therapy is what can help you push through these depressive barriers. These barriers are strengthened by the people around you that aren&amp;#39;t appreciative of the fact that you are indeed suffering dark thoughts, don&amp;#39;t let them and their misunderstandings make you think you&amp;#39;re alone. I&amp;#39;m sure your parents and friends would help if they only knew how and they only know what you&amp;#39;ve told them and nothing deeper. If sharing your feelings with a group or a confidant, like a therapist, can help you discard your emotional walls leading to more supportive infrastructure within your own mind then it&amp;#39;s worth a shot. Once you&amp;#39;ve died I cannot say what happens but the vast majority of people who&amp;#39;ve jumped off a bridge and lived reported the realization that every one of their problems could be fixed.\nPlease check into a hospital. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0fc8a", "created": 1398305279.0, "author_flair_text": null, "created_utc": 1398301679.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch0dc6e", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0d343", "approved_by": null, "body": "Out of state for college in a fraternity.  I've struggled with depression for years. I was finally over it until I came to this hell. Everyone is unforgiving,  judgmental and offers no help in life but instead cruelty. I've relapsed on drugs, I've lost interest in all hobbies, and my grades have plummeted. I've been in therapy and group therapy for 5 months. Before i came here i had a year of therapy under my belt. I just had a breakthrough on my childhood trauma, and had plans for this summer. Now, I see nothing but death. Suicide has been on my mind for years, everyday. Hell, I tried when I was 16. I'm a druggie. A rager. A freak. I am ending it now", "edited": 1398297654.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Out of state for college in a fraternity.  I&amp;#39;ve struggled with depression for years. I was finally over it until I came to this hell. Everyone is unforgiving,  judgmental and offers no help in life but instead cruelty. I&amp;#39;ve relapsed on drugs, I&amp;#39;ve lost interest in all hobbies, and my grades have plummeted. I&amp;#39;ve been in therapy and group therapy for 5 months. Before i came here i had a year of therapy under my belt. I just had a breakthrough on my childhood trauma, and had plans for this summer. Now, I see nothing but death. Suicide has been on my mind for years, everyday. Hell, I tried when I was 16. I&amp;#39;m a druggie. A rager. A freak. I am ending it now&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0dc6e", "created": 1398326204.0, "author_flair_text": null, "created_utc": 1398297404.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0d343", "gilded": 0, "author": "Szymanski", "parent_id": "t3_23t920", "approved_by": null, "body": "Slow down mate! I know the feeling, your mind is probably racing right now, emotions out of control. I totally get that, but could you explain your situation a bit more? I'm willing to listen if you're willing to tell me :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Slow down mate! I know the feeling, your mind is probably racing right now, emotions out of control. I totally get that, but could you explain your situation a bit more? I&amp;#39;m willing to listen if you&amp;#39;re willing to tell me :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0d343", "created": 1398325650.0, "author_flair_text": null, "created_utc": 1398296850.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0i0my", "gilded": 0, "author": "DoYouEvenShit", "parent_id": "t3_23t920", "approved_by": null, "body": "I really hope you don't go on with what you're choosing. Even though I do not know you, it would be a hard next few days knowing that someone had reached out and yet still chose to go on with it. I understand how incredibly difficult life can be but understand that we have 27 thousand people on this subreddit that can help you somehow. None of us want to see you go and we really hope you keep us updated.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really hope you don&amp;#39;t go on with what you&amp;#39;re choosing. Even though I do not know you, it would be a hard next few days knowing that someone had reached out and yet still chose to go on with it. I understand how incredibly difficult life can be but understand that we have 27 thousand people on this subreddit that can help you somehow. None of us want to see you go and we really hope you keep us updated.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0i0my", "created": 1398336050.0, "author_flair_text": null, "created_utc": 1398307250.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0lubl", "gilded": 0, "author": "limbooo", "parent_id": "t3_23t920", "approved_by": null, "body": "This generation is cruel and unforgiving. I'm so tired too.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This generation is cruel and unforgiving. I&amp;#39;m so tired too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0lubl", "created": 1398345363.0, "author_flair_text": null, "created_utc": 1398316563.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfrs3b", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch2tkhg", "approved_by": null, "body": "Sorry for the long overdue update, i feel as if i scared some people. Yes, I am alive, and yes I am back home. I still have urges to kill myself, including right now, and my severe depression along with my insomnia still hangs around. However, Ive talked with my parents and my counselors at UNL and my old psychologist at home in a group call, and I've gotten some help. I will be in counseling all year, and i have been prescribed an anti depressant and a sleeping aid. Life goes on, and hopefully i can get better. Right now, I am just waiting for the anti depressants to do their work.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the long overdue update, i feel as if i scared some people. Yes, I am alive, and yes I am back home. I still have urges to kill myself, including right now, and my severe depression along with my insomnia still hangs around. However, Ive talked with my parents and my counselors at UNL and my old psychologist at home in a group call, and I&amp;#39;ve gotten some help. I will be in counseling all year, and i have been prescribed an anti depressant and a sleeping aid. Life goes on, and hopefully i can get better. Right now, I am just waiting for the anti depressants to do their work.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_chfrs3b", "created": 1399904843.0, "author_flair_text": null, "created_utc": 1399876043.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2tkhg", "gilded": 0, "author": "DoYouEvenShit", "parent_id": "t3_23t920", "approved_by": null, "body": "Can you keep us updated?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you keep us updated?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch2tkhg", "created": 1398576268.0, "author_flair_text": null, "created_utc": 1398547468.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0rnjc", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0rfj3", "approved_by": null, "body": "ok! will do.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ok! will do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0rnjc", "created": 1398373542.0, "author_flair_text": null, "created_utc": 1398344742.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0rfj3", "gilded": 0, "author": "SyndicateSC2", "parent_id": "t1_ch0gc7v", "approved_by": null, "body": "Listen to this immediately!: https://www.youtube.com/watch?v=2pcLtSle714#t=678         COLORADOBRO DONT DO IT- Dexters final seasons were bad. You have a lot more to watch! Dexter is pretty good Season 1-4 were great! For tip top tier: Watch The Wire and The Shield. Download emulators for oldschool classic games that you may or may not have played during your childhood. Listen to this ", "edited": 1398344282.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listen to this immediately!: &lt;a href=\"https://www.youtube.com/watch?v=2pcLtSle714#t=678\"&gt;https://www.youtube.com/watch?v=2pcLtSle714#t=678&lt;/a&gt;         COLORADOBRO DONT DO IT- Dexters final seasons were bad. You have a lot more to watch! Dexter is pretty good Season 1-4 were great! For tip top tier: Watch The Wire and The Shield. Download emulators for oldschool classic games that you may or may not have played during your childhood. Listen to this &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0rfj3", "created": 1398372785.0, "author_flair_text": null, "created_utc": 1398343985.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chftuu3", "gilded": 0, "author": "cya-KH", "parent_id": "t1_chftn0i", "approved_by": null, "body": "   Well peep show is like a comedy about two awkward guys, and its shot with head cams and they use internal monolog a lot so you see things from the character's perspective. its a very British comedy though. and I'll say for the insomnia, I had that for a long time. The best way to get over it is to stop drinking coffee and alcohol (and stop smoking if you do). Then 30 minutes before bed, avoid watching tv or going on the computer. Those things are stimulants and will keep you up. then if you're not a sleep after 15 minutes, get up and do some non stimulating thing until you feel tired then try sleeping again. It worked wonders for me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well peep show is like a comedy about two awkward guys, and its shot with head cams and they use internal monolog a lot so you see things from the character&amp;#39;s perspective. its a very British comedy though. and I&amp;#39;ll say for the insomnia, I had that for a long time. The best way to get over it is to stop drinking coffee and alcohol (and stop smoking if you do). Then 30 minutes before bed, avoid watching tv or going on the computer. Those things are stimulants and will keep you up. then if you&amp;#39;re not a sleep after 15 minutes, get up and do some non stimulating thing until you feel tired then try sleeping again. It worked wonders for me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_chftuu3", "created": 1399915811.0, "author_flair_text": null, "created_utc": 1399887011.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chftn0i", "gilded": 0, "author": "coloradobro", "parent_id": "t1_chftmji", "approved_by": null, "body": "Homeland is excellent! As an insomniac i just spend time watching tv now. Could you describe peepshow though?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Homeland is excellent! As an insomniac i just spend time watching tv now. Could you describe peepshow though?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_chftn0i", "created": 1399914386.0, "author_flair_text": null, "created_utc": 1399885586.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chftmji", "gilded": 0, "author": "cya-KH", "parent_id": "t1_chfrqhm", "approved_by": null, "body": "Sure man. depends what you want, if its a drama like Dexter you're looking for, then I've just started watching the walking dead and homeland and they're really good. If its some comedies you want, then I love archer and bobs burgers. Not sure if you get it in America, but one of my all time favourites is peep show. Hope you'll like any of them, and I'm glad to know you're ok.    ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure man. depends what you want, if its a drama like Dexter you&amp;#39;re looking for, then I&amp;#39;ve just started watching the walking dead and homeland and they&amp;#39;re really good. If its some comedies you want, then I love archer and bobs burgers. Not sure if you get it in America, but one of my all time favourites is peep show. Hope you&amp;#39;ll like any of them, and I&amp;#39;m glad to know you&amp;#39;re ok.    &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_chftmji", "created": 1399914297.0, "author_flair_text": null, "created_utc": 1399885497.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfrqhm", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0gtqh", "approved_by": null, "body": "please recommend them to me! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;please recommend them to me! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_chfrqhm", "created": 1399904670.0, "author_flair_text": null, "created_utc": 1399875870.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0gtqh", "gilded": 0, "author": "cya-KH", "parent_id": "t1_ch0gc7v", "approved_by": null, "body": "Yeah, Dexter was pretty damn good. All I can say is fined a new TV show. I know plenty I could recommend if you want.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, Dexter was pretty damn good. All I can say is fined a new TV show. I know plenty I could recommend if you want.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0gtqh", "created": 1398308414.0, "author_flair_text": null, "created_utc": 1398304814.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0gc7v", "gilded": 0, "author": "coloradobro", "parent_id": "t1_ch0fxgf", "approved_by": null, "body": "Lol I wanted to finish dexter before I did. I finished it yesterday. Anything helps man", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol I wanted to finish dexter before I did. I finished it yesterday. Anything helps man&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0gc7v", "created": 1398332606.0, "author_flair_text": null, "created_utc": 1398303806.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch0fxgf", "gilded": 0, "author": "cya-KH", "parent_id": "t3_23t920", "approved_by": null, "body": "I'm not going to say I know exactly what you're feeling, everyone experience of depression is different, and I know it can sound some what condescending when people try to relate. however I'm in similar circumstances. I'm 19 and have suffered from depression for many years, it got so bad I had to drop out of university. Things that help me are know I can talk to people, turns out five of my good friends also have depression. nothing about this makes you a freak or unlikeable, in fact its pretty common. however the best thing to do at a moment like this is to just find a reason to postpone it. I nearly killed myself 6 months ago, but I was watching breaking bad at the time and wanted to finish it first. that's a silly example I know but it saved my life. why not try giving everyone you love one last good memory of you, like go for a drink with a friend or spend the day with you parents. and if god forbid you ever though with it, that last memory will mean the world to them. I hope this helps in the slightest. message me if you ever wont to chat about things.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to say I know exactly what you&amp;#39;re feeling, everyone experience of depression is different, and I know it can sound some what condescending when people try to relate. however I&amp;#39;m in similar circumstances. I&amp;#39;m 19 and have suffered from depression for many years, it got so bad I had to drop out of university. Things that help me are know I can talk to people, turns out five of my good friends also have depression. nothing about this makes you a freak or unlikeable, in fact its pretty common. however the best thing to do at a moment like this is to just find a reason to postpone it. I nearly killed myself 6 months ago, but I was watching breaking bad at the time and wanted to finish it first. that&amp;#39;s a silly example I know but it saved my life. why not try giving everyone you love one last good memory of you, like go for a drink with a friend or spend the day with you parents. and if god forbid you ever though with it, that last memory will mean the world to them. I hope this helps in the slightest. message me if you ever wont to chat about things.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23t920", "score_hidden": false, "name": "t1_ch0fxgf", "created": 1398331742.0, "author_flair_text": null, "created_utc": 1398302942.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]