[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have internet friends, but I have no friends at my school and people make fun of me all the time then. Talking to my friends over the web helps, but I just can&amp;#39;t deal with it anymore. There are so many things wrong with me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have internet friends, but I have no friends at my school and people make fun of me all the time then. Talking to my friends over the web helps, but I just can't deal with it anymore. There are so many things wrong with me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24x6fb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "LegendOfPickles", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24x6fb/im_so_lonely/", "name": "t3_24x6fb", "created": 1399460212.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24x6fb/im_so_lonely/", "author_flair_text": null, "title": "I'm so lonely", "created_utc": 1399431412.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbl5b3", "gilded": 0, "author": "TurtleFantasy", "parent_id": "t3_24x6fb", "approved_by": null, "body": "I know the feeling. I dont know if I can make a difference, but heres what I did. Laugh. Laugh as they make fun of you. And for the friends. Just start talking to people you think you can be friends with. I hope you can heed our words. We're always here. Just ask. Good luck.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know the feeling. I dont know if I can make a difference, but heres what I did. Laugh. Laugh as they make fun of you. And for the friends. Just start talking to people you think you can be friends with. I hope you can heed our words. We&amp;#39;re always here. Just ask. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x6fb", "score_hidden": false, "name": "t1_chbl5b3", "created": 1399465211.0, "author_flair_text": null, "created_utc": 1399436411.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbjo3g", "gilded": 0, "author": "sofar1776", "parent_id": "t3_24x6fb", "approved_by": null, "body": "There are things wrong with all of us. Nobody in the world is perfect. I am not going to try to tell you to just go make friends, if it was that easy you would have just taken care of it already. Maybe there is someone you haven't considered talking to. Depends on how big your school is, and I have no idea. Please keep trying. School is important, but later in life you might be surprised to realize how small that world can be. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are things wrong with all of us. Nobody in the world is perfect. I am not going to try to tell you to just go make friends, if it was that easy you would have just taken care of it already. Maybe there is someone you haven&amp;#39;t considered talking to. Depends on how big your school is, and I have no idea. Please keep trying. School is important, but later in life you might be surprised to realize how small that world can be. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x6fb", "score_hidden": false, "name": "t1_chbjo3g", "created": 1399461502.0, "author_flair_text": null, "created_utc": 1399432702.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbm96j", "gilded": 0, "author": "PoppyCokc", "parent_id": "t3_24x6fb", "approved_by": null, "body": "I doubt there is as much wrong with you as you think. Sometimes you have to put a little effort in to relationships and step out side of your comfort zone to try and make friends. I am plagued by social anxiety, like to the extent that I lie to people about going out somewhere and want to avoid any awkward interactions. It seriously sucked for a long time because I would feel like everyone was judging me or not accepting me but in reality I just wasn't making the effort to interact with people because I was too afraid. When I finally realized that I could determine my own fate, I started slowly forcing myself out of my shell and strike up conversation with strangers. Now though I am not 'cured' and still get this anxiety, I have a network of people around that help me get through it. We all need social interaction and while the internet can provide a medium for this, physical real world contact is also necessary I think. People used to tell me that exercise would really help me feel better too, and I thought it was total BS until I started riding my bike and actually feel this weird positive sensastion hah.   \nIf you do want to chat or anything pm me, if not that's okay too.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubt there is as much wrong with you as you think. Sometimes you have to put a little effort in to relationships and step out side of your comfort zone to try and make friends. I am plagued by social anxiety, like to the extent that I lie to people about going out somewhere and want to avoid any awkward interactions. It seriously sucked for a long time because I would feel like everyone was judging me or not accepting me but in reality I just wasn&amp;#39;t making the effort to interact with people because I was too afraid. When I finally realized that I could determine my own fate, I started slowly forcing myself out of my shell and strike up conversation with strangers. Now though I am not &amp;#39;cured&amp;#39; and still get this anxiety, I have a network of people around that help me get through it. We all need social interaction and while the internet can provide a medium for this, physical real world contact is also necessary I think. People used to tell me that exercise would really help me feel better too, and I thought it was total BS until I started riding my bike and actually feel this weird positive sensastion hah.&lt;br/&gt;\nIf you do want to chat or anything pm me, if not that&amp;#39;s okay too.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24x6fb", "score_hidden": false, "name": "t1_chbm96j", "created": 1399468488.0, "author_flair_text": null, "created_utc": 1399439688.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]