[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi reddit, I&amp;#39;m just here with... euhm, my story I guess. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a 19 year old male, Sebastian, and I&amp;#39;ve been dragged to the dust from the beginning, &amp;#39;till today. I&amp;#39;ve been severaly bullied in a physical way in elementary, been bullied in highschool and spent most of my times all alone. Two years ago, I lost sleep and got diagnosed with PTSD in a severe cause, combined with hallucinations. &lt;/p&gt;\n\n&lt;p&gt;This made life even harder for me (failed attempt a year ago in may), not that it might be that hard like others on here though, today I got robbed on the train and now completly lost my faith in humanity...&lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t want to keep this suffering up, I&amp;#39;m seriously done with all this. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi reddit, I'm just here with... euhm, my story I guess. \n\nI'm a 19 year old male, Sebastian, and I've been dragged to the dust from the beginning, 'till today. I've been severaly bullied in a physical way in elementary, been bullied in highschool and spent most of my times all alone. Two years ago, I lost sleep and got diagnosed with PTSD in a severe cause, combined with hallucinations. \n\nThis made life even harder for me (failed attempt a year ago in may), not that it might be that hard like others on here though, today I got robbed on the train and now completly lost my faith in humanity...\n\nI really don't want to keep this suffering up, I'm seriously done with all this. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "244rbf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Havendir", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/244rbf/im_scared/", "name": "t3_244rbf", "created": 1398661362.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/244rbf/im_scared/", "author_flair_text": null, "title": "I'm scared...", "created_utc": 1398632562.0, "ups": 7, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3ua4b", "gilded": 0, "author": "hyuga488", "parent_id": "t3_244rbf", "approved_by": null, "body": "Hey Sebastian. I know that humanity can be a bitch. There will be assholes in this world. I get that. Hell, I can be an asshole sometimes too. But there's also good people. For every thief or bully, there's a kind grandmother or friendly stranger. I'm sorry to hear about your PTSD.\n\nIf your faith in humanity is what's driving you to do this, then my recommendation is volunteer. It's a great way to meet wonderful people. Trust me on this.\n\nMy last piece of advice is to talk to a professional. I can only help you so much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Sebastian. I know that humanity can be a bitch. There will be assholes in this world. I get that. Hell, I can be an asshole sometimes too. But there&amp;#39;s also good people. For every thief or bully, there&amp;#39;s a kind grandmother or friendly stranger. I&amp;#39;m sorry to hear about your PTSD.&lt;/p&gt;\n\n&lt;p&gt;If your faith in humanity is what&amp;#39;s driving you to do this, then my recommendation is volunteer. It&amp;#39;s a great way to meet wonderful people. Trust me on this.&lt;/p&gt;\n\n&lt;p&gt;My last piece of advice is to talk to a professional. I can only help you so much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3ua4b", "created": 1398683504.0, "author_flair_text": null, "created_utc": 1398654704.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3opwn", "gilded": 0, "author": "Havendir", "parent_id": "t1_ch3kn2e", "approved_by": null, "body": "thanks, you got my cheeks up yeah! I did share it, and my parent are supportive as they are the thing keeping me here, it would be to mean to do that to them, I think, it's just... hard", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks, you got my cheeks up yeah! I did share it, and my parent are supportive as they are the thing keeping me here, it would be to mean to do that to them, I think, it&amp;#39;s just... hard&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3opwn", "created": 1398645679.0, "author_flair_text": null, "created_utc": 1398642079.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3kn2e", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_244rbf", "approved_by": null, "body": "Hi Sebastian,\nnice to meet you.\n\nI'm sorry to hear you got bullied. Did you share what happened with your parents\\teachers?\n\nYou got robbed. Don't worry. It happens. It happened also to me. If humanity would be composed only of these people, I guess we would be lost and not even this subreddit would exist. (hope this statement made you smile)\n\n\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi Sebastian,\nnice to meet you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry to hear you got bullied. Did you share what happened with your parents\\teachers?&lt;/p&gt;\n\n&lt;p&gt;You got robbed. Don&amp;#39;t worry. It happens. It happened also to me. If humanity would be composed only of these people, I guess we would be lost and not even this subreddit would exist. (hope this statement made you smile)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3kn2e", "created": 1398661623.0, "author_flair_text": null, "created_utc": 1398632823.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3uafr", "gilded": 0, "author": "assnkitties", "parent_id": "t3_244rbf", "approved_by": null, "body": "Sometimes I feel this way about humanity too but I found that I was looking in the wrong places. I started volunteering for organizations and this really brightened my outlook on people. Once I saw the people who are trying to do things for others and giving themselves and their time to help people that they don't even know, thats when my faith was restored in humanity. There are bad people that try to hurt people and bring other people down but then there are people that are positive and make a difference for the better. You should try volunteering and giving some time to help others or animals or whatever you are interested in. You will feel much better and it saved me. Hope this is helpful. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel this way about humanity too but I found that I was looking in the wrong places. I started volunteering for organizations and this really brightened my outlook on people. Once I saw the people who are trying to do things for others and giving themselves and their time to help people that they don&amp;#39;t even know, thats when my faith was restored in humanity. There are bad people that try to hurt people and bring other people down but then there are people that are positive and make a difference for the better. You should try volunteering and giving some time to help others or animals or whatever you are interested in. You will feel much better and it saved me. Hope this is helpful. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3uafr", "created": 1398658325.0, "author_flair_text": null, "created_utc": 1398654725.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdhsxm", "gilded": 0, "author": "gofredo50", "parent_id": "t3_244rbf", "approved_by": null, "body": "Sebastian,\n\nI hope you've had a good couple of days since you posted this. Life can be hard, especially at your age, and it sounds like for you it's been particularly tough. I can sympathize for sure. I got teased a lot in elementary and high school and there were some times when I just didn't know what the point was any more. \n\nHowever, I can also say that I would not be nearly the person I am today without those struggles. After years of focusing on finding myself and people who care about me for who I am, I can honestly say that life has never been better and that I owe a great amount of my happiness to lessons learned in those years of struggle.\n\nThe point is: keep going, keep trying. Don't ever, ever give up. If there is something you love to do, pour your heart and soul into it and share it with people who care about it too. This can be done with almost any subject over the internet and hopefully in person, too. Your passion will attract people who care about the same things. You can share and learn from one another and find great friends.\n\nSorry to hear you got robbed. That stinks. It's happened to me before. I got robbed of 40 euro on the train once. It still pisses me off. I don't think to much of it anymore and after some time passes hopefully you won't either. You got out of there with your most valuable possession: yourself.\n\nGood luck. I hope this helps. If you ever need a sympathetic ear, give me a shout. BTW: cool cosplay.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sebastian,&lt;/p&gt;\n\n&lt;p&gt;I hope you&amp;#39;ve had a good couple of days since you posted this. Life can be hard, especially at your age, and it sounds like for you it&amp;#39;s been particularly tough. I can sympathize for sure. I got teased a lot in elementary and high school and there were some times when I just didn&amp;#39;t know what the point was any more. &lt;/p&gt;\n\n&lt;p&gt;However, I can also say that I would not be nearly the person I am today without those struggles. After years of focusing on finding myself and people who care about me for who I am, I can honestly say that life has never been better and that I owe a great amount of my happiness to lessons learned in those years of struggle.&lt;/p&gt;\n\n&lt;p&gt;The point is: keep going, keep trying. Don&amp;#39;t ever, ever give up. If there is something you love to do, pour your heart and soul into it and share it with people who care about it too. This can be done with almost any subject over the internet and hopefully in person, too. Your passion will attract people who care about the same things. You can share and learn from one another and find great friends.&lt;/p&gt;\n\n&lt;p&gt;Sorry to hear you got robbed. That stinks. It&amp;#39;s happened to me before. I got robbed of 40 euro on the train once. It still pisses me off. I don&amp;#39;t think to much of it anymore and after some time passes hopefully you won&amp;#39;t either. You got out of there with your most valuable possession: yourself.&lt;/p&gt;\n\n&lt;p&gt;Good luck. I hope this helps. If you ever need a sympathetic ear, give me a shout. BTW: cool cosplay.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_chdhsxm", "created": 1399627625.0, "author_flair_text": null, "created_utc": 1399624025.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3osvd", "gilded": 0, "author": "Havendir", "parent_id": "t1_ch3nuoi", "approved_by": null, "body": "Thank you Sir/Madam, that really hit my mark, to state it quite directly. You are right, it's hard to think that way without being knocked out of balance. But really, thankk you for the text, you made smile and feel kinda proud in a way, thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you Sir/Madam, that really hit my mark, to state it quite directly. You are right, it&amp;#39;s hard to think that way without being knocked out of balance. But really, thankk you for the text, you made smile and feel kinda proud in a way, thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3osvd", "created": 1398645871.0, "author_flair_text": null, "created_utc": 1398642271.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3nuoi", "gilded": 0, "author": "Seletial", "parent_id": "t3_244rbf", "approved_by": null, "body": "Hello Sebastian, \n\nI am truly very sorry for your recent trouble on the train, and I really hope that the people responsible are caught and punished accordingly, but I think it is a good thing that you are safe from harm. No one can endure the pain of being constantly bullied by themselves, and it seems that most people would rather just pretend not to notice, then help you or stand up for you. I have been there myself. What I can tell you is that, as you get a bit older, the people that are causing you grief will eventually fade away, and will most likely become buried beneath a mountain of their own mistakes. \nSee, I genuinely feel sorry for them more than I do for you, despite the tragic turn that fate has had for you. I know that they are guaranteed to eventually fail, while you still have enormous opportunity to succeed at life - IF you don't give up and stick it out for a while longer. \nYou have a choice Sebastian. You can see the humans that cause pain and negativity with sadness, or you can believe that they have power over you. You should feel sorry for them, and you should know with 100% certainty that you are better than them. \nThat means that you are the part of humanity that so many other people are looking up to. You are the good side of us, and hopefully you don't let the others have the satisfaction of taking one more good person away. \nTake care. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello Sebastian, &lt;/p&gt;\n\n&lt;p&gt;I am truly very sorry for your recent trouble on the train, and I really hope that the people responsible are caught and punished accordingly, but I think it is a good thing that you are safe from harm. No one can endure the pain of being constantly bullied by themselves, and it seems that most people would rather just pretend not to notice, then help you or stand up for you. I have been there myself. What I can tell you is that, as you get a bit older, the people that are causing you grief will eventually fade away, and will most likely become buried beneath a mountain of their own mistakes. \nSee, I genuinely feel sorry for them more than I do for you, despite the tragic turn that fate has had for you. I know that they are guaranteed to eventually fail, while you still have enormous opportunity to succeed at life - IF you don&amp;#39;t give up and stick it out for a while longer. \nYou have a choice Sebastian. You can see the humans that cause pain and negativity with sadness, or you can believe that they have power over you. You should feel sorry for them, and you should know with 100% certainty that you are better than them. \nThat means that you are the part of humanity that so many other people are looking up to. You are the good side of us, and hopefully you don&amp;#39;t let the others have the satisfaction of taking one more good person away. \nTake care. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244rbf", "score_hidden": false, "name": "t1_ch3nuoi", "created": 1398643663.0, "author_flair_text": null, "created_utc": 1398640063.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]