[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just took diphenhydramine. I know it&amp;#39;s not the best way to go, but it&amp;#39;s the only option I had. I don&amp;#39;t even know why I&amp;#39;m posting this. For months--years?--I&amp;#39;ve felt so separate from people. Like I can make small talk, and smile, but I feel like a robot. Or like I&amp;#39;m really a hundred million miles away. Or that I&amp;#39;m actually talking through water, so that sound waves are, yes, traveling, but no one can actually understand me . . . I&amp;#39;m unintelligible. I don&amp;#39;t understand myself or anything else. This is just me rambling. I&amp;#39;m sorry. I think I love my family but I&amp;#39;ve never loved romantically. I think it might be impossible for me to love. I feel like something has died within me; or rather, I&amp;#39;m missing some major component, the part of me that needs to exist but doesn&amp;#39;t--a soul? Whatever it is that allows others to smile and love and live. I lack that. I&amp;#39;m sorry for rambling. I don&amp;#39;t know anything. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just took diphenhydramine. I know it's not the best way to go, but it's the only option I had. I don't even know why I'm posting this. For months--years?--I've felt so separate from people. Like I can make small talk, and smile, but I feel like a robot. Or like I'm really a hundred million miles away. Or that I'm actually talking through water, so that sound waves are, yes, traveling, but no one can actually understand me . . . I'm unintelligible. I don't understand myself or anything else. This is just me rambling. I'm sorry. I think I love my family but I've never loved romantically. I think it might be impossible for me to love. I feel like something has died within me; or rather, I'm missing some major component, the part of me that needs to exist but doesn't--a soul? Whatever it is that allows others to smile and love and live. I lack that. I'm sorry for rambling. I don't know anything. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249dfl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "depressedanonymous", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398756258.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249dfl/im_sick/", "name": "t3_249dfl", "created": 1398784768.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249dfl/im_sick/", "author_flair_text": null, "title": "I'm sick", "created_utc": 1398755968.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4xkrp", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_249dfl", "approved_by": null, "body": "You're certainly not alone in thinking you're missing some vital part of yourself; a lot of us have felt that at some time or another.  My god, I had trouble making small talk, but I made myself do it until I was comfortable with it.  If you've taken a fatal dose, you should call 911.  Can you post here later so we'll know if you're alive?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re certainly not alone in thinking you&amp;#39;re missing some vital part of yourself; a lot of us have felt that at some time or another.  My god, I had trouble making small talk, but I made myself do it until I was comfortable with it.  If you&amp;#39;ve taken a fatal dose, you should call 911.  Can you post here later so we&amp;#39;ll know if you&amp;#39;re alive?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249dfl", "score_hidden": false, "name": "t1_ch4xkrp", "created": 1398795708.0, "author_flair_text": null, "created_utc": 1398766908.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]