[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m a transwoman and I&amp;#39;m passing fine, people tell me I look and sound great. That&amp;#39;s not the whole issue.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a Chef and transitioned at the same place I&amp;#39;ve worked at for two years because I need money to support my son who I love so dearly.&lt;/p&gt;\n\n&lt;p&gt;I work 45+hrs a week to support him, I have 40percent care of him, pay more child support than is required and give him the world.&lt;/p&gt;\n\n&lt;p&gt;But at work I have to present as male (a very girly looking male) and I speak in my old disgusting male voice and I get treated as a male and I want to just scream but I can&amp;#39;t get out of the job.&lt;/p&gt;\n\n&lt;p&gt;I have no other skills. It&amp;#39;s a male dominated industry.&lt;/p&gt;\n\n&lt;p&gt;I just want to kill myself, but I don&amp;#39;t think I will because I want to be around for my son. But I really want to hurt myself in other ways. I&amp;#39;m scared because I&amp;#39;m trying to hard to be strong, and I have been, but now my world is falling apart.&lt;/p&gt;\n\n&lt;p&gt;I need to disappear. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'm a transwoman and I'm passing fine, people tell me I look and sound great. That's not the whole issue.\n\nI'm a Chef and transitioned at the same place I've worked at for two years because I need money to support my son who I love so dearly.\n\nI work 45+hrs a week to support him, I have 40percent care of him, pay more child support than is required and give him the world.\n\nBut at work I have to present as male (a very girly looking male) and I speak in my old disgusting male voice and I get treated as a male and I want to just scream but I can't get out of the job.\n\nI have no other skills. It's a male dominated industry.\n\nI just want to kill myself, but I don't think I will because I want to be around for my son. But I really want to hurt myself in other ways. I'm scared because I'm trying to hard to be strong, and I have been, but now my world is falling apart.\n\nI need to disappear. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24d8k3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "gracelandgirl", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24d8k3/im_scared_i_want_to_disappear/", "name": "t3_24d8k3", "created": 1398895398.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24d8k3/im_scared_i_want_to_disappear/", "author_flair_text": null, "title": "I'm scared. I want to disappear.", "created_utc": 1398866598.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch609rq", "gilded": 0, "author": "powerrangers98", "parent_id": "t3_24d8k3", "approved_by": null, "body": "You have to be strong and be there for your son!  Think about him, and that he will grow up with you in his life one day.  There are a lot of things that he need.  Though I don't want to tell you this, but I think I should: it's selfish to hurt yourself, because you still have a lot of people that love you.  People who hurt themselves, also hurt other people in their life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to be strong and be there for your son!  Think about him, and that he will grow up with you in his life one day.  There are a lot of things that he need.  Though I don&amp;#39;t want to tell you this, but I think I should: it&amp;#39;s selfish to hurt yourself, because you still have a lot of people that love you.  People who hurt themselves, also hurt other people in their life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24d8k3", "score_hidden": false, "name": "t1_ch609rq", "created": 1398899460.0, "author_flair_text": null, "created_utc": 1398870660.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch636io", "gilded": 0, "author": "SnallTrippin", "parent_id": "t3_24d8k3", "approved_by": null, "body": "Do not pay more child support than required.  Save that cash for your kid later.\n\nAlso - why can't you come out as a woman at the job??  Also why can't you find another job in the field? Its a pretty big field anyway (Though you may have to take a paycut which would suck).", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not pay more child support than required.  Save that cash for your kid later.&lt;/p&gt;\n\n&lt;p&gt;Also - why can&amp;#39;t you come out as a woman at the job??  Also why can&amp;#39;t you find another job in the field? Its a pretty big field anyway (Though you may have to take a paycut which would suck).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24d8k3", "score_hidden": false, "name": "t1_ch636io", "created": 1398880130.0, "author_flair_text": null, "created_utc": 1398876530.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6828w", "gilded": 0, "author": "seanyroastbeefy", "parent_id": "t3_24d8k3", "approved_by": null, "body": "I cross dressed for about a year of my life and recently just stopped back in November. It was so hard for me. I felt like killing myself. My wife left me, I lost my job, dropped out of school, upped my alcoholism and disregarded my health and safety. I am also a parent, I have a 2yo son. I can really relate to you. I would already be dead if I didn't have a son. But I love him and it sounds like you love your child as well. Think about your child's future and what it would be like if you weren't there. It's heartbreaking. Keep your head up, you never know what joys life has to offer of you check out early. Maybe you'll save someone's life one day. Just yet to remain positive.\n\nWhy do you have to appear as a male at work? If it's because you choose to, I understand. If they're telling you that you have to appear as a male they might be violating some laws depending on where you live. I never cross dressed at work but I can only imagine your situation. For the sake of your child, your future and TG/CD's everywhere, stay strong and keep your head up!\n\nPM me if you want someone to talk to. Me and you aren't so different!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cross dressed for about a year of my life and recently just stopped back in November. It was so hard for me. I felt like killing myself. My wife left me, I lost my job, dropped out of school, upped my alcoholism and disregarded my health and safety. I am also a parent, I have a 2yo son. I can really relate to you. I would already be dead if I didn&amp;#39;t have a son. But I love him and it sounds like you love your child as well. Think about your child&amp;#39;s future and what it would be like if you weren&amp;#39;t there. It&amp;#39;s heartbreaking. Keep your head up, you never know what joys life has to offer of you check out early. Maybe you&amp;#39;ll save someone&amp;#39;s life one day. Just yet to remain positive.&lt;/p&gt;\n\n&lt;p&gt;Why do you have to appear as a male at work? If it&amp;#39;s because you choose to, I understand. If they&amp;#39;re telling you that you have to appear as a male they might be violating some laws depending on where you live. I never cross dressed at work but I can only imagine your situation. For the sake of your child, your future and TG/CD&amp;#39;s everywhere, stay strong and keep your head up!&lt;/p&gt;\n\n&lt;p&gt;PM me if you want someone to talk to. Me and you aren&amp;#39;t so different!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24d8k3", "score_hidden": false, "name": "t1_ch6828w", "created": 1398915277.0, "author_flair_text": null, "created_utc": 1398886477.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]