[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I make so many dumb mistakes and i lack common sense. whenever i&amp;#39;m in a social situation I feel like im not even a real person; it instead just feels like im watching from a third person view cringing about how awkward i am. when i was growing up my mother was mentally ill(now dead) i remember being 6-7 and i would get made fun at school because my mother would send me their wearing the same clothes a week in a row with out washing them. I became the center of all of the bullying in middle school because the same people never stopped hating me. I missed out on learning about how to interact with people.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 16 now and still in the same school system. my dad and grandma take care of me well and everything but i have literally no friends of any kind. I haven&amp;#39;t done anything with someone i know from school in years. I come home and play league/look at reddit all day then go to sleep.my dad gets mad at me and says i need to be more active but i really just dont know what to to do beacuse nothing intrestes me. I&amp;#39;m almost never happy and i fantasize about killing myself every moment because im such a pathetic disappointment that is not capable of anything.&lt;/p&gt;\n\n&lt;p&gt;I play league all day but i&amp;#39;m still terrible at it. my ranked record is 308/307 and im still only silver 3. I made a few friends online but all of them would eventually get better than me and not want to play with me. Although many &amp;quot;internet friends&amp;quot; have  stopped talking to me the most upsetting and recent example was a girl who mained support and played with me almost every day almost 5-8 hours a day for 3 months. I felt like she actually thought i was an acceptable person and it really boosted my confidence . then about a month ago she removed me from her friends list and hasn&amp;#39;t talked to me since. it breaks my heart and i realize how pathetic that is even considering i didn&amp;#39;t know her irl.&lt;/p&gt;\n\n&lt;p&gt;essentially i&amp;#39;ll be doing everyone a favour to just die since i have no potential to contribute anything to society.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I make so many dumb mistakes and i lack common sense. whenever i'm in a social situation I feel like im not even a real person; it instead just feels like im watching from a third person view cringing about how awkward i am. when i was growing up my mother was mentally ill(now dead) i remember being 6-7 and i would get made fun at school because my mother would send me their wearing the same clothes a week in a row with out washing them. I became the center of all of the bullying in middle school because the same people never stopped hating me. I missed out on learning about how to interact with people.\n\nI'm 16 now and still in the same school system. my dad and grandma take care of me well and everything but i have literally no friends of any kind. I haven't done anything with someone i know from school in years. I come home and play league/look at reddit all day then go to sleep.my dad gets mad at me and says i need to be more active but i really just dont know what to to do beacuse nothing intrestes me. I'm almost never happy and i fantasize about killing myself every moment because im such a pathetic disappointment that is not capable of anything.\n\nI play league all day but i'm still terrible at it. my ranked record is 308/307 and im still only silver 3. I made a few friends online but all of them would eventually get better than me and not want to play with me. Although many \"internet friends\" have  stopped talking to me the most upsetting and recent example was a girl who mained support and played with me almost every day almost 5-8 hours a day for 3 months. I felt like she actually thought i was an acceptable person and it really boosted my confidence . then about a month ago she removed me from her friends list and hasn't talked to me since. it breaks my heart and i realize how pathetic that is even considering i didn't know her irl.\n\nessentially i'll be doing everyone a favour to just die since i have no potential to contribute anything to society.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ccmm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway220603", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ccmm/im_so_pathetic/", "name": "t3_24ccmm", "created": 1398835830.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ccmm/im_so_pathetic/", "author_flair_text": null, "title": "I'm so pathetic", "created_utc": 1398832230.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5rqz9", "gilded": 0, "author": "SkyAvus", "parent_id": "t3_24ccmm", "approved_by": null, "body": "I can't say I have directly been I'm your position, but I know how it feels. I know what it's like being raised by a single parent and feeling isolated in school. Failure is no stranger to me either. I just turned 18, bud, so I know where you're coming from with all of this grief. If you wanna talk, PM me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t say I have directly been I&amp;#39;m your position, but I know how it feels. I know what it&amp;#39;s like being raised by a single parent and feeling isolated in school. Failure is no stranger to me either. I just turned 18, bud, so I know where you&amp;#39;re coming from with all of this grief. If you wanna talk, PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ccmm", "score_hidden": false, "name": "t1_ch5rqz9", "created": 1398865888.0, "author_flair_text": null, "created_utc": 1398837088.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5u9pc", "gilded": 0, "author": "DavidAamez", "parent_id": "t3_24ccmm", "approved_by": null, "body": "it kind of sounds like you hate league but don't want to give it up because you have invested so much time in it. do you still actually enjoy playing it? do the days it makes you happy outnumber the days it pisses you off?\ni played dota/hon for yeaaaars. from when i was 20-29. Even though I knew it was pissing me off more often than making me happy, I still played it religously because I felt I had to...because I had so many hours in it by then. What helped me stop was that I realized that the game had helped me with fast decision making and multitasking, and hand eye coordination. How much, I dont know. But just the fact that I convinced myself I had actually gotten something out of playing, made it easier to walk away from the game and not feel like I just wasted a big chunk of my life. And this was without even making friends on it (i was so much older than most of the players, I just trolled most of the time solo).\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it kind of sounds like you hate league but don&amp;#39;t want to give it up because you have invested so much time in it. do you still actually enjoy playing it? do the days it makes you happy outnumber the days it pisses you off?\ni played dota/hon for yeaaaars. from when i was 20-29. Even though I knew it was pissing me off more often than making me happy, I still played it religously because I felt I had to...because I had so many hours in it by then. What helped me stop was that I realized that the game had helped me with fast decision making and multitasking, and hand eye coordination. How much, I dont know. But just the fact that I convinced myself I had actually gotten something out of playing, made it easier to walk away from the game and not feel like I just wasted a big chunk of my life. And this was without even making friends on it (i was so much older than most of the players, I just trolled most of the time solo).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ccmm", "score_hidden": false, "name": "t1_ch5u9pc", "created": 1398852415.0, "author_flair_text": null, "created_utc": 1398848815.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]