[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve lost count at how many times I&amp;#39;ve tried to kill myself. All I really know right now is that I don&amp;#39;t wanna grow up and that&amp;#39;s why I keep at it. I&amp;#39;m 18 now and my high school graduation is a month away and each day is moving by too damn quickly. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t wanna go to college this summer and fall flat on my face because I honestly don&amp;#39;t wanna be there. Due to depression I fucked up school and had a low GPA, I had to go to the local college. It&amp;#39;s a good college, but I have to continue living with my parents and it doesn&amp;#39;t have a good program for my major. I wanted to become a journalist and travel the world and meet all sorts of people and learn about the way they think and act. Humans are fascinating to me but only for a little while. Most of all I want to be remembered for being a good person and have time in the spotlight, but that&amp;#39;s the selfish secret behind the career choice. &lt;/p&gt;\n\n&lt;p&gt;My worst fear is to be stuck in one place, seeing the same people every day and doing the same things every day and having a routine. It bores me, gives me time to think, and that thinking swells with negative thoughts. \nMost of the thoughts are about how I&amp;#39;m gonna grow up to be nothing. That I&amp;#39;m taking away opportunities from people more capable. That all the people I look up to will never know my name and I&amp;#39;ll never get to hug them. That I&amp;#39;m too ugly to be loved despite the fact I&amp;#39;m a romantic person who doesn&amp;#39;t like to be single. &lt;/p&gt;\n\n&lt;p&gt;I know things are different from every other attempt because usually what snaps me out of it is thinking about my family and friends and how deep of a scar I would leave in them. It&amp;#39;s not working out this time and I just keep planning for the few days ahead. Should I go early and ruin my parents vacation? Wait a few weeks until after they&amp;#39;ve had fun? I don&amp;#39;t know but I don&amp;#39;t see me waking up this coming Friday and after 8 years of depression I&amp;#39;m relieved. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've lost count at how many times I've tried to kill myself. All I really know right now is that I don't wanna grow up and that's why I keep at it. I'm 18 now and my high school graduation is a month away and each day is moving by too damn quickly. \n\nI don't wanna go to college this summer and fall flat on my face because I honestly don't wanna be there. Due to depression I fucked up school and had a low GPA, I had to go to the local college. It's a good college, but I have to continue living with my parents and it doesn't have a good program for my major. I wanted to become a journalist and travel the world and meet all sorts of people and learn about the way they think and act. Humans are fascinating to me but only for a little while. Most of all I want to be remembered for being a good person and have time in the spotlight, but that's the selfish secret behind the career choice. \n\nMy worst fear is to be stuck in one place, seeing the same people every day and doing the same things every day and having a routine. It bores me, gives me time to think, and that thinking swells with negative thoughts. \nMost of the thoughts are about how I'm gonna grow up to be nothing. That I'm taking away opportunities from people more capable. That all the people I look up to will never know my name and I'll never get to hug them. That I'm too ugly to be loved despite the fact I'm a romantic person who doesn't like to be single. \n\nI know things are different from every other attempt because usually what snaps me out of it is thinking about my family and friends and how deep of a scar I would leave in them. It's not working out this time and I just keep planning for the few days ahead. Should I go early and ruin my parents vacation? Wait a few weeks until after they've had fun? I don't know but I don't see me waking up this coming Friday and after 8 years of depression I'm relieved. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2590lc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "MrIronMan", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2590lc/im_stuck/", "name": "t3_2590lc", "created": 1399800993.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2590lc/im_stuck/", "author_flair_text": null, "title": "I'm Stuck", "created_utc": 1399772193.0, "ups": 2, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg6pit", "gilded": 0, "author": "MrIronMan", "parent_id": "t1_chg4y7b", "approved_by": null, "body": "You're taking a few minutes out of your day to talk to me. I feel sorry about that. \n\nI do! But after 5 years it's just pilled on me to the point where suicide does seem like an escape. I've had good years and bad years but the future is so sketchy and look so upsetting that I just have to escape. I have so many reasons to kill myself. I drew together a pro-con list and gosh the pro is massive..\n\nI understand that. Even when I'm violently sobbing they just stand there and stare before continuing doing whatever it was that they were doing. I reach out and find air. That's one of the reasons I finally gathered courage to post here. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re taking a few minutes out of your day to talk to me. I feel sorry about that. &lt;/p&gt;\n\n&lt;p&gt;I do! But after 5 years it&amp;#39;s just pilled on me to the point where suicide does seem like an escape. I&amp;#39;ve had good years and bad years but the future is so sketchy and look so upsetting that I just have to escape. I have so many reasons to kill myself. I drew together a pro-con list and gosh the pro is massive..&lt;/p&gt;\n\n&lt;p&gt;I understand that. Even when I&amp;#39;m violently sobbing they just stand there and stare before continuing doing whatever it was that they were doing. I reach out and find air. That&amp;#39;s one of the reasons I finally gathered courage to post here. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chg6pit", "created": 1399951960.0, "author_flair_text": null, "created_utc": 1399923160.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chg4y7b", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t1_chfzmrn", "approved_by": null, "body": "What are you sorry for? \n\nDo you want to change your depression? It's okay if you don't want to, it's not an uncommon feeling. I know I'm quite comfortable with mine and it's easier to stay where I am rather than make the effort required to change.\n\nPeople don't pick up on hints etc because it's not something anyone ever expects, they just anticipate you being in their lives for the present and in the future. They don't imagine you not being there so they're not looking out for signs of you leaving. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are you sorry for? &lt;/p&gt;\n\n&lt;p&gt;Do you want to change your depression? It&amp;#39;s okay if you don&amp;#39;t want to, it&amp;#39;s not an uncommon feeling. I know I&amp;#39;m quite comfortable with mine and it&amp;#39;s easier to stay where I am rather than make the effort required to change.&lt;/p&gt;\n\n&lt;p&gt;People don&amp;#39;t pick up on hints etc because it&amp;#39;s not something anyone ever expects, they just anticipate you being in their lives for the present and in the future. They don&amp;#39;t imagine you not being there so they&amp;#39;re not looking out for signs of you leaving. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chg4y7b", "created": 1399948360.0, "author_flair_text": null, "created_utc": 1399919560.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfzmrn", "gilded": 0, "author": "MrIronMan", "parent_id": "t1_chfvn07", "approved_by": null, "body": "I tend to do volunteer work anyway, usually it leave me feeling rather empty. I have to do volunteer work to continue going to the school I am currently in (30 hours per year or else you'll get the boot). I can't put into words why I feel empty. I want to give them my entire life so that they don't have to be miserable, but I know I can't. \n\nReading helps for a little while. Really anything that brings me to another place helps but that's honestly one of the biggest things that depressed me. I've saved the world countless times in my head but in reality I sat there staring at a wall for a good hour. Usually when I realize that all that I imagine will never happen brings the worst of the depressive episodes. \n\nDay by day huh? So like- Get dressed, brush teeth, go to school, play video games, do homework, and then try and see what the next day brings? I tend to go week by week due to plans and projects, but I can see myself trying it out. \n\nI remember learning about Cognitive Behavioral Therapy in my psychology class and enjoying the idea of it. I am seeing a psychologist but honestly he kinda sucks. Not all that focused and changes the subject when we get on my depression. (Usually I'm very resistant to change in my depression because I've pretty much heard it all.) Perhaps I'll look into someone that'll help me with that. \n\nHorribly. I've packed what I need to kill myself in my backpack. I've dropped so many hints to my friends and family, even to teachers and they're rather blind. Any conversation I try to start with anyone is dropped pretty much instantly and I'm losing losing touch with all the people I care about due to this. It's a struggle not just to try it out today. I know I don't wanna do it at home because I don't want my mother to find me. \nBut on the other hand I'm planning tattooes and my drivers license and I even had flashes of what I wanted to do if I were to get married. \nI'm sorry. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tend to do volunteer work anyway, usually it leave me feeling rather empty. I have to do volunteer work to continue going to the school I am currently in (30 hours per year or else you&amp;#39;ll get the boot). I can&amp;#39;t put into words why I feel empty. I want to give them my entire life so that they don&amp;#39;t have to be miserable, but I know I can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Reading helps for a little while. Really anything that brings me to another place helps but that&amp;#39;s honestly one of the biggest things that depressed me. I&amp;#39;ve saved the world countless times in my head but in reality I sat there staring at a wall for a good hour. Usually when I realize that all that I imagine will never happen brings the worst of the depressive episodes. &lt;/p&gt;\n\n&lt;p&gt;Day by day huh? So like- Get dressed, brush teeth, go to school, play video games, do homework, and then try and see what the next day brings? I tend to go week by week due to plans and projects, but I can see myself trying it out. &lt;/p&gt;\n\n&lt;p&gt;I remember learning about Cognitive Behavioral Therapy in my psychology class and enjoying the idea of it. I am seeing a psychologist but honestly he kinda sucks. Not all that focused and changes the subject when we get on my depression. (Usually I&amp;#39;m very resistant to change in my depression because I&amp;#39;ve pretty much heard it all.) Perhaps I&amp;#39;ll look into someone that&amp;#39;ll help me with that. &lt;/p&gt;\n\n&lt;p&gt;Horribly. I&amp;#39;ve packed what I need to kill myself in my backpack. I&amp;#39;ve dropped so many hints to my friends and family, even to teachers and they&amp;#39;re rather blind. Any conversation I try to start with anyone is dropped pretty much instantly and I&amp;#39;m losing losing touch with all the people I care about due to this. It&amp;#39;s a struggle not just to try it out today. I know I don&amp;#39;t wanna do it at home because I don&amp;#39;t want my mother to find me. \nBut on the other hand I&amp;#39;m planning tattooes and my drivers license and I even had flashes of what I wanted to do if I were to get married. \nI&amp;#39;m sorry. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chfzmrn", "created": 1399937071.0, "author_flair_text": null, "created_utc": 1399908271.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfvn07", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t1_chfcatq", "approved_by": null, "body": "It depends entirely on what you want to get out of your hobby. I personally find that doing something for someone else is what makes me feel better as opposed to doing something for myself. \nVolunteering time at old people's homes, soup kitchens or anything where you can interact with other people and help them might be useful and it helps give you a sense of worth too and make everything seem more meaningful. (I know you said you wanted something without the need of others, but in this case the others need you, not vice versa). (Also, knit something for an old person in a home, they won't judge you, it'll make their day.)\n\nAside from that, writing might be something you like, particularly as it helps your future career goals too. Reading (even mindless stuff online can be helpful in some ways). \n\nAs far as recreating a sense of relief goes, I find the best way to do that is to think more in the short run and focus on what you'll do on a day to day, then week to week basis as opposed to planning out your life in one go. That just puts pressure on you when you have a bad day (and even the best, most put together people have bad days). Of course, keep your end goal in mind but don't put so much emphasis on the bigger elements of achieving it ie. Don't think \"I need to go to a brilliant university, or I will have failed at achieving my goal of becoming a journalist\"\n\nIt's hard but you have to teach yourself to think differently and approach things differently which is why it takes such a long time and everything you try to make yourself feel better at first seems mundane and stupid in the bigger scheme of things. Cognitive Behavioural Therapy which has a pretty high success rate when it comes to helping people out of depression is mostly about recognising and changing thinking patterns. \n\nHow are you doing now though?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends entirely on what you want to get out of your hobby. I personally find that doing something for someone else is what makes me feel better as opposed to doing something for myself. \nVolunteering time at old people&amp;#39;s homes, soup kitchens or anything where you can interact with other people and help them might be useful and it helps give you a sense of worth too and make everything seem more meaningful. (I know you said you wanted something without the need of others, but in this case the others need you, not vice versa). (Also, knit something for an old person in a home, they won&amp;#39;t judge you, it&amp;#39;ll make their day.)&lt;/p&gt;\n\n&lt;p&gt;Aside from that, writing might be something you like, particularly as it helps your future career goals too. Reading (even mindless stuff online can be helpful in some ways). &lt;/p&gt;\n\n&lt;p&gt;As far as recreating a sense of relief goes, I find the best way to do that is to think more in the short run and focus on what you&amp;#39;ll do on a day to day, then week to week basis as opposed to planning out your life in one go. That just puts pressure on you when you have a bad day (and even the best, most put together people have bad days). Of course, keep your end goal in mind but don&amp;#39;t put so much emphasis on the bigger elements of achieving it ie. Don&amp;#39;t think &amp;quot;I need to go to a brilliant university, or I will have failed at achieving my goal of becoming a journalist&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard but you have to teach yourself to think differently and approach things differently which is why it takes such a long time and everything you try to make yourself feel better at first seems mundane and stupid in the bigger scheme of things. Cognitive Behavioural Therapy which has a pretty high success rate when it comes to helping people out of depression is mostly about recognising and changing thinking patterns. &lt;/p&gt;\n\n&lt;p&gt;How are you doing now though?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chfvn07", "created": 1399925675.0, "author_flair_text": null, "created_utc": 1399896875.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfcatq", "gilded": 0, "author": "MrIronMan", "parent_id": "t1_chevix3", "approved_by": null, "body": "Sorry for the late response- \nI have a question. You mentioned other forms of relief beyond suicide. I have my hobbies but all of them are rather dull right now. Knitting makes me feel old and I'm too scared of criticism right now to go play online video games. Do you have any suggestions? I'm honestly looking for just about anything that doesn't need much money or the need of others. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the late response- \nI have a question. You mentioned other forms of relief beyond suicide. I have my hobbies but all of them are rather dull right now. Knitting makes me feel old and I&amp;#39;m too scared of criticism right now to go play online video games. Do you have any suggestions? I&amp;#39;m honestly looking for just about anything that doesn&amp;#39;t need much money or the need of others. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chfcatq", "created": 1399864130.0, "author_flair_text": null, "created_utc": 1399835330.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chevix3", "gilded": 0, "author": "rabidbanjoplayer", "parent_id": "t3_2590lc", "approved_by": null, "body": "I'd really like to be able to help you. \n\nI don't know too much about you as a person, after all 4 paragraphs to sum up a person and 18 years of life isn't much, but I do think that you're too hard on yourself. Sometimes it can seem as though our lives are sort of set on a weird \"autopilot\" driven by expectations of what everyone else wants us to do etc. and it might seem at this age that your life is being thrown massively off course by not doing amazingly in school or having the best course options at university, but I'm certain that's not true. You seem like an intelligent, compassionate and aware person who thinks things through. That's not the sort of person who fails at life. You can take charge of things and turn things around and people will be willing to help you. \n\nIt can feel like a huge relief to finally have an out in the form of suicide, but that sense of relief and control over your life can be recreated in other ways too and you don't have to make that sort of decision or take that course of action. Depression colours every action, thought and feeling someone has to the point that it's difficult to separate it from your personality anymore. If you can control or remove your feelings of depression, it'd lighten your load a lot and I'm certain that you can get rid of your depression. I care about you, even if that's hard to believe, but I'd hate to see such a talented, capable and compassionate person leave this world. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d really like to be able to help you. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know too much about you as a person, after all 4 paragraphs to sum up a person and 18 years of life isn&amp;#39;t much, but I do think that you&amp;#39;re too hard on yourself. Sometimes it can seem as though our lives are sort of set on a weird &amp;quot;autopilot&amp;quot; driven by expectations of what everyone else wants us to do etc. and it might seem at this age that your life is being thrown massively off course by not doing amazingly in school or having the best course options at university, but I&amp;#39;m certain that&amp;#39;s not true. You seem like an intelligent, compassionate and aware person who thinks things through. That&amp;#39;s not the sort of person who fails at life. You can take charge of things and turn things around and people will be willing to help you. &lt;/p&gt;\n\n&lt;p&gt;It can feel like a huge relief to finally have an out in the form of suicide, but that sense of relief and control over your life can be recreated in other ways too and you don&amp;#39;t have to make that sort of decision or take that course of action. Depression colours every action, thought and feeling someone has to the point that it&amp;#39;s difficult to separate it from your personality anymore. If you can control or remove your feelings of depression, it&amp;#39;d lighten your load a lot and I&amp;#39;m certain that you can get rid of your depression. I care about you, even if that&amp;#39;s hard to believe, but I&amp;#39;d hate to see such a talented, capable and compassionate person leave this world. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2590lc", "score_hidden": false, "name": "t1_chevix3", "created": 1399802653.0, "author_flair_text": null, "created_utc": 1399773853.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]