[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been putting off this thread for weeks now, because I know I&amp;#39;m going to forget many stuff that I need to talk with someone about. \nI&amp;#39;m male, almost 20 years old, and more important to me than anything else in life are romantic relationships. Two of them we&amp;#39;re major changes in my life. &lt;/p&gt;\n\n&lt;p&gt;One succeeded in both high school and college. She got a 4.0 GPA, 34 ACT, top 1% of her class, and won some state scholarship in water polo, and a full ride to University to study Engineering. She also has lived her life in Chicago (whereas I live out in the boonies of the suburbs), and has been raised with an extremely outgoing personality. This made her an extremely likeable person and has given her a very happy and interesting life, and a boyfriend for more than a year. &lt;/p&gt;\n\n&lt;p&gt;The second girl that changed my life was extremely mediocre in high school. She was not excessively outgoing or achieving in any respect. But when she got to college she turned all of it around, she started to meet people more, and start to try hard at school. She became social and athletic and fun to be around. She may have failed in high school, but she made herself great in college. She is now an extremely likeable person to be around and also now has a boyfriend. &lt;/p&gt;\n\n&lt;p&gt;So what does this have to do with me? I&amp;#39;ve been dumped by both of these girls in my life, with the second one cheating on me as well. They may have been both only children, but they were always much closer and more loyal with their families than I was ever with mine. Though I&amp;#39;ve played sports all of my life (until recently), running in high school and rowing for a little bit at Uni, both played water polo; a much, much more difficult sport with the first girl above being an expert at it. I never played water polo and can barely swim. I got good grades in high school and was probably in the top half of my class, but never to the point where I would get a full ride in engineering.  &lt;/p&gt;\n\n&lt;p&gt;I have humiliated myself and the family. I have very few friends, I&amp;#39;m not a likeable person to be around; I&amp;#39;m not a good person either or this would have never happened to me. When I was supposed to &amp;quot;turn things around&amp;quot; in college and really up my game and become a better, more well rounded person; I ended up having to dropout and attend community college this past semester. I&amp;#39;m so completely alone, it&amp;#39;s almost pathetic. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m definitely forgetting much of what I need to talk about, maybe I&amp;#39;ll remember soon. Other than that though you guys really do help people here more than you imagine. Thank you so much for helping other people out. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been putting off this thread for weeks now, because I know I'm going to forget many stuff that I need to talk with someone about. \nI'm male, almost 20 years old, and more important to me than anything else in life are romantic relationships. Two of them we're major changes in my life. \n\nOne succeeded in both high school and college. She got a 4.0 GPA, 34 ACT, top 1% of her class, and won some state scholarship in water polo, and a full ride to University to study Engineering. She also has lived her life in Chicago (whereas I live out in the boonies of the suburbs), and has been raised with an extremely outgoing personality. This made her an extremely likeable person and has given her a very happy and interesting life, and a boyfriend for more than a year. \n\nThe second girl that changed my life was extremely mediocre in high school. She was not excessively outgoing or achieving in any respect. But when she got to college she turned all of it around, she started to meet people more, and start to try hard at school. She became social and athletic and fun to be around. She may have failed in high school, but she made herself great in college. She is now an extremely likeable person to be around and also now has a boyfriend. \n\nSo what does this have to do with me? I've been dumped by both of these girls in my life, with the second one cheating on me as well. They may have been both only children, but they were always much closer and more loyal with their families than I was ever with mine. Though I've played sports all of my life (until recently), running in high school and rowing for a little bit at Uni, both played water polo; a much, much more difficult sport with the first girl above being an expert at it. I never played water polo and can barely swim. I got good grades in high school and was probably in the top half of my class, but never to the point where I would get a full ride in engineering.  \n\nI have humiliated myself and the family. I have very few friends, I'm not a likeable person to be around; I'm not a good person either or this would have never happened to me. When I was supposed to \"turn things around\" in college and really up my game and become a better, more well rounded person; I ended up having to dropout and attend community college this past semester. I'm so completely alone, it's almost pathetic. \n\nI'm definitely forgetting much of what I need to talk about, maybe I'll remember soon. Other than that though you guys really do help people here more than you imagine. Thank you so much for helping other people out. \n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23wzkt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "helpmesaveme1", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23wzkt/im_so_sorry_mom_and_dad/", "name": "t3_23wzkt", "created": 1398419582.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23wzkt/im_so_sorry_mom_and_dad/", "author_flair_text": null, "title": "I'm so sorry Mom and Dad.", "created_utc": 1398390782.0, "ups": 4, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1f932", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch1etm1", "approved_by": null, "body": "Well, first off, you have the right to be bitchy.  Breaking up sucks, and when there's infidelity involved it's even worse.  It's only natural that your angry when someone has wronged you the way that these two young women have.\nThe good news is, you don't have to date anymore.  That's entirely your decision to make.  But I have a feeling that you'll change your mind someday.  In the meantime, it is never, never, never too late to invest in your schoolwork, your family, and your friends.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, first off, you have the right to be bitchy.  Breaking up sucks, and when there&amp;#39;s infidelity involved it&amp;#39;s even worse.  It&amp;#39;s only natural that your angry when someone has wronged you the way that these two young women have.\nThe good news is, you don&amp;#39;t have to date anymore.  That&amp;#39;s entirely your decision to make.  But I have a feeling that you&amp;#39;ll change your mind someday.  In the meantime, it is never, never, never too late to invest in your schoolwork, your family, and your friends.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1f932", "created": 1398398499.0, "author_flair_text": null, "created_utc": 1398394899.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1etm1", "gilded": 0, "author": "helpmesaveme1", "parent_id": "t1_ch1en0m", "approved_by": null, "body": "I'm a jealous person, the fact that these relationships didn't work out don't make me lose as much sleep at night as knowing that people who wronged me are know happy and successful while I've been left behind. Things won't get better from here because I haven't been working towards my future. I don't know sorry I'm acting all bitchy. I don't want to date anymore, I wish I was gay or something. I'm so done with this shit. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a jealous person, the fact that these relationships didn&amp;#39;t work out don&amp;#39;t make me lose as much sleep at night as knowing that people who wronged me are know happy and successful while I&amp;#39;ve been left behind. Things won&amp;#39;t get better from here because I haven&amp;#39;t been working towards my future. I don&amp;#39;t know sorry I&amp;#39;m acting all bitchy. I don&amp;#39;t want to date anymore, I wish I was gay or something. I&amp;#39;m so done with this shit. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1etm1", "created": 1398397551.0, "author_flair_text": null, "created_utc": 1398393951.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1en0m", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch1edbb", "approved_by": null, "body": "There is so much more to life than your teen years.  Mine were terrible, I enjoyed my twenties much more, and I'm enjoying my thirties even more than that so far.  \n\nI happen to feel that no relationship with another person is a waste of time.  When we're in shitty relationships and we break up, we understand more about what we want and don't want in a romantic partner.  Third time's a charm, so they say...", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is so much more to life than your teen years.  Mine were terrible, I enjoyed my twenties much more, and I&amp;#39;m enjoying my thirties even more than that so far.  &lt;/p&gt;\n\n&lt;p&gt;I happen to feel that no relationship with another person is a waste of time.  When we&amp;#39;re in shitty relationships and we break up, we understand more about what we want and don&amp;#39;t want in a romantic partner.  Third time&amp;#39;s a charm, so they say...&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1en0m", "created": 1398397100.0, "author_flair_text": null, "created_utc": 1398393500.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1edbb", "gilded": 0, "author": "helpmesaveme1", "parent_id": "t1_ch1dlux", "approved_by": null, "body": "It's more than just bad relationships, it's a huge sense of inadequacy. I know what I'm going through doesn't mean much to other people, but I've been incapable of living on because of this issue. From working out, to getting good grades, to making friends; everything seems like nothing but a cheap imitation of what they achieved when they were younger. I mean there must be something that's seriously wrong with me. Noting in life belongs to me anymore, it's all from the perspective of them; and I let it derail my college career. Now I look back and my teen years are gone, never fully enjoyed because I wasn't outgoing enough and because I let these two suck up all my time and thoughts. I don't know, I'm just so done. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s more than just bad relationships, it&amp;#39;s a huge sense of inadequacy. I know what I&amp;#39;m going through doesn&amp;#39;t mean much to other people, but I&amp;#39;ve been incapable of living on because of this issue. From working out, to getting good grades, to making friends; everything seems like nothing but a cheap imitation of what they achieved when they were younger. I mean there must be something that&amp;#39;s seriously wrong with me. Noting in life belongs to me anymore, it&amp;#39;s all from the perspective of them; and I let it derail my college career. Now I look back and my teen years are gone, never fully enjoyed because I wasn&amp;#39;t outgoing enough and because I let these two suck up all my time and thoughts. I don&amp;#39;t know, I&amp;#39;m just so done. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1edbb", "created": 1398396539.0, "author_flair_text": null, "created_utc": 1398392939.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1dlux", "gilded": 0, "author": "I_Am_Zarathustra", "parent_id": "t3_23wzkt", "approved_by": null, "body": "Sounds like you're going through a shitty time right now. Being dumped and cheated on sucks, you're not alone there. From my personal experience, the way relationships go and the way they end will often change you as a person, for better or worse. The upside is that a lot of us have gone through it and can relate to you. I think I understand how you feel here; if you want to talk more about that or anything else, message me or reply here.\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you&amp;#39;re going through a shitty time right now. Being dumped and cheated on sucks, you&amp;#39;re not alone there. From my personal experience, the way relationships go and the way they end will often change you as a person, for better or worse. The upside is that a lot of us have gone through it and can relate to you. I think I understand how you feel here; if you want to talk more about that or anything else, message me or reply here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1dlux", "created": 1398420128.0, "author_flair_text": null, "created_utc": 1398391328.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1e7io", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23wzkt", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1e7io", "created": 1398396191.0, "author_flair_text": null, "created_utc": 1398392591.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1dn3l", "gilded": 0, "author": "mousecreek", "parent_id": "t3_23wzkt", "approved_by": null, "body": "You don't have to apologize to mom and dad if you don't kill yourself over a couple of exes.\n\nSo don't , ok?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to apologize to mom and dad if you don&amp;#39;t kill yourself over a couple of exes.&lt;/p&gt;\n\n&lt;p&gt;So don&amp;#39;t , ok?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23wzkt", "score_hidden": false, "name": "t1_ch1dn3l", "created": 1398394997.0, "author_flair_text": null, "created_utc": 1398391397.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]