[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m such an awkward person that always over-think that I&amp;#39;m a nuisance to others and everyone is just being nice to me. I don&amp;#39;t know if my friends are really my friends. Like.. I&amp;#39;ve done all these things for them but it&amp;#39;s like whenever I need someone, they&amp;#39;re never there. They&amp;#39;re good people though, trust me. They never really tell me stuff. There always has to be another friend there. It&amp;#39;s never just me and another friend. I guess I&amp;#39;m really angry because I just want to have a best friend. Someone who never wants to leave me out of things. I&amp;#39;m always left out. I always have to invite myself in and that&amp;#39;s awkward and I feel like they have a reason for not inviting me in the first place. I feel so left out. Earlier, I asked my friends if they wanted to do &amp;quot;this&amp;quot;. They said no so I went in by myself. A few minutes after, another friend asked if they wanted to do the very same thing I was doing and well what do you know.. the very friend who said no to me said yes to him. That just makes me think &amp;quot;what is so bad about me?&amp;quot; I feel so repulsive. I&amp;#39;ve felt like this since I was 7. It just built from there. I&amp;#39;m 18 now.. turning 19 in May.&lt;/p&gt;\n\n&lt;p&gt;I have more to say but I can&amp;#39;t find the words.. I&amp;#39;m sorry. I feel like this is a stupid problem and I&amp;#39;m probably wasting your time. I&amp;#39;m really sorry.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm such an awkward person that always over-think that I'm a nuisance to others and everyone is just being nice to me. I don't know if my friends are really my friends. Like.. I've done all these things for them but it's like whenever I need someone, they're never there. They're good people though, trust me. They never really tell me stuff. There always has to be another friend there. It's never just me and another friend. I guess I'm really angry because I just want to have a best friend. Someone who never wants to leave me out of things. I'm always left out. I always have to invite myself in and that's awkward and I feel like they have a reason for not inviting me in the first place. I feel so left out. Earlier, I asked my friends if they wanted to do \"this\". They said no so I went in by myself. A few minutes after, another friend asked if they wanted to do the very same thing I was doing and well what do you know.. the very friend who said no to me said yes to him. That just makes me think \"what is so bad about me?\" I feel so repulsive. I've felt like this since I was 7. It just built from there. I'm 18 now.. turning 19 in May.\n\nI have more to say but I can't find the words.. I'm sorry. I feel like this is a stupid problem and I'm probably wasting your time. I'm really sorry.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24yvhc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "AsianSeaFood", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24yvhc/im_so_angry/", "name": "t3_24yvhc", "created": 1399513523.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24yvhc/im_so_angry/", "author_flair_text": null, "title": "I'm so angry.", "created_utc": 1399484723.0, "ups": 9, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc41th", "gilded": 0, "author": "CinnamonLover79", "parent_id": "t3_24yvhc", "approved_by": null, "body": "Wow - I completely know that feeling. I'm almost twice your age, but I still feel disappointed when I get left out. Sometimes it hurts a lot, but more often I just acknowledge it. I guess I'm saying that life got better, and today it matters less.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow - I completely know that feeling. I&amp;#39;m almost twice your age, but I still feel disappointed when I get left out. Sometimes it hurts a lot, but more often I just acknowledge it. I guess I&amp;#39;m saying that life got better, and today it matters less.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chc41th", "created": 1399522414.0, "author_flair_text": null, "created_utc": 1399493614.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc4h02", "gilded": 0, "author": "VesperWae", "parent_id": "t3_24yvhc", "approved_by": null, "body": "Please don't apologize, you're not wasting anyone's time. In this sub there's always someone to listen (well, read actually) to what you have to say. I understand how you're feeling about you're friends, I've been there too. I used to be the third wheel and I had enough of it, so I told them and stopped hanging around with them. And now I have the best friends ever. You might feel desperate and lonely right now, but one day you will find your best friend. It took me very long as well, so I know the struggle. Best of luck to you! ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t apologize, you&amp;#39;re not wasting anyone&amp;#39;s time. In this sub there&amp;#39;s always someone to listen (well, read actually) to what you have to say. I understand how you&amp;#39;re feeling about you&amp;#39;re friends, I&amp;#39;ve been there too. I used to be the third wheel and I had enough of it, so I told them and stopped hanging around with them. And now I have the best friends ever. You might feel desperate and lonely right now, but one day you will find your best friend. It took me very long as well, so I know the struggle. Best of luck to you! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chc4h02", "created": 1399523224.0, "author_flair_text": null, "created_utc": 1399494424.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc69vg", "gilded": 0, "author": "slut-throwaway", "parent_id": "t3_24yvhc", "approved_by": null, "body": "I feel the same way sometimes. I'm 36 and while I've had good friends, I've never really had that close friendship everyone seems to have. But for me I realized the fault lies in me not my friends. Just know that you're not the only one who has felt this way. I've found that if you back off, do what you want then friends will come to you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same way sometimes. I&amp;#39;m 36 and while I&amp;#39;ve had good friends, I&amp;#39;ve never really had that close friendship everyone seems to have. But for me I realized the fault lies in me not my friends. Just know that you&amp;#39;re not the only one who has felt this way. I&amp;#39;ve found that if you back off, do what you want then friends will come to you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chc69vg", "created": 1399526677.0, "author_flair_text": null, "created_utc": 1399497877.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcb87w", "gilded": 0, "author": "read-my-lips", "parent_id": "t3_24yvhc", "approved_by": null, "body": "That's an understandable problem and I've felt that way a number of times. It sounds like your current friend group isn't working out well for you, so it might be helpful to meet new people--like join a group or take up a new hobby, something that will let you meet new people while still hopefully enjoying yourself even if you don't make new friends immediately.\n\nIf you are socially awkward, it is possible to get better at reading social cues and knowing how to behave in social situations, and people often get better at that with age. Same goes for low self-esteem/confidence issues. Are you getting any help with any of this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an understandable problem and I&amp;#39;ve felt that way a number of times. It sounds like your current friend group isn&amp;#39;t working out well for you, so it might be helpful to meet new people--like join a group or take up a new hobby, something that will let you meet new people while still hopefully enjoying yourself even if you don&amp;#39;t make new friends immediately.&lt;/p&gt;\n\n&lt;p&gt;If you are socially awkward, it is possible to get better at reading social cues and knowing how to behave in social situations, and people often get better at that with age. Same goes for low self-esteem/confidence issues. Are you getting any help with any of this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chcb87w", "created": 1399537641.0, "author_flair_text": null, "created_utc": 1399508841.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcdhq1", "gilded": 0, "author": "Killsranq", "parent_id": "t3_24yvhc", "approved_by": null, "body": "Yeah i relate. I'm from turkey and the culture from there is so strict and restricted. Even though im just a bit younger than you i feel the same, but in a different manner. My parents just dont let me socialize. To them, quoting them here, \"There's drug dealers everywhere\" (In the middle of fairfax, k)\n\nSo yeah. I talk to people at school but i'm just really awkward. I've had the same group of friends that i do not fit in with at all. They hang out on the weekends, while i usually do not get invited. Whenever i do though my parents dont let me go anywhere. \n\nBest advice i can give you is make new friends. It really helps. Meet new people. go online and if you have an interest, hobby or some kind get on a subreddit and be active there. It's helped me from being lonely.\n\nOr you can talk to me to that can always work :^)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah i relate. I&amp;#39;m from turkey and the culture from there is so strict and restricted. Even though im just a bit younger than you i feel the same, but in a different manner. My parents just dont let me socialize. To them, quoting them here, &amp;quot;There&amp;#39;s drug dealers everywhere&amp;quot; (In the middle of fairfax, k)&lt;/p&gt;\n\n&lt;p&gt;So yeah. I talk to people at school but i&amp;#39;m just really awkward. I&amp;#39;ve had the same group of friends that i do not fit in with at all. They hang out on the weekends, while i usually do not get invited. Whenever i do though my parents dont let me go anywhere. &lt;/p&gt;\n\n&lt;p&gt;Best advice i can give you is make new friends. It really helps. Meet new people. go online and if you have an interest, hobby or some kind get on a subreddit and be active there. It&amp;#39;s helped me from being lonely.&lt;/p&gt;\n\n&lt;p&gt;Or you can talk to me to that can always work :&lt;sup&gt;)&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chcdhq1", "created": 1399542760.0, "author_flair_text": null, "created_utc": 1399513960.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcqsxc", "gilded": 0, "author": "Carlosmantega", "parent_id": "t3_24yvhc", "approved_by": null, "body": "Hey. I can completely relate to this problem as well, and I believe I might a handy piece of advice.\nYou might not feel it, but you might be overdoing it. Like, you sound nice, even too nice, and that's a problem sometimes. I can't explain why, but it drives people away if you are excessively nice, it shows somehow that you are needy and people don't always react like you would want to your good intentions. \nTry to play it down a little, stop inviting yourself in with this group for a little while (2, 3 weeks maybe) and work on yourself. By that I mean do a lot of reading, write, find new hobbies, and try to go to new places and try meet new people. Keep your expectations low, just hang out casually with anyone, it gives a good feeling. Ultimately you would want to feel more independent and at ease with yourself, then everything will fall into place. People, probably those old friends too, will come back and you will be little by little invited to different plans.\nAlways play it cool, that's how society works. \nI felt exactly like you at roughly the same age. Now I am the kind of person that greets everyone in the streets of a big city.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey. I can completely relate to this problem as well, and I believe I might a handy piece of advice.\nYou might not feel it, but you might be overdoing it. Like, you sound nice, even too nice, and that&amp;#39;s a problem sometimes. I can&amp;#39;t explain why, but it drives people away if you are excessively nice, it shows somehow that you are needy and people don&amp;#39;t always react like you would want to your good intentions. \nTry to play it down a little, stop inviting yourself in with this group for a little while (2, 3 weeks maybe) and work on yourself. By that I mean do a lot of reading, write, find new hobbies, and try to go to new places and try meet new people. Keep your expectations low, just hang out casually with anyone, it gives a good feeling. Ultimately you would want to feel more independent and at ease with yourself, then everything will fall into place. People, probably those old friends too, will come back and you will be little by little invited to different plans.\nAlways play it cool, that&amp;#39;s how society works. \nI felt exactly like you at roughly the same age. Now I am the kind of person that greets everyone in the streets of a big city.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24yvhc", "score_hidden": false, "name": "t1_chcqsxc", "created": 1399590028.0, "author_flair_text": null, "created_utc": 1399561228.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]