[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really hate waking up everyday. I don&amp;#39;t like interacting with people. I just want to be comfortable and alone for the rest of my life. That&amp;#39;s impossible. I don&amp;#39;t have any friends anymore. Most everyone I know has moved away and I&amp;#39;ve fucked myself up so bad financially somehow that I can&amp;#39;t afford to move. I&amp;#39;m lucky to be in the spot I am. My friends that did stay here have all slowly turned into people I don&amp;#39;t like being around. My closest friend has some type of dementia starting to set in. It&amp;#39;s impossible to carry on a conversation with him. I occasionally have an exgirlfriend that tries to abuse me and vandalizes things around here. I can&amp;#39;t reason with her either. My other close friend has stopped talking to me because he rather go home and binge watch TV series than talk to anyone. Everyone else is angry all the time and not fun to be around. I&amp;#39;ve done some traveling and I find other places to be alien and too much trouble to navigate. I don&amp;#39;t have the energy to deal with life anymore. I don&amp;#39;t have any family left alive either so killing myself wouldn&amp;#39;t be that destructive to those around me. The people that do know me wouldn&amp;#39;t care if I was here or not. &lt;/p&gt;\n\n&lt;p&gt;I just want life to be over. No more having to deal with anything. I don&amp;#39;t even like eating anymore. I can&amp;#39;t stand being around people and can&amp;#39;t afford help. The cheapest therapist I could find here was $130 a session. I&amp;#39;m untreatable anyway due to my social anxiety. I can&amp;#39;t hear what they are saying over my own thoughts. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s time to end the misery and I&amp;#39;m ready to kill myself. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I really hate waking up everyday. I don't like interacting with people. I just want to be comfortable and alone for the rest of my life. That's impossible. I don't have any friends anymore. Most everyone I know has moved away and I've fucked myself up so bad financially somehow that I can't afford to move. I'm lucky to be in the spot I am. My friends that did stay here have all slowly turned into people I don't like being around. My closest friend has some type of dementia starting to set in. It's impossible to carry on a conversation with him. I occasionally have an exgirlfriend that tries to abuse me and vandalizes things around here. I can't reason with her either. My other close friend has stopped talking to me because he rather go home and binge watch TV series than talk to anyone. Everyone else is angry all the time and not fun to be around. I've done some traveling and I find other places to be alien and too much trouble to navigate. I don't have the energy to deal with life anymore. I don't have any family left alive either so killing myself wouldn't be that destructive to those around me. The people that do know me wouldn't care if I was here or not. \n\nI just want life to be over. No more having to deal with anything. I don't even like eating anymore. I can't stand being around people and can't afford help. The cheapest therapist I could find here was $130 a session. I'm untreatable anyway due to my social anxiety. I can't hear what they are saying over my own thoughts. \n\nIt's time to end the misery and I'm ready to kill myself. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24sicc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "555old", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24sicc/im_too_burned_out_to_carry_on/", "name": "t3_24sicc", "created": 1399340795.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24sicc/im_too_burned_out_to_carry_on/", "author_flair_text": null, "title": "I'm too burned out to carry on.", "created_utc": 1399311995.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaa1bf", "gilded": 0, "author": "marinated_pork", "parent_id": "t3_24sicc", "approved_by": null, "body": "What if I told you that I would talk to you every single day and be your therapist for free until you feel better? I would love to give you strength and help you through this rough time.\n\nI hate my life too and feel like a failure, but I want you to be strong and happy.\n\nPM me please.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if I told you that I would talk to you every single day and be your therapist for free until you feel better? I would love to give you strength and help you through this rough time.&lt;/p&gt;\n\n&lt;p&gt;I hate my life too and feel like a failure, but I want you to be strong and happy.&lt;/p&gt;\n\n&lt;p&gt;PM me please.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24sicc", "score_hidden": false, "name": "t1_chaa1bf", "created": 1399345895.0, "author_flair_text": null, "created_utc": 1399317095.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chagb8t", "gilded": 0, "author": "jolonnar", "parent_id": "t3_24sicc", "approved_by": null, "body": "The financial stuff is the worst.  I know what you're feeling there.\n\nMaybe camping in the wilderness is something you should try out.  Not all travelling has to involve people and their stuff.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The financial stuff is the worst.  I know what you&amp;#39;re feeling there.&lt;/p&gt;\n\n&lt;p&gt;Maybe camping in the wilderness is something you should try out.  Not all travelling has to involve people and their stuff.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24sicc", "score_hidden": false, "name": "t1_chagb8t", "created": 1399358340.0, "author_flair_text": null, "created_utc": 1399329540.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]