[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No, I&amp;#39;m not tired, I&amp;#39;m exhausted. Every day is a constant struggle to slowly drag one foot in front of the other, trying to stay balanced. I don&amp;#39;t know if I can do it anymore. I have been trying, so hard, and I&amp;#39;ve done all the &amp;quot;right&amp;quot; things. I&amp;#39;ve reached out to family and friends, I&amp;#39;ve been to therapy, I&amp;#39;ve tried countless medications, I&amp;#39;ve even been hospitalized a few times and all that seems to do is delay the inevitable. It keeps me existing; nothing more, nothing less. &lt;/p&gt;\n\n&lt;p&gt;Trying to find ways to cope with stress has always been hard. I try to do healthy things like focus on my eating habits, try to quit smoking, pick up exercise again. It feels good when I do those things. I can stick with it for awhile, but when things reach that point where I feel like I can&amp;#39;t go on, that&amp;#39;s when my unhealthy habits emerge. In the past it&amp;#39;s cycled through sex, drugs, alcohol, or self harm. I was doing great up until a couple of weeks ago. Now I don&amp;#39;t want to stop. I like to be able to feel something. I&amp;#39;m so disappointed in myself.&lt;/p&gt;\n\n&lt;p&gt;When my relationship is good with those around me, things are okay. Things aren&amp;#39;t perfect, but I have hope, and I feel like I can probably make it through, like I really can take control of my illness and be a better person. That&amp;#39;s what I want, that&amp;#39;s what I continually strive for, but I can only be knocked down so many times before I cannot get up again. Life has dealt me some incredible blows over the last few years, and just when things start looking up, just when I feel like I have a grip on things again, the rug is pulled from underneath me. I would like to think it&amp;#39;s just bad luck, but I know that I am the only common denominator. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve proven to be good at destroying things over the years. Particularly my marriage, my relationship with my parents, friendships, and most recently my relationship with the only person I truly love wholly outside of family. I would do anything for that person, but they&amp;#39;re gone. I understand why, I know that my ups and downs are hard to handle. I know I can be unpredictable and do or say hurtful things which I have to apologize for later, and I know that when I&amp;#39;m down, I&amp;#39;m way, way down. I know that eventually a person always grows tired of it, and they can only accept your apology so many times, or can only offer encouragement so many times before they can&amp;#39;t do it anymore. It has happened time and time again. &lt;/p&gt;\n\n&lt;p&gt;What do you do when you know you rely heavily on some kind of support system, you know you&amp;#39;re not strong enough to do it on your own, but there is no one left? I live a never ending cycle of self loathing, pushing people away, and heartache. I want this to be the last time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "No, I'm not tired, I'm exhausted. Every day is a constant struggle to slowly drag one foot in front of the other, trying to stay balanced. I don't know if I can do it anymore. I have been trying, so hard, and I've done all the \"right\" things. I've reached out to family and friends, I've been to therapy, I've tried countless medications, I've even been hospitalized a few times and all that seems to do is delay the inevitable. It keeps me existing; nothing more, nothing less. \n\nTrying to find ways to cope with stress has always been hard. I try to do healthy things like focus on my eating habits, try to quit smoking, pick up exercise again. It feels good when I do those things. I can stick with it for awhile, but when things reach that point where I feel like I can't go on, that's when my unhealthy habits emerge. In the past it's cycled through sex, drugs, alcohol, or self harm. I was doing great up until a couple of weeks ago. Now I don't want to stop. I like to be able to feel something. I'm so disappointed in myself.\n\nWhen my relationship is good with those around me, things are okay. Things aren't perfect, but I have hope, and I feel like I can probably make it through, like I really can take control of my illness and be a better person. That's what I want, that's what I continually strive for, but I can only be knocked down so many times before I cannot get up again. Life has dealt me some incredible blows over the last few years, and just when things start looking up, just when I feel like I have a grip on things again, the rug is pulled from underneath me. I would like to think it's just bad luck, but I know that I am the only common denominator. \n\nI've proven to be good at destroying things over the years. Particularly my marriage, my relationship with my parents, friendships, and most recently my relationship with the only person I truly love wholly outside of family. I would do anything for that person, but they're gone. I understand why, I know that my ups and downs are hard to handle. I know I can be unpredictable and do or say hurtful things which I have to apologize for later, and I know that when I'm down, I'm way, way down. I know that eventually a person always grows tired of it, and they can only accept your apology so many times, or can only offer encouragement so many times before they can't do it anymore. It has happened time and time again. \n\nWhat do you do when you know you rely heavily on some kind of support system, you know you're not strong enough to do it on your own, but there is no one left? I live a never ending cycle of self loathing, pushing people away, and heartache. I want this to be the last time.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zhfq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "195967", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zhfq/im_tired/", "name": "t3_24zhfq", "created": 1399526051.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zhfq/im_tired/", "author_flair_text": null, "title": "I'm tired.", "created_utc": 1399497251.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc8y9r", "gilded": 0, "author": "reverienoire", "parent_id": "t3_24zhfq", "approved_by": null, "body": "what's your med history? are you on any right now? diagnoses? you don't have to answer any of these questions, of course.\n\ndo you feel like talking more about things? getting into the specifics, i mean. what are the setbacks you've experienced?\n\ni get caught up in these bad cycles of wanting/needing to rely on people and when their reactions/offerings are not what i want/need, it makes me more upset and i isolate or push people away. it makes me wonder why i bother reaching out when it just makes the both of us feel worse. it makes me want to handle things on my own, but if i were any good handling things on my own i wouldn't exactly be in this position, would i? i wish people were better equipped to handle mental illness in general but i have to remind myself that friends and family aren't trained and educated to grapple with this stuff. i tried getting my boyfriend to read a book about depression and he promised and eventually made a lot of excuses as to why he couldn't and wouldn't and that ending up hurting me really bad. if someone you know and love is suffering, wouldn't you do everything in your power to help them? wouldn't you educate yourself as much as possible? idk, i really struggle with stuff like this.\n\ni wish i could get to a support group. do you have any experience with them? they're supposed to be really good if you give them a chance, because everyone that goes is typically in a similar boat and understands. i've heard a lot of people say that their support groups become their second family. that sounds really nice.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what&amp;#39;s your med history? are you on any right now? diagnoses? you don&amp;#39;t have to answer any of these questions, of course.&lt;/p&gt;\n\n&lt;p&gt;do you feel like talking more about things? getting into the specifics, i mean. what are the setbacks you&amp;#39;ve experienced?&lt;/p&gt;\n\n&lt;p&gt;i get caught up in these bad cycles of wanting/needing to rely on people and when their reactions/offerings are not what i want/need, it makes me more upset and i isolate or push people away. it makes me wonder why i bother reaching out when it just makes the both of us feel worse. it makes me want to handle things on my own, but if i were any good handling things on my own i wouldn&amp;#39;t exactly be in this position, would i? i wish people were better equipped to handle mental illness in general but i have to remind myself that friends and family aren&amp;#39;t trained and educated to grapple with this stuff. i tried getting my boyfriend to read a book about depression and he promised and eventually made a lot of excuses as to why he couldn&amp;#39;t and wouldn&amp;#39;t and that ending up hurting me really bad. if someone you know and love is suffering, wouldn&amp;#39;t you do everything in your power to help them? wouldn&amp;#39;t you educate yourself as much as possible? idk, i really struggle with stuff like this.&lt;/p&gt;\n\n&lt;p&gt;i wish i could get to a support group. do you have any experience with them? they&amp;#39;re supposed to be really good if you give them a chance, because everyone that goes is typically in a similar boat and understands. i&amp;#39;ve heard a lot of people say that their support groups become their second family. that sounds really nice.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zhfq", "score_hidden": false, "name": "t1_chc8y9r", "created": 1399532447.0, "author_flair_text": null, "created_utc": 1399503647.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]