[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I felt like considering suicide again. It&amp;#39;s been a couple of months since the last time and I have made some significant good changes in my life but it doesn&amp;#39;t seem to be enough. It always comes back to the same issue. I am not happy in my relationship it would seem. &lt;/p&gt;\n\n&lt;p&gt;The first time I really, I mean really considered suicide was when I was married to a sociopath. That was 1 1/2 years and I finally ended it. I dated one other time seriously for about the same time but never thought to hurt myself, we just broke it off. Then my dad committed suicide and that was it. I was like, this is it, it&amp;#39;s only a matter of time.&lt;/p&gt;\n\n&lt;p&gt;I was put on a really strong anti psychotic medication that really helped and I met my now SO a couple of months later. We have been together 3 years now but it seems to keep declining. I am always trying to rationalize with myself that I am wrong. That what I am feeling is wrong. I have sought counseling, medication, lifestyle changes, learning about different philosophies, meeting new people, trying to be involved with friends. I know that I am independent, there is no doubt about that. All the crap that I have had to put up with in my life does not question the type of grit I am capable of. But the fact remains that our relationship is not compatible. I have tried to not define our relationship but then it comes to this, what truly is a romantic relationship? What the fuck does it even mean anymore? Am I supposed to constantly sacrifice my relationship desires because he is not available?&lt;/p&gt;\n\n&lt;p&gt;He works all the time.&lt;/p&gt;\n\n&lt;p&gt;Even when he doesn&amp;#39;t work all the time, he does things to distract himself - drinking beer, playing video games, watching shows, surfing the internet.&lt;/p&gt;\n\n&lt;p&gt;We have sex maybe once a month. I have tried to rationalize this as, we don&amp;#39;t define how many times we &lt;em&gt;should&lt;/em&gt; be having sex but we don&amp;#39;t even cuddle in lieu of or have other intimate moments.&lt;/p&gt;\n\n&lt;p&gt;He never wants to go out. Never wants to do anything. I have to think of everything to do because he is too tired and too stressed. It&amp;#39;s like pulling teeth to have him come to my work and have lunch with me or visa versa. He can&amp;#39;t take an hour of lunch because he&amp;#39;s always too busy and I feel like I am an inconvenience. &lt;/p&gt;\n\n&lt;p&gt;We don&amp;#39;t text or talk to each other during the day. He hates doing that.&lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t surprise me with anything. What really stood out to me as the decline was it was my birthday and I asked if we could go out. He said that he wanted to take me to this one place and I was excited. My birthday came and I was all excited and then he said that he didn&amp;#39;t make reservations. I was really taken aback. That didn&amp;#39;t sound like him at all. OF COURSE, I looked to the brighter side and we ended up going somewhere else that was cool. &lt;/p&gt;\n\n&lt;p&gt;I feel that I always sacrifice my emotional needs for him.&lt;/p&gt;\n\n&lt;p&gt;Before we met, he bought a house. I moved in with him, endured (and still is) his family&amp;#39;s BS, helped him completely renovate his house (we hardly knew each other) I have painted the entire house, decorated, cook, clean, take care of our dog. &lt;/p&gt;\n\n&lt;p&gt;He told me one time that he would of wished that I lived by myself when I moved out here, that we didn&amp;#39;t live with each other right off the bat. What? Then I should of never moved out here. WTF?&lt;/p&gt;\n\n&lt;p&gt;I was recently watching this spiritual guide name Mooji? In one of his videos he describes not needing to be loved. That we cling on to people, not wanting to let go and in turn chasing them away. I agree but not wanting to be loved? I don&amp;#39;t understand that. I need love, I need to not just hear the words, but see that he loves me. Everyone always tells me how much he loves me. &amp;quot;Oh, he really loves you so much, you have no idea.&amp;quot; Why, because he &lt;em&gt;deals&lt;/em&gt; with me? Because he moved me over a thousand miles away and now he has that responsibility? I don&amp;#39;t know. I don&amp;#39;t know if he will be brutally honest with me.&lt;/p&gt;\n\n&lt;p&gt;He has expressed that he didn&amp;#39;t feel, more than a couple of times, that we were going to work out. I would like to know when these times where.&lt;/p&gt;\n\n&lt;p&gt;I am not going to say that I am the light in this relationship. Since moving, I have had serious depression, mood swings, violent outbursts. &lt;/p&gt;\n\n&lt;p&gt;But I am done. I just don&amp;#39;t even want to think about breaking up. I have no where to go. I have no friends or family. I can&amp;#39;t even handle the fact that I will end up like my dad. Alone, in a studio apartment, with books and a mat on the floor. Where he killed himself and I know that is where my fate will be like. The same as him. Whether I hate him or not.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t rationalize not being happy anymore. Why? Why? Oh, it&amp;#39;s because my parents didn&amp;#39;t love me enough? It&amp;#39;s because I have to do things differently in our relationship, I have to just let him do whatever he &lt;em&gt;needs&lt;/em&gt; to do. Why am I even here? I can be alone, with no companionship, in my own apartment. I can feel just as sad without him. Why am I even doing this?  I can&amp;#39;t rationalize continuing to be alone, at 30? Or wait, do I wait another 10 years and try at 40, 50?&lt;/p&gt;\n\n&lt;p&gt;I am a bit hysterical obviously. I am scared. I want to end it but I don&amp;#39;t know how. I know that I don&amp;#39;t want to live here anymore, not even in the state. I want to go somewhere else. New job, moving again, I have little to no money. I am not staying in this town though, it sucks and I have always said it from the beginning that it does and that I didn&amp;#39;t want to live here anymore. &lt;/p&gt;\n\n&lt;p&gt;What am I supposed to do? Am I wrong? Everytime I try to find advice online, it doesn&amp;#39;t apply to us. We have the same values like, we don&amp;#39;t want to get married, have kids, and we&amp;#39;re atheist. But all I find online for advice are about marriages, kids, &amp;quot;Why he&amp;#39;s  not committing to marriage&amp;quot;, kind of bullshit. Or, we don&amp;#39;t do this or that. Is it possible to do all of the right things like, being open and communicative, being supportive to one another, etc. Is it possible that there is only so much supporting that you can do before you feel that they are taking advantage of that definition. That I am not being supportive because he has to work all the time and I should grovel at his feet for being financially supportive??? NO! I can walk from a million dollars. I CAN WALK and that doesn&amp;#39;t make me an ungrateful. It shows that it&amp;#39;s a two way street and I deserve to feel like I matter and that I am a priority, that I don&amp;#39;t deserve to be treated on the same emotional level as a roommate FFS.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I felt like considering suicide again. It's been a couple of months since the last time and I have made some significant good changes in my life but it doesn't seem to be enough. It always comes back to the same issue. I am not happy in my relationship it would seem. \n\nThe first time I really, I mean really considered suicide was when I was married to a sociopath. That was 1 1/2 years and I finally ended it. I dated one other time seriously for about the same time but never thought to hurt myself, we just broke it off. Then my dad committed suicide and that was it. I was like, this is it, it's only a matter of time.\n\nI was put on a really strong anti psychotic medication that really helped and I met my now SO a couple of months later. We have been together 3 years now but it seems to keep declining. I am always trying to rationalize with myself that I am wrong. That what I am feeling is wrong. I have sought counseling, medication, lifestyle changes, learning about different philosophies, meeting new people, trying to be involved with friends. I know that I am independent, there is no doubt about that. All the crap that I have had to put up with in my life does not question the type of grit I am capable of. But the fact remains that our relationship is not compatible. I have tried to not define our relationship but then it comes to this, what truly is a romantic relationship? What the fuck does it even mean anymore? Am I supposed to constantly sacrifice my relationship desires because he is not available?\n\nHe works all the time.\n\nEven when he doesn't work all the time, he does things to distract himself - drinking beer, playing video games, watching shows, surfing the internet.\n\nWe have sex maybe once a month. I have tried to rationalize this as, we don't define how many times we *should* be having sex but we don't even cuddle in lieu of or have other intimate moments.\n\nHe never wants to go out. Never wants to do anything. I have to think of everything to do because he is too tired and too stressed. It's like pulling teeth to have him come to my work and have lunch with me or visa versa. He can't take an hour of lunch because he's always too busy and I feel like I am an inconvenience. \n\nWe don't text or talk to each other during the day. He hates doing that.\n\nHe doesn't surprise me with anything. What really stood out to me as the decline was it was my birthday and I asked if we could go out. He said that he wanted to take me to this one place and I was excited. My birthday came and I was all excited and then he said that he didn't make reservations. I was really taken aback. That didn't sound like him at all. OF COURSE, I looked to the brighter side and we ended up going somewhere else that was cool. \n\nI feel that I always sacrifice my emotional needs for him.\n\nBefore we met, he bought a house. I moved in with him, endured (and still is) his family's BS, helped him completely renovate his house (we hardly knew each other) I have painted the entire house, decorated, cook, clean, take care of our dog. \n\nHe told me one time that he would of wished that I lived by myself when I moved out here, that we didn't live with each other right off the bat. What? Then I should of never moved out here. WTF?\n\nI was recently watching this spiritual guide name Mooji? In one of his videos he describes not needing to be loved. That we cling on to people, not wanting to let go and in turn chasing them away. I agree but not wanting to be loved? I don't understand that. I need love, I need to not just hear the words, but see that he loves me. Everyone always tells me how much he loves me. \"Oh, he really loves you so much, you have no idea.\" Why, because he *deals* with me? Because he moved me over a thousand miles away and now he has that responsibility? I don't know. I don't know if he will be brutally honest with me.\n\nHe has expressed that he didn't feel, more than a couple of times, that we were going to work out. I would like to know when these times where.\n\nI am not going to say that I am the light in this relationship. Since moving, I have had serious depression, mood swings, violent outbursts. \n\nBut I am done. I just don't even want to think about breaking up. I have no where to go. I have no friends or family. I can't even handle the fact that I will end up like my dad. Alone, in a studio apartment, with books and a mat on the floor. Where he killed himself and I know that is where my fate will be like. The same as him. Whether I hate him or not.\n\nI can't rationalize not being happy anymore. Why? Why? Oh, it's because my parents didn't love me enough? It's because I have to do things differently in our relationship, I have to just let him do whatever he *needs* to do. Why am I even here? I can be alone, with no companionship, in my own apartment. I can feel just as sad without him. Why am I even doing this?  I can't rationalize continuing to be alone, at 30? Or wait, do I wait another 10 years and try at 40, 50?\n\nI am a bit hysterical obviously. I am scared. I want to end it but I don't know how. I know that I don't want to live here anymore, not even in the state. I want to go somewhere else. New job, moving again, I have little to no money. I am not staying in this town though, it sucks and I have always said it from the beginning that it does and that I didn't want to live here anymore. \n\nWhat am I supposed to do? Am I wrong? Everytime I try to find advice online, it doesn't apply to us. We have the same values like, we don't want to get married, have kids, and we're atheist. But all I find online for advice are about marriages, kids, \"Why he's  not committing to marriage\", kind of bullshit. Or, we don't do this or that. Is it possible to do all of the right things like, being open and communicative, being supportive to one another, etc. Is it possible that there is only so much supporting that you can do before you feel that they are taking advantage of that definition. That I am not being supportive because he has to work all the time and I should grovel at his feet for being financially supportive??? NO! I can walk from a million dollars. I CAN WALK and that doesn't make me an ungrateful. It shows that it's a two way street and I deserve to feel like I matter and that I am a priority, that I don't deserve to be treated on the same emotional level as a roommate FFS.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24gw80", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24gw80/im_tired_of_always_feeling_like_i_am_wrong_or/", "name": "t3_24gw80", "created": 1398992669.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24gw80/im_tired_of_always_feeling_like_i_am_wrong_or/", "author_flair_text": null, "title": "I'm tired of always feeling like I am wrong or feel wrong.", "created_utc": 1398963869.0, "ups": 2, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch70ldj", "gilded": 0, "author": "Soletrador", "parent_id": "t1_ch70czr", "approved_by": null, "body": "Can you see nothing relevant about the future?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you see nothing relevant about the future?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch70ldj", "created": 1398969683.0, "author_flair_text": null, "created_utc": 1398966083.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch70czr", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch7079t", "approved_by": null, "body": "Years. Years I have tried. I have no dreams because they can be rationalized into nothingness within seconds.\n\nIt's not like I want dreams or plans. They essentially do not matter. Nothing does. \n\nI thought I had it. I started to do mediation, reading into that kind of stuff and it still has no effect on me. It makes sense but then it's purpose it to become nothing. It makes sense and then it doesn't what is the point of being something if you are to become nothing?\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Years. Years I have tried. I have no dreams because they can be rationalized into nothingness within seconds.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not like I want dreams or plans. They essentially do not matter. Nothing does. &lt;/p&gt;\n\n&lt;p&gt;I thought I had it. I started to do mediation, reading into that kind of stuff and it still has no effect on me. It makes sense but then it&amp;#39;s purpose it to become nothing. It makes sense and then it doesn&amp;#39;t what is the point of being something if you are to become nothing?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch70czr", "created": 1398994406.0, "author_flair_text": null, "created_utc": 1398965606.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch70ixc", "gilded": 0, "author": "Soletrador", "parent_id": "t1_ch70dxi", "approved_by": null, "body": "Talking is better than do.\n\nWhen it started?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talking is better than do.&lt;/p&gt;\n\n&lt;p&gt;When it started?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch70ixc", "created": 1398969542.0, "author_flair_text": null, "created_utc": 1398965942.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch70pmn", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch70dxi", "approved_by": null, "body": "I disagree. there's plenty reason to say something. if you're feeling this way, why keep it inside? that's why you're here right? \n\nPM me if you wanna talk about all this &lt;3 \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree. there&amp;#39;s plenty reason to say something. if you&amp;#39;re feeling this way, why keep it inside? that&amp;#39;s why you&amp;#39;re here right? &lt;/p&gt;\n\n&lt;p&gt;PM me if you wanna talk about all this &amp;lt;3 &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch70pmn", "created": 1398995124.0, "author_flair_text": null, "created_utc": 1398966324.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch70dxi", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch7079t", "approved_by": null, "body": "I don't even know why I am talking about this. What's the saying? If you are going to do it, you wouldn't talk about it.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even know why I am talking about this. What&amp;#39;s the saying? If you are going to do it, you wouldn&amp;#39;t talk about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch70dxi", "created": 1398994457.0, "author_flair_text": null, "created_utc": 1398965657.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7079t", "gilded": 0, "author": "Soletrador", "parent_id": "t1_ch6zzc2", "approved_by": null, "body": "\nWhat if you just find something that make you happy?\n\nWhat are your dream? And your plans? What is holding you far of them?\n\n\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if you just find something that make you happy?&lt;/p&gt;\n\n&lt;p&gt;What are your dream? And your plans? What is holding you far of them?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch7079t", "created": 1398968871.0, "author_flair_text": null, "created_utc": 1398965271.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6zzc2", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch6zuqw", "approved_by": null, "body": "There's nothing wrong with that.\n\nWhat if I leave and I am still unhappy? What do I do then? Implode? I'm just giving up. Either way it doesn't matter. I will never be happy. There is nothing.\n\nIt will be easier to just die.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s nothing wrong with that.&lt;/p&gt;\n\n&lt;p&gt;What if I leave and I am still unhappy? What do I do then? Implode? I&amp;#39;m just giving up. Either way it doesn&amp;#39;t matter. I will never be happy. There is nothing.&lt;/p&gt;\n\n&lt;p&gt;It will be easier to just die.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch6zzc2", "created": 1398993619.0, "author_flair_text": null, "created_utc": 1398964819.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch6zuqw", "gilded": 0, "author": "Soletrador", "parent_id": "t3_24gw80", "approved_by": null, "body": "The fear of being alone are leaving you alone within.\n\nWhat is wrong in let this guy and search your happiness?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fear of being alone are leaving you alone within.&lt;/p&gt;\n\n&lt;p&gt;What is wrong in let this guy and search your happiness?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24gw80", "score_hidden": false, "name": "t1_ch6zuqw", "created": 1398968143.0, "author_flair_text": null, "created_utc": 1398964543.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]