[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just about 2 years ago I landed a great job, bought a house and met my wife. Life was looking up; I mean, I am 30, a homeowner and I have a beautiful girl, what more could I want. I was, literally, cruising. You see, the thing about cruising is that you&amp;#39;re comfortable while at it, but you are not attentive. Your reaction time is no where near what it should be; you become lax; your judgement is slightly impaired. Just a few days after the wedding, we started having issues; mostly it was she who was not able to get along with my parents or my sister. Her complained, and rightfully so, that my parents called way too often and inquired about a variety of topics. She called it interference and I called it love. &lt;/p&gt;\n\n&lt;p&gt;What started happening was that I would get calls from my wife in the middle of my work day saying that my parents said something to her parents or that my parents said something nasty to her. This happened so much that I dreaded going back home from work. In my own home I felt the urge to leave. It was not my home anymore; it was a place where I went to get ear-raped. I stood up for my wife and worked hard to smooth things between her and my parents. But her animosity towards my family had already seeped in to our relationship. This started affecting my work because I was in no position to concentrate.  I only did so much that I did not get fired; my relations at work suffered; a change in management at work did not help. &lt;/p&gt;\n\n&lt;p&gt;In September last year, I was fired from my job. Since then I have not been able to find any meaningful work. I do have an opportunity with a local start-up, but I&amp;#39;ve got immigration issues that they are sorting out. Just today, I heard from 2 places that though they liked me and that I was their top candidate, they cannot file for a work permit due to the nature of the work. Plus today, my wife said that she wants to live separately. I have put up my house for sale; for the last so many months I&amp;#39;ve been able to pay my mortgage off of my previous savings, which have now dwindled.  I did get an admission into a MA+PhD program at a university which I may be able to start in August. I say &amp;quot;may be&amp;quot; because of my current immigration status. There&amp;#39;s a good chance that I&amp;#39;ll have to pack my bags and leave this country. &lt;/p&gt;\n\n&lt;p&gt;Fastforward to a few months- I have no job, no home and maybe no wife. My parents don&amp;#39;t speak much to me either. &lt;/p&gt;\n\n&lt;p&gt;I really have nothing more to look forward to. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just about 2 years ago I landed a great job, bought a house and met my wife. Life was looking up; I mean, I am 30, a homeowner and I have a beautiful girl, what more could I want. I was, literally, cruising. You see, the thing about cruising is that you're comfortable while at it, but you are not attentive. Your reaction time is no where near what it should be; you become lax; your judgement is slightly impaired. Just a few days after the wedding, we started having issues; mostly it was she who was not able to get along with my parents or my sister. Her complained, and rightfully so, that my parents called way too often and inquired about a variety of topics. She called it interference and I called it love. \n\nWhat started happening was that I would get calls from my wife in the middle of my work day saying that my parents said something to her parents or that my parents said something nasty to her. This happened so much that I dreaded going back home from work. In my own home I felt the urge to leave. It was not my home anymore; it was a place where I went to get ear-raped. I stood up for my wife and worked hard to smooth things between her and my parents. But her animosity towards my family had already seeped in to our relationship. This started affecting my work because I was in no position to concentrate.  I only did so much that I did not get fired; my relations at work suffered; a change in management at work did not help. \n\nIn September last year, I was fired from my job. Since then I have not been able to find any meaningful work. I do have an opportunity with a local start-up, but I've got immigration issues that they are sorting out. Just today, I heard from 2 places that though they liked me and that I was their top candidate, they cannot file for a work permit due to the nature of the work. Plus today, my wife said that she wants to live separately. I have put up my house for sale; for the last so many months I've been able to pay my mortgage off of my previous savings, which have now dwindled.  I did get an admission into a MA+PhD program at a university which I may be able to start in August. I say \"may be\" because of my current immigration status. There's a good chance that I'll have to pack my bags and leave this country. \n\nFastforward to a few months- I have no job, no home and maybe no wife. My parents don't speak much to me either. \n\nI really have nothing more to look forward to. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ijd2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "moralantipathy", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399001900.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ijd2/im_tired_of_fighting_fate_im_just_one_bad_news/", "name": "t3_24ijd2", "created": 1399030360.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ijd2/im_tired_of_fighting_fate_im_just_one_bad_news/", "author_flair_text": null, "title": "I'm tired of fighting fate. I'm just one bad news away from ending it forever.", "created_utc": 1399001560.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7j27f", "gilded": 0, "author": "PoetJustice", "parent_id": "t3_24ijd2", "approved_by": null, "body": "Hey, I can't comprehend what you've gone through but if you need anyone to talk to, I'll be here if you need advice or companionship. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I can&amp;#39;t comprehend what you&amp;#39;ve gone through but if you need anyone to talk to, I&amp;#39;ll be here if you need advice or companionship. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ijd2", "score_hidden": false, "name": "t1_ch7j27f", "created": 1399036889.0, "author_flair_text": null, "created_utc": 1399008089.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7kfc6", "gilded": 0, "author": "moralantipathy", "parent_id": "t3_24ijd2", "approved_by": null, "body": "I went from having a job, a home, a wife and a bank balance to being jobless, forced to sell the home, broke to being left (almost) by my wife. To add insult to injury, the immigration rules in this country are so archaic that I cannot even go back to school as a full time student despite scholarship. \nMy family members don't talk to me much anymore; I am unable to be employed anymore due to immigration issues. I don't know what to do except end my life. I've exhausted ALMOST all avenues for overcoming the immigration issue but no avail. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went from having a job, a home, a wife and a bank balance to being jobless, forced to sell the home, broke to being left (almost) by my wife. To add insult to injury, the immigration rules in this country are so archaic that I cannot even go back to school as a full time student despite scholarship. \nMy family members don&amp;#39;t talk to me much anymore; I am unable to be employed anymore due to immigration issues. I don&amp;#39;t know what to do except end my life. I&amp;#39;ve exhausted ALMOST all avenues for overcoming the immigration issue but no avail. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ijd2", "score_hidden": false, "name": "t1_ch7kfc6", "created": 1399041849.0, "author_flair_text": null, "created_utc": 1399013049.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]