[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To start, I feel like it is important to note that my husband&amp;#39;s mother has been diagnosed with depression and she has been on medication since we met in high school. As a teenager he developed this idea that depression was his mother&amp;#39;s way of getting attention and that it wasn&amp;#39;t a real disorder, so to speak, and so has strong feelings against going to the doctor and getting medication for this sort of thing. I truly believe she does have mental health concerns, but she had (and still has) serious health issues that I think led her down that path. That being said, I am still worried some of these problems could be hereditary.&lt;/p&gt;\n\n&lt;p&gt;Okay, now on to my concern. I&amp;#39;ve always known that something has always been a little off with the way my husband copes with anger, stress, and sadness. He has acknowledged these issues in the past and has actively worked to improve his reactions to situations, but he just had a huge blow to his self esteem and I am worried by some of the things he is saying. He used to have a very short temper but is much better with it now. However, when he does get very angry (which is rare - I&amp;#39;d say fewer than 3 or 4 times in a year), he can sometimes become violent. He tries to do it when I don&amp;#39;t see, but he hurts himself. He used to be more extreme, like making a fist and hitting himself in the head repeatedly. Now he will just pull his hair or something less violent but still harming himself in some way. It is usually accompanied by him mumbling about him being stupid or insulting himself verbally as well. Sometimes he will throw things since we have spoken about him hurting himself in the past so he tries to find another way to get out his anger I guess. Occasionally in the past he has made comments like &amp;quot;I am having bad thoughts about doing things I know I shouldn&amp;#39;t do.&amp;quot; I never asked directly. I guess I was too scared to, but I know he must have been alluding to hurting himself more or possibly suicide. &lt;/p&gt;\n\n&lt;p&gt;Like I said, he has been actively working on improving his reactions to anger on the rare occasion he gets that angry, but today he found out he was not offered a job that he really wanted and was confident he would get. He has been stuck in a shit job for 4 years now and feels like he doesn&amp;#39;t know what to do at this point. When I talked to him on his way home from work and for the short time he was home he acted very disappointed, as would be expected, and I expected it to continue at least through the weekend. Now, he left the house for something he had to attend and found out someone else he knows was offered a second interview for this position and he started sending me text messages. He is saying he sucks at his job, no one wants him, he wants to just quit. Normal things I feel like people would say when feeling rejected... but then he starts in with &amp;quot;I&amp;#39;m getting bad thoughts and I don&amp;#39;t like it&amp;quot; &amp;quot;I just don&amp;#39;t want to have to care anymore&amp;quot;. I was trying to reassure him and say we will work it out together but he said to stop trying to cheer him up. &lt;/p&gt;\n\n&lt;p&gt;I apologize if this doesn&amp;#39;t belong in this subreddit but I feel really helpless right now. I don&amp;#39;t know how to help him through this and I don&amp;#39;t know how to tell when to worry that he will actually follow through with the things he says. He has never said anything specifically about suicide, but given the mental health history of his mother I am really concerned. Should I talk to him about seeing a counselor? Like I said before, he has not been open to the idea in the past, but he is not hiding these feelings so I feel like he is reaching out for help. Any advice would really be appreciated.&lt;/p&gt;\n\n&lt;p&gt;As a last note here I do want to just say he has never threatened me or another person with violence, nor has committed any acts of violence against me or another person - only himself. I don&amp;#39;t fear for my safety in any way, only for his. Thank you for taking the time to read this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To start, I feel like it is important to note that my husband's mother has been diagnosed with depression and she has been on medication since we met in high school. As a teenager he developed this idea that depression was his mother's way of getting attention and that it wasn't a real disorder, so to speak, and so has strong feelings against going to the doctor and getting medication for this sort of thing. I truly believe she does have mental health concerns, but she had (and still has) serious health issues that I think led her down that path. That being said, I am still worried some of these problems could be hereditary.\n\nOkay, now on to my concern. I've always known that something has always been a little off with the way my husband copes with anger, stress, and sadness. He has acknowledged these issues in the past and has actively worked to improve his reactions to situations, but he just had a huge blow to his self esteem and I am worried by some of the things he is saying. He used to have a very short temper but is much better with it now. However, when he does get very angry (which is rare - I'd say fewer than 3 or 4 times in a year), he can sometimes become violent. He tries to do it when I don't see, but he hurts himself. He used to be more extreme, like making a fist and hitting himself in the head repeatedly. Now he will just pull his hair or something less violent but still harming himself in some way. It is usually accompanied by him mumbling about him being stupid or insulting himself verbally as well. Sometimes he will throw things since we have spoken about him hurting himself in the past so he tries to find another way to get out his anger I guess. Occasionally in the past he has made comments like \"I am having bad thoughts about doing things I know I shouldn't do.\" I never asked directly. I guess I was too scared to, but I know he must have been alluding to hurting himself more or possibly suicide. \n\nLike I said, he has been actively working on improving his reactions to anger on the rare occasion he gets that angry, but today he found out he was not offered a job that he really wanted and was confident he would get. He has been stuck in a shit job for 4 years now and feels like he doesn't know what to do at this point. When I talked to him on his way home from work and for the short time he was home he acted very disappointed, as would be expected, and I expected it to continue at least through the weekend. Now, he left the house for something he had to attend and found out someone else he knows was offered a second interview for this position and he started sending me text messages. He is saying he sucks at his job, no one wants him, he wants to just quit. Normal things I feel like people would say when feeling rejected... but then he starts in with \"I'm getting bad thoughts and I don't like it\" \"I just don't want to have to care anymore\". I was trying to reassure him and say we will work it out together but he said to stop trying to cheer him up. \n\nI apologize if this doesn't belong in this subreddit but I feel really helpless right now. I don't know how to help him through this and I don't know how to tell when to worry that he will actually follow through with the things he says. He has never said anything specifically about suicide, but given the mental health history of his mother I am really concerned. Should I talk to him about seeing a counselor? Like I said before, he has not been open to the idea in the past, but he is not hiding these feelings so I feel like he is reaching out for help. Any advice would really be appreciated.\n\nAs a last note here I do want to just say he has never threatened me or another person with violence, nor has committed any acts of violence against me or another person - only himself. I don't fear for my safety in any way, only for his. Thank you for taking the time to read this.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256a2j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "needadvice9987", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/256a2j/im_worried_about_my_husband_and_dont_know_what_to/", "name": "t3_256a2j", "created": 1399711727.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/256a2j/im_worried_about_my_husband_and_dont_know_what_to/", "author_flair_text": null, "title": "I'm worried about my husband and don't know what to do.", "created_utc": 1399682927.0, "ups": 6, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che6hz6", "gilded": 0, "author": "Greenedified", "parent_id": "t3_256a2j", "approved_by": null, "body": "Hey there,\nit seems your husband is going through a rough time. Especially when he got the news that he didn't get the job even though he thought he was qualified for it. It must have been another blow to his self esteem, which already was low before. :/ Seeing a therapist or counselor about his anger management \"issues\" is a good idea if he's behind that and I think it might work out well. They should be able to help with his self esteem as well.\nI think a good advice I can give you, and everyone else in general, is to compliment people some more. It always feels good and boosts self esteem when someone says \"you look great today!\" or anything like that.", "edited": 1399694355.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there,\nit seems your husband is going through a rough time. Especially when he got the news that he didn&amp;#39;t get the job even though he thought he was qualified for it. It must have been another blow to his self esteem, which already was low before. :/ Seeing a therapist or counselor about his anger management &amp;quot;issues&amp;quot; is a good idea if he&amp;#39;s behind that and I think it might work out well. They should be able to help with his self esteem as well.\nI think a good advice I can give you, and everyone else in general, is to compliment people some more. It always feels good and boosts self esteem when someone says &amp;quot;you look great today!&amp;quot; or anything like that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256a2j", "score_hidden": false, "name": "t1_che6hz6", "created": 1399718615.0, "author_flair_text": null, "created_utc": 1399689815.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chefy5n", "gilded": 0, "author": "the_splatt", "parent_id": "t3_256a2j", "approved_by": null, "body": "I'd start by talking with him about what his bad thoughts are, and I'd do that before you tell him you think he should see a counsellor.  I'd try to establish what these thoughts are and how he feels about having them and I'd go from there.  I think he's trying to reach out to you for understanding (not 'cheering up' or finding a way to 'work it out', but real *understanding*) and the first way to achieve that would be to encourage him to speak about what he's thinking and feeling.\nI'd tell him that I'm worried about him hurting himself and him becoming angry at himself, ask him what he means by 'bad thoughts' and see where the conversation takes you.  Maybe it's time for counselling, but I think it's probably more important right now for him to feel understood.  I'd let him be angry and upset about the job.  He's entitled to grieve for something he's lost that he thought was in the bag.  Trying to make him feel better isn't what he's after from the sounds of it.\nThe most important thing I would be doing in your situation is trying to understand and to support him in the grief.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d start by talking with him about what his bad thoughts are, and I&amp;#39;d do that before you tell him you think he should see a counsellor.  I&amp;#39;d try to establish what these thoughts are and how he feels about having them and I&amp;#39;d go from there.  I think he&amp;#39;s trying to reach out to you for understanding (not &amp;#39;cheering up&amp;#39; or finding a way to &amp;#39;work it out&amp;#39;, but real &lt;em&gt;understanding&lt;/em&gt;) and the first way to achieve that would be to encourage him to speak about what he&amp;#39;s thinking and feeling.\nI&amp;#39;d tell him that I&amp;#39;m worried about him hurting himself and him becoming angry at himself, ask him what he means by &amp;#39;bad thoughts&amp;#39; and see where the conversation takes you.  Maybe it&amp;#39;s time for counselling, but I think it&amp;#39;s probably more important right now for him to feel understood.  I&amp;#39;d let him be angry and upset about the job.  He&amp;#39;s entitled to grieve for something he&amp;#39;s lost that he thought was in the bag.  Trying to make him feel better isn&amp;#39;t what he&amp;#39;s after from the sounds of it.\nThe most important thing I would be doing in your situation is trying to understand and to support him in the grief.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256a2j", "score_hidden": false, "name": "t1_chefy5n", "created": 1399761301.0, "author_flair_text": null, "created_utc": 1399732501.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]