[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been having suicidal thoughts for some time.  To allay any immediate concerns, I&amp;#39;m not on the brink of suicide now or worried that I will be soon.  That said, this is obviously a bad place to be and I&amp;#39;d like to get some help to not be there.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been going to therapy sporadically (as life allows) for some time, and it&amp;#39;s helped.  The big issue I have is that it seems like I have to say &amp;quot;No.&amp;quot; whenever I&amp;#39;m asked about suicidal thoughts.  I&amp;#39;ve had friends end up getting essentially kidnapped to unhelpful closed wards for admitting to suicidal tendencies, and it&amp;#39;s been made very clear to me that such an admission could get me kicked out of my university (which will probably be demanding records of my sessions as part of ongoing attendance.  No idea if that&amp;#39;s legal, but it&amp;#39;s probably not terribly relevant.)&lt;/p&gt;\n\n&lt;p&gt;What happens if I tell a therapist the truth - I don&amp;#39;t intend to kill myself, but I do have somewhat detailed thoughts on the topic?  If I can&amp;#39;t tell a therapist, are there other ways I could talk to a human that won&amp;#39;t see me locked up on a closed ward somewhere? I just don&amp;#39;t know how to go about learning this stuff or who I could ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been having suicidal thoughts for some time.  To allay any immediate concerns, I'm not on the brink of suicide now or worried that I will be soon.  That said, this is obviously a bad place to be and I'd like to get some help to not be there.\n\nI've been going to therapy sporadically (as life allows) for some time, and it's helped.  The big issue I have is that it seems like I have to say \"No.\" whenever I'm asked about suicidal thoughts.  I've had friends end up getting essentially kidnapped to unhelpful closed wards for admitting to suicidal tendencies, and it's been made very clear to me that such an admission could get me kicked out of my university (which will probably be demanding records of my sessions as part of ongoing attendance.  No idea if that's legal, but it's probably not terribly relevant.)\n\nWhat happens if I tell a therapist the truth - I don't intend to kill myself, but I do have somewhat detailed thoughts on the topic?  If I can't tell a therapist, are there other ways I could talk to a human that won't see me locked up on a closed ward somewhere? I just don't know how to go about learning this stuff or who I could ask.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xr32", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tempdontworry", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xr32/inperson_help_without_consequences/", "name": "t3_23xr32", "created": 1398444361.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xr32/inperson_help_without_consequences/", "author_flair_text": null, "title": "In-person help without consequences?", "created_utc": 1398415561.0, "ups": 2, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1v3ef", "gilded": 0, "author": "tempdontworry", "parent_id": "t1_ch1ly2e", "approved_by": null, "body": "Thanks - keeping these concerns in one head for too long tends to leave them way out of proportion.  I'll talk to a therapist and trust that I can work it out that way.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks - keeping these concerns in one head for too long tends to leave them way out of proportion.  I&amp;#39;ll talk to a therapist and trust that I can work it out that way.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1v3ef", "created": 1398449365.0, "author_flair_text": null, "created_utc": 1398445765.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1ly2e", "gilded": 0, "author": "Madame_de_Cunt", "parent_id": "t1_ch1lnqg", "approved_by": null, "body": "Casual C+. It was sort of like a pity pass.\n\nI doubt they will do that. Proof you're ready to return just means a doctor's note saying you're OK. It covers your absences for that time and all sorts of covering-their-own-asses shit.\n\nYou'll be fine.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Casual C+. It was sort of like a pity pass.&lt;/p&gt;\n\n&lt;p&gt;I doubt they will do that. Proof you&amp;#39;re ready to return just means a doctor&amp;#39;s note saying you&amp;#39;re OK. It covers your absences for that time and all sorts of covering-their-own-asses shit.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll be fine.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1ly2e", "created": 1398422714.0, "author_flair_text": null, "created_utc": 1398419114.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch1lnqg", "gilded": 0, "author": "tempdontworry", "parent_id": "t1_ch1lllr", "approved_by": null, "body": "Damn, that's a heavy final exam, I'm sorry.  Anyone drop you a line to see if you were ok, or just a casual C+?\n\nThanks for the reassurance on therapists, I got a little paranoid but it makes sense that they're not going to jump any time anyone mentions suicidal thoughts.\n\nI'm concerned about getting tossed out because it's an American private school and I'm on \"leave\" for grades (less than shockingly, my mental state and those grades are related).  Without \"proof that I'm ready to return\" I don't come back - the bar for that isn't high, but I have some reason to believe that they'd be eager to say no if they thought I might hurt myself while on their student statistics.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn, that&amp;#39;s a heavy final exam, I&amp;#39;m sorry.  Anyone drop you a line to see if you were ok, or just a casual C+?&lt;/p&gt;\n\n&lt;p&gt;Thanks for the reassurance on therapists, I got a little paranoid but it makes sense that they&amp;#39;re not going to jump any time anyone mentions suicidal thoughts.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m concerned about getting tossed out because it&amp;#39;s an American private school and I&amp;#39;m on &amp;quot;leave&amp;quot; for grades (less than shockingly, my mental state and those grades are related).  Without &amp;quot;proof that I&amp;#39;m ready to return&amp;quot; I don&amp;#39;t come back - the bar for that isn&amp;#39;t high, but I have some reason to believe that they&amp;#39;d be eager to say no if they thought I might hurt myself while on their student statistics.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1lnqg", "created": 1398420866.0, "author_flair_text": null, "created_utc": 1398417266.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1lllr", "gilded": 0, "author": "Madame_de_Cunt", "parent_id": "t3_23xr32", "approved_by": null, "body": "When it comes to speaking to your therapist they aren't going to throw you in the looney bin for having suicidal thoughts. Everybody's had them one time or another, they can't really just go chucking us all periodically in the sanitarium when it suits.\n\nFrom my experience, if you say \"Yes, I have thoughts but no, I have no intentions. I do not think I am a danger to myself,\" they won't take you away. Edit: This is because they can only take action when they believe you are a violent threat to yourself or others.\n\nAs for kicking you out of university, I don't think they can for admitting to suicidal tendencies or ideation. I once wrote a suicide note as a final exam in uni. I got a C+. Truly wish I were joking. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to speaking to your therapist they aren&amp;#39;t going to throw you in the looney bin for having suicidal thoughts. Everybody&amp;#39;s had them one time or another, they can&amp;#39;t really just go chucking us all periodically in the sanitarium when it suits.&lt;/p&gt;\n\n&lt;p&gt;From my experience, if you say &amp;quot;Yes, I have thoughts but no, I have no intentions. I do not think I am a danger to myself,&amp;quot; they won&amp;#39;t take you away. Edit: This is because they can only take action when they believe you are a violent threat to yourself or others.&lt;/p&gt;\n\n&lt;p&gt;As for kicking you out of university, I don&amp;#39;t think they can for admitting to suicidal tendencies or ideation. I once wrote a suicide note as a final exam in uni. I got a C+. Truly wish I were joking. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1lllr", "created": 1398420487.0, "author_flair_text": null, "created_utc": 1398416887.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch22lsx", "gilded": 0, "author": "Dogg_92", "parent_id": "t1_ch1v5fi", "approved_by": null, "body": "Another way that I phrase it that sounds less threatening is \"I wish there was an off button\" or \"I'm tired of life\". Saying things like \"I just want to go get a gun and shoot myself\" or \"I wish I could just slice my wrist\" sounds very extreme, and even though I may be feeling like that at the moment, I don't ever say it because it's just a thought. There have been a couple times where I truly did feel like I was going to hurt myself, and I was able to get help without being committed (just had to change my medication). You can always PM me if you need to talk or have questions. Good luck to you. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another way that I phrase it that sounds less threatening is &amp;quot;I wish there was an off button&amp;quot; or &amp;quot;I&amp;#39;m tired of life&amp;quot;. Saying things like &amp;quot;I just want to go get a gun and shoot myself&amp;quot; or &amp;quot;I wish I could just slice my wrist&amp;quot; sounds very extreme, and even though I may be feeling like that at the moment, I don&amp;#39;t ever say it because it&amp;#39;s just a thought. There have been a couple times where I truly did feel like I was going to hurt myself, and I was able to get help without being committed (just had to change my medication). You can always PM me if you need to talk or have questions. Good luck to you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch22lsx", "created": 1398464705.0, "author_flair_text": null, "created_utc": 1398461105.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1v5fi", "gilded": 0, "author": "tempdontworry", "parent_id": "t1_ch1qahp", "approved_by": null, "body": "Thanks, I will.  I saw a few friends get committed (though that was from overzealous cop-calling by others), and got the impression that it was a question you couldn't say yes to.  After seeing people respond I get that that's kind of a silly thought - obviously not everyone who thinks about suicide can or should be committed.\n\nI'll talk to a therapist about it, and don't worry, I'm not in immediate danger.  I think this will help a lot.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I will.  I saw a few friends get committed (though that was from overzealous cop-calling by others), and got the impression that it was a question you couldn&amp;#39;t say yes to.  After seeing people respond I get that that&amp;#39;s kind of a silly thought - obviously not everyone who thinks about suicide can or should be committed.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll talk to a therapist about it, and don&amp;#39;t worry, I&amp;#39;m not in immediate danger.  I think this will help a lot.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1v5fi", "created": 1398449473.0, "author_flair_text": null, "created_utc": 1398445873.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1qahp", "gilded": 0, "author": "Dogg_92", "parent_id": "t3_23xr32", "approved_by": null, "body": "Good therapists understand that there is a huge difference between wanting to die, and making serious plans to die.\n\nWanting to die is something that shouldn't get you put into a mental ward (I have been in and out of the mental health system, and so I have an understanding of this). I have seen my therapist for 4 years now, and I have talked about wanting to die plenty of times. I have even told my therapist how I would kill myself if I ever will. But I have never told my therapist about concrete plans (such as \"I really think I'm going to kill myself sometime soon with a gun). I've always just said things like \"I just don't want to be here anymore\", \"I want to die\" , etc.\n\nIf everyone who had suicidal thoughts was thrown into a mental institution, then all hospitals would be filled up constantly. Please tell someone if you are thinking of this. Therapists can help you in many ways. Please tell someone. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good therapists understand that there is a huge difference between wanting to die, and making serious plans to die.&lt;/p&gt;\n\n&lt;p&gt;Wanting to die is something that shouldn&amp;#39;t get you put into a mental ward (I have been in and out of the mental health system, and so I have an understanding of this). I have seen my therapist for 4 years now, and I have talked about wanting to die plenty of times. I have even told my therapist how I would kill myself if I ever will. But I have never told my therapist about concrete plans (such as &amp;quot;I really think I&amp;#39;m going to kill myself sometime soon with a gun). I&amp;#39;ve always just said things like &amp;quot;I just don&amp;#39;t want to be here anymore&amp;quot;, &amp;quot;I want to die&amp;quot; , etc.&lt;/p&gt;\n\n&lt;p&gt;If everyone who had suicidal thoughts was thrown into a mental institution, then all hospitals would be filled up constantly. Please tell someone if you are thinking of this. Therapists can help you in many ways. Please tell someone. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xr32", "score_hidden": false, "name": "t1_ch1qahp", "created": 1398439468.0, "author_flair_text": null, "created_utc": 1398435868.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]