[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if this turns into a bit of a ramble. I am nineteen and I&amp;#39;ve been suffering from depression and various other issues ever since my mother died when I was eleven. Despite having had a lot of support, both professionally and from friends, I don&amp;#39;t seem to have ever made progress and I&amp;#39;m inclined to believe that life just isn&amp;#39;t worth it.&lt;/p&gt;\n\n&lt;p&gt;When I tell people that I want to die, they say I shouldn&amp;#39;t do it because it will get better eventually... but will it? Will it really? The longer I live, the more inevitable it becomes that I will only suffer again and again, as all people do. Even if I eventually overcome my depression, all human beings are invariably stricken by pain and loss over and over again if they live long enough.&lt;/p&gt;\n\n&lt;p&gt;All I really know is that I hate suffering, and the only way for me to guarantee I&amp;#39;ll never suffer again is to take my own life.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m only alive for these reasons: Firstly I don&amp;#39;t want to hurt the people I care about, secondly I&amp;#39;m too scared of failing an attempt, thirdly I have a strong survival instinct.&lt;/p&gt;\n\n&lt;p&gt;Also I don&amp;#39;t have anything that&amp;#39;s readily accessible that I could use to make a successful attempt on my life. I have made plans that I could use to kill myself in a foolproof and painless way, but they require things that take forethought to acquire, and I&amp;#39;m yet to have mustered sufficient resolve to actually started actioning an attempt on my life.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just really in two minds about the whole thing. Mostly, I think maybe I&amp;#39;ve already made up my mind - that I can&amp;#39;t really try to kill myself, for the sake of people I care about, however I might actually want to - so I feel kind of like an empty person that&amp;#39;s only really alive because I have to be. I really just want to know if life is actually worth living for any other reason.&lt;/p&gt;\n\n&lt;p&gt;People tell me that happiness is worth it but I really doubt that some kind of fleeting glimpse of happiness could really be worth it, even if real lasting happiness is something that could ever really be something attainable for me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry if this turns into a bit of a ramble. I am nineteen and I've been suffering from depression and various other issues ever since my mother died when I was eleven. Despite having had a lot of support, both professionally and from friends, I don't seem to have ever made progress and I'm inclined to believe that life just isn't worth it.\n\nWhen I tell people that I want to die, they say I shouldn't do it because it will get better eventually... but will it? Will it really? The longer I live, the more inevitable it becomes that I will only suffer again and again, as all people do. Even if I eventually overcome my depression, all human beings are invariably stricken by pain and loss over and over again if they live long enough.\n\nAll I really know is that I hate suffering, and the only way for me to guarantee I'll never suffer again is to take my own life.\n\nI'm only alive for these reasons: Firstly I don't want to hurt the people I care about, secondly I'm too scared of failing an attempt, thirdly I have a strong survival instinct.\n\nAlso I don't have anything that's readily accessible that I could use to make a successful attempt on my life. I have made plans that I could use to kill myself in a foolproof and painless way, but they require things that take forethought to acquire, and I'm yet to have mustered sufficient resolve to actually started actioning an attempt on my life.\n\nI'm just really in two minds about the whole thing. Mostly, I think maybe I've already made up my mind - that I can't really try to kill myself, for the sake of people I care about, however I might actually want to - so I feel kind of like an empty person that's only really alive because I have to be. I really just want to know if life is actually worth living for any other reason.\n\nPeople tell me that happiness is worth it but I really doubt that some kind of fleeting glimpse of happiness could really be worth it, even if real lasting happiness is something that could ever really be something attainable for me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245r9n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Tinesife", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245r9n/is_life_worth_it/", "name": "t3_245r9n", "created": 1398685722.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245r9n/is_life_worth_it/", "author_flair_text": null, "title": "Is life worth it?", "created_utc": 1398656922.0, "ups": 8, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]