[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even know what I&amp;#39;m doing posting this, I don&amp;#39;t want attention, I guess I just need to talk to someone. I don&amp;#39;t really have any friends anymore. In October my boyfriend and I of four years split up, as the result of me and my selfish actions. I cheated on him. I ruined my life. We were happy, it wasn&amp;#39;t perfect but I was happy, content and everything was falling into place, my life was falling into place. And then I cheated on him. And I fucked up. He never wants to see me again, which I get, I moved out of our house, I left pretty much everything but some clothes  and I moved into a efficiency. One month prior to that, my cat who was just the best thing I had in my life, he got out one night and never came back. I still can&amp;#39;t look at a picture of him without crying. In January, three months after breakup, my dad died. He&amp;#39;d been battling cancer for a few years and it had gotten pretty tough the months leading up to his death but my dad was such a strong dude that death was never an option, we never even thought about it, my father was such a fighter, and the best guy I&amp;#39;ve ever known. Loved me unconditionally, had the best sense of humor, got along great w everyone, he was just the best. I miss him so much. The past five months have been so hollow. I live paycheck to paycheck, I&amp;#39;m thousands upon thousands dollars in debt from living beyond my means for too many years (I&amp;#39;ve stopped the spending, cut my cards up last June) everyday it&amp;#39;s another bill collector, another credit company calling and I just don&amp;#39;t have the money, I feel like I&amp;#39;m drowning in debt. It&amp;#39;s mother&amp;#39;s day and I can&amp;#39;t even afford to buy my mom some flowers. I&amp;#39;ve been at work since three this morning, I got out at twelve and I&amp;#39;m at my other job at five, I work as a cook, all I do is serve food to happy people and all I am is miserable. I&amp;#39;ve been googling a lot about suicide and I think that&amp;#39;s kind of a warning flag for me. I&amp;#39;m on antidepressants but I don&amp;#39;t think they&amp;#39;re working. I can&amp;#39;t even afford to go talk to someone. I&amp;#39;m such a fucking loser I can&amp;#39;t even buy my mom flowers for mothers day. I don&amp;#39;t sleep, I just stare at the ceiling. I don&amp;#39;t feel like a burden to others but I don&amp;#39;t feel like I&amp;#39;m worth anything. Right now, it&amp;#39;s my mom keeping me from killing myself. She already buried her husband this year, I can&amp;#39;t let her bury her daughter, I think it would destroy her. But at the same time I can&amp;#39;t talk to her about anything real because she&amp;#39;s so sad about my dad that when I see her i try and keep it light. It&amp;#39;s like twelve months ago, this time last year, my life was completely different, I had my boyfriend, my cat, my father, my friends. Now I&amp;#39;m all alone. And I&amp;#39;m so tired but I can&amp;#39;t go to sleep. And I know I deserve it, I&amp;#39;m just so tired of the pain. So tired of being sad and of crying. I feel like I&amp;#39;m in a nightmare but I can&amp;#39;t wake up...I don&amp;#39;t know what to do anymore&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't even know what I'm doing posting this, I don't want attention, I guess I just need to talk to someone. I don't really have any friends anymore. In October my boyfriend and I of four years split up, as the result of me and my selfish actions. I cheated on him. I ruined my life. We were happy, it wasn't perfect but I was happy, content and everything was falling into place, my life was falling into place. And then I cheated on him. And I fucked up. He never wants to see me again, which I get, I moved out of our house, I left pretty much everything but some clothes  and I moved into a efficiency. One month prior to that, my cat who was just the best thing I had in my life, he got out one night and never came back. I still can't look at a picture of him without crying. In January, three months after breakup, my dad died. He'd been battling cancer for a few years and it had gotten pretty tough the months leading up to his death but my dad was such a strong dude that death was never an option, we never even thought about it, my father was such a fighter, and the best guy I've ever known. Loved me unconditionally, had the best sense of humor, got along great w everyone, he was just the best. I miss him so much. The past five months have been so hollow. I live paycheck to paycheck, I'm thousands upon thousands dollars in debt from living beyond my means for too many years (I've stopped the spending, cut my cards up last June) everyday it's another bill collector, another credit company calling and I just don't have the money, I feel like I'm drowning in debt. It's mother's day and I can't even afford to buy my mom some flowers. I've been at work since three this morning, I got out at twelve and I'm at my other job at five, I work as a cook, all I do is serve food to happy people and all I am is miserable. I've been googling a lot about suicide and I think that's kind of a warning flag for me. I'm on antidepressants but I don't think they're working. I can't even afford to go talk to someone. I'm such a fucking loser I can't even buy my mom flowers for mothers day. I don't sleep, I just stare at the ceiling. I don't feel like a burden to others but I don't feel like I'm worth anything. Right now, it's my mom keeping me from killing myself. She already buried her husband this year, I can't let her bury her daughter, I think it would destroy her. But at the same time I can't talk to her about anything real because she's so sad about my dad that when I see her i try and keep it light. It's like twelve months ago, this time last year, my life was completely different, I had my boyfriend, my cat, my father, my friends. Now I'm all alone. And I'm so tired but I can't go to sleep. And I know I deserve it, I'm just so tired of the pain. So tired of being sad and of crying. I feel like I'm in a nightmare but I can't wake up...I don't know what to do anymore", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25adav", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "reluctantlyjoining", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25adav/it_all_feels_so_meaningless/", "name": "t3_25adav", "created": 1399854364.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25adav/it_all_feels_so_meaningless/", "author_flair_text": null, "title": "It all feels so meaningless", "created_utc": 1399825564.0, "ups": 1, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfcy9b", "gilded": 0, "author": "reluctantlyjoining", "parent_id": "t1_chf9dzv", "approved_by": null, "body": "Thank you. Congrats on quitting your job, abusive bosses suck and definitely don't make work a fun place to be", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. Congrats on quitting your job, abusive bosses suck and definitely don&amp;#39;t make work a fun place to be&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chfcy9b", "created": 1399865784.0, "author_flair_text": null, "created_utc": 1399836984.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf9dzv", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t3_25adav", "approved_by": null, "body": "Huge hug for you. I just quit my second job yesterday, boss was quite abusive. But I understand what it means to be always exhausted, it feels like you're loosing your mind.\n\nFor the debts you should probably seek advice in r/personalfinance. But just know that you are not the only one, lots of people are in the same situation.\n\nDon't be to hard on yourself. You've been through some difficult times and it takes time to put things back together.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huge hug for you. I just quit my second job yesterday, boss was quite abusive. But I understand what it means to be always exhausted, it feels like you&amp;#39;re loosing your mind.&lt;/p&gt;\n\n&lt;p&gt;For the debts you should probably seek advice in r/personalfinance. But just know that you are not the only one, lots of people are in the same situation.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be to hard on yourself. You&amp;#39;ve been through some difficult times and it takes time to put things back together.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chf9dzv", "created": 1399856492.0, "author_flair_text": null, "created_utc": 1399827692.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfdf7k", "gilded": 0, "author": "InexorableMarch", "parent_id": "t1_chfd39k", "approved_by": null, "body": "It's really good to get a fresh start. And you're welcome. It's so much easier to avoid I know the feeling. It's kind of like picking at scab. It hurts, *hurts so, so much,* but once it's off you can deal and the healing will begin. I'm glad you have a plan! Mountains in the summer and snowboarding in the winter sounds amazing! Your plan is very attainable. You can do it. You're stepping up, you're talking, it's good. It's good to be part of a community too.  \n  \nOwn who you are, what you've done, and what you're doing to fix it. You aren't alone. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s really good to get a fresh start. And you&amp;#39;re welcome. It&amp;#39;s so much easier to avoid I know the feeling. It&amp;#39;s kind of like picking at scab. It hurts, &lt;em&gt;hurts so, so much,&lt;/em&gt; but once it&amp;#39;s off you can deal and the healing will begin. I&amp;#39;m glad you have a plan! Mountains in the summer and snowboarding in the winter sounds amazing! Your plan is very attainable. You can do it. You&amp;#39;re stepping up, you&amp;#39;re talking, it&amp;#39;s good. It&amp;#39;s good to be part of a community too.  &lt;/p&gt;\n\n&lt;p&gt;Own who you are, what you&amp;#39;ve done, and what you&amp;#39;re doing to fix it. You aren&amp;#39;t alone. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chfdf7k", "created": 1399866978.0, "author_flair_text": null, "created_utc": 1399838178.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfd39k", "gilded": 0, "author": "reluctantlyjoining", "parent_id": "t1_chfasg3", "approved_by": null, "body": "Thank you. I know I need to stop avoiding it. It's just that it's so much easier to just avoid it, to try not to think about it. The anxiety I experience whenever I think about the debt I've accumulated is so overwhelming that I just can't deal, or won't deal or whatever. \nI have this plan, my six month plan, to get out of Miami, transfer somewhere with my job, start in a new city. Somewhere more affordable, where 900/month gets you more than just a 10x10 room. Get a cat, maybe even two cats. Go hiking in the mountains in the summer, snowboarding in the winter, maybe meet some people that I could come to call my friends. Sometimes I feel that's an attainable plan, sometimes I think I'm just dreaming and I'll never get out of here. I don't think the grass is greener..I just think it might be good for me to make a fresh start of things", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I know I need to stop avoiding it. It&amp;#39;s just that it&amp;#39;s so much easier to just avoid it, to try not to think about it. The anxiety I experience whenever I think about the debt I&amp;#39;ve accumulated is so overwhelming that I just can&amp;#39;t deal, or won&amp;#39;t deal or whatever. \nI have this plan, my six month plan, to get out of Miami, transfer somewhere with my job, start in a new city. Somewhere more affordable, where 900/month gets you more than just a 10x10 room. Get a cat, maybe even two cats. Go hiking in the mountains in the summer, snowboarding in the winter, maybe meet some people that I could come to call my friends. Sometimes I feel that&amp;#39;s an attainable plan, sometimes I think I&amp;#39;m just dreaming and I&amp;#39;ll never get out of here. I don&amp;#39;t think the grass is greener..I just think it might be good for me to make a fresh start of things&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chfd39k", "created": 1399866132.0, "author_flair_text": null, "created_utc": 1399837332.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfasg3", "gilded": 0, "author": "InexorableMarch", "parent_id": "t3_25adav", "approved_by": null, "body": "It doesn't just feel meaningless that whole situation sucks. No ifs and or buts and I don't want to demean what you're going through by suggesting it's otherwise. But you're doing good. I mean that.  \n  \nI've been in debt and had the collectors call. You don't want to answer your phone because there's nothing you can do. I don't know if it'll work for you but what I did is I finally stopped avoiding it. I charted out all my expenses, looked at what I was making and what I could afford. Built myself essentially a step by step plan to make it out and dig myself out of debt a spoonful at a time. I called them up (took control of the situation) and told them that I couldn't pay them any money, but I wanted to pay it back. And we set up some payment plans.  \n  \nYou don't deserve to be in pain, you really don't. You're human. Sometimes we fuck up. The only way out of a mess like this is to start rebuilding your life one step at a time. If you can, save up some money and adopt a new cat. Find a stray and take them in if that's not an option. Start with something small and regain control of your life a little at a time.  \n  \n*Hugs*", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t just feel meaningless that whole situation sucks. No ifs and or buts and I don&amp;#39;t want to demean what you&amp;#39;re going through by suggesting it&amp;#39;s otherwise. But you&amp;#39;re doing good. I mean that.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in debt and had the collectors call. You don&amp;#39;t want to answer your phone because there&amp;#39;s nothing you can do. I don&amp;#39;t know if it&amp;#39;ll work for you but what I did is I finally stopped avoiding it. I charted out all my expenses, looked at what I was making and what I could afford. Built myself essentially a step by step plan to make it out and dig myself out of debt a spoonful at a time. I called them up (took control of the situation) and told them that I couldn&amp;#39;t pay them any money, but I wanted to pay it back. And we set up some payment plans.  &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t deserve to be in pain, you really don&amp;#39;t. You&amp;#39;re human. Sometimes we fuck up. The only way out of a mess like this is to start rebuilding your life one step at a time. If you can, save up some money and adopt a new cat. Find a stray and take them in if that&amp;#39;s not an option. Start with something small and regain control of your life a little at a time.  &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Hugs&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chfasg3", "created": 1399860253.0, "author_flair_text": null, "created_utc": 1399831453.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chff0iq", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25adav", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25adav", "score_hidden": false, "name": "t1_chff0iq", "created": 1399870906.0, "author_flair_text": null, "created_utc": 1399842106.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]