[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a letter I wrote to myself. I just needed someone to read it.&lt;/p&gt;\n\n&lt;p&gt;What am I going to do? If I try and fail, will that be enough? If I do everything I can, put my best foot forward, and then fail? I&amp;#39;ll never recover. So I can not try. I can be passive, and let my life carry on as it is. I&amp;#39;ll never have to find out if I&amp;#39;m actually good at anything. And that&amp;#39;s what I&amp;#39;ll do. Continue my life as this waste of resources. I contribute nothing to the world, and in return, I smoke weed and jerk off. Because that is a millions times easier than trying. Than caring. I quit things. That&amp;#39;s what I do. I quit sports, I quit trying in class, I quit caring about my health. I quit everything. Because quitting is easy. And I&amp;#39;m all about the easiest possible solution. Lowest common denominator. Because god forbid I ever once see anything through to the end. I fucking hate you. I hate everything, and everyone. Because they don&amp;#39;t have this crippling fear of trying. And it will never be enough. I&amp;#39;ll always have to do more. There&amp;#39;s always another mountain to climb. And what&amp;#39;s the goal? The point? The reason to wake up in the morning and fight the monotony. Self-preservation. We stay alive because it&amp;#39;s hard wired into our brains. We do what we have to, in order to keep the ship afloat. But who the fuck cares if it does? My family. My friends. They&amp;#39;ll be sad. They&amp;#39;ll post on their walls, they&amp;#39;ll tweet, they&amp;#39;ll make it know that I&amp;#39;m &amp;#39;gone but not forgotten&amp;#39;. And then they&amp;#39;ll forget. The world will forget. And they&amp;#39;ll get over it, and move on, and stay alive, and I won&amp;#39;t have to deal with any of it anymore. No more vapid girls with delusions of grandeur. No more cocksure, douchebag guys who somehow take every woman of substance. I can be free of it all. Free of social circles, and dumb people. I can&amp;#39;t stand it anymore. And I say this the day after my goddamn birthday. Because last night was a blast. Probably, I can&amp;#39;t remember. But tonight, I could go out, and go back to being ignored. Go back to no one giving a damn. And my friends wonder why I don&amp;#39;t love birthdays. Because it&amp;#39;s the where one day of the year people pretend to give a shit about you. And then it ends. It all ends.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a letter I wrote to myself. I just needed someone to read it.\n\n\n\n\nWhat am I going to do? If I try and fail, will that be enough? If I do everything I can, put my best foot forward, and then fail? I'll never recover. So I can not try. I can be passive, and let my life carry on as it is. I'll never have to find out if I'm actually good at anything. And that's what I'll do. Continue my life as this waste of resources. I contribute nothing to the world, and in return, I smoke weed and jerk off. Because that is a millions times easier than trying. Than caring. I quit things. That's what I do. I quit sports, I quit trying in class, I quit caring about my health. I quit everything. Because quitting is easy. And I'm all about the easiest possible solution. Lowest common denominator. Because god forbid I ever once see anything through to the end. I fucking hate you. I hate everything, and everyone. Because they don't have this crippling fear of trying. And it will never be enough. I'll always have to do more. There's always another mountain to climb. And what's the goal? The point? The reason to wake up in the morning and fight the monotony. Self-preservation. We stay alive because it's hard wired into our brains. We do what we have to, in order to keep the ship afloat. But who the fuck cares if it does? My family. My friends. They'll be sad. They'll post on their walls, they'll tweet, they'll make it know that I'm 'gone but not forgotten'. And then they'll forget. The world will forget. And they'll get over it, and move on, and stay alive, and I won't have to deal with any of it anymore. No more vapid girls with delusions of grandeur. No more cocksure, douchebag guys who somehow take every woman of substance. I can be free of it all. Free of social circles, and dumb people. I can't stand it anymore. And I say this the day after my goddamn birthday. Because last night was a blast. Probably, I can't remember. But tonight, I could go out, and go back to being ignored. Go back to no one giving a damn. And my friends wonder why I don't love birthdays. Because it's the where one day of the year people pretend to give a shit about you. And then it ends. It all ends.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24lufw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "quitseverything", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24lufw/it_doesnt_matter/", "name": "t3_24lufw", "created": 1399128758.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24lufw/it_doesnt_matter/", "author_flair_text": null, "title": "It doesn't matter.", "created_utc": 1399099958.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8mfeh", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24lufw", "approved_by": null, "body": "Funny thing about life and about the self: both have the power to change. You recognize there's a problem and want to fix it. Do you know how great that it is? Most people live their entire lives resigning themselves to wasted time.\n\nBut you can turn this all around. I know you're afraid to try, and nothing is more difficult than that first step, but it's a step worth taking. You can do it. What do you have to lose, really? A life you can't stand?  And if you fail, who the hell can stop you from trying again?  \n\nPoint is that you can do this. Find what makes you happy. Look for meaning in something. Purpose is out there and you will find it eventually.\n\nNothing in this world lasts forever.  The bad times will pass. Don't opt for a permanent solution to a temporary problem. Just try, please. Do it for yourself if not for anyone else. Maybe it's not a lot that a total stranger on the internet believes in you, but at least someone does. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny thing about life and about the self: both have the power to change. You recognize there&amp;#39;s a problem and want to fix it. Do you know how great that it is? Most people live their entire lives resigning themselves to wasted time.&lt;/p&gt;\n\n&lt;p&gt;But you can turn this all around. I know you&amp;#39;re afraid to try, and nothing is more difficult than that first step, but it&amp;#39;s a step worth taking. You can do it. What do you have to lose, really? A life you can&amp;#39;t stand?  And if you fail, who the hell can stop you from trying again?  &lt;/p&gt;\n\n&lt;p&gt;Point is that you can do this. Find what makes you happy. Look for meaning in something. Purpose is out there and you will find it eventually.&lt;/p&gt;\n\n&lt;p&gt;Nothing in this world lasts forever.  The bad times will pass. Don&amp;#39;t opt for a permanent solution to a temporary problem. Just try, please. Do it for yourself if not for anyone else. Maybe it&amp;#39;s not a lot that a total stranger on the internet believes in you, but at least someone does. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lufw", "score_hidden": false, "name": "t1_ch8mfeh", "created": 1399166374.0, "author_flair_text": null, "created_utc": 1399137574.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8xyu4", "gilded": 0, "author": "Soletrador", "parent_id": "t3_24lufw", "approved_by": null, "body": "You still here?\n\nPlease answer me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You still here?&lt;/p&gt;\n\n&lt;p&gt;Please answer me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lufw", "score_hidden": false, "name": "t1_ch8xyu4", "created": 1399197239.0, "author_flair_text": null, "created_utc": 1399168439.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]