[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 17 years old and Nigerian. I&amp;#39;ve only recently discovered that I&amp;#39;m suffering from depression (this is a self diagnosis). But I had been seeing the signs constantly. and where I come from, if you say you&amp;#39;re depressed, most people just think you&amp;#39;re being lazy. I have been contemplating suicide now because of the amount of pressure coming from my parents (I&amp;#39;m the only son although fourth child of five kids). I feel very useless at times and I&amp;#39;m just a waste of &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am 17 years old and Nigerian. I've only recently discovered that I'm suffering from depression (this is a self diagnosis). But I had been seeing the signs constantly. and where I come from, if you say you're depressed, most people just think you're being lazy. I have been contemplating suicide now because of the amount of pressure coming from my parents (I'm the only son although fourth child of five kids). I feel very useless at times and I'm just a waste of ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248dgt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TheImbalanced1", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248dgt/it_had_to_come_to_this/", "name": "t3_248dgt", "created": 1398758145.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248dgt/it_had_to_come_to_this/", "author_flair_text": null, "title": "It had to come to this.", "created_utc": 1398729345.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4my8b", "gilded": 0, "author": "spliff_killington", "parent_id": "t3_248dgt", "approved_by": null, "body": "I went through a lot of depression a couple years ago and it reached its peak right when I was your age and I attempted suicide.  The first thing I need to say is don't ever give up on your life.  Have you told your parents about your depression?  If not, I highly suggest you do.  My parents put a lot of pressure on me to do well since I am the only kid in my family that had a chance of going to a good college (I'm in the US, so going to college is a huge deal for us especially in a family where only a couple of relatives have even gone to college).  Anyways, once I told them, they realized that their kid came before anything else.  \nUnfortunately, I continued to spiral further and further downwards as my friends stop hanging out with me, my girlfriend broke up with me, and even my little brother who has been my best friend my whole life barely talked to me.  And I knew it was all because of my depression which I thought could never be cured because of how deep a hole I dug myself into.  Finally I decided it was time to end my life. I wrote a note and sent a couple goodbye texts out to my best friends, but it was about 2 AM so I hoped they wouldn't answer.  Within 2 minutes, my best friend kicked in my bedroom door, took the belt off from around my neck, and just hugged me as I cried for hours.  That was the point where I realized that I didn't want to end my life.  I went to a psych ward for a few weeks afterwards which I hated because I was drugged up all the time which was not an effective method for me (not to say it isn't effective as I've met many people that anti-depressants can help).  I spent a lot of time once I got out reflecting on why I wanted to kill myself and I found that a lot of those issues could be easily resolved.  For me, my issues revolved around pressure from parents like you are facing, but I also struggled to find real friends and spent a lot of time alone just wallowing in my own self-pity instead of trying to make efforts to bring myself out of my depression.\nThe best advice I can give you is to find someone you know you can trust and talk to them.  Even if you have no one, don't let that discourage you.  Often times the best revelations I had about depression and suicide were when I was just sitting around thinking or writing.  All in all, try to see life for the beautiful thing it is.  There is a one in infinity chance that you would ever be born, so try to make the most of that life every day that you can.  Find activities that you love to do that will keep your mind away from depression.  Draw, read, play sports, go for walks, whatever it takes.  Just wake up every morning and try to be the best person you can, because why shouldn't you?  You've got a whole life ahead of you full of happiness, sadness, love, curiosity, new things to be learned, and just pure wonder.  Don't cut that life short.  \nEdit: Forgot to say, reply or PM me if you need a friend to talk to.", "edited": 1398733735.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a lot of depression a couple years ago and it reached its peak right when I was your age and I attempted suicide.  The first thing I need to say is don&amp;#39;t ever give up on your life.  Have you told your parents about your depression?  If not, I highly suggest you do.  My parents put a lot of pressure on me to do well since I am the only kid in my family that had a chance of going to a good college (I&amp;#39;m in the US, so going to college is a huge deal for us especially in a family where only a couple of relatives have even gone to college).  Anyways, once I told them, they realized that their kid came before anything else.&lt;br/&gt;\nUnfortunately, I continued to spiral further and further downwards as my friends stop hanging out with me, my girlfriend broke up with me, and even my little brother who has been my best friend my whole life barely talked to me.  And I knew it was all because of my depression which I thought could never be cured because of how deep a hole I dug myself into.  Finally I decided it was time to end my life. I wrote a note and sent a couple goodbye texts out to my best friends, but it was about 2 AM so I hoped they wouldn&amp;#39;t answer.  Within 2 minutes, my best friend kicked in my bedroom door, took the belt off from around my neck, and just hugged me as I cried for hours.  That was the point where I realized that I didn&amp;#39;t want to end my life.  I went to a psych ward for a few weeks afterwards which I hated because I was drugged up all the time which was not an effective method for me (not to say it isn&amp;#39;t effective as I&amp;#39;ve met many people that anti-depressants can help).  I spent a lot of time once I got out reflecting on why I wanted to kill myself and I found that a lot of those issues could be easily resolved.  For me, my issues revolved around pressure from parents like you are facing, but I also struggled to find real friends and spent a lot of time alone just wallowing in my own self-pity instead of trying to make efforts to bring myself out of my depression.\nThe best advice I can give you is to find someone you know you can trust and talk to them.  Even if you have no one, don&amp;#39;t let that discourage you.  Often times the best revelations I had about depression and suicide were when I was just sitting around thinking or writing.  All in all, try to see life for the beautiful thing it is.  There is a one in infinity chance that you would ever be born, so try to make the most of that life every day that you can.  Find activities that you love to do that will keep your mind away from depression.  Draw, read, play sports, go for walks, whatever it takes.  Just wake up every morning and try to be the best person you can, because why shouldn&amp;#39;t you?  You&amp;#39;ve got a whole life ahead of you full of happiness, sadness, love, curiosity, new things to be learned, and just pure wonder.  Don&amp;#39;t cut that life short.&lt;br/&gt;\nEdit: Forgot to say, reply or PM me if you need a friend to talk to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248dgt", "score_hidden": false, "name": "t1_ch4my8b", "created": 1398737080.0, "author_flair_text": null, "created_utc": 1398733480.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]