[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been beaten, abused, and otherwise metaphorically shat on my whole life. During the whole time I&amp;#39;ve heard &amp;quot;Don&amp;#39;t worry, it&amp;#39;ll get better.&amp;quot; That&amp;#39;s a crock of shit. I&amp;#39;ve been homeless, finally got back on my feet, got a place to live, and now I&amp;#39;m about to be out of that yet again. I can&amp;#39;t find a job where my boss will give me more than 12 hours a week because &amp;quot;your parents will help you out.&amp;quot; Fuck you, I&amp;#39;m 20, they aren&amp;#39;t responsible for me anymore, and they sure as hell show it. I&amp;#39;ve made it to college, in debt up to my eyeballs, just had my appeal for deferred payment declined because I&amp;#39;m living on loans and not getting enough income per week to pay for it in the long run. My health has been on a steady decline because I can&amp;#39;t afford shit for healthcare. Tell me, why the fuck shouldn&amp;#39;t I just die? I&amp;#39;m working my ass off to get another job to make an honest living, and I can&amp;#39;t even do that. I haven&amp;#39;t even bothered to re-enroll in college next year because I&amp;#39;ll be damned if I can afford that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been beaten, abused, and otherwise metaphorically shat on my whole life. During the whole time I've heard \"Don't worry, it'll get better.\" That's a crock of shit. I've been homeless, finally got back on my feet, got a place to live, and now I'm about to be out of that yet again. I can't find a job where my boss will give me more than 12 hours a week because \"your parents will help you out.\" Fuck you, I'm 20, they aren't responsible for me anymore, and they sure as hell show it. I've made it to college, in debt up to my eyeballs, just had my appeal for deferred payment declined because I'm living on loans and not getting enough income per week to pay for it in the long run. My health has been on a steady decline because I can't afford shit for healthcare. Tell me, why the fuck shouldn't I just die? I'm working my ass off to get another job to make an honest living, and I can't even do that. I haven't even bothered to re-enroll in college next year because I'll be damned if I can afford that.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23vqqx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ThisMightBeThrowaway", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23vqqx/it_will_get_better_bullshit/", "name": "t3_23vqqx", "created": 1398393299.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23vqqx/it_will_get_better_bullshit/", "author_flair_text": null, "title": "\"It will get better.\" Bullshit.", "created_utc": 1398364499.0, "ups": 5, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1if1e", "gilded": 0, "author": "ThisMightBeThrowaway", "parent_id": "t1_ch1asaj", "approved_by": null, "body": "Definitely not easy. I live in the Southeast US. As for unemployment support, as odd as it may seem, I really don't want that. I want to earn my money. I want to know that my money is given to me because I did something, not simply because I'm down on my luck. As I said, I've been homeless, and I can't tell you how much it breaks my heart to see someone that's obviously struggling give me money for a meal. It just feels wrong. Not that I don't appreciate it, but I feel that it isn't right taking money from another soul who needs it. Nowadays I spend my nights in drunken sadness, as my \"friends\" seem to think booze solves all of life's problems. And honestly, I'd rather die than fall back into that path. It's a dark and morbid reality to live in. \n\nI guess what I'm trying to say is that I want to live life earning my living from those who can afford to pay someone to do honest work, rather than taking it for no work from someone who needs it. And seeing as that doesn't seem to be reality, I don't see much reason left to live in such a world.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely not easy. I live in the Southeast US. As for unemployment support, as odd as it may seem, I really don&amp;#39;t want that. I want to earn my money. I want to know that my money is given to me because I did something, not simply because I&amp;#39;m down on my luck. As I said, I&amp;#39;ve been homeless, and I can&amp;#39;t tell you how much it breaks my heart to see someone that&amp;#39;s obviously struggling give me money for a meal. It just feels wrong. Not that I don&amp;#39;t appreciate it, but I feel that it isn&amp;#39;t right taking money from another soul who needs it. Nowadays I spend my nights in drunken sadness, as my &amp;quot;friends&amp;quot; seem to think booze solves all of life&amp;#39;s problems. And honestly, I&amp;#39;d rather die than fall back into that path. It&amp;#39;s a dark and morbid reality to live in. &lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m trying to say is that I want to live life earning my living from those who can afford to pay someone to do honest work, rather than taking it for no work from someone who needs it. And seeing as that doesn&amp;#39;t seem to be reality, I don&amp;#39;t see much reason left to live in such a world.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch1if1e", "created": 1398406496.0, "author_flair_text": null, "created_utc": 1398402896.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1asaj", "gilded": 0, "author": "sbw2012", "parent_id": "t3_23vqqx", "approved_by": null, "body": "Not easy I know, but could you move to a country with better socialised healthcare and unemployment support? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not easy I know, but could you move to a country with better socialised healthcare and unemployment support? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch1asaj", "created": 1398413896.0, "author_flair_text": null, "created_utc": 1398385096.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch26qf2", "gilded": 0, "author": "marlstown", "parent_id": "t3_23vqqx", "approved_by": null, "body": "I thought i'd post cause pretty much every reply was deleted. I became homeless for the 1st time at 19 when I got kicked out of home. I lived with a gf for a year and a half and when she left me I could no longer afford the rent and was made homeless for a 2nd time. One day I bumped into an old boss and was offered a job I soon found out he had a spare flat which I rented and finally was happy for the first time in a long time. 3 months later he sold his business and kicked me out and I was made homeless for a 3rd time. I'm 23 now living in a small room in someones cottage in a tiny village and unemployed. I'm thinking of making my self homelss again for the summer and sofa surf in the nearest city where I have few friends and try to find work? I dunno what the fuck do I do? I'm not saying I have it worse not at all. I'm not in the US I get free healthcare, I could also get a better room paid for whilst i look for work but I have a dog and unless I get rid of her I need a flat which i can't afford without a job.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought i&amp;#39;d post cause pretty much every reply was deleted. I became homeless for the 1st time at 19 when I got kicked out of home. I lived with a gf for a year and a half and when she left me I could no longer afford the rent and was made homeless for a 2nd time. One day I bumped into an old boss and was offered a job I soon found out he had a spare flat which I rented and finally was happy for the first time in a long time. 3 months later he sold his business and kicked me out and I was made homeless for a 3rd time. I&amp;#39;m 23 now living in a small room in someones cottage in a tiny village and unemployed. I&amp;#39;m thinking of making my self homelss again for the summer and sofa surf in the nearest city where I have few friends and try to find work? I dunno what the fuck do I do? I&amp;#39;m not saying I have it worse not at all. I&amp;#39;m not in the US I get free healthcare, I could also get a better room paid for whilst i look for work but I have a dog and unless I get rid of her I need a flat which i can&amp;#39;t afford without a job.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch26qf2", "created": 1398474656.0, "author_flair_text": null, "created_utc": 1398471056.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch14zoo", "gilded": 0, "author": "ThisMightBeThrowaway", "parent_id": "t1_ch13vjq", "approved_by": null, "body": "As a follow up to this, where do I direct my \"FUCK YOU\"? If I'm homeless, nobody will employ me. I'll be left with nothing but debt and a cardboard box. Douglass was able to start his movement because there were people out there that wanted to join his cause. People that wanted to help him and others like him. There were few, but they were there. Now with my situation, you know who wants to help me? You know who wants to help a soon-to-be homeless man with debt out the ass? Not a damn person, that's who.\n\nNot to say that your post wasn't uplifting, but he had people behind his cause. I have nothing. I've struggled with alcoholism with nobody even offering to help. I *pleaded* for people to help me stop, and nobody did. Not friends, not family, not counselors. And at that time, I still had some control over my life, so I was able to say \"fuck you\" to that. Now I've lost that control and I'm still without the things I need. All I need is a job that will let me work my ass off for food on the table, but because of who I appear to be to complete strangers, it's assumed that I don't need it. They all want to give the job to the older guy, who has a family backing him up, or the war vet who still has income trickling in if they really need it. Not the young guy looking to support himself. I've killed my habits that seeked to kill me, and I've done my best to better myself, and it's landed me up shit creek without even a boat, let alone a paddle.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a follow up to this, where do I direct my &amp;quot;FUCK YOU&amp;quot;? If I&amp;#39;m homeless, nobody will employ me. I&amp;#39;ll be left with nothing but debt and a cardboard box. Douglass was able to start his movement because there were people out there that wanted to join his cause. People that wanted to help him and others like him. There were few, but they were there. Now with my situation, you know who wants to help me? You know who wants to help a soon-to-be homeless man with debt out the ass? Not a damn person, that&amp;#39;s who.&lt;/p&gt;\n\n&lt;p&gt;Not to say that your post wasn&amp;#39;t uplifting, but he had people behind his cause. I have nothing. I&amp;#39;ve struggled with alcoholism with nobody even offering to help. I &lt;em&gt;pleaded&lt;/em&gt; for people to help me stop, and nobody did. Not friends, not family, not counselors. And at that time, I still had some control over my life, so I was able to say &amp;quot;fuck you&amp;quot; to that. Now I&amp;#39;ve lost that control and I&amp;#39;m still without the things I need. All I need is a job that will let me work my ass off for food on the table, but because of who I appear to be to complete strangers, it&amp;#39;s assumed that I don&amp;#39;t need it. They all want to give the job to the older guy, who has a family backing him up, or the war vet who still has income trickling in if they really need it. Not the young guy looking to support himself. I&amp;#39;ve killed my habits that seeked to kill me, and I&amp;#39;ve done my best to better myself, and it&amp;#39;s landed me up shit creek without even a boat, let alone a paddle.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch14zoo", "created": 1398376143.0, "author_flair_text": null, "created_utc": 1398372543.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch13vjq", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23vqqx", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch13vjq", "created": 1398374036.0, "author_flair_text": null, "created_utc": 1398370436.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch15ol0", "gilded": 0, "author": "a1mck", "parent_id": "t1_ch13a44", "approved_by": null, "body": "Mod here. We actually delete as many of those \"glib - it gets better\" posts.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mod here. We actually delete as many of those &amp;quot;glib - it gets better&amp;quot; posts.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch15ol0", "created": 1398402717.0, "author_flair_text": null, "created_utc": 1398373917.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch13a44", "gilded": 0, "author": "ThisMightBeThrowaway", "parent_id": "t1_ch12ldq", "approved_by": null, "body": "I'm not calling *everything* here bullshit. But I'm really fucking tired of hearing \"Oh, it'll get better\" or \"Think of the people that love you\" (Ain't none of those left). I'm looking for a legitimate reason to not just say \"fuck it\".", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not calling &lt;em&gt;everything&lt;/em&gt; here bullshit. But I&amp;#39;m really fucking tired of hearing &amp;quot;Oh, it&amp;#39;ll get better&amp;quot; or &amp;quot;Think of the people that love you&amp;quot; (Ain&amp;#39;t none of those left). I&amp;#39;m looking for a legitimate reason to not just say &amp;quot;fuck it&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch13a44", "created": 1398398098.0, "author_flair_text": null, "created_utc": 1398369298.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch12ldq", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23vqqx", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vqqx", "score_hidden": false, "name": "t1_ch12ldq", "created": 1398371579.0, "author_flair_text": null, "created_utc": 1398367979.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]