[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t post on here anymore really. For anyone interested, my life is very turbulent right now and becoming the opposite of what they were these past months.\nI am happier than I was and a small less stressed, though I still have worries. The goods are that I have my own place, (though an efficiency it may be) a job that is starting to feel steady, a dual income household, a relationship that is as content as it is serious, and so many more blossoming feelings and moments. I cant fathom anyone else in my life being my sweetheart and I work with my sister!!!! School is on my mind and so are plans to save for my second anniversary &amp;lt;3 I&amp;#39;m doing good at work and am starting to get the hang of things and gain confidence. my relationship with my mom is finally getting better.The bad are that I feel very lost. \nI can&amp;#39;t count the amount of times where I have been in doubt or unwell.\nIt is starting to make me into a person that I would not be proud of knowing and that scares me, though I do have hope in the end and a loving embrace to help me back on track.\nI feel so isolated, I&amp;#39;m starting to resent things and people and am starting to push those around that I love away. I feel helpless to it all, I feel so tired all the time and like I am struggling to keep myself stable.\nI can feel my thoughts and natural persona start to deteriorate. I&amp;#39;m paranoid about a lot of people myself included and seem to over rationalize some things and under rationalize others.\nMy thoughts are fleeting and scattered to the point where I can say that I can&amp;#39;t understand them. And I feel so detached from myself sometimes that I go days thinking that I&amp;#39;m still asleep. I&amp;#39;m starting to believe it. I&amp;#39;m so detached that I almost just posted this on my public Facebook as personal and scatter brained as this is. I think now more than ever that I truly must be ill.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't post on here anymore really. For anyone interested, my life is very turbulent right now and becoming the opposite of what they were these past months.\nI am happier than I was and a small less stressed, though I still have worries. The goods are that I have my own place, (though an efficiency it may be) a job that is starting to feel steady, a dual income household, a relationship that is as content as it is serious, and so many more blossoming feelings and moments. I cant fathom anyone else in my life being my sweetheart and I work with my sister!!!! School is on my mind and so are plans to save for my second anniversary &lt;3 I'm doing good at work and am starting to get the hang of things and gain confidence. my relationship with my mom is finally getting better.The bad are that I feel very lost. \nI can't count the amount of times where I have been in doubt or unwell.\nIt is starting to make me into a person that I would not be proud of knowing and that scares me, though I do have hope in the end and a loving embrace to help me back on track.\nI feel so isolated, I'm starting to resent things and people and am starting to push those around that I love away. I feel helpless to it all, I feel so tired all the time and like I am struggling to keep myself stable.\nI can feel my thoughts and natural persona start to deteriorate. I'm paranoid about a lot of people myself included and seem to over rationalize some things and under rationalize others.\nMy thoughts are fleeting and scattered to the point where I can say that I can't understand them. And I feel so detached from myself sometimes that I go days thinking that I'm still asleep. I'm starting to believe it. I'm so detached that I almost just posted this on my public Facebook as personal and scatter brained as this is. I think now more than ever that I truly must be ill.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242dv3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ChildOfTheZora", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242dv3/its_something_i_guess/", "name": "t3_242dv3", "created": 1398584065.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242dv3/its_something_i_guess/", "author_flair_text": null, "title": "It's something I guess.", "created_utc": 1398555265.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2zhak", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_242dv3", "approved_by": null, "body": "I can relate to the feeling lost and being in doubt constantly.\n\nIt might just be something you have to get through or you might want to seek professional help. In my opinion though, and this is just an opinion, you CAN get through it if you tell yourself you can. Life is all about self perception. If you think life is good, you will see the good. If you think life is bad, you will see the bad. If you doubt yourself, you will start doubting life. Wake up every morning and just tell yourself it is going to be a great day and it does wonders on how you feel the rest of the day.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate to the feeling lost and being in doubt constantly.&lt;/p&gt;\n\n&lt;p&gt;It might just be something you have to get through or you might want to seek professional help. In my opinion though, and this is just an opinion, you CAN get through it if you tell yourself you can. Life is all about self perception. If you think life is good, you will see the good. If you think life is bad, you will see the bad. If you doubt yourself, you will start doubting life. Wake up every morning and just tell yourself it is going to be a great day and it does wonders on how you feel the rest of the day.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242dv3", "score_hidden": false, "name": "t1_ch2zhak", "created": 1398566802.0, "author_flair_text": null, "created_utc": 1398563202.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]