[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At this point in my life, I can&amp;#39;t imagine waking up again. &lt;/p&gt;\n\n&lt;p&gt;Life is too stressful. I&amp;#39;m sitting here listening to massive attack and on the verge of calm tears. You know the kind, where there&amp;#39;s no heaving or sobbing, just silent waterworks. I loved this girl so much, and I told her. She said she wanted to stay friends. I tried to be ok with it, for her. I tried to show her I&amp;#39;d moved on so that maybe she would regret her decision, but she didn&amp;#39;t. She told me about another mutual friend she cared for. I told her he had a girlfriend and wanted my other friend to cheat on her boyfriend with him, and she told me no one would ever love her or ever has.\nI got very angry and told her &lt;em&gt;I&lt;/em&gt; did. &lt;em&gt;I&lt;/em&gt; wanted her more than anything. I&amp;#39;m going to skip the details, but basically she ended up saying that she didn&amp;#39;t want to ruin our friendship with it, and that she would give me a chance if we weren&amp;#39;t so close. I told her that I hope she can find someone who she doesn&amp;#39;t get to close too, who she can feel that way for, and she said &amp;quot;stop being so nice to me&amp;quot;, seriously.\nLadies, gents, whoever is reading this, if you want to devalue or patronize someone when in this type of situation, that is your sentence. \nI cried angry, hateful tears that day. I hate her now, but I guess I forgive her.\nShe had told me just before the fight that she had chosen my birthday present, and as I&amp;#39;m typing this I feel very bad about all of this. \nShe had teased me and called me cute and fascinating, and then acts detatched. Her family has went through a divorce in the past so I don&amp;#39;t blame her for not wanting a relationship, which is what she told me. I have a problem with her leading me on with this hope, and then crushing it by telling me she liked someone else.&lt;/p&gt;\n\n&lt;p&gt;I understand I shouldn&amp;#39;t like her after this, and I told her I can&amp;#39;t be friends with her. She told me she&amp;#39;s going to give me space, and hasn&amp;#39;t talked to me for a few days.\nThe worst part, I think, is how helpless I feel. Her and some other friends are off doing something and I&amp;#39;m stuck at home, and she&amp;#39;s posting status updates constantly. I guess it frustrates me to see how much this isn&amp;#39;t effecting her, and how much it is effecting me. In the beginning of this I wanted to make her hurt just like she made me, but the sad reality was, nothing I could ever do to her would equate to this type of pain.\nI asked her, cause I was upset and hurt, if the other guy had asked her out, would she say yes? She told me to let it go and she wasn&amp;#39;t looking for a boyfriend anyway. \nI want to get over her so badly, but she is one of the other 3 girls that I&amp;#39;m actually interested in, and the other one said I wasn&amp;#39;t her type.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m doing something with the other next weekend alone, but I don&amp;#39;t know wether I should ask if it&amp;#39;s a date or not. \nAm I not boyfriend material? Why bother living then?&lt;/p&gt;\n\n&lt;p&gt;What is the fucking point if I&amp;#39;m just &amp;quot;friends&amp;quot; with these girls when better, stronger, better looking guys can come swoop them off their feet? Why fucking bother with any of it? So I can hold their purse and hold them while they cry? Fuck that shit. I won&amp;#39;t be their fucking stepping stone so they can go get laid or enjoy love that I can&amp;#39;t have. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t escape it, though, cause they are my only friends. The only escape is a goddamn pistol.&lt;/p&gt;\n\n&lt;p&gt;So I ask, what do I do? Where do I go? And frankly, the answer is already in my bottom fucking drawer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "At this point in my life, I can't imagine waking up again. \n\nLife is too stressful. I'm sitting here listening to massive attack and on the verge of calm tears. You know the kind, where there's no heaving or sobbing, just silent waterworks. I loved this girl so much, and I told her. She said she wanted to stay friends. I tried to be ok with it, for her. I tried to show her I'd moved on so that maybe she would regret her decision, but she didn't. She told me about another mutual friend she cared for. I told her he had a girlfriend and wanted my other friend to cheat on her boyfriend with him, and she told me no one would ever love her or ever has.\nI got very angry and told her *I* did. *I* wanted her more than anything. I'm going to skip the details, but basically she ended up saying that she didn't want to ruin our friendship with it, and that she would give me a chance if we weren't so close. I told her that I hope she can find someone who she doesn't get to close too, who she can feel that way for, and she said \"stop being so nice to me\", seriously.\nLadies, gents, whoever is reading this, if you want to devalue or patronize someone when in this type of situation, that is your sentence. \nI cried angry, hateful tears that day. I hate her now, but I guess I forgive her.\nShe had told me just before the fight that she had chosen my birthday present, and as I'm typing this I feel very bad about all of this. \nShe had teased me and called me cute and fascinating, and then acts detatched. Her family has went through a divorce in the past so I don't blame her for not wanting a relationship, which is what she told me. I have a problem with her leading me on with this hope, and then crushing it by telling me she liked someone else.\n\nI understand I shouldn't like her after this, and I told her I can't be friends with her. She told me she's going to give me space, and hasn't talked to me for a few days.\nThe worst part, I think, is how helpless I feel. Her and some other friends are off doing something and I'm stuck at home, and she's posting status updates constantly. I guess it frustrates me to see how much this isn't effecting her, and how much it is effecting me. In the beginning of this I wanted to make her hurt just like she made me, but the sad reality was, nothing I could ever do to her would equate to this type of pain.\nI asked her, cause I was upset and hurt, if the other guy had asked her out, would she say yes? She told me to let it go and she wasn't looking for a boyfriend anyway. \nI want to get over her so badly, but she is one of the other 3 girls that I'm actually interested in, and the other one said I wasn't her type.\n\nI'm doing something with the other next weekend alone, but I don't know wether I should ask if it's a date or not. \nAm I not boyfriend material? Why bother living then?\n\nWhat is the fucking point if I'm just \"friends\" with these girls when better, stronger, better looking guys can come swoop them off their feet? Why fucking bother with any of it? So I can hold their purse and hold them while they cry? Fuck that shit. I won't be their fucking stepping stone so they can go get laid or enjoy love that I can't have. \n\nI can't escape it, though, cause they are my only friends. The only escape is a goddamn pistol.\n\nSo I ask, what do I do? Where do I go? And frankly, the answer is already in my bottom fucking drawer.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245mzz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "farhsa", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245mzz/its_gotta_be_better_than_this/", "name": "t3_245mzz", "created": 1398682603.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245mzz/its_gotta_be_better_than_this/", "author_flair_text": null, "title": "It's gotta be better than this", "created_utc": 1398653803.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3u4cy", "gilded": 0, "author": "farhsa", "parent_id": "t1_ch3u0hb", "approved_by": null, "body": "She won, and thats the sad part. she got me to freak out and get angry, and then she told me to stop being so nice to her. she won me, man.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She won, and thats the sad part. she got me to freak out and get angry, and then she told me to stop being so nice to her. she won me, man.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245mzz", "score_hidden": false, "name": "t1_ch3u4cy", "created": 1398683150.0, "author_flair_text": null, "created_utc": 1398654350.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3u0hb", "gilded": 0, "author": "[deleted]", "parent_id": "t3_245mzz", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245mzz", "score_hidden": false, "name": "t1_ch3u0hb", "created": 1398682912.0, "author_flair_text": null, "created_utc": 1398654112.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4beec", "gilded": 0, "author": "5titch", "parent_id": "t3_245mzz", "approved_by": null, "body": "You put the pussy on a pedestal,  she freaked out and then you lashed out. \n\nYou live and you learn. Use it as a building experience. If you never face rejection you will never get stronger. The world will not coddle,  accept and love you the way you want. \n\nYou idolize the idea of being in a relationship without having anything to offer or be happy yourself. Guess what?  No one wants it be in a relationship with a guy that is hell bent on obsession. Play role reversal. Would you want to be her and think you're being watched or tracked 24/7? \n\nGet off Facebook. Get off instagram. It literally shows only the good in people's lives. While you sit there doing nothing but envying others they are experiencing / gloating about the good times in life. You have no idea what they're truly like behind closed doors. Stop envying. Stop being jealous. Be your own person. Create your own interests and hobbies. The women will come to you. You can only make others happy if you're happy yourself. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You put the pussy on a pedestal,  she freaked out and then you lashed out. &lt;/p&gt;\n\n&lt;p&gt;You live and you learn. Use it as a building experience. If you never face rejection you will never get stronger. The world will not coddle,  accept and love you the way you want. &lt;/p&gt;\n\n&lt;p&gt;You idolize the idea of being in a relationship without having anything to offer or be happy yourself. Guess what?  No one wants it be in a relationship with a guy that is hell bent on obsession. Play role reversal. Would you want to be her and think you&amp;#39;re being watched or tracked 24/7? &lt;/p&gt;\n\n&lt;p&gt;Get off Facebook. Get off instagram. It literally shows only the good in people&amp;#39;s lives. While you sit there doing nothing but envying others they are experiencing / gloating about the good times in life. You have no idea what they&amp;#39;re truly like behind closed doors. Stop envying. Stop being jealous. Be your own person. Create your own interests and hobbies. The women will come to you. You can only make others happy if you&amp;#39;re happy yourself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245mzz", "score_hidden": false, "name": "t1_ch4beec", "created": 1398713237.0, "author_flair_text": null, "created_utc": 1398709637.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]