[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just have no one to really talk to about this, because if I told the few people who do care about me, they&amp;#39;d just worry, and I don&amp;#39;t want them to worry, because I&amp;#39;m not going to do anything stupid.&lt;/p&gt;\n\n&lt;p&gt;I just feel like I have nothing to look forward to in life, and all that cliche bullshit. I hate my job, it&amp;#39;s really stressing me out; I don&amp;#39;t have that many close friends any more, and those that I have live hundreds of miles away so I can&amp;#39;t see them more than once or twice a year. I have a terrible relationship with my family that I have grown too unmotivated and nonconfrontational to repair. i haven&amp;#39;t had the time, nor inspiration, nor the resources (a.k.a other people to help me) to make music or film, the two forms of art I used to be super passionate about. The one thing I have left is my partner, whom I love, but they are starting to feel doubts about our relationship, and knowing this, I feel as though the last thing I have to hang on to is slipping away. The worst thing is that I can&amp;#39;t really imagine dating anyone else after this person, either.&lt;/p&gt;\n\n&lt;p&gt;I am not distraught or anything, but I am finding it really hard to find anything worth continuing for. Once this relationship is over, there really won&amp;#39;t be much left for me here. &lt;/p&gt;\n\n&lt;p&gt;Just wanted to get that off my chest; y&amp;#39;all have a good night and stay alive and stuff.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just have no one to really talk to about this, because if I told the few people who do care about me, they'd just worry, and I don't want them to worry, because I'm not going to do anything stupid.\n\nI just feel like I have nothing to look forward to in life, and all that cliche bullshit. I hate my job, it's really stressing me out; I don't have that many close friends any more, and those that I have live hundreds of miles away so I can't see them more than once or twice a year. I have a terrible relationship with my family that I have grown too unmotivated and nonconfrontational to repair. i haven't had the time, nor inspiration, nor the resources (a.k.a other people to help me) to make music or film, the two forms of art I used to be super passionate about. The one thing I have left is my partner, whom I love, but they are starting to feel doubts about our relationship, and knowing this, I feel as though the last thing I have to hang on to is slipping away. The worst thing is that I can't really imagine dating anyone else after this person, either.\n\nI am not distraught or anything, but I am finding it really hard to find anything worth continuing for. Once this relationship is over, there really won't be much left for me here. \n\nJust wanted to get that off my chest; y'all have a good night and stay alive and stuff.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25fefa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawhoops", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25fefa/its_not_super_urgent_and_im_not_going_to_do_it/", "name": "t3_25fefa", "created": 1399988455.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25fefa/its_not_super_urgent_and_im_not_going_to_do_it/", "author_flair_text": null, "title": "It's not super urgent, and I'm not going to do it over something so trivial", "created_utc": 1399959655.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgnmel", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25fefa", "approved_by": null, "body": "Lol nice name, gave me a 90's giggle for some reason. Hey I appreciate that last sentence you provided with keeping us alive and stuff. I also used to admire maybe being a film producer, but after years of high school and browsing the glorious but (addictive) internet, I found that there are so many other things out there that are actually what I should be doing. It made me happy to change and think differently as I age. But nevermind that, I hope your life reaaaly gets better! this world could never stop needing more good people. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol nice name, gave me a 90&amp;#39;s giggle for some reason. Hey I appreciate that last sentence you provided with keeping us alive and stuff. I also used to admire maybe being a film producer, but after years of high school and browsing the glorious but (addictive) internet, I found that there are so many other things out there that are actually what I should be doing. It made me happy to change and think differently as I age. But nevermind that, I hope your life reaaaly gets better! this world could never stop needing more good people. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25fefa", "score_hidden": false, "name": "t1_chgnmel", "created": 1399991138.0, "author_flair_text": null, "created_utc": 1399962338.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]