[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought I was pretty much at rock bottom but it&amp;#39;s only just begun. Ever since she left me I feel like a fucking zombie. I don&amp;#39;t even think anymore, my body just does at it will. I don&amp;#39;t have control. I have gambled away every penny I have. I am crippled by credit card debt and I owe the IRS. It just gets worse and worse. I literally have no happiness in my life other than when I gamble. I disgust myself. I am stuck in this cycle. I will never be able to break it because I like in Las Vegas and can&amp;#39;t escape. No matter what I do I will always gamble because it&amp;#39;s right there. I want to leave this city. But I can&amp;#39;t. I pissed away all the money that could have gone towards moving. All I think about is how happy she is and how pathetic I&amp;#39;ve become in the span of a week or so. I wish I never moved to this piece of shit town. I wish I never met her. I am just crumbling and it gets worse and worse. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got less than 5 months left. That day cannot come soon enough.  I just want to be done with everything. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I thought I was pretty much at rock bottom but it's only just begun. Ever since she left me I feel like a fucking zombie. I don't even think anymore, my body just does at it will. I don't have control. I have gambled away every penny I have. I am crippled by credit card debt and I owe the IRS. It just gets worse and worse. I literally have no happiness in my life other than when I gamble. I disgust myself. I am stuck in this cycle. I will never be able to break it because I like in Las Vegas and can't escape. No matter what I do I will always gamble because it's right there. I want to leave this city. But I can't. I pissed away all the money that could have gone towards moving. All I think about is how happy she is and how pathetic I've become in the span of a week or so. I wish I never moved to this piece of shit town. I wish I never met her. I am just crumbling and it gets worse and worse. \n\nI've got less than 5 months left. That day cannot come soon enough.  I just want to be done with everything. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2596q4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "igotmyxomatosis", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2596q4/ive_completely_lost_all_control/", "name": "t3_2596q4", "created": 1399806000.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2596q4/ive_completely_lost_all_control/", "author_flair_text": null, "title": "I've completely lost all control.", "created_utc": 1399777200.0, "ups": 2, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chh0tqa", "gilded": 0, "author": "igotmyxomatosis", "parent_id": "t1_chgnmpd", "approved_by": null, "body": "I know this. I'm well aware. But the fact that she doesn't care about me anymore is what drives it. I don't really care about being around anymore. I want to hit rock bottom so I can stop being here. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this. I&amp;#39;m well aware. But the fact that she doesn&amp;#39;t care about me anymore is what drives it. I don&amp;#39;t really care about being around anymore. I want to hit rock bottom so I can stop being here. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chh0tqa", "created": 1400034104.0, "author_flair_text": null, "created_utc": 1400005304.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgnmpd", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_chffa41", "approved_by": null, "body": "It sounds like you're trying to punish her and punishing yourself instead.  Consider this:  if she really doesn't care about you, you're not actually hurting her at all by gambling away your money, only yourself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re trying to punish her and punishing yourself instead.  Consider this:  if she really doesn&amp;#39;t care about you, you&amp;#39;re not actually hurting her at all by gambling away your money, only yourself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chgnmpd", "created": 1399991174.0, "author_flair_text": null, "created_utc": 1399962374.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chffa41", "gilded": 0, "author": "igotmyxomatosis", "parent_id": "t1_chfeqqw", "approved_by": null, "body": "Nah, it isn't about control. Gambling is the one thing I was ever good at in my life. It's not about \"I can win it back if I ...\" because I know I can win it back. It's not about that. I gamble at the sportsbook. I'm able to win big if I set my mind to it. But right now there is just anger inside me. Anger towards her. I want to take it out on her. But I can't. So I purposely throw away my money on things that are basically impossible to win. My mind is so fucked right now that I get satisfaction over throwing my life away. She will never even know how bad she has completely destroyed me. Yet it brings a smile to my face when I sink deeper and deeper and I know it's all because of her. I can't even explain it anymore. It really isn't even gambling. It's just me getting my anger out. Every penny I had was for a life with her. It wasn't much right now, but it was towards a new life and for me to get out of this dumb city. But a part of me wants to fail. A part of me wants it all to end. I want to dig a hole so deep that there is no recovering from it. I  feel hopeless right now, but I want it to be more than just a feeling. I want there to literally be no possibility for hope at all. I want to be completely crushed. Then I can go away.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, it isn&amp;#39;t about control. Gambling is the one thing I was ever good at in my life. It&amp;#39;s not about &amp;quot;I can win it back if I ...&amp;quot; because I know I can win it back. It&amp;#39;s not about that. I gamble at the sportsbook. I&amp;#39;m able to win big if I set my mind to it. But right now there is just anger inside me. Anger towards her. I want to take it out on her. But I can&amp;#39;t. So I purposely throw away my money on things that are basically impossible to win. My mind is so fucked right now that I get satisfaction over throwing my life away. She will never even know how bad she has completely destroyed me. Yet it brings a smile to my face when I sink deeper and deeper and I know it&amp;#39;s all because of her. I can&amp;#39;t even explain it anymore. It really isn&amp;#39;t even gambling. It&amp;#39;s just me getting my anger out. Every penny I had was for a life with her. It wasn&amp;#39;t much right now, but it was towards a new life and for me to get out of this dumb city. But a part of me wants to fail. A part of me wants it all to end. I want to dig a hole so deep that there is no recovering from it. I  feel hopeless right now, but I want it to be more than just a feeling. I want there to literally be no possibility for hope at all. I want to be completely crushed. Then I can go away.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chffa41", "created": 1399871582.0, "author_flair_text": null, "created_utc": 1399842782.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfeqqw", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_chf5ubc", "approved_by": null, "body": "Would you say that you feel you have a lack of control over your life and that you do this because it's one thing you feel you can control?  Also, what I'm reading seems to be different from what I've read about a lot of problem gamblers.  You don't seem to have an expectation that \"If I just do this long enough, I'll win it all back.\"\n\n\nAlso, what's the most you've ever gambled away in one sitting?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you say that you feel you have a lack of control over your life and that you do this because it&amp;#39;s one thing you feel you can control?  Also, what I&amp;#39;m reading seems to be different from what I&amp;#39;ve read about a lot of problem gamblers.  You don&amp;#39;t seem to have an expectation that &amp;quot;If I just do this long enough, I&amp;#39;ll win it all back.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Also, what&amp;#39;s the most you&amp;#39;ve ever gambled away in one sitting?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chfeqqw", "created": 1399870233.0, "author_flair_text": null, "created_utc": 1399841433.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf5ubc", "gilded": 0, "author": "igotmyxomatosis", "parent_id": "t1_chf3sdf", "approved_by": null, "body": "Yes. I don't gain pleasure from anything else. I get a weird sense  of satisfaction throwing away all the money I had saved working towards a new life with my ex. It felt so good to flush her ring money down the fucking toilet. Especially since she hated when I gambled. But I can't put an end to it. There's nothing else I can do that makes the time pass. I want to stop. I want to leave this city and start my life over. But it's too late. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. I don&amp;#39;t gain pleasure from anything else. I get a weird sense  of satisfaction throwing away all the money I had saved working towards a new life with my ex. It felt so good to flush her ring money down the fucking toilet. Especially since she hated when I gambled. But I can&amp;#39;t put an end to it. There&amp;#39;s nothing else I can do that makes the time pass. I want to stop. I want to leave this city and start my life over. But it&amp;#39;s too late. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chf5ubc", "created": 1399846444.0, "author_flair_text": null, "created_utc": 1399817644.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf3sdf", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_2596q4", "approved_by": null, "body": "Would you say you're addicted to gambling?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you say you&amp;#39;re addicted to gambling?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2596q4", "score_hidden": false, "name": "t1_chf3sdf", "created": 1399837246.0, "author_flair_text": null, "created_utc": 1399808446.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]