[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve decided that after I publish my book, I&amp;#39;m going to jump off the golden gate bridge on June 5th, 2014.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m the MRA author. I&amp;#39;m writing my book, but it&amp;#39;s depressing to know that in all likelyhood, it&amp;#39;ll never be read. I just can&amp;#39;t bear knowing what I know, it seems like I&amp;#39;m the only one in the world who knows quite as much as I do. My autism allowed me to become extremely obsessed and focused, and so for the past 4 years, I&amp;#39;ve build a great wealth of knowledge regarding MRA and feminist arguments and positions, and I think I see things in way no one else does. &lt;/p&gt;\n\n&lt;p&gt;I MUST get my book famous. I&amp;#39;m thinking either going to a ledge in manhatten and calling Howard Stern, or doing something else then jumping off the golden gate bridge. But either way, I just can&amp;#39;t bear this anymore. My life isn&amp;#39;t worth living.&lt;/p&gt;\n\n&lt;p&gt;Thing is,I&amp;#39;m an ugly loser freak. I have aspegers, I&amp;#39;m physically very weird looking, and 6&amp;#39;3 so I just stand out like an awkward freak even more. I&amp;#39;ve never had a girlfriend or kiss, or a girl that liked me, and I&amp;#39;m 21. I&amp;#39;ve only had sex once so thank god I&amp;#39;m not a virgin, but it was at the moonlite bunnyranch when I was 19, so she didn&amp;#39;t really &amp;quot;like&amp;quot; me either.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been the guy who was bullied and a loner, so I don&amp;#39;t have any normalized socializing skills. This always confused me...I would always try to be friendly and nice and never start confrontation, yet every time I met a new group of people, I&amp;#39;d always become the one everybody hated and picked on. I don&amp;#39;t know what I did wrong!  I&amp;#39;m extremely socially awkward and paranoid. I always think people are laughing at me when I go out, like I&amp;#39;m standing out. I HATE being in line...I can just tell everyone behind me hates me. I have bipolar, with 2 main &amp;quot;modes&amp;quot;- There&amp;#39;s crazy high mode, and extreme suicide mode. Unfortunately, one side is much more common than the other.  I think I might be schizophrenic to- I always imagine celebrities are tracking my life and watching me, and I have fantasies and getting famous and they already &amp;quot;know&amp;quot; my life- but that might be the bipolar. I know those fantasies aren&amp;#39;t true, but they invade my thoughts anyway.&lt;/p&gt;\n\n&lt;p&gt;But the thing is, that&amp;#39;s not even why I&amp;#39;d want to kill myself. It&amp;#39;s my PHYSICALLY health. Fatigue, muscle aches, no emergy, brain fog. I think I have soomething like leaky guy or canddia or crohns brought about by years of terrible diet. If I could just feel normal and healthy again, I&amp;#39;d be ok.&lt;/p&gt;\n\n&lt;p&gt;Yesterday I realized that I actually Do have very misogynistic and messed up thoughts towards women.  Maybe it was from the lack of social interaction and any kind of dating, but the whole &amp;quot;talking to girls&amp;quot; thing just seems like a different world to me. I just have no idea how to do it. It&amp;#39;s not that I feel entitled to sex, in fact, it&amp;#39;s the opposite. I feel like a disgusting freak who doesn&amp;#39;t deserve to even think about girls, like it shouldn&amp;#39;t be a part of me. I used to hit myself whenever I looked at a pretty girl to train myself not to look. It&amp;#39;s like I feel pretty girls are just &amp;quot;above&amp;quot; me, and I always feel inferior.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s weird...I look at the pretty 18,19,20 year old girls and realize soon, I&amp;#39;m going to be really &amp;quot;older&amp;quot; than them, like a difference stage of life. I missed out on that whole era, and it&amp;#39;s somethimes hard to believe. I still find 18 year old girls more attractive than 21 year olds, I think because I never got the experience it.&lt;/p&gt;\n\n&lt;p&gt;Actually, it sort of worked. I now have the ability to just totally ignore that hot girl. Most guys start acting stupidly or desperately, trying to make dumb conversation and look cool, but I never worry about that. I don&amp;#39;t care about looking cool or saying the right thing, I&amp;#39;ll talk about whatever and make no special effort to &amp;quot;pick her up.&amp;quot; It&amp;#39;s like I can just totally not think about it. I&amp;#39;ll talk to the sexy 19 year old sorority girl, hot 25 year old bartender, 80 year old grandmother, and overweight 50 year trucker exactly the same way. (well ok, not exactly, but you know what I mean.)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really trying to just free my mind from all thoughts of sex and love and attraction, it&amp;#39;d be so much easier.&lt;/p&gt;\n\n&lt;p&gt;But the truth is, I really DON&amp;#39;T want to die. I just want to be healthy and happy. I can be cool with always being alone, it feels normal anyway, but I can&amp;#39;t take feeling sick. I&amp;#39;m afraid of death. I&amp;#39;m a transhumanist and want to live forever, and there&amp;#39;s a company researching foreskin restoration using stem cells. I&amp;#39;d really like to get to feel that at least once in my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've decided that after I publish my book, I'm going to jump off the golden gate bridge on June 5th, 2014.\n\nSo I'm the MRA author. I'm writing my book, but it's depressing to know that in all likelyhood, it'll never be read. I just can't bear knowing what I know, it seems like I'm the only one in the world who knows quite as much as I do. My autism allowed me to become extremely obsessed and focused, and so for the past 4 years, I've build a great wealth of knowledge regarding MRA and feminist arguments and positions, and I think I see things in way no one else does. \n \nI MUST get my book famous. I'm thinking either going to a ledge in manhatten and calling Howard Stern, or doing something else then jumping off the golden gate bridge. But either way, I just can't bear this anymore. My life isn't worth living.\n \nThing is,I'm an ugly loser freak. I have aspegers, I'm physically very weird looking, and 6'3 so I just stand out like an awkward freak even more. I've never had a girlfriend or kiss, or a girl that liked me, and I'm 21. I've only had sex once so thank god I'm not a virgin, but it was at the moonlite bunnyranch when I was 19, so she didn't really \"like\" me either.\n \n I've always been the guy who was bullied and a loner, so I don't have any normalized socializing skills. This always confused me...I would always try to be friendly and nice and never start confrontation, yet every time I met a new group of people, I'd always become the one everybody hated and picked on. I don't know what I did wrong!  I'm extremely socially awkward and paranoid. I always think people are laughing at me when I go out, like I'm standing out. I HATE being in line...I can just tell everyone behind me hates me. I have bipolar, with 2 main \"modes\"- There's crazy high mode, and extreme suicide mode. Unfortunately, one side is much more common than the other.  I think I might be schizophrenic to- I always imagine celebrities are tracking my life and watching me, and I have fantasies and getting famous and they already \"know\" my life- but that might be the bipolar. I know those fantasies aren't true, but they invade my thoughts anyway.\n \nBut the thing is, that's not even why I'd want to kill myself. It's my PHYSICALLY health. Fatigue, muscle aches, no emergy, brain fog. I think I have soomething like leaky guy or canddia or crohns brought about by years of terrible diet. If I could just feel normal and healthy again, I'd be ok.\n \nYesterday I realized that I actually Do have very misogynistic and messed up thoughts towards women.  Maybe it was from the lack of social interaction and any kind of dating, but the whole \"talking to girls\" thing just seems like a different world to me. I just have no idea how to do it. It's not that I feel entitled to sex, in fact, it's the opposite. I feel like a disgusting freak who doesn't deserve to even think about girls, like it shouldn't be a part of me. I used to hit myself whenever I looked at a pretty girl to train myself not to look. It's like I feel pretty girls are just \"above\" me, and I always feel inferior.\n \nIt's weird...I look at the pretty 18,19,20 year old girls and realize soon, I'm going to be really \"older\" than them, like a difference stage of life. I missed out on that whole era, and it's somethimes hard to believe. I still find 18 year old girls more attractive than 21 year olds, I think because I never got the experience it.\n \nActually, it sort of worked. I now have the ability to just totally ignore that hot girl. Most guys start acting stupidly or desperately, trying to make dumb conversation and look cool, but I never worry about that. I don't care about looking cool or saying the right thing, I'll talk about whatever and make no special effort to \"pick her up.\" It's like I can just totally not think about it. I'll talk to the sexy 19 year old sorority girl, hot 25 year old bartender, 80 year old grandmother, and overweight 50 year trucker exactly the same way. (well ok, not exactly, but you know what I mean.)\n \nI'm really trying to just free my mind from all thoughts of sex and love and attraction, it'd be so much easier.\n \nBut the truth is, I really DON'T want to die. I just want to be healthy and happy. I can be cool with always being alone, it feels normal anyway, but I can't take feeling sick. I'm afraid of death. I'm a transhumanist and want to live forever, and there's a company researching foreskin restoration using stem cells. I'd really like to get to feel that at least once in my life.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23z44k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "William_8_Red", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398455441.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 7, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23z44k/ive_decided_that_after_i_publish_my_book_im_going/", "name": "t3_23z44k", "created": 1398482439.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23z44k/ive_decided_that_after_i_publish_my_book_im_going/", "author_flair_text": null, "title": "I've decided that after I publish my book, I'm going to jump off the golden gate bridge on June 5th, 2014.", "created_utc": 1398453639.0, "ups": 8, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch203en", "gilded": 0, "author": "3dogs3catsandahedgeh", "parent_id": "t3_23z44k", "approved_by": null, "body": "The depression and digestive issues you write about suggest that you may be a celiac. Please don't kill yourself until you get tested. If you have a gluten allergy, you will find a big increase in your health when you stop eating it. But get tested before you do that. Gluten literally saws the villi off the lining of your intestine, and the villi are what uptakes nutrients into your body. Without vitamins like folic acid, you suffer neurologically. You don't get enough iron, calcium, B vitamins, and D either. All of those vitamins have a dramatic effect on your health. If you'd like to read about nutrition, Prescription for Nutritional Healing is a great book. http://www.amazon.com/Prescription-Nutritional-Healing-Practical-Reference/dp/1583330771\nYou can learn a ton about how to heal depression by reading that part of the book. It will also help you with celiac if you have it. \n\nAs to your book, if you're self publishing it, you can post a link on social media sites like Reddit, and make people aware of it a lot more effectively than by jumping off a bridge. As for the Aspergers, I thought I had it, but was instead diagnosed with PTSD and social anxiety. Still, I have many of its attributes, and I understand about the social cues. I am completely unable to read people, so I often say things I shouldn't. Still, I have friends and a life and a wonderful daughter. You're only 21; there's a lot ahead of you, and romance does come to people, whether or not they anticipate it. \n\nYour health could improve just from finding out about the celiac. Please PM me if you have questions. Hang in there. You can get past this.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The depression and digestive issues you write about suggest that you may be a celiac. Please don&amp;#39;t kill yourself until you get tested. If you have a gluten allergy, you will find a big increase in your health when you stop eating it. But get tested before you do that. Gluten literally saws the villi off the lining of your intestine, and the villi are what uptakes nutrients into your body. Without vitamins like folic acid, you suffer neurologically. You don&amp;#39;t get enough iron, calcium, B vitamins, and D either. All of those vitamins have a dramatic effect on your health. If you&amp;#39;d like to read about nutrition, Prescription for Nutritional Healing is a great book. &lt;a href=\"http://www.amazon.com/Prescription-Nutritional-Healing-Practical-Reference/dp/1583330771\"&gt;http://www.amazon.com/Prescription-Nutritional-Healing-Practical-Reference/dp/1583330771&lt;/a&gt;\nYou can learn a ton about how to heal depression by reading that part of the book. It will also help you with celiac if you have it. &lt;/p&gt;\n\n&lt;p&gt;As to your book, if you&amp;#39;re self publishing it, you can post a link on social media sites like Reddit, and make people aware of it a lot more effectively than by jumping off a bridge. As for the Aspergers, I thought I had it, but was instead diagnosed with PTSD and social anxiety. Still, I have many of its attributes, and I understand about the social cues. I am completely unable to read people, so I often say things I shouldn&amp;#39;t. Still, I have friends and a life and a wonderful daughter. You&amp;#39;re only 21; there&amp;#39;s a lot ahead of you, and romance does come to people, whether or not they anticipate it. &lt;/p&gt;\n\n&lt;p&gt;Your health could improve just from finding out about the celiac. Please PM me if you have questions. Hang in there. You can get past this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23z44k", "score_hidden": false, "name": "t1_ch203en", "created": 1398459348.0, "author_flair_text": null, "created_utc": 1398455748.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}]