[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m extremely clumsy, and a total idiot. I just find myself useless and a complete waste of space. It would take my months to tell you everything wrong with me.&lt;/p&gt;\n\n&lt;p&gt;Anyways, I am from a Vietnamese family. One that is pretty smart and strict. My cousins and nieces have all been successful in school, both of my cousins have very good careers as engineers. My niece has gotten a full scholarship to a nice school, sister has a big house with a solid, smart husband and here I am. A complete piece of shit.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a sophomore, nearing junior and I have realized that I fucked up a bit too late. I&amp;#39;m not a bad kid, never got in trouble, never got in a fight, no drugs, nothin. I have pretty OK grades, but that&amp;#39;s because I&amp;#39;ve taken all easy classes. At the end of my freshman year, after my schedule has been picked, I realized that I have achieved nothing and that I probably won&amp;#39;t even go to the Ivy League schools. I absolutely love engineering, but I&amp;#39;ve taken really basic classes while everyone else is taking all advanced classes. I&amp;#39;m nearing my Junior year, with no advance courses. How in the hell will any good college that I want accept me? It&amp;#39;s too late to pick good classes and change, so... I&amp;#39;m screwed there. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be like my mom or my dad. Mom&amp;#39;s a housekeeper, never went to highschool and so she&amp;#39;s no where close to being the sharpest tool, and dad, a food chef dropped out of community college. They always tease and yell about how I&amp;#39;m not as good as my cousins or nieces, or their friend&amp;#39;s son, or my brother-in-law. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m dumb and clumsy, and I get it from my mom. I don&amp;#39;t hate my parents, but I hate myself. I don&amp;#39;t know what to do with myself. &lt;/p&gt;\n\n&lt;p&gt;I can hear my parents talk badly about me all the time and it&amp;#39;s so demoralizing. What am I supposed to do with myself? I can try my hardest and read motivational quotes all day long, but in the end; there&amp;#39;s no point. I&amp;#39;ll never be able to actually accomplish anything. &lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;ll just be another underachiever in this smart world.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm extremely clumsy, and a total idiot. I just find myself useless and a complete waste of space. It would take my months to tell you everything wrong with me.\n\nAnyways, I am from a Vietnamese family. One that is pretty smart and strict. My cousins and nieces have all been successful in school, both of my cousins have very good careers as engineers. My niece has gotten a full scholarship to a nice school, sister has a big house with a solid, smart husband and here I am. A complete piece of shit.\n\n I'm a sophomore, nearing junior and I have realized that I fucked up a bit too late. I'm not a bad kid, never got in trouble, never got in a fight, no drugs, nothin. I have pretty OK grades, but that's because I've taken all easy classes. At the end of my freshman year, after my schedule has been picked, I realized that I have achieved nothing and that I probably won't even go to the Ivy League schools. I absolutely love engineering, but I've taken really basic classes while everyone else is taking all advanced classes. I'm nearing my Junior year, with no advance courses. How in the hell will any good college that I want accept me? It's too late to pick good classes and change, so... I'm screwed there. \n\nI don't want to be like my mom or my dad. Mom's a housekeeper, never went to highschool and so she's no where close to being the sharpest tool, and dad, a food chef dropped out of community college. They always tease and yell about how I'm not as good as my cousins or nieces, or their friend's son, or my brother-in-law. \n\nI'm dumb and clumsy, and I get it from my mom. I don't hate my parents, but I hate myself. I don't know what to do with myself. \n\nI can hear my parents talk badly about me all the time and it's so demoralizing. What am I supposed to do with myself? I can try my hardest and read motivational quotes all day long, but in the end; there's no point. I'll never be able to actually accomplish anything. \n\nI guess I'll just be another underachiever in this smart world.  \n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23tsqu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throw2131away9283", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23tsqu/ive_made_stupid_mistakes_and_im_a_waste_of_space/", "name": "t3_23tsqu", "created": 1398336670.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23tsqu/ive_made_stupid_mistakes_and_im_a_waste_of_space/", "author_flair_text": null, "title": "I've made stupid mistakes and I'm a waste of space.", "created_utc": 1398307870.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1e6e2", "gilded": 0, "author": "Throw2131away9283", "parent_id": "t1_ch0j3pw", "approved_by": null, "body": "Wow, what a response. I hate posting here because I feel like an attention seeker, but this made me feel warm inside. Thanks so much for this response, actually made me feel a lot better. \n\nI guess, now that I'm depression sober(?), my worrying was for nothing.   It feels nice to see that i'm not the only one that went through this and felt like me. Thank you so much, I'll have to keep this somewhere to read when I feel down. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, what a response. I hate posting here because I feel like an attention seeker, but this made me feel warm inside. Thanks so much for this response, actually made me feel a lot better. &lt;/p&gt;\n\n&lt;p&gt;I guess, now that I&amp;#39;m depression sober(?), my worrying was for nothing.   It feels nice to see that i&amp;#39;m not the only one that went through this and felt like me. Thank you so much, I&amp;#39;ll have to keep this somewhere to read when I feel down. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tsqu", "score_hidden": false, "name": "t1_ch1e6e2", "created": 1398396126.0, "author_flair_text": null, "created_utc": 1398392526.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0j3pw", "gilded": 0, "author": "ballermurph", "parent_id": "t3_23tsqu", "approved_by": null, "body": "The key point that really stuck out to me from what you said is how you love engineering. You are just in high school now. You don't have to take all of the top classes to succeed farther down the road. College is where you really work to find yourself and develop your interests, like engineering. It's your passion, not what you do in high school, that is going to carry you into the future, and you should focus on what makes you happy.\n\nDon't focus so much on IV league schools. There are several state colleges and universities with great engineering programs that I'm sure would accept you, and depending on your test scores, may even give you scholarship money. (University of Texas and University of Pennsylvania just to name two) What you do in high school doesn't make or break your future or define who you are.\n\nFrom my high school perspective, I constantly felt like I was never good enough, pushing myself harder and harder to do better, achieving the highest grade point average and test scores possible. I got lost in the hype and lost my happiness for a long time, falling into a dark depression and hating myself for a long time. When the end of high school rolled around, I realized that IV League schools acceptance policies are a load of crap anyway. I was accepted to a good school with a good scholarship, and I could have done far less and made myself a much happier person in the process. In this day and age with social media sending propaganda and lies everywhere, it is easy to feel small and inferior in the grand scheme of things. But after senior year of high school, your eyes open up to the real world and how little all the high school bull crap really means.\n\nAs for your parents, I'm really sorry to hear that they are not more supportive of you. I'm sure that it's just that they love you and have set overly ambitious goals for you in their own minds. I have several friends whose parents push them too hard or put them down, but in the end, your parents don't call the shots in your life and they don't know everything about who you are and how you think. As long as you follow what you want to do with your life and pursue what is going to make you happy, someday they will realize that they were wrong.\n\nI apologize for the long worded response. High school is such a small fraction of our lives, and we are all awkward in our own ways in high school, some less noticably than others. Try not to get caught up in the stupid hype that is high school. You are not a waste of space, and your future is not as bleak as it may look to you now.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The key point that really stuck out to me from what you said is how you love engineering. You are just in high school now. You don&amp;#39;t have to take all of the top classes to succeed farther down the road. College is where you really work to find yourself and develop your interests, like engineering. It&amp;#39;s your passion, not what you do in high school, that is going to carry you into the future, and you should focus on what makes you happy.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t focus so much on IV league schools. There are several state colleges and universities with great engineering programs that I&amp;#39;m sure would accept you, and depending on your test scores, may even give you scholarship money. (University of Texas and University of Pennsylvania just to name two) What you do in high school doesn&amp;#39;t make or break your future or define who you are.&lt;/p&gt;\n\n&lt;p&gt;From my high school perspective, I constantly felt like I was never good enough, pushing myself harder and harder to do better, achieving the highest grade point average and test scores possible. I got lost in the hype and lost my happiness for a long time, falling into a dark depression and hating myself for a long time. When the end of high school rolled around, I realized that IV League schools acceptance policies are a load of crap anyway. I was accepted to a good school with a good scholarship, and I could have done far less and made myself a much happier person in the process. In this day and age with social media sending propaganda and lies everywhere, it is easy to feel small and inferior in the grand scheme of things. But after senior year of high school, your eyes open up to the real world and how little all the high school bull crap really means.&lt;/p&gt;\n\n&lt;p&gt;As for your parents, I&amp;#39;m really sorry to hear that they are not more supportive of you. I&amp;#39;m sure that it&amp;#39;s just that they love you and have set overly ambitious goals for you in their own minds. I have several friends whose parents push them too hard or put them down, but in the end, your parents don&amp;#39;t call the shots in your life and they don&amp;#39;t know everything about who you are and how you think. As long as you follow what you want to do with your life and pursue what is going to make you happy, someday they will realize that they were wrong.&lt;/p&gt;\n\n&lt;p&gt;I apologize for the long worded response. High school is such a small fraction of our lives, and we are all awkward in our own ways in high school, some less noticably than others. Try not to get caught up in the stupid hype that is high school. You are not a waste of space, and your future is not as bleak as it may look to you now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tsqu", "score_hidden": false, "name": "t1_ch0j3pw", "created": 1398313201.0, "author_flair_text": null, "created_utc": 1398309601.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0ivf4", "gilded": 0, "author": "priestofdisorder", "parent_id": "t3_23tsqu", "approved_by": null, "body": "You dont hace to impresa anybody but yourself, you have to meet your own expectations and follow the road you want to take un life, my parents are really strict toó bit i told them im not the exacta person they want me to be, wish you the best op, sometimes good grades doesnt mean intelligence.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You dont hace to impresa anybody but yourself, you have to meet your own expectations and follow the road you want to take un life, my parents are really strict toó bit i told them im not the exacta person they want me to be, wish you the best op, sometimes good grades doesnt mean intelligence.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tsqu", "score_hidden": false, "name": "t1_ch0ivf4", "created": 1398312694.0, "author_flair_text": null, "created_utc": 1398309094.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]