[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a HUGE idiot because my main goal in life is to be madly in love with someone. I just want to be comfortable and loved and give love. I&amp;#39;m not ugly, I have many people interested in me and I never have to be single, unless I want to. But it seems everyone I get with cheats on me or beats me. I have HUGE trust issues naturally and am scared of everyone. I have PTSD from being raped when I was young and I normally don&amp;#39;t talk about it but it does become a problem in bed. I can tense up and cry over the littlest things. I&amp;#39;m 25, I should be so fucking worked up over it anymore.\nI have huge anxiety attacks that shut me down completely. I LOVE going out, but even after having fun I tend to feel guilty and panic the while next day. Or longer.&lt;/p&gt;\n\n&lt;p&gt;I finally thought I found someone to love me for me, but it turns out he can&amp;#39;t handle my problems and I&amp;#39;m too emotional. I told me I may as well kill myself and get it over with. I&amp;#39;ll never figure my shit out and I&amp;#39;ll never have someone love a whore like me.&lt;/p&gt;\n\n&lt;p&gt;I told my friends and family he said these things and they want me to stay away from him. But I secretly keep seeing him and letting him have sex with me. He tells me he loves me too when I say it, but he also tells me how I can&amp;#39;t stop him from seeing other people. I KNOW it should be obvious to avoid him, but I really want to be loved. I feel crazy. If I were anyone else reading this the first thing I&amp;#39;d say is to stay away from him but I can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Everything makes me want to die. The littlest thing goes wrong and I want to get a gun. Another thing he &amp;quot;joked&amp;#39; about was I shouldn&amp;#39;t buy a gun when I can just rent one at the shooting range. It sounds like a good idea. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure people will miss me but I feel like I can&amp;#39;t take the stress anymore. I feel like I&amp;#39;m bothering everyone all the time. Even now I want to say I&amp;#39;m sorry for writing so much..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a HUGE idiot because my main goal in life is to be madly in love with someone. I just want to be comfortable and loved and give love. I'm not ugly, I have many people interested in me and I never have to be single, unless I want to. But it seems everyone I get with cheats on me or beats me. I have HUGE trust issues naturally and am scared of everyone. I have PTSD from being raped when I was young and I normally don't talk about it but it does become a problem in bed. I can tense up and cry over the littlest things. I'm 25, I should be so fucking worked up over it anymore.\nI have huge anxiety attacks that shut me down completely. I LOVE going out, but even after having fun I tend to feel guilty and panic the while next day. Or longer.\n\nI finally thought I found someone to love me for me, but it turns out he can't handle my problems and I'm too emotional. I told me I may as well kill myself and get it over with. I'll never figure my shit out and I'll never have someone love a whore like me.\n\nI told my friends and family he said these things and they want me to stay away from him. But I secretly keep seeing him and letting him have sex with me. He tells me he loves me too when I say it, but he also tells me how I can't stop him from seeing other people. I KNOW it should be obvious to avoid him, but I really want to be loved. I feel crazy. If I were anyone else reading this the first thing I'd say is to stay away from him but I can't.\n\nEverything makes me want to die. The littlest thing goes wrong and I want to get a gun. Another thing he \"joked' about was I shouldn't buy a gun when I can just rent one at the shooting range. It sounds like a good idea. \n\nI'm sure people will miss me but I feel like I can't take the stress anymore. I feel like I'm bothering everyone all the time. Even now I want to say I'm sorry for writing so much..", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2484q0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "blankaccount1234", "media": null, "score": 13, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 6, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2484q0/ive_wanted_to_kill_myself_for_years_everyone_says/", "name": "t3_2484q0", "created": 1398752759.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2484q0/ive_wanted_to_kill_myself_for_years_everyone_says/", "author_flair_text": null, "title": "I've wanted to kill myself for years. Everyone says \"it gets better\" but it has only been getting worse.", "created_utc": 1398723959.0, "ups": 19, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8nsbl", "gilded": 0, "author": "blankaccount1234", "parent_id": "t1_ch5pn4w", "approved_by": null, "body": "Thank you so much. It does help me to know I'm not alone. I have a hard time because I want the guys I fall for to just understand, I get it in my head if I try and try they will care and want to care for me. But it never seems to work out that way.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. It does help me to know I&amp;#39;m not alone. I have a hard time because I want the guys I fall for to just understand, I get it in my head if I try and try they will care and want to care for me. But it never seems to work out that way.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch8nsbl", "created": 1399144586.0, "author_flair_text": null, "created_utc": 1399140986.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5pn4w", "gilded": 0, "author": "Emibri28", "parent_id": "t3_2484q0", "approved_by": null, "body": "A lot of what I read on your post is soooo similar to me. I am 27 and have had so many trust issues because things that havr happened to me in the past. I won't get into that now, just \nknow I understand a lot of what you have said.  I went through so many guys who couldn't deal with my issues and couldn't handle my apologies for issues in\nbed and otherwise.  And there were those guys who just wanted to get laid so they acted like they understood until they didn't\n anymore.  But I'm telling you this to say that things did get better for me and I truly believe they can for you as well.  I almost gave up on myself more times than I can count and still have to have my SO reassure me almost daily...and he does without frustration. As many guys as it took to find him, I did. Please don't give up on yourself or others. There are good ones out there... Unfortunately they don't always come right when we need then.  If you need to talk just let me know", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of what I read on your post is soooo similar to me. I am 27 and have had so many trust issues because things that havr happened to me in the past. I won&amp;#39;t get into that now, just \nknow I understand a lot of what you have said.  I went through so many guys who couldn&amp;#39;t deal with my issues and couldn&amp;#39;t handle my apologies for issues in\nbed and otherwise.  And there were those guys who just wanted to get laid so they acted like they understood until they didn&amp;#39;t\n anymore.  But I&amp;#39;m telling you this to say that things did get better for me and I truly believe they can for you as well.  I almost gave up on myself more times than I can count and still have to have my SO reassure me almost daily...and he does without frustration. As many guys as it took to find him, I did. Please don&amp;#39;t give up on yourself or others. There are good ones out there... Unfortunately they don&amp;#39;t always come right when we need then.  If you need to talk just let me know&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch5pn4w", "created": 1398834752.0, "author_flair_text": null, "created_utc": 1398831152.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4uw75", "gilded": 0, "author": "throwaway56126327", "parent_id": "t1_ch4j2nm", "approved_by": null, "body": "I do not know if this will make you feel better, but I have a friend who went through a similar situation - she was raped in high school and had PTSD because of that as well as an eating disorder. However, a few years later she is getting better, and recently started dating a really nice guy who is comfortable with her experiences and the daily struggle she is going through. There is love out there....", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not know if this will make you feel better, but I have a friend who went through a similar situation - she was raped in high school and had PTSD because of that as well as an eating disorder. However, a few years later she is getting better, and recently started dating a really nice guy who is comfortable with her experiences and the daily struggle she is going through. There is love out there....&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4uw75", "created": 1398755793.0, "author_flair_text": null, "created_utc": 1398752193.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4j2nm", "gilded": 0, "author": "blankaccount1234", "parent_id": "t1_ch4iuj4", "approved_by": null, "body": "Thank you. I have friends and family who all want to help me but I'm afraid of being a hassle. They tell me I'm not but some of them also use my sadness against me. \nMy boyfriend and I broke up Friday, and a friend of mine was texting me telling me how sorry she was and how she was there for me. I was pouring my heart out to her. And she was just using that information while textng him at the same time to talk bad about me and tell him how bad she wanted to fuck him. I can't trust anyone. Edit: which is why I'm looking to strangers on the internet, I guess. IF people don't know me they can't hurt me, right?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I have friends and family who all want to help me but I&amp;#39;m afraid of being a hassle. They tell me I&amp;#39;m not but some of them also use my sadness against me. \nMy boyfriend and I broke up Friday, and a friend of mine was texting me telling me how sorry she was and how she was there for me. I was pouring my heart out to her. And she was just using that information while textng him at the same time to talk bad about me and tell him how bad she wanted to fuck him. I can&amp;#39;t trust anyone. Edit: which is why I&amp;#39;m looking to strangers on the internet, I guess. IF people don&amp;#39;t know me they can&amp;#39;t hurt me, right?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4j2nm", "created": 1398728850.0, "author_flair_text": null, "created_utc": 1398725250.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4iuj4", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2484q0", "approved_by": null, "body": "You're not a n idiot at all, that's a perfectly reasonable thing you can expect from life, but if what I have realised from life is true, then life is a bitch. I haven't had the personal experiences you have had, but I know what it is like to feel alonf when you are dealing with this stuff. I honeztly don't know if you have family or firendsthere for you when you are going through this, when you have all this to deal with, but (and I know this doesn't mean much) i promise you I will be there for you. If you ever want to talk about this stuff I'm here to help.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not a n idiot at all, that&amp;#39;s a perfectly reasonable thing you can expect from life, but if what I have realised from life is true, then life is a bitch. I haven&amp;#39;t had the personal experiences you have had, but I know what it is like to feel alonf when you are dealing with this stuff. I honeztly don&amp;#39;t know if you have family or firendsthere for you when you are going through this, when you have all this to deal with, but (and I know this doesn&amp;#39;t mean much) i promise you I will be there for you. If you ever want to talk about this stuff I&amp;#39;m here to help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4iuj4", "created": 1398728353.0, "author_flair_text": null, "created_utc": 1398724753.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8nxso", "gilded": 0, "author": "blankaccount1234", "parent_id": "t1_ch4ma21", "approved_by": null, "body": "Wow this was really moving, actually. Thank you so much. I think about sex a lot. A whole lot. I'm horny constantly. But when it actually comes to the act I often tense up and worry. I HATE getting someone worked up and turned on just to have to turn them down. And i don't want that. I want someone who will treat me like it's okay and kiss me and keep the mood going (unless i really NEED to stop NOW). Because every time I pull away and they get upset it seems to make it worse. And I can't seem to stop myself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this was really moving, actually. Thank you so much. I think about sex a lot. A whole lot. I&amp;#39;m horny constantly. But when it actually comes to the act I often tense up and worry. I HATE getting someone worked up and turned on just to have to turn them down. And i don&amp;#39;t want that. I want someone who will treat me like it&amp;#39;s okay and kiss me and keep the mood going (unless i really NEED to stop NOW). Because every time I pull away and they get upset it seems to make it worse. And I can&amp;#39;t seem to stop myself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch8nxso", "created": 1399144954.0, "author_flair_text": null, "created_utc": 1399141354.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4ma21", "gilded": 0, "author": "findit1", "parent_id": "t1_ch4jl2m", "approved_by": null, "body": "I constantly just think about fucking my girl, or other perverted things she probably didnt realize that till recently. She cries/ says sorry if I get angry cries/ says sorry if I speak loudly cries/ says sorry if I'm distracted. The weird thing is I don't care. I don't know why or maybe because all I want to do is fuck her or want her sucking me off or even going down on her and that is why I don't care. It rarely happens though, I get a blowjob every now and then we came close to sex I seduce her but then she just cries/ says sorry and we cuddle. Two years this has been happening but I got my blowjob three days ago, worth it. Maybe I'm just a sick person but don't think that just because someone craves sex and you can't give it to them that it's a \"deal breaker\" I actually thought it would be I thought I wouldn't be able to live without it but damn I make her so happy that I'm happy. Maybe you're not an easy route(my girl definitely bloody wasn't but that isn't a problem at all). She calls her self conservative, her friends and parents call her a prude. I call her perfect. Now look at her I'm making her happier than all of them put together can.\n\nTl;dr I'm a pervert in it for the long haul with a deeply wounded girl who has difficulty with sex. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I constantly just think about fucking my girl, or other perverted things she probably didnt realize that till recently. She cries/ says sorry if I get angry cries/ says sorry if I speak loudly cries/ says sorry if I&amp;#39;m distracted. The weird thing is I don&amp;#39;t care. I don&amp;#39;t know why or maybe because all I want to do is fuck her or want her sucking me off or even going down on her and that is why I don&amp;#39;t care. It rarely happens though, I get a blowjob every now and then we came close to sex I seduce her but then she just cries/ says sorry and we cuddle. Two years this has been happening but I got my blowjob three days ago, worth it. Maybe I&amp;#39;m just a sick person but don&amp;#39;t think that just because someone craves sex and you can&amp;#39;t give it to them that it&amp;#39;s a &amp;quot;deal breaker&amp;quot; I actually thought it would be I thought I wouldn&amp;#39;t be able to live without it but damn I make her so happy that I&amp;#39;m happy. Maybe you&amp;#39;re not an easy route(my girl definitely bloody wasn&amp;#39;t but that isn&amp;#39;t a problem at all). She calls her self conservative, her friends and parents call her a prude. I call her perfect. Now look at her I&amp;#39;m making her happier than all of them put together can.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr I&amp;#39;m a pervert in it for the long haul with a deeply wounded girl who has difficulty with sex. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4ma21", "created": 1398735711.0, "author_flair_text": null, "created_utc": 1398732111.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4jslz", "gilded": 0, "author": "dotadotedoto", "parent_id": "t1_ch4jl2m", "approved_by": null, "body": "she doesn't even like sex lol she's not into it not that often anyways... she made that clear its fine.. she loves masturbating tho haha probably does it more than me. shes not much of a writer but i'm ok with sending her messages that turn her on and stuff... i suppose i like talking dirty and don't mind she doesn't want me actually doing it. she cries a lot even when happy its cool its the way she is... \"painful unnecessary messy\" been there done that dont want anymore is her view of sex. i know that. i doubt it'll change either fine by me. ", "edited": 1398727142.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;she doesn&amp;#39;t even like sex lol she&amp;#39;s not into it not that often anyways... she made that clear its fine.. she loves masturbating tho haha probably does it more than me. shes not much of a writer but i&amp;#39;m ok with sending her messages that turn her on and stuff... i suppose i like talking dirty and don&amp;#39;t mind she doesn&amp;#39;t want me actually doing it. she cries a lot even when happy its cool its the way she is... &amp;quot;painful unnecessary messy&amp;quot; been there done that dont want anymore is her view of sex. i know that. i doubt it&amp;#39;ll change either fine by me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4jslz", "created": 1398730410.0, "author_flair_text": null, "created_utc": 1398726810.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4jl2m", "gilded": 0, "author": "blankaccount1234", "parent_id": "t1_ch4jc19", "approved_by": null, "body": "Wow she and I sound pretty similar. i've lost  a lot of people in my life from constantly saying sorry. She is lucky to have you. \nSometimes I think being good looking is hard. Because there are so many, many people out there who want in your pants, especially as a girl it's hard to figure out which just want to fuck you and which actually like you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow she and I sound pretty similar. i&amp;#39;ve lost  a lot of people in my life from constantly saying sorry. She is lucky to have you. \nSometimes I think being good looking is hard. Because there are so many, many people out there who want in your pants, especially as a girl it&amp;#39;s hard to figure out which just want to fuck you and which actually like you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4jl2m", "created": 1398729951.0, "author_flair_text": null, "created_utc": 1398726351.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4jc19", "gilded": 0, "author": "dotadotedoto", "parent_id": "t3_2484q0", "approved_by": null, "body": "my gf used to be pretty messed up she still is and has nightmares, cries her self to sleep. her time of the month is the hardest. this is 20 months after her ex broke up with her and her last bf after that was not very nice either.\n\nwe're 2 weeks from our first year... she is extremely clingy and craves attention (which is positive yeh i love giving attention)\n anyways she was a bitch to me for literally 6 months straight made me feel like total shit i stayed with her despite this i'm just like that. she apologizes for no reason we even have a thing where i say \"dss\" or dont say sorry. she also says \" i'll stop bothering you now\" to me all the time (she never is, it's not even possible for me to see it that way)\n\nhmm so my point is she fell in love with me not really the other way round.., then after she was dropping tons of clues i opened up more, we had chemistry, i'm a forward thinking person  and now we're going strong. \n\nsome people like me have absorbing someones \"problems\" as their defining feature, i'm calm (people say) i actually come across menacing and abraisive though. I'm nothing like you'd think until you talk to me. I'm not bad looking either i literally see 3+ people i can pick up every day probably more but thats just an example. my point in mentioning my looks is just that some ppl say \"ugly\" people are more willing to put up with a psycho good looking person coz its the best they can land.\n\nim a guy who loves bs i love that my gf throws bs my way 24/7 never a dull moment... i can absorb it... hmm to give an idea of my strengths its a bunch of empathy, i'm good with picturing a future in \"realistic\" terms i.e. i knew she was messed up etc and that even if she stays this way forever we'll still be perfect or even if she changes we'll be great too.. and i can see what makes people individually unique, everyone is unique. but she is someone i can analyze all day and not be bored it's great fun obviously I don't vocalize any of it I don't need to. although she constantly says \"I'm reading her mind\" I know what she's thinking a lot. (these are my main things that allow me to accept her i believe) oh and another thing she says sorry u have to \"put up\" with me... as if it's like that it really isn't.. oh i guess i'm a good listener too thats inherent in my learning ability tho. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;my gf used to be pretty messed up she still is and has nightmares, cries her self to sleep. her time of the month is the hardest. this is 20 months after her ex broke up with her and her last bf after that was not very nice either.&lt;/p&gt;\n\n&lt;p&gt;we&amp;#39;re 2 weeks from our first year... she is extremely clingy and craves attention (which is positive yeh i love giving attention)\n anyways she was a bitch to me for literally 6 months straight made me feel like total shit i stayed with her despite this i&amp;#39;m just like that. she apologizes for no reason we even have a thing where i say &amp;quot;dss&amp;quot; or dont say sorry. she also says &amp;quot; i&amp;#39;ll stop bothering you now&amp;quot; to me all the time (she never is, it&amp;#39;s not even possible for me to see it that way)&lt;/p&gt;\n\n&lt;p&gt;hmm so my point is she fell in love with me not really the other way round.., then after she was dropping tons of clues i opened up more, we had chemistry, i&amp;#39;m a forward thinking person  and now we&amp;#39;re going strong. &lt;/p&gt;\n\n&lt;p&gt;some people like me have absorbing someones &amp;quot;problems&amp;quot; as their defining feature, i&amp;#39;m calm (people say) i actually come across menacing and abraisive though. I&amp;#39;m nothing like you&amp;#39;d think until you talk to me. I&amp;#39;m not bad looking either i literally see 3+ people i can pick up every day probably more but thats just an example. my point in mentioning my looks is just that some ppl say &amp;quot;ugly&amp;quot; people are more willing to put up with a psycho good looking person coz its the best they can land.&lt;/p&gt;\n\n&lt;p&gt;im a guy who loves bs i love that my gf throws bs my way 24/7 never a dull moment... i can absorb it... hmm to give an idea of my strengths its a bunch of empathy, i&amp;#39;m good with picturing a future in &amp;quot;realistic&amp;quot; terms i.e. i knew she was messed up etc and that even if she stays this way forever we&amp;#39;ll still be perfect or even if she changes we&amp;#39;ll be great too.. and i can see what makes people individually unique, everyone is unique. but she is someone i can analyze all day and not be bored it&amp;#39;s great fun obviously I don&amp;#39;t vocalize any of it I don&amp;#39;t need to. although she constantly says &amp;quot;I&amp;#39;m reading her mind&amp;quot; I know what she&amp;#39;s thinking a lot. (these are my main things that allow me to accept her i believe) oh and another thing she says sorry u have to &amp;quot;put up&amp;quot; with me... as if it&amp;#39;s like that it really isn&amp;#39;t.. oh i guess i&amp;#39;m a good listener too thats inherent in my learning ability tho. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4jc19", "created": 1398729413.0, "author_flair_text": null, "created_utc": 1398725813.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8uytu", "gilded": 0, "author": "Emibri28", "parent_id": "t3_2484q0", "approved_by": null, "body": "I know what you mean...You think if you give and give eventually someone will give back and give you what you need. Unfortunately it usually doesn't happen that way.  I think you need to stay away from the guy you were talking about. He doesn't deserve you,  give yourself more credit. Just because bad things have happened to you it doesn't make you any less of a person and definitely doesnt make you less  deserving of someone who really loves you. It took a long time for me to even begin to believe that but you need to try to so you can stop giving yourself to him.  You deserve to be loved and not taken advantage of... You just have to find it in yourself to dig down deep and try to be strong enough to stop yourself from being taken advantage of. Believe me I know it's not easy but i believe you can do it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean...You think if you give and give eventually someone will give back and give you what you need. Unfortunately it usually doesn&amp;#39;t happen that way.  I think you need to stay away from the guy you were talking about. He doesn&amp;#39;t deserve you,  give yourself more credit. Just because bad things have happened to you it doesn&amp;#39;t make you any less of a person and definitely doesnt make you less  deserving of someone who really loves you. It took a long time for me to even begin to believe that but you need to try to so you can stop giving yourself to him.  You deserve to be loved and not taken advantage of... You just have to find it in yourself to dig down deep and try to be strong enough to stop yourself from being taken advantage of. Believe me I know it&amp;#39;s not easy but i believe you can do it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch8uytu", "created": 1399163601.0, "author_flair_text": null, "created_utc": 1399160001.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4pgv1", "gilded": 0, "author": "stapleherdick", "parent_id": "t3_2484q0", "approved_by": null, "body": "It comes down to the whole \"the wolf you feed\" argument. It is easy to be with this guy because you're already feeling bad. Sometimes, I'm not sure if this is you, but sometimes we get so used to feeling a certain way that there is almost a pleasure in it, a comfort. I sometimes feel an almost high when I feel severely low, if that makes sense. This guy feeds both of your wolves which can feel like an ideal situation, especially if you want a high and then also get high off the crash. However you are in a cycle of abuse. That guy is being abusive to you. You have to sit here and make the conscious choice are you going to help yourself or not. You know its bad. You know it isn't going to help you. You have to be your own best friend and nurse yourself through this. You have to say no. This isn't love. Don't fool yourself into thinking so. You don't need to be hurt to be loved. This guy feeds the bad wolf more then he feeds the good. \n\nYou have to understand that trust is a process. That when someone takes your trust for granted it doesn't always have anything to do with you. That is what life is in my opinion. You take chances, some work out, some don't, the ones that don't hurt way more, but you learn, over time, to pick yourself up after every let down. The important thing is that you don't stop. You don't stop taking chances. You've settled for this because this is either the best you think you can do, you're comfortable in it, or you don't actually want someone that only treats you well. \n\nYou're not a whore. You're not a whore for being raped. You're not unclean. You're not even a whore for having sex. \n\nTrust me there are people out there who are willing to be patient and would be with you. \nI think it would be wise to either start seeing a therapist or do a day hospital program if you can. There are skills that you can learn to help you with your anxiety and issues. \nAlso we all work through things through our own ways. There is no should. You had something horrific happen to you...its like a death. You learn to deal with it, you move on in some ways, but the pain can still be there. It is okay to be 25 and still be affected by it, hell its okay to be 100 and still be affected by it. \n\nAlso I think the \"it gets better\" is bullshit personally. No one can guarantee that. However there is one thing I can guarantee, its that things will change. Not everything you're dealing with will last. That is just a fact of life. Find hope in knowing that nothing can last forever. \nI wish you all the luck.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It comes down to the whole &amp;quot;the wolf you feed&amp;quot; argument. It is easy to be with this guy because you&amp;#39;re already feeling bad. Sometimes, I&amp;#39;m not sure if this is you, but sometimes we get so used to feeling a certain way that there is almost a pleasure in it, a comfort. I sometimes feel an almost high when I feel severely low, if that makes sense. This guy feeds both of your wolves which can feel like an ideal situation, especially if you want a high and then also get high off the crash. However you are in a cycle of abuse. That guy is being abusive to you. You have to sit here and make the conscious choice are you going to help yourself or not. You know its bad. You know it isn&amp;#39;t going to help you. You have to be your own best friend and nurse yourself through this. You have to say no. This isn&amp;#39;t love. Don&amp;#39;t fool yourself into thinking so. You don&amp;#39;t need to be hurt to be loved. This guy feeds the bad wolf more then he feeds the good. &lt;/p&gt;\n\n&lt;p&gt;You have to understand that trust is a process. That when someone takes your trust for granted it doesn&amp;#39;t always have anything to do with you. That is what life is in my opinion. You take chances, some work out, some don&amp;#39;t, the ones that don&amp;#39;t hurt way more, but you learn, over time, to pick yourself up after every let down. The important thing is that you don&amp;#39;t stop. You don&amp;#39;t stop taking chances. You&amp;#39;ve settled for this because this is either the best you think you can do, you&amp;#39;re comfortable in it, or you don&amp;#39;t actually want someone that only treats you well. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not a whore. You&amp;#39;re not a whore for being raped. You&amp;#39;re not unclean. You&amp;#39;re not even a whore for having sex. &lt;/p&gt;\n\n&lt;p&gt;Trust me there are people out there who are willing to be patient and would be with you. \nI think it would be wise to either start seeing a therapist or do a day hospital program if you can. There are skills that you can learn to help you with your anxiety and issues. \nAlso we all work through things through our own ways. There is no should. You had something horrific happen to you...its like a death. You learn to deal with it, you move on in some ways, but the pain can still be there. It is okay to be 25 and still be affected by it, hell its okay to be 100 and still be affected by it. &lt;/p&gt;\n\n&lt;p&gt;Also I think the &amp;quot;it gets better&amp;quot; is bullshit personally. No one can guarantee that. However there is one thing I can guarantee, its that things will change. Not everything you&amp;#39;re dealing with will last. That is just a fact of life. Find hope in knowing that nothing can last forever. \nI wish you all the luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2484q0", "score_hidden": false, "name": "t1_ch4pgv1", "created": 1398767201.0, "author_flair_text": null, "created_utc": 1398738401.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]