[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway because I have friends who know my main alt. Diagnosed as bipolar 2-3years ago (my memory is shot), take my meds and attend therapy when I have an appointment but things just keep sliding. Haven&amp;#39;t showered in days, and that&amp;#39;s a regular thing. My room has a pile of beer cans and bottles and empty takeaway containers etc about 1m high. I smoke weed regularly, but not every day. Same with the drinking. Have an outstanding fine that&amp;#39;s spiralled so far out it&amp;#39;s been forwarded to the sheriffs office. I have lucid dreams/nightmares that are so vivid and real that I question my own reality. It&amp;#39;s got to the point that I can&amp;#39;t continue. I tell my two closest friends about my plans, and seeing the pain in their eyes just strengthens my resolve. I&amp;#39;d be dead by now if I could find a reliable method to end it all (access to a gun is impossible and I&amp;#39;ve got a medical background so I know how ineffective most suicide methods are). &lt;/p&gt;\n\n&lt;p&gt;My thinking behind this is that my life is hell. My mum is fucked (drunk every night and abusive as well as delusional). My dad regularly disappears on fishing trips cos he can&amp;#39;t cope. My sister is absent. I would love to move out but I have no qualifications (I dropped out of uni in my last year and haven&amp;#39;t been able to stick with a course since), can&amp;#39;t hold down a job and was told to sleep in my car when I went to the welfare office. So, I feel like a cornered animal, and can&amp;#39;t see what&amp;#39;s wrong with ending it all. No one complains when a cancer patient gives up, and I&amp;#39;ve never had any real improvement with meds and the therapy. What&amp;#39;s the difference? I don&amp;#39;t know what I really want here, but right now it&amp;#39;s 5am here and there&amp;#39;s no one here to listen to the dark shit that&amp;#39;s spinning in my head.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Throwaway because I have friends who know my main alt. Diagnosed as bipolar 2-3years ago (my memory is shot), take my meds and attend therapy when I have an appointment but things just keep sliding. Haven't showered in days, and that's a regular thing. My room has a pile of beer cans and bottles and empty takeaway containers etc about 1m high. I smoke weed regularly, but not every day. Same with the drinking. Have an outstanding fine that's spiralled so far out it's been forwarded to the sheriffs office. I have lucid dreams/nightmares that are so vivid and real that I question my own reality. It's got to the point that I can't continue. I tell my two closest friends about my plans, and seeing the pain in their eyes just strengthens my resolve. I'd be dead by now if I could find a reliable method to end it all (access to a gun is impossible and I've got a medical background so I know how ineffective most suicide methods are). \n\nMy thinking behind this is that my life is hell. My mum is fucked (drunk every night and abusive as well as delusional). My dad regularly disappears on fishing trips cos he can't cope. My sister is absent. I would love to move out but I have no qualifications (I dropped out of uni in my last year and haven't been able to stick with a course since), can't hold down a job and was told to sleep in my car when I went to the welfare office. So, I feel like a cornered animal, and can't see what's wrong with ending it all. No one complains when a cancer patient gives up, and I've never had any real improvement with meds and the therapy. What's the difference? I don't know what I really want here, but right now it's 5am here and there's no one here to listen to the dark shit that's spinning in my head.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23z2f3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sothisistheend1", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23z2f3/ive_hit_rock_bottom_and_would_like_to_discuss/", "name": "t3_23z2f3", "created": 1398481383.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23z2f3/ive_hit_rock_bottom_and_would_like_to_discuss/", "author_flair_text": null, "title": "I've hit rock bottom and would like to discuss some things with you guys.", "created_utc": 1398452583.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1yt2h", "gilded": 0, "author": "sothisistheend1", "parent_id": "t3_23z2f3", "approved_by": null, "body": "Oh, and I forgot, went out the other night with my old drinking team from uni. I just felt like I was a plaque on the wall. My close friend who knew was up kept trying to draw me back unto the fold but I just couldn't mesh. Any time I said anything it just felt like I was being ignored and I kept finding myself being cut out of a circle of friends by others pushing their way in to join etc. If anything, it just crystallised my conviction that everyone would quickly get over my death once it happens. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, and I forgot, went out the other night with my old drinking team from uni. I just felt like I was a plaque on the wall. My close friend who knew was up kept trying to draw me back unto the fold but I just couldn&amp;#39;t mesh. Any time I said anything it just felt like I was being ignored and I kept finding myself being cut out of a circle of friends by others pushing their way in to join etc. If anything, it just crystallised my conviction that everyone would quickly get over my death once it happens. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23z2f3", "score_hidden": false, "name": "t1_ch1yt2h", "created": 1398456721.0, "author_flair_text": null, "created_utc": 1398453121.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch22f3p", "gilded": 0, "author": "sothisistheend1", "parent_id": "t1_ch21lum", "approved_by": null, "body": "1. No I won't. I shower and put on fresh clothes when I go out. It just makes me feel like a wolf in sheeps clothing. I have a beard so shaving isn't a problem.\n2. It's done for me, this isn't an issue. As it is, I'm not making any.\n3. &amp; 4. It's well and good to say this, but it really doesn't help me. I know it isn't great, and I'm fairly repulsed by it. Do I do anything about it?\n5. An associate professor of psychiatry can't get me to do it. This isn't happening unless I have a huge improvement in my mental well-being.\n6. I frankly don't see the point of this, half an hour is plenty and will make changes occur. A hike involves a lot prior planning and organisation. \n7. I need to be close to civilisation on the off-chance I need hospitalisation. He goes pretty far off the grid and is gone for some time.\n8. Why the hell would I take them anywhere?! Also, I don't think you realise how offensive it is to tell someone with bipolar to save money. Money problems are one of the most common problems. Related to impulse control. \n9. Pointless. I'm not mentally stable enough. There was a best of about this today. \n10. Have one. It's zero motivation. \n11. Have one and read everyday, and I don't mean reddit. I used to enjoy it, all it is now is a distraction. I derive no enjoyment from it.\n\nAs for focusing on myself, it's all I do these days.\n\nI don't mean to sound ungrateful, but this just feels like \"11 secrets that psychologists/psychiatrists hate\".", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;No I won&amp;#39;t. I shower and put on fresh clothes when I go out. It just makes me feel like a wolf in sheeps clothing. I have a beard so shaving isn&amp;#39;t a problem.&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s done for me, this isn&amp;#39;t an issue. As it is, I&amp;#39;m not making any.&lt;/li&gt;\n&lt;li&gt;&amp;amp; 4. It&amp;#39;s well and good to say this, but it really doesn&amp;#39;t help me. I know it isn&amp;#39;t great, and I&amp;#39;m fairly repulsed by it. Do I do anything about it?&lt;/li&gt;\n&lt;li&gt;An associate professor of psychiatry can&amp;#39;t get me to do it. This isn&amp;#39;t happening unless I have a huge improvement in my mental well-being.&lt;/li&gt;\n&lt;li&gt;I frankly don&amp;#39;t see the point of this, half an hour is plenty and will make changes occur. A hike involves a lot prior planning and organisation. &lt;/li&gt;\n&lt;li&gt;I need to be close to civilisation on the off-chance I need hospitalisation. He goes pretty far off the grid and is gone for some time.&lt;/li&gt;\n&lt;li&gt;Why the hell would I take them anywhere?! Also, I don&amp;#39;t think you realise how offensive it is to tell someone with bipolar to save money. Money problems are one of the most common problems. Related to impulse control. &lt;/li&gt;\n&lt;li&gt;Pointless. I&amp;#39;m not mentally stable enough. There was a best of about this today. &lt;/li&gt;\n&lt;li&gt;Have one. It&amp;#39;s zero motivation. &lt;/li&gt;\n&lt;li&gt;Have one and read everyday, and I don&amp;#39;t mean reddit. I used to enjoy it, all it is now is a distraction. I derive no enjoyment from it.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As for focusing on myself, it&amp;#39;s all I do these days.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t mean to sound ungrateful, but this just feels like &amp;quot;11 secrets that psychologists/psychiatrists hate&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23z2f3", "score_hidden": false, "name": "t1_ch22f3p", "created": 1398464303.0, "author_flair_text": null, "created_utc": 1398460703.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch21lum", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23z2f3", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23z2f3", "score_hidden": false, "name": "t1_ch21lum", "created": 1398462520.0, "author_flair_text": null, "created_utc": 1398458920.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]