[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So... Yeah a good start might be by saying that I no longer see any reason to live. Why ? Well, there are sadly to many reasons for that. But lets start from the beginning.&lt;/p&gt;\n\n&lt;p&gt;The 26th of november 2013. About half a year ago back I met this girl online. I has always been a lonely person, never really seen a reason to meet other people or anything, just being lonely infront of the computer was my thing. That&amp;#39;s where I felt comfortable &amp;amp; how I liked it best. But deep down inside I felt a strong wanting for something more - for someone that I could share my life with. So I found this wonderful girlfriend online, she was so incredibly nice against me and listened to all I had to say and really cared about me and listened to everything I had to say about my past and was there for me (My father died from drug abuse 2011 &amp;amp; I had a pretty hard time with a diagnosis I got back then as well) so well yeah, she was there for me and I was there for her as she had a few problems herself. So just after a couple of days of constant talking... I guess I just felt in my heart that she was the right one. The words &amp;quot; I love you &amp;quot; flew from her screen to mine and I replied with the same. Because it really felt like I did, it just felt so right. We decided we were going to meet on new years eve. But we came across some minor issues until then, we had some small fights, but I guess I didn&amp;#39;t think to much about it and just waited for the day she would come to my arms. I was incredibly nervous as I&amp;#39;ve never done such a thing before, I thought of blowing it off a couple of times but never did... The day came. It didn&amp;#39;t start out very well as it had been a bad traffic accident just before so I arrived at the train station a few minutes late so she had to wait, she didn&amp;#39;t like that very much obviously, but anyway, that didn&amp;#39;t last very long. I saw her and my smile just went up to my eyes it felt like, she was so stunning and I took her in my arms as soon as I reached her and gave her a big hug. Sadly, when we get home to me... Of course I was nervous, I mean, it was a long distance relationship and I used to be very lonely, like, I only met people during the day when I was i school, but even there I prefered being by myself. So anyway, things started out very quiet... I had bought her a heart necklace and gave it to her as soon as we got home, she was so happy and we told each other that we loved each other, obviously I guess. So yeah, after that we were a little quiet, hadn&amp;#39;t had our first kiss yet... So I asked if she wanted to play some games (which we usually do when we&amp;#39;re away from each other) and she said &amp;quot;sure&amp;quot;, we sat on the bed and got the computer out... Lets just say at this time I had no idea that she had Borderline yet... We sat down and started the game. The first thing I get is a skype message from her, asking if I was still in love with her? I was surprised and put my computer on the ground and told her of course I do and don&amp;#39;t doubt it for a second, and leaned towards her for our first kiss, just to show her that I really do... But she didn&amp;#39;t accept the kiss. Instead she turned her head around, got mad at me and threw all kinds of insults at me and she said it was a misstake and wanted to go home... Okay, I was surprised. I sat down on my couch and started crying, yeah well, I&amp;#39;m a very sensitive guy, so I cried and she didn&amp;#39;t even care... She kept checking her things and just ready to burst out the door while me begging her to stay... Which after a few hours, when it was time for bed (she arrived pretty late), she did calm down. I slowly went to the bed and laid myself down beside her and just slowly, slowly, for probably an hour went in for the kiss. It was probably the best and most memorable moment of my life, I was so in love that I forgot what just happened. Her mood had changed again. She left a few days later. And then she came back about 1 month later and stayed for about 2 weeks or so before I had to go on a vacation... Those 2 weeks was wonderful, they were perfect and not a problem in sight. So, then the day came when I was going on vacation... She went berserk at me for no reason. She was so mad, asking me why I didn&amp;#39;t stay home with her, why she had to go home, that she was going to leave her if I went... I was once again surprised, incredibly. So I actually went to my parents asking them if I could just stay at home with her, but obviously they didn&amp;#39;t allow that. So yeah well, I went anyway after I had calmed her down a bit. (Bear in mind that I would only be gone for 7 days and she was going to come back the next day I came home). Under those 7 days my life was a nightmare. I couldn&amp;#39;t leave my computer or my hotel room, if I did she would start threatening me that she would cut herself etc etc... I had to eat when she was still asleep, hoping she wouldn&amp;#39;t wake up while I was gone so she would get mad. So yeah, for 7 days I was stuck in the hotel room while my family was out having a good time. This was the first time I realised that something was really wrong. One time she said she had cut herself so badly that she couldn&amp;#39;t write anymore and that she would probably going to die... And there I was, in another country and was not able to do anything, just breaking down hoping she would be okay, crying myself to sleep. But then I returned home and she went wonderful again. She came to me and well, you can guess... Her cut marks where no bigger then the scratches a cat makes - On her leg. She lied to me and made my worry myself to death thinking she would be dead by the morning. Anyways, I decided to forgive and we continued. We were then going to have our first sex together, me still a virgin as well... The day came. She asked me over and over if I wanted to do it, but I asked her if she was 110% ready for it and she said yes... So we did. During the sex I asked her over and over if she was okay and if I was doing it right, and she said that I did and all was fine... And when we were done... She was just lying there, not accepting my kisses or anything. Just just laid there and then started crying and asked me how I could do it, how I could have sex with her. I had no idea what was wrong so I started hugging her and cried as well because I hate seeing her sad... And well yeah, after about an hour or so she came back to her normal senses, and started hugging me and kissing me like nothing ever happened. Okay I thought, that was a little strange... And this went on, almost every time we had sex. I have never once in our relationship brought up that we should have sex, it&amp;#39;s her everytime. Sometimes she could just turn to me and sit right ontop of me when we were watching a movie. And after she would get so mad that I allowed her to do it. I mean, she asked me if I wanted, I asked her if she wanted, and after she just went berserk like I did every kind of bad thing I possibly could&amp;#39;ve done to her. This was pretty much always the same situation after we had sex. And that&amp;#39;s just sex... Then we have all the other stuff as well. Like when we were watching a movie for example... She was asking me from all out of nowhere in a serious and mad voice why I was sitting so close to her and why I held her and I said because I just want to make it as cozy as possible (it was a horror movie), she got mad and asked me to move a little bit away, so I did. And when I had done it she went berserk again asking how I could do it and that she thought I thought she was disgusting or something like that, and I told her that you just told me to move away... But then she got even angrier and just didn&amp;#39;t talk to me rest of the night... Until bed time again, when she was acting like nothing ever happened, like always, again. This happened pretty much every other day, always a new strange situation where she thought stuff I did was bad and she got mad. Just over and over, almost everyday. But of course I took it and apoligized to her... Because I thought it was my fault and I didn&amp;#39;t want to hurt her. I don&amp;#39;t even want to talk about when she or me had to go home... Oh god, she would say that she would never contact me once she got home or when I got home... But when she/me got home, the first thing I get is how wonderful it had been and how much she loved me. I have been SO confused... So we had been dating for about 4 months now and this had happened so many times that I had lost count and I no longer cared as much when it happened because I knew she was just going to be okay a few hours or so later. I learned how she worked... Until a few days ago. She told me she had been at the doctor and they said she was pregnant. She told me how they figured out she was pregnant and I immediatly knew she was lying. But I kept it to myself because I wanted to see for how long she was going to keep lying... She got mad when I said that it was just a big deal and that I wanted to see a pregnancy test and she logged out... I later asked her why she lied about it and she said &amp;quot;I just wanted to test you, I would be disgusted and probably would&amp;#39;ve killed myself if I were carrying your baby.&amp;quot; So yeah... I took that pretty hard as a family is something I&amp;#39;ve dreamed about for so long, something I really want. So I just gave up on everything. I started crying and I had to go see a doctor that same night to get some medicine to calm me down and I had to talk about everything... I told them I wanted to kill myself. I just loved her so much, she was my first love and I saw myself to everything she said to me, that it actually was my fault. I still see it as my fault, because she makes it seem to real even though my family and everyone keeps telling me it&amp;#39;s never my fault, it&amp;#39;s just her way to act. And lets also say that I&amp;#39;m not allowed to spend time with my family anymore, just eating dinner with them is just a big betrayal and that she hates me. Yupp, really. So, the day after she lied about being pregnant she made a fake profile trying to test me there as well and see if I were going to cheat on another girl, but I&amp;#39;m not stupid because I NEVER recieve new requests from peopple I don&amp;#39;t know on skype. So yeah, I knew there as well that it was her. I told that to her that I knew and she said it was her mothers idea and that I was a fucking idiot. For no reason, just because I knew that it was her. That&amp;#39;s the kind of stuff I had to take, everyday. I would never even think of cheating as I see that and violence as some of the worst things you could do. She has also accused me of raping her. Yeah... But after the fake profile incident I decided that I no longer could do it. I waited to the next day, when a big fight once again was going to happen... I went to bed and saw that she had deleted me from skype and facebook. So I broke up with her and changed my pictures with her to something else, just removed everything. She wrote to me seconds later asking me why I did it and I told her how it was, I loved her so much but I no longer can take her tests and her accusments of doing stuff I have never done, I just couldn&amp;#39;t anymore so I had to leave her, in hopes she would get something better someday... She said if I left her, she would kill herself. But I did, and she didn&amp;#39;t... But I feel so empty and hurt and just everything feels pointless. I loved her so much but I had to let go because I couldn&amp;#39;t take the bad times anymore, it was to much, every night we had a new fight over something old. I just couldn&amp;#39;t take it anymore. So here I am now, sitting on a stone in a forest with the computer in my lap writing this, thinking of a reason to keep living. But I just can&amp;#39;t seem to find one. It hurts to much. I love her so much but I can&amp;#39;t take it anymore... I still think all the things she said was my fault, is my fault, which makes it even harder knowing that I&amp;#39;ve hurt someone I love so much, when in reality... I probably haven&amp;#39;t, atleast everyone I&amp;#39;ve talked about it to says it&amp;#39;s not my fault, but I still don&amp;#39;t know. I&amp;#39;m just so lost and I need something to motivate me to keep on living... Because right now, I just can&amp;#39;t seem to find a reason anymore as I&amp;#39;m already dead inside from all the crap I&amp;#39;ve taken and the things I&amp;#39;ve lost. I&amp;#39;m dead. But still alive. Thinking if I should make it permanent. I need help, so badly.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 17 going to 18 in a few months and she is 19 going to 20 in a few months, if that makes any difference. It was also a LDR. More can be explained if wanted and if you want to talk in PM I can. I just need some nice person to talk to that understands me. Please help.&lt;/p&gt;\n\n&lt;p&gt;If this wasn&amp;#39;t the right subreddit to post in, please tell me a better one.&lt;/p&gt;\n\n&lt;p&gt;Thanks, have a wonderful night. Love to all of you. &lt;em&gt;Hugs&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So... Yeah a good start might be by saying that I no longer see any reason to live. Why ? Well, there are sadly to many reasons for that. But lets start from the beginning.\n\nThe 26th of november 2013. About half a year ago back I met this girl online. I has always been a lonely person, never really seen a reason to meet other people or anything, just being lonely infront of the computer was my thing. That's where I felt comfortable &amp; how I liked it best. But deep down inside I felt a strong wanting for something more - for someone that I could share my life with. So I found this wonderful girlfriend online, she was so incredibly nice against me and listened to all I had to say and really cared about me and listened to everything I had to say about my past and was there for me (My father died from drug abuse 2011 &amp; I had a pretty hard time with a diagnosis I got back then as well) so well yeah, she was there for me and I was there for her as she had a few problems herself. So just after a couple of days of constant talking... I guess I just felt in my heart that she was the right one. The words \" I love you \" flew from her screen to mine and I replied with the same. Because it really felt like I did, it just felt so right. We decided we were going to meet on new years eve. But we came across some minor issues until then, we had some small fights, but I guess I didn't think to much about it and just waited for the day she would come to my arms. I was incredibly nervous as I've never done such a thing before, I thought of blowing it off a couple of times but never did... The day came. It didn't start out very well as it had been a bad traffic accident just before so I arrived at the train station a few minutes late so she had to wait, she didn't like that very much obviously, but anyway, that didn't last very long. I saw her and my smile just went up to my eyes it felt like, she was so stunning and I took her in my arms as soon as I reached her and gave her a big hug. Sadly, when we get home to me... Of course I was nervous, I mean, it was a long distance relationship and I used to be very lonely, like, I only met people during the day when I was i school, but even there I prefered being by myself. So anyway, things started out very quiet... I had bought her a heart necklace and gave it to her as soon as we got home, she was so happy and we told each other that we loved each other, obviously I guess. So yeah, after that we were a little quiet, hadn't had our first kiss yet... So I asked if she wanted to play some games (which we usually do when we're away from each other) and she said \"sure\", we sat on the bed and got the computer out... Lets just say at this time I had no idea that she had Borderline yet... We sat down and started the game. The first thing I get is a skype message from her, asking if I was still in love with her? I was surprised and put my computer on the ground and told her of course I do and don't doubt it for a second, and leaned towards her for our first kiss, just to show her that I really do... But she didn't accept the kiss. Instead she turned her head around, got mad at me and threw all kinds of insults at me and she said it was a misstake and wanted to go home... Okay, I was surprised. I sat down on my couch and started crying, yeah well, I'm a very sensitive guy, so I cried and she didn't even care... She kept checking her things and just ready to burst out the door while me begging her to stay... Which after a few hours, when it was time for bed (she arrived pretty late), she did calm down. I slowly went to the bed and laid myself down beside her and just slowly, slowly, for probably an hour went in for the kiss. It was probably the best and most memorable moment of my life, I was so in love that I forgot what just happened. Her mood had changed again. She left a few days later. And then she came back about 1 month later and stayed for about 2 weeks or so before I had to go on a vacation... Those 2 weeks was wonderful, they were perfect and not a problem in sight. So, then the day came when I was going on vacation... She went berserk at me for no reason. She was so mad, asking me why I didn't stay home with her, why she had to go home, that she was going to leave her if I went... I was once again surprised, incredibly. So I actually went to my parents asking them if I could just stay at home with her, but obviously they didn't allow that. So yeah well, I went anyway after I had calmed her down a bit. (Bear in mind that I would only be gone for 7 days and she was going to come back the next day I came home). Under those 7 days my life was a nightmare. I couldn't leave my computer or my hotel room, if I did she would start threatening me that she would cut herself etc etc... I had to eat when she was still asleep, hoping she wouldn't wake up while I was gone so she would get mad. So yeah, for 7 days I was stuck in the hotel room while my family was out having a good time. This was the first time I realised that something was really wrong. One time she said she had cut herself so badly that she couldn't write anymore and that she would probably going to die... And there I was, in another country and was not able to do anything, just breaking down hoping she would be okay, crying myself to sleep. But then I returned home and she went wonderful again. She came to me and well, you can guess... Her cut marks where no bigger then the scratches a cat makes - On her leg. She lied to me and made my worry myself to death thinking she would be dead by the morning. Anyways, I decided to forgive and we continued. We were then going to have our first sex together, me still a virgin as well... The day came. She asked me over and over if I wanted to do it, but I asked her if she was 110% ready for it and she said yes... So we did. During the sex I asked her over and over if she was okay and if I was doing it right, and she said that I did and all was fine... And when we were done... She was just lying there, not accepting my kisses or anything. Just just laid there and then started crying and asked me how I could do it, how I could have sex with her. I had no idea what was wrong so I started hugging her and cried as well because I hate seeing her sad... And well yeah, after about an hour or so she came back to her normal senses, and started hugging me and kissing me like nothing ever happened. Okay I thought, that was a little strange... And this went on, almost every time we had sex. I have never once in our relationship brought up that we should have sex, it's her everytime. Sometimes she could just turn to me and sit right ontop of me when we were watching a movie. And after she would get so mad that I allowed her to do it. I mean, she asked me if I wanted, I asked her if she wanted, and after she just went berserk like I did every kind of bad thing I possibly could've done to her. This was pretty much always the same situation after we had sex. And that's just sex... Then we have all the other stuff as well. Like when we were watching a movie for example... She was asking me from all out of nowhere in a serious and mad voice why I was sitting so close to her and why I held her and I said because I just want to make it as cozy as possible (it was a horror movie), she got mad and asked me to move a little bit away, so I did. And when I had done it she went berserk again asking how I could do it and that she thought I thought she was disgusting or something like that, and I told her that you just told me to move away... But then she got even angrier and just didn't talk to me rest of the night... Until bed time again, when she was acting like nothing ever happened, like always, again. This happened pretty much every other day, always a new strange situation where she thought stuff I did was bad and she got mad. Just over and over, almost everyday. But of course I took it and apoligized to her... Because I thought it was my fault and I didn't want to hurt her. I don't even want to talk about when she or me had to go home... Oh god, she would say that she would never contact me once she got home or when I got home... But when she/me got home, the first thing I get is how wonderful it had been and how much she loved me. I have been SO confused... So we had been dating for about 4 months now and this had happened so many times that I had lost count and I no longer cared as much when it happened because I knew she was just going to be okay a few hours or so later. I learned how she worked... Until a few days ago. She told me she had been at the doctor and they said she was pregnant. She told me how they figured out she was pregnant and I immediatly knew she was lying. But I kept it to myself because I wanted to see for how long she was going to keep lying... She got mad when I said that it was just a big deal and that I wanted to see a pregnancy test and she logged out... I later asked her why she lied about it and she said \"I just wanted to test you, I would be disgusted and probably would've killed myself if I were carrying your baby.\" So yeah... I took that pretty hard as a family is something I've dreamed about for so long, something I really want. So I just gave up on everything. I started crying and I had to go see a doctor that same night to get some medicine to calm me down and I had to talk about everything... I told them I wanted to kill myself. I just loved her so much, she was my first love and I saw myself to everything she said to me, that it actually was my fault. I still see it as my fault, because she makes it seem to real even though my family and everyone keeps telling me it's never my fault, it's just her way to act. And lets also say that I'm not allowed to spend time with my family anymore, just eating dinner with them is just a big betrayal and that she hates me. Yupp, really. So, the day after she lied about being pregnant she made a fake profile trying to test me there as well and see if I were going to cheat on another girl, but I'm not stupid because I NEVER recieve new requests from peopple I don't know on skype. So yeah, I knew there as well that it was her. I told that to her that I knew and she said it was her mothers idea and that I was a fucking idiot. For no reason, just because I knew that it was her. That's the kind of stuff I had to take, everyday. I would never even think of cheating as I see that and violence as some of the worst things you could do. She has also accused me of raping her. Yeah... But after the fake profile incident I decided that I no longer could do it. I waited to the next day, when a big fight once again was going to happen... I went to bed and saw that she had deleted me from skype and facebook. So I broke up with her and changed my pictures with her to something else, just removed everything. She wrote to me seconds later asking me why I did it and I told her how it was, I loved her so much but I no longer can take her tests and her accusments of doing stuff I have never done, I just couldn't anymore so I had to leave her, in hopes she would get something better someday... She said if I left her, she would kill herself. But I did, and she didn't... But I feel so empty and hurt and just everything feels pointless. I loved her so much but I had to let go because I couldn't take the bad times anymore, it was to much, every night we had a new fight over something old. I just couldn't take it anymore. So here I am now, sitting on a stone in a forest with the computer in my lap writing this, thinking of a reason to keep living. But I just can't seem to find one. It hurts to much. I love her so much but I can't take it anymore... I still think all the things she said was my fault, is my fault, which makes it even harder knowing that I've hurt someone I love so much, when in reality... I probably haven't, atleast everyone I've talked about it to says it's not my fault, but I still don't know. I'm just so lost and I need something to motivate me to keep on living... Because right now, I just can't seem to find a reason anymore as I'm already dead inside from all the crap I've taken and the things I've lost. I'm dead. But still alive. Thinking if I should make it permanent. I need help, so badly.\n\nI'm 17 going to 18 in a few months and she is 19 going to 20 in a few months, if that makes any difference. It was also a LDR. More can be explained if wanted and if you want to talk in PM I can. I just need some nice person to talk to that understands me. Please help.\n\nIf this wasn't the right subreddit to post in, please tell me a better one.\n\nThanks, have a wonderful night. Love to all of you. *Hugs*", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24mv9m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "voorkio", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24mv9m/just_broke_up_with_my_borderline_girlfriend/", "name": "t3_24mv9m", "created": 1399168774.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24mv9m/just_broke_up_with_my_borderline_girlfriend/", "author_flair_text": null, "title": "Just broke up with my borderline girlfriend...", "created_utc": 1399139974.0, "ups": 2, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8qo6e", "gilded": 0, "author": "circinia", "parent_id": "t1_ch8q3gv", "approved_by": null, "body": "I hope you'll manage to get through it, too! Life is full of experiences of loving things and learning things and losing things, and at times when there's a lot of the latter it can be hard to believe you'll ever get back to the good side of it. The journey, however, is generally worthwhile. &lt;3", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you&amp;#39;ll manage to get through it, too! Life is full of experiences of loving things and learning things and losing things, and at times when there&amp;#39;s a lot of the latter it can be hard to believe you&amp;#39;ll ever get back to the good side of it. The journey, however, is generally worthwhile. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mv9m", "score_hidden": false, "name": "t1_ch8qo6e", "created": 1399177119.0, "author_flair_text": null, "created_utc": 1399148319.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8q3gv", "gilded": 0, "author": "voorkio", "parent_id": "t1_ch8pl7k", "approved_by": null, "body": "Thank you so so much for your reply, it means a lot to me. Saying all these things I really need to hear right now... It's just so hard right now. But hopefully I'll manage to get through it. But I'm just so empty inside right now and the road back to finding myself again is long, but I'll do it somehow, hopefully. I've learned a lot from this relationship but I've also lost so many things. Thanks again for you reply, it means so much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so so much for your reply, it means a lot to me. Saying all these things I really need to hear right now... It&amp;#39;s just so hard right now. But hopefully I&amp;#39;ll manage to get through it. But I&amp;#39;m just so empty inside right now and the road back to finding myself again is long, but I&amp;#39;ll do it somehow, hopefully. I&amp;#39;ve learned a lot from this relationship but I&amp;#39;ve also lost so many things. Thanks again for you reply, it means so much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mv9m", "score_hidden": false, "name": "t1_ch8q3gv", "created": 1399175578.0, "author_flair_text": null, "created_utc": 1399146778.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch8pl7k", "gilded": 0, "author": "circinia", "parent_id": "t3_24mv9m", "approved_by": null, "body": "(((hugs))) I'm so sorry you're going through this. What everyone has said about this situation is right on; it's not in any way your fault that things happened the way they did. For someone with borderline personality disorder, having a stable and loving relationship can be very difficult; if it's possible it generally requires a lot of work in therapy--and applying that work to their life--by the person with BPD. \n\nI know that doesn't make it any easier to end a relationship with someone you genuinely loved, or to be able to imagine ever loving anyone else. You've made a lot of good but difficult choices, both in ending the relationship and in asking for help.\n\nThis relationship--although it was deeply problematic--has shown to you your capacity to love, and to take joy in loving; and that you have the ability to connect deeply with other people. Ending this relationship does not end those abilities; you'll be able to take them with you into the future. But it's understandable for it to hurt too much right now.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(((hugs))) I&amp;#39;m so sorry you&amp;#39;re going through this. What everyone has said about this situation is right on; it&amp;#39;s not in any way your fault that things happened the way they did. For someone with borderline personality disorder, having a stable and loving relationship can be very difficult; if it&amp;#39;s possible it generally requires a lot of work in therapy--and applying that work to their life--by the person with BPD. &lt;/p&gt;\n\n&lt;p&gt;I know that doesn&amp;#39;t make it any easier to end a relationship with someone you genuinely loved, or to be able to imagine ever loving anyone else. You&amp;#39;ve made a lot of good but difficult choices, both in ending the relationship and in asking for help.&lt;/p&gt;\n\n&lt;p&gt;This relationship--although it was deeply problematic--has shown to you your capacity to love, and to take joy in loving; and that you have the ability to connect deeply with other people. Ending this relationship does not end those abilities; you&amp;#39;ll be able to take them with you into the future. But it&amp;#39;s understandable for it to hurt too much right now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mv9m", "score_hidden": false, "name": "t1_ch8pl7k", "created": 1399174241.0, "author_flair_text": null, "created_utc": 1399145441.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfnz4m", "gilded": 0, "author": "socrateshaditright", "parent_id": "t3_24mv9m", "approved_by": null, "body": "Hi there. BPD is a really difficult illness to deal with, for relationships, and for the individual. I'm really sorry that this has happened to you. Our experiences here are so incredibly similar, and I feel so strongly with you. If you want to further discuss this, or need someone to talk to you can PM me whenever. I have BPD, my boyfriend just ended our relationship two months ago, and I'm still not over it, either. It's really tough. I'm here for you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. BPD is a really difficult illness to deal with, for relationships, and for the individual. I&amp;#39;m really sorry that this has happened to you. Our experiences here are so incredibly similar, and I feel so strongly with you. If you want to further discuss this, or need someone to talk to you can PM me whenever. I have BPD, my boyfriend just ended our relationship two months ago, and I&amp;#39;m still not over it, either. It&amp;#39;s really tough. I&amp;#39;m here for you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24mv9m", "score_hidden": false, "name": "t1_chfnz4m", "created": 1399893305.0, "author_flair_text": null, "created_utc": 1399864505.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]