[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My new life insurance starts soon, and I will at least be able to leave my daughter with some money. There are these cliffs that are very easy to drunkenly slip and drive down.  So 5 years of a relationship that change me into a better person, and then tore my heart out. I had a kid at age 19. I gave up on &amp;quot;partying&amp;quot; That was never a problem she was worth it to me. I got lucky, worked my ass off starting at 10$ an hour. Now I make 35 an hour. I have never been able to fully put the wall down. \nThis apparently made her feel lonely, and she found &amp;quot;help&amp;quot;. I found out shortly after she cheated, and we decided to work through it.  Camping trip 2 weeks later, and I wake up IN THE SAME FUCKING TENT to the heavy breathing of her and our mutual friend. Well 2 years go by of apologies and attempts to forgive her, and trust with my feelings.\nShe does nothing to proactively make her self trustworthy.\nWe break up, and I move.\nI come home from work 2 months later to see her sitting on my doorstep crying, about to be kicked out of her parents house.\nI am weak, and scared. I let her in, and she has been living with me for the past 6 months in my spare room.\nWe talked alot, and had a  mutual agreement that neither of us would see anyone during her stay. (like I had much interest in love anyway)\nwell I finally gathered the strength to break through my wall, and tell her about the scared little boy inside. The person who went through numerous trauma as a child, and trusts nothing and no one.\nI tell her I need help, and that she is the only person I feel can stop me from totally isolating myself. Well I came out sounding more pathetic than I wanted, barely got the actual point across, and she took it as a sad attempt to win her back. I WILL NOT watch my daughter and the woman I love go live a happy life with someone else. I cannot do it. I have nightmares, anxiety, my will to do anything comes and goes. mid sentence. The only thing I can do is give them some $$ on the way out. It&amp;#39;s all I was every good for anyway.&lt;/p&gt;\n\n&lt;p&gt;sorry to anyone who dares to read this wall of text. sorry for not grammar, or spell checking myself. I&amp;#39;m sure you understand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My new life insurance starts soon, and I will at least be able to leave my daughter with some money. There are these cliffs that are very easy to drunkenly slip and drive down.  So 5 years of a relationship that change me into a better person, and then tore my heart out. I had a kid at age 19. I gave up on \"partying\" That was never a problem she was worth it to me. I got lucky, worked my ass off starting at 10$ an hour. Now I make 35 an hour. I have never been able to fully put the wall down. \nThis apparently made her feel lonely, and she found \"help\". I found out shortly after she cheated, and we decided to work through it.  Camping trip 2 weeks later, and I wake up IN THE SAME FUCKING TENT to the heavy breathing of her and our mutual friend. Well 2 years go by of apologies and attempts to forgive her, and trust with my feelings.\nShe does nothing to proactively make her self trustworthy.\nWe break up, and I move.\nI come home from work 2 months later to see her sitting on my doorstep crying, about to be kicked out of her parents house.\nI am weak, and scared. I let her in, and she has been living with me for the past 6 months in my spare room.\nWe talked alot, and had a  mutual agreement that neither of us would see anyone during her stay. (like I had much interest in love anyway)\nwell I finally gathered the strength to break through my wall, and tell her about the scared little boy inside. The person who went through numerous trauma as a child, and trusts nothing and no one.\nI tell her I need help, and that she is the only person I feel can stop me from totally isolating myself. Well I came out sounding more pathetic than I wanted, barely got the actual point across, and she took it as a sad attempt to win her back. I WILL NOT watch my daughter and the woman I love go live a happy life with someone else. I cannot do it. I have nightmares, anxiety, my will to do anything comes and goes. mid sentence. The only thing I can do is give them some $$ on the way out. It's all I was every good for anyway.\n\nsorry to anyone who dares to read this wall of text. sorry for not grammar, or spell checking myself. I'm sure you understand.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "247rpy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "killmekillmekillmepl", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/247rpy/just_want_to_share_my_story/", "name": "t3_247rpy", "created": 1398745286.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/247rpy/just_want_to_share_my_story/", "author_flair_text": null, "title": "Just want to share my story", "created_utc": 1398716486.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4fj1v", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4favh", "approved_by": null, "body": "It my be the case that the thing that motivated you in the past has gone, but that does not mean you have nothing left. I don't know what it's like to have a child, so this may sound like crap coming from me, sorry if it does, but if I were in your position I would want to do the best I could for your daughter. I know having a family with separated parents is not ideal, but having two parents who love her is better than other situations.\n\nI think what I'm trying to say is, I know it's hard to do this without a reason to fight for, and I'm sorry your wife has done these things to you, but you are still family for your daughter and that's got to be worth something. Also, and this shouldn't be your primary concern right now, but I know a lot of life insurance policies don't pay out for suicide.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It my be the case that the thing that motivated you in the past has gone, but that does not mean you have nothing left. I don&amp;#39;t know what it&amp;#39;s like to have a child, so this may sound like crap coming from me, sorry if it does, but if I were in your position I would want to do the best I could for your daughter. I know having a family with separated parents is not ideal, but having two parents who love her is better than other situations.&lt;/p&gt;\n\n&lt;p&gt;I think what I&amp;#39;m trying to say is, I know it&amp;#39;s hard to do this without a reason to fight for, and I&amp;#39;m sorry your wife has done these things to you, but you are still family for your daughter and that&amp;#39;s got to be worth something. Also, and this shouldn&amp;#39;t be your primary concern right now, but I know a lot of life insurance policies don&amp;#39;t pay out for suicide.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rpy", "score_hidden": false, "name": "t1_ch4fj1v", "created": 1398721489.0, "author_flair_text": null, "created_utc": 1398717889.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4favh", "gilded": 0, "author": "killmekillmekillmepl", "parent_id": "t1_ch4ezto", "approved_by": null, "body": "Thanks, I have been battling depression for years before I met her. It always feels like a series of staires, always increasing in height. You fall harder each time, and a longer climb to the top. I have fought that, and still can. The problem is the one thing that has motiviated, and made me who I am is gone. The only thing I care about is my family. now I feel like I was just a loan shark who let someone freeload at my place for 6 months, and now wants to take the kid and leave her with nothing.\nShe has no job, no skills. But she is her mother. I can't take her away from her mom, and coming from a broken family I can't let her deal with that either. My only option it seems is to leave the picture, and provide from her from afar. whether that is from another state, or a big check on my way to the black.... I just can't find anything in the former option.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I have been battling depression for years before I met her. It always feels like a series of staires, always increasing in height. You fall harder each time, and a longer climb to the top. I have fought that, and still can. The problem is the one thing that has motiviated, and made me who I am is gone. The only thing I care about is my family. now I feel like I was just a loan shark who let someone freeload at my place for 6 months, and now wants to take the kid and leave her with nothing.\nShe has no job, no skills. But she is her mother. I can&amp;#39;t take her away from her mom, and coming from a broken family I can&amp;#39;t let her deal with that either. My only option it seems is to leave the picture, and provide from her from afar. whether that is from another state, or a big check on my way to the black.... I just can&amp;#39;t find anything in the former option.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rpy", "score_hidden": false, "name": "t1_ch4favh", "created": 1398721044.0, "author_flair_text": null, "created_utc": 1398717444.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4ezto", "gilded": 0, "author": "[deleted]", "parent_id": "t3_247rpy", "approved_by": null, "body": "Man, I'm so sorry you're feeling this way. I've never been married myself, or had a child, so I can't say I understand what you're going through, but feeling isolates, feeling alone, and feeling like I need a way out is all too familiar to me. I know this may not be what you want to hear right now, but there is always something else you can do about all this. You've had to put up with a lot, I realise that, but honestly, talking through these problems with someone can help. I know I'm no substitute for an professional, but I know how hard it can be to go see someone like that sometimes, so if you want someone to talk to about some of this, I'm here to listen and do what I can to help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, I&amp;#39;m so sorry you&amp;#39;re feeling this way. I&amp;#39;ve never been married myself, or had a child, so I can&amp;#39;t say I understand what you&amp;#39;re going through, but feeling isolates, feeling alone, and feeling like I need a way out is all too familiar to me. I know this may not be what you want to hear right now, but there is always something else you can do about all this. You&amp;#39;ve had to put up with a lot, I realise that, but honestly, talking through these problems with someone can help. I know I&amp;#39;m no substitute for an professional, but I know how hard it can be to go see someone like that sometimes, so if you want someone to talk to about some of this, I&amp;#39;m here to listen and do what I can to help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247rpy", "score_hidden": false, "name": "t1_ch4ezto", "created": 1398720434.0, "author_flair_text": null, "created_utc": 1398716834.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]