[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all.  Her and I were talking for about a month or so, and it was going really great.  Had a lot in common, seemed to really understand eachother, etc etc. Eventually her and I got to talking about what she found attractive.  She hesitated, and told me she would rather not say.  When I finally got the answer, she came clean and said I&amp;#39;m not attractive to her.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve posted here before and this is not a throwaway, as let&amp;#39;s face it, who the fuck cares who knows at this point.  As such I already had my issues and suicidal thoughts and this just ramped it up to a level I have not felt in a very long time.  The choice to me is quite clear now.  I will kill myself.  I will.  I don&amp;#39;t yet know how, or when, but I will.  I would love for someone to prove me wrong and convince me to actually stay alive, but obviously I&amp;#39;m skeptical of that happening.  &lt;/p&gt;\n\n&lt;p&gt;A part of me still thinks it&amp;#39;s unreasonable she doesn&amp;#39;t find me attractive, as I really don&amp;#39;t think I&amp;#39;m hideous looking.  But at the same time I&amp;#39;m not muscular or wealthy and I guess that&amp;#39;s all women want.  Life and sex as a whole are evil.  And I&amp;#39;m done living in this evil world.  It is torture.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Title says it all.  Her and I were talking for about a month or so, and it was going really great.  Had a lot in common, seemed to really understand eachother, etc etc. Eventually her and I got to talking about what she found attractive.  She hesitated, and told me she would rather not say.  When I finally got the answer, she came clean and said I'm not attractive to her.  \n\nI've posted here before and this is not a throwaway, as let's face it, who the fuck cares who knows at this point.  As such I already had my issues and suicidal thoughts and this just ramped it up to a level I have not felt in a very long time.  The choice to me is quite clear now.  I will kill myself.  I will.  I don't yet know how, or when, but I will.  I would love for someone to prove me wrong and convince me to actually stay alive, but obviously I'm skeptical of that happening.  \n\nA part of me still thinks it's unreasonable she doesn't find me attractive, as I really don't think I'm hideous looking.  But at the same time I'm not muscular or wealthy and I guess that's all women want.  Life and sex as a whole are evil.  And I'm done living in this evil world.  It is torture.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bj2i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Brodellsky", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bj2i/just_found_out_that_the_first_girl_in_over_a_year/", "name": "t3_25bj2i", "created": 1399883422.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bj2i/just_found_out_that_the_first_girl_in_over_a_year/", "author_flair_text": null, "title": "Just found out that the first girl in over a year and a half that I've had a \"thing\" with doesn't find me attractive at all. My confidence was already uncertain but now it's destroyed.", "created_utc": 1399854622.0, "ups": 6, "num_comments": 13, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chflpr9", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chflhd6", "approved_by": null, "body": "Wow this felt like reading the words straight out of my mind.  You nailed it.  Sexuality is by nature, evil.  And I want it.  I want it so bad.  I don't want to want it.  Because as you said, it's the only thing I need that I can't provide for myself.  I've always been a leader and very independent, but unfortunately it's awfully lonely walking your own path.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this felt like reading the words straight out of my mind.  You nailed it.  Sexuality is by nature, evil.  And I want it.  I want it so bad.  I don&amp;#39;t want to want it.  Because as you said, it&amp;#39;s the only thing I need that I can&amp;#39;t provide for myself.  I&amp;#39;ve always been a leader and very independent, but unfortunately it&amp;#39;s awfully lonely walking your own path.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chflpr9", "created": 1399888092.0, "author_flair_text": null, "created_utc": 1399859292.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chflhd6", "gilded": 0, "author": "64536546345", "parent_id": "t3_25bj2i", "approved_by": null, "body": "Yeah man, sexuality is awful. People really manage to dehumanize each other with severe regularity when it comes to that topic. If it makes you feel better, even if you had those things, they'd find other dis qualifiers.  There is always someone taller, or with a larger yacht, bigger muscles, etc. I'm not sure what the answer is.  I tried a path of self-discovery, but the only thing I discovered, for the second time, was that most people won't give you the benefit of the doubt. You only get one chance, and that chance is sometimes based on factors outside your control. \n\nI understand your pain, I guess is what I am trying to say.  Sexuality is killing me.  Rotting me from the inside.  It's the one thing in life that you can't do yourself.  If I was an alien looking at the human race, I'd assume sex, and the behaviors surrounding it, were forms of war.  They involve the same \"rationale\" and raw, brute animal-ism. They both tear us from what makes us \"different\" from the animal kingdom.  I predict an eventual sexless, war-less future. The two are inseparable.  They come from the same place in the mind. It won't be a peaceful future.  We will never know peace.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah man, sexuality is awful. People really manage to dehumanize each other with severe regularity when it comes to that topic. If it makes you feel better, even if you had those things, they&amp;#39;d find other dis qualifiers.  There is always someone taller, or with a larger yacht, bigger muscles, etc. I&amp;#39;m not sure what the answer is.  I tried a path of self-discovery, but the only thing I discovered, for the second time, was that most people won&amp;#39;t give you the benefit of the doubt. You only get one chance, and that chance is sometimes based on factors outside your control. &lt;/p&gt;\n\n&lt;p&gt;I understand your pain, I guess is what I am trying to say.  Sexuality is killing me.  Rotting me from the inside.  It&amp;#39;s the one thing in life that you can&amp;#39;t do yourself.  If I was an alien looking at the human race, I&amp;#39;d assume sex, and the behaviors surrounding it, were forms of war.  They involve the same &amp;quot;rationale&amp;quot; and raw, brute animal-ism. They both tear us from what makes us &amp;quot;different&amp;quot; from the animal kingdom.  I predict an eventual sexless, war-less future. The two are inseparable.  They come from the same place in the mind. It won&amp;#39;t be a peaceful future.  We will never know peace.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chflhd6", "created": 1399887528.0, "author_flair_text": null, "created_utc": 1399858728.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfl5sr", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfkx1h", "approved_by": null, "body": "I live with my father.  My mother lives 15 minutes away, but even on mother's day, she is dead to me.  Yeah I have bucketlists, but they all require money.  And to be honest, I'm not sure those things are worth completing anyways.  I would just feel empty inside if I ever did.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live with my father.  My mother lives 15 minutes away, but even on mother&amp;#39;s day, she is dead to me.  Yeah I have bucketlists, but they all require money.  And to be honest, I&amp;#39;m not sure those things are worth completing anyways.  I would just feel empty inside if I ever did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfl5sr", "created": 1399886714.0, "author_flair_text": null, "created_utc": 1399857914.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfkx1h", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chfkm1m", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkx1h", "created": 1399886087.0, "author_flair_text": null, "created_utc": 1399857287.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfkm1m", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfkfqu", "approved_by": null, "body": "Haha.  My family has done more to support me than I deserve, especially as no, they no longer have the funds to help me out.  I've already had to borrow money from a friend just to eat and have a little gas money.  I have applied everywhere.  Nobody wants some loser 20 year old white kid that isn't in college and can't afford college.  I've worked so many crap jobs in my life (8...since I was 15.  yeah) I know what happens.  I get taken advantage of, get paid slave wage, and end up hating myself and the world even more.  There is no option but suicide.  I don't feel guilty for wanting to kill myself.  I was forced into this life and I have the knowhow and ability to force myself out.  And that's still what I intend to do.  Thanks anyways, man.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha.  My family has done more to support me than I deserve, especially as no, they no longer have the funds to help me out.  I&amp;#39;ve already had to borrow money from a friend just to eat and have a little gas money.  I have applied everywhere.  Nobody wants some loser 20 year old white kid that isn&amp;#39;t in college and can&amp;#39;t afford college.  I&amp;#39;ve worked so many crap jobs in my life (8...since I was 15.  yeah) I know what happens.  I get taken advantage of, get paid slave wage, and end up hating myself and the world even more.  There is no option but suicide.  I don&amp;#39;t feel guilty for wanting to kill myself.  I was forced into this life and I have the knowhow and ability to force myself out.  And that&amp;#39;s still what I intend to do.  Thanks anyways, man.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkm1m", "created": 1399885331.0, "author_flair_text": null, "created_utc": 1399856531.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfkfqu", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chfkcgy", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkfqu", "created": 1399884897.0, "author_flair_text": null, "created_utc": 1399856097.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfkcgy", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfk7qs", "approved_by": null, "body": "I'm unemployed, in fact I'm so out of money that my bank has been charging me overdraft fees every few days, so even when I can finally get a paycheck somewhere it will be for nothing but some stupid greedy bank that feels it needs money more than a 20 year old on the edge of homelessness.  This world is fucked I do not want any part of it anymore.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m unemployed, in fact I&amp;#39;m so out of money that my bank has been charging me overdraft fees every few days, so even when I can finally get a paycheck somewhere it will be for nothing but some stupid greedy bank that feels it needs money more than a 20 year old on the edge of homelessness.  This world is fucked I do not want any part of it anymore.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkcgy", "created": 1399884672.0, "author_flair_text": null, "created_utc": 1399855872.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfk7qs", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25bj2i", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfk7qs", "created": 1399884341.0, "author_flair_text": null, "created_utc": 1399855541.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chflm0w", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chflbsi", "approved_by": null, "body": "Fair enough. I just thought I'd chime in from a similar situation but with a different worldview. Wish you the best of luck, wherever that takes you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. I just thought I&amp;#39;d chime in from a similar situation but with a different worldview. Wish you the best of luck, wherever that takes you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chflm0w", "created": 1399887846.0, "author_flair_text": null, "created_utc": 1399859046.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chflbsi", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfl5rm", "approved_by": null, "body": "Unfortunately, I can.  Depression to me is the world without a filtered lens.  When you see the widespread suffering, the injustices, the pitiful existence that I call myself, it's easy to see that the world is a terrible, terrible place.  Life was never \"meant\" to exist, it just sort of happened.  As such, this world, and the universe, was not made for us.  There is no requirement for us to be happy.  Hell, a lot of times we don't even get the chance to pursue it.  For every winner, there must be a loser.  I've accepted the fact that I am a loser.  I've accepted that I no longer want to live.  I just wish it was acceptable to the rest of the world, but leave it to this evil existence to try and convince me to continue to suffer.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately, I can.  Depression to me is the world without a filtered lens.  When you see the widespread suffering, the injustices, the pitiful existence that I call myself, it&amp;#39;s easy to see that the world is a terrible, terrible place.  Life was never &amp;quot;meant&amp;quot; to exist, it just sort of happened.  As such, this world, and the universe, was not made for us.  There is no requirement for us to be happy.  Hell, a lot of times we don&amp;#39;t even get the chance to pursue it.  For every winner, there must be a loser.  I&amp;#39;ve accepted the fact that I am a loser.  I&amp;#39;ve accepted that I no longer want to live.  I just wish it was acceptable to the rest of the world, but leave it to this evil existence to try and convince me to continue to suffer.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chflbsi", "created": 1399887133.0, "author_flair_text": null, "created_utc": 1399858333.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfl5rm", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chfkqq9", "approved_by": null, "body": "Thanks for the well wishes. It's not that I disagree with you ultimate conclusion, I just don't think it's fair to lump everyone into the same pot because of the actions of a few people. We suicidally depressed people are a weird lot. Maybe that's the sort of person we just naturally draw? I think we're ultimately givers at heart, and since we're so wrapped up in our neuroses and issues, we would never run into another group of givers, so it only seems like the world is full of takers. \n\nIt's not a concrete rule by any means, and hell, it may just be rationalization, but I just can't believe that the entire world is horrible, even if my own life is. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the well wishes. It&amp;#39;s not that I disagree with you ultimate conclusion, I just don&amp;#39;t think it&amp;#39;s fair to lump everyone into the same pot because of the actions of a few people. We suicidally depressed people are a weird lot. Maybe that&amp;#39;s the sort of person we just naturally draw? I think we&amp;#39;re ultimately givers at heart, and since we&amp;#39;re so wrapped up in our neuroses and issues, we would never run into another group of givers, so it only seems like the world is full of takers. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not a concrete rule by any means, and hell, it may just be rationalization, but I just can&amp;#39;t believe that the entire world is horrible, even if my own life is. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfl5rm", "created": 1399886710.0, "author_flair_text": null, "created_utc": 1399857910.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfkqq9", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfkm42", "approved_by": null, "body": "Wow I feel like that is *exactly* what she did to me, too.  Internet hugs, bro.  And happy birthday from a random suicidal guy on the internet, for what that's worth.  \n\nIs it really not indicative of the world we live in?  It's a dog eat dog world, it's kill or be killed.  I don't want to stay here because even if it is just me, the only way out of this body is death.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow I feel like that is &lt;em&gt;exactly&lt;/em&gt; what she did to me, too.  Internet hugs, bro.  And happy birthday from a random suicidal guy on the internet, for what that&amp;#39;s worth.  &lt;/p&gt;\n\n&lt;p&gt;Is it really not indicative of the world we live in?  It&amp;#39;s a dog eat dog world, it&amp;#39;s kill or be killed.  I don&amp;#39;t want to stay here because even if it is just me, the only way out of this body is death.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkqq9", "created": 1399885651.0, "author_flair_text": null, "created_utc": 1399856851.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfkm42", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25bj2i", "approved_by": null, "body": "I had sort of the same situation with a girl. Since I'm a completely self-loathing person who views any interest in me as some sort of plan to eventually humiliate me, it took her a while to break down my walls. Turns out I was just a foil to prop up her self esteem, and my value was in proving to herself how desirable she was while simultaneously not being attracted to me and stringing me along. \n\nIt's insane, but today was my birthday and it tears me up that she didn't even bother to text. I guess what I'm saying is that we're all insane when it comes to things like this. It's not indicative of the world, just ourselves. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had sort of the same situation with a girl. Since I&amp;#39;m a completely self-loathing person who views any interest in me as some sort of plan to eventually humiliate me, it took her a while to break down my walls. Turns out I was just a foil to prop up her self esteem, and my value was in proving to herself how desirable she was while simultaneously not being attracted to me and stringing me along. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s insane, but today was my birthday and it tears me up that she didn&amp;#39;t even bother to text. I guess what I&amp;#39;m saying is that we&amp;#39;re all insane when it comes to things like this. It&amp;#39;s not indicative of the world, just ourselves. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfkm42", "created": 1399885335.0, "author_flair_text": null, "created_utc": 1399856535.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfu2tm", "gilded": 0, "author": "Altruizzy", "parent_id": "t1_chfpith", "approved_by": null, "body": "Well if you are struggling with confidence and internal demons that isnt gonna be fair to anyone u date. Gotta get some of that stuff a little more squared away:) Does that help?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if you are struggling with confidence and internal demons that isnt gonna be fair to anyone u date. Gotta get some of that stuff a little more squared away:) Does that help?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfu2tm", "created": 1399917275.0, "author_flair_text": null, "created_utc": 1399888475.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfpith", "gilded": 0, "author": "Brodellsky", "parent_id": "t1_chfon7d", "approved_by": null, "body": "I used to but once my parents saw the bill they put a stop to that real quick. And I dont even know with her. She said she was being honest. And it hurts.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to but once my parents saw the bill they put a stop to that real quick. And I dont even know with her. She said she was being honest. And it hurts.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfpith", "created": 1399897394.0, "author_flair_text": null, "created_utc": 1399868594.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfon7d", "gilded": 0, "author": "Altruizzy", "parent_id": "t3_25bj2i", "approved_by": null, "body": "Maybe she is being passive aggressive and trying to push your buttons. Even if you could you don't want to force a relationship. You want it to happen naturally. Sounds to me yoy need to re-evaluate the way you are thinking about things. How about getting a therapist?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe she is being passive aggressive and trying to push your buttons. Even if you could you don&amp;#39;t want to force a relationship. You want it to happen naturally. Sounds to me yoy need to re-evaluate the way you are thinking about things. How about getting a therapist?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bj2i", "score_hidden": false, "name": "t1_chfon7d", "created": 1399895005.0, "author_flair_text": null, "created_utc": 1399866205.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]