[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll try to keep it brief. I have something called alopecia so I am balding in random spots on my head at age 16. All my friends have drifted away from me in the past month or so, it&amp;#39;d gotten to the point where they just ignore me. Get new friends? Yeah cuz people are lining up to be friends with the bald kid. My grades are absolute shit, my parents won&amp;#39;t even let me work out, I have to study constantly. My life isn&amp;#39;t worth living, but there&amp;#39;s a part of me that doubts that, thought I&amp;#39;d give this a chance. In my hands I have about 3 grams of codeine and a ton more percocet just to be sure I die&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll try to keep it brief. I have something called alopecia so I am balding in random spots on my head at age 16. All my friends have drifted away from me in the past month or so, it'd gotten to the point where they just ignore me. Get new friends? Yeah cuz people are lining up to be friends with the bald kid. My grades are absolute shit, my parents won't even let me work out, I have to study constantly. My life isn't worth living, but there's a part of me that doubts that, thought I'd give this a chance. In my hands I have about 3 grams of codeine and a ton more percocet just to be sure I die", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24lyno", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "hjkjggukjbd", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24lyno/just_want_out/", "name": "t3_24lyno", "created": 1399134726.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24lyno/just_want_out/", "author_flair_text": null, "title": "Just want out", "created_utc": 1399105926.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8f0wu", "gilded": 0, "author": "Throwawaystartover", "parent_id": "t3_24lyno", "approved_by": null, "body": "You literally have your whole life ahead of you. Being bald at 16 can be rough I'm sure, but it's not as odd as you think. I think you should explain to your parents how you're really feeling and tell them working out would be like an escape from everything.\n\nAll I can really say is if people don't want to be your friend because you're bald, fuck them. You'll be amazed at how much people are going to mature in the next 3 years of your life.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You literally have your whole life ahead of you. Being bald at 16 can be rough I&amp;#39;m sure, but it&amp;#39;s not as odd as you think. I think you should explain to your parents how you&amp;#39;re really feeling and tell them working out would be like an escape from everything.&lt;/p&gt;\n\n&lt;p&gt;All I can really say is if people don&amp;#39;t want to be your friend because you&amp;#39;re bald, fuck them. You&amp;#39;ll be amazed at how much people are going to mature in the next 3 years of your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lyno", "score_hidden": false, "name": "t1_ch8f0wu", "created": 1399135161.0, "author_flair_text": null, "created_utc": 1399106361.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8f1mg", "gilded": 0, "author": "neeeeeedhelp", "parent_id": "t3_24lyno", "approved_by": null, "body": "This kind of weird, I went through the exact same thing.. I lost my hair at 14 due to health conditions and it was fully gone at 15 (Its never going grow back). I won't lie to you, it crushed me and still I have troubles with it today. However, the thing I regret most is the degree I let it affect me. I took many drug overdoses on alcohol, painkillers and sleeping pills but the thing that occurred to me every time I did it was I haven't tried hard engough to prove myself to everybody. I want to show everybody what I'm capable of despite the things that may limit me. I wanted to showed them that I can do better than thing even with my difficulties.  I let it literally DESTROY my school grades, I developed mental health difficulties that are haunting me today. I have other health problems as well and stack on top of each other it was just awful. I know it's hard to say and it'll be hard to do considering your predicament and the feelings you're having. But I suggest that you just TRY so hard, even harder than anyone else in order to succeed in life. Don't let your suffering be in vein. Start to turn your life around at school, study like mad even if you don't feel like it. Also you should hit the gym, it will make you feel more confident and happier once you start to develop a nice physique. I wish I could have gave myself this advice when I was 16. ", "edited": 1399107127.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This kind of weird, I went through the exact same thing.. I lost my hair at 14 due to health conditions and it was fully gone at 15 (Its never going grow back). I won&amp;#39;t lie to you, it crushed me and still I have troubles with it today. However, the thing I regret most is the degree I let it affect me. I took many drug overdoses on alcohol, painkillers and sleeping pills but the thing that occurred to me every time I did it was I haven&amp;#39;t tried hard engough to prove myself to everybody. I want to show everybody what I&amp;#39;m capable of despite the things that may limit me. I wanted to showed them that I can do better than thing even with my difficulties.  I let it literally DESTROY my school grades, I developed mental health difficulties that are haunting me today. I have other health problems as well and stack on top of each other it was just awful. I know it&amp;#39;s hard to say and it&amp;#39;ll be hard to do considering your predicament and the feelings you&amp;#39;re having. But I suggest that you just TRY so hard, even harder than anyone else in order to succeed in life. Don&amp;#39;t let your suffering be in vein. Start to turn your life around at school, study like mad even if you don&amp;#39;t feel like it. Also you should hit the gym, it will make you feel more confident and happier once you start to develop a nice physique. I wish I could have gave myself this advice when I was 16. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lyno", "score_hidden": false, "name": "t1_ch8f1mg", "created": 1399135290.0, "author_flair_text": null, "created_utc": 1399106490.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8fdd9", "gilded": 0, "author": "GrindTillShine", "parent_id": "t3_24lyno", "approved_by": null, "body": "If your friends would stop caring about you because your balding then good riddance. Those aren't real friends. Fuck em man. Once your out of high school you'll see people could care less. Hang in there my dude. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your friends would stop caring about you because your balding then good riddance. Those aren&amp;#39;t real friends. Fuck em man. Once your out of high school you&amp;#39;ll see people could care less. Hang in there my dude. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24lyno", "score_hidden": false, "name": "t1_ch8fdd9", "created": 1399137787.0, "author_flair_text": null, "created_utc": 1399108987.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]