[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I thought I&amp;#39;d write this as it might be cathartic for me. I&amp;#39;ve reached the point where I&amp;#39;m so unhappy with who I am that I just don&amp;#39;t want to carry on - stupid, selfish, angry and whatever that makes me its simply the way I feel now and have done for a while.&lt;/p&gt;\n\n&lt;p&gt;What makes how I feel worse is how lucky I am, realistically. I go to a great University, I have a loving mother and am in a position that really my life should be great. But it&amp;#39;s not, because of who I am.&lt;/p&gt;\n\n&lt;p&gt;I do nothing but waste my time and waste the time of others. Nothing I try to do do I ever fulfill as I should, I simply let things in my life drift by unattended until they reach levels that are calamitous. I wish I could drop out of University and go live somewhere quiet, away from everyone but I can&amp;#39;t bare disappointing my mum like that and being such an embarrassment. I don&amp;#39;t want to concede that I&amp;#39;m not what I and everybody else I know wishes and pretends I am, I feel like it&amp;#39;s easier to simply let myself go in the easiest way I can.&lt;/p&gt;\n\n&lt;p&gt;Sorry this is so long and rambling and that I&amp;#39;ve subjected any of you people to reading it. Its late where I am and I&amp;#39;m tired and I just wanted to write this down in some sort of public forum.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I thought I'd write this as it might be cathartic for me. I've reached the point where I'm so unhappy with who I am that I just don't want to carry on - stupid, selfish, angry and whatever that makes me its simply the way I feel now and have done for a while.\n\nWhat makes how I feel worse is how lucky I am, realistically. I go to a great University, I have a loving mother and am in a position that really my life should be great. But it's not, because of who I am.\n\nI do nothing but waste my time and waste the time of others. Nothing I try to do do I ever fulfill as I should, I simply let things in my life drift by unattended until they reach levels that are calamitous. I wish I could drop out of University and go live somewhere quiet, away from everyone but I can't bare disappointing my mum like that and being such an embarrassment. I don't want to concede that I'm not what I and everybody else I know wishes and pretends I am, I feel like it's easier to simply let myself go in the easiest way I can.\n\nSorry this is so long and rambling and that I've subjected any of you people to reading it. Its late where I am and I'm tired and I just wanted to write this down in some sort of public forum.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2536y2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "timetothrowaway3", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2536y2/just_cant_deal_with_it_anymore/", "name": "t3_2536y2", "created": 1399624067.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2536y2/just_cant_deal_with_it_anymore/", "author_flair_text": null, "title": "Just can't deal with it anymore", "created_utc": 1399595267.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd974h", "gilded": 0, "author": "OutcastedKilljoy", "parent_id": "t3_2536y2", "approved_by": null, "body": "This isn't long or rambling. You're doing fine. \nSometimes you have to live life for yourself, or else you're never going to be happy. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t long or rambling. You&amp;#39;re doing fine. \nSometimes you have to live life for yourself, or else you&amp;#39;re never going to be happy. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2536y2", "score_hidden": false, "name": "t1_chd974h", "created": 1399627553.0, "author_flair_text": null, "created_utc": 1399598753.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd9enm", "gilded": 0, "author": "Dogg_92", "parent_id": "t3_2536y2", "approved_by": null, "body": "You don't need to apologize for having to read this. That is the whole point of this subreddit, so you can come and talk about these things without people judging you :)\n\nYou also don't need to feel bad that you have a loving mother and go to a good University. Yes, those are great things. But if you are feeling depressed, you certainly don't need to feel bad about it! From what you wrote, it sounds like you are intelligent individual who is also depressed. Please don't feel guilty about that!\n\nYou say that you are not what everyone else wishes you are. What do other people wish you to be? Do other people have too high expectations for you? Or are you being pressured into studying something at University that you don't want to?\n\nI'm not in your situation, and so I'm not truly aware of what is going on. The first thing I think you should do is write a list of what you want in your life. What things do you want to do with your life? What makes you happy? Don't write what makes your mother or other people happy. Write down what is your definition of happiness. \n\nNext, try and think of one or two ways in which you can achieve your definition of happiness. Is there anything you can do to achieve your goals? \n\nLastly, please post back and update us on how you are feeling. You can ALWAYS come here and talk. Nobody will judge you. You can also PM me if you would like to talk more in private. Either way, please come back and let us know how you are feeling. I hope that you soon find the path you are meant to be on in life :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need to apologize for having to read this. That is the whole point of this subreddit, so you can come and talk about these things without people judging you :)&lt;/p&gt;\n\n&lt;p&gt;You also don&amp;#39;t need to feel bad that you have a loving mother and go to a good University. Yes, those are great things. But if you are feeling depressed, you certainly don&amp;#39;t need to feel bad about it! From what you wrote, it sounds like you are intelligent individual who is also depressed. Please don&amp;#39;t feel guilty about that!&lt;/p&gt;\n\n&lt;p&gt;You say that you are not what everyone else wishes you are. What do other people wish you to be? Do other people have too high expectations for you? Or are you being pressured into studying something at University that you don&amp;#39;t want to?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not in your situation, and so I&amp;#39;m not truly aware of what is going on. The first thing I think you should do is write a list of what you want in your life. What things do you want to do with your life? What makes you happy? Don&amp;#39;t write what makes your mother or other people happy. Write down what is your definition of happiness. &lt;/p&gt;\n\n&lt;p&gt;Next, try and think of one or two ways in which you can achieve your definition of happiness. Is there anything you can do to achieve your goals? &lt;/p&gt;\n\n&lt;p&gt;Lastly, please post back and update us on how you are feeling. You can ALWAYS come here and talk. Nobody will judge you. You can also PM me if you would like to talk more in private. Either way, please come back and let us know how you are feeling. I hope that you soon find the path you are meant to be on in life :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2536y2", "score_hidden": false, "name": "t1_chd9enm", "created": 1399627958.0, "author_flair_text": null, "created_utc": 1399599158.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]