[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 16, i am fairly clever but no work ethic. My parents expect me to do very well. I am the only person that knows my best friend is depressed (i am trying to get her to see someone) and i dont have too many friends, although i am considered popular at school?&lt;/p&gt;\n\n&lt;p&gt;I feel like i really want to just leave, the school, or just life. My parents and i never get along and i constantly fight with them. My grades are dropping at school and i am trying to fix my problems with drink and drugs.&lt;/p&gt;\n\n&lt;p&gt;Very few things make me happy and i am upset 95% of the time, i thought this was what life was like and i was just being a wimp. Recently i have self harmed but i didnt do much for me, i prefer to lash out anger on a wall.&lt;/p&gt;\n\n&lt;p&gt;Over the past few months i have started thinking suicidal thoughts and now they take up most of my day, how, when, where. But i feel like this is what normal teenage life is like. I really dont know what to do because i dont want to bother other people with my problems, and the only person i would, could be my best friend, but it would push her over the edge.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am 16, i am fairly clever but no work ethic. My parents expect me to do very well. I am the only person that knows my best friend is depressed (i am trying to get her to see someone) and i dont have too many friends, although i am considered popular at school?\n\nI feel like i really want to just leave, the school, or just life. My parents and i never get along and i constantly fight with them. My grades are dropping at school and i am trying to fix my problems with drink and drugs.\n\nVery few things make me happy and i am upset 95% of the time, i thought this was what life was like and i was just being a wimp. Recently i have self harmed but i didnt do much for me, i prefer to lash out anger on a wall.\n\nOver the past few months i have started thinking suicidal thoughts and now they take up most of my day, how, when, where. But i feel like this is what normal teenage life is like. I really dont know what to do because i dont want to bother other people with my problems, and the only person i would, could be my best friend, but it would push her over the edge.\n\nThanks in advance :)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24z74n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "16anddead", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24z74n/just_saw_a_post_that_inspired_me_to_post/", "name": "t3_24z74n", "created": 1399520280.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24z74n/just_saw_a_post_that_inspired_me_to_post/", "author_flair_text": null, "title": "Just saw a post that inspired me to post.", "created_utc": 1399491480.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcf2le", "gilded": 0, "author": "okay_go_182_41", "parent_id": "t3_24z74n", "approved_by": null, "body": "Hey, another 16 year old here.\n\nI'm not sure if it's normal for teenagers,  but this has been normal for me. I've been depressed for a while now, and the only person I ever told about it isn't around anymore (as in them not figuring out by having to take me to the hospital,  hah). I've  always been considered pretty smart as well,  but this semester 's been wrecked by being constantly on the edge of suicide. I hope that this isn't normal for the sake of everyone else, but it's all I've really known. \n\nNot trying to just blab about myself here, just trying to say that I know where you're coming from kind of. And I want you to know that  as someone that's tried it before.  The gun's always heavier when it's against your head, the pills are always harder to swallow and there's always the terrible guilty feeling from the cutting. It's easier said than done. \n\nAs for the situation with your friend,  you must mean a lot to her if you're the only person she's told. I don't think you telling her about what you're going through will put her over the edge as much as you may think.  She could even help you through it, us depressed people know a lot about how to deal with it :)\n\nI'm nit going to go preachy about drugs and drinking, since the occasional drunk still helps me mellow out. Frankly I don't mind the lighter drugs like weed or LSD, but I do recommend quitting anything harder than that. All depends on your morals though.\n\nThis may seem a bit like just rambling, or not really useful, and if it is either of those then I'm sorry and I'll delete it. Long story short, nip depression in the bud and don't bescaredto asasked help.  Your friend's there for you as much as you are for her :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, another 16 year old here.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if it&amp;#39;s normal for teenagers,  but this has been normal for me. I&amp;#39;ve been depressed for a while now, and the only person I ever told about it isn&amp;#39;t around anymore (as in them not figuring out by having to take me to the hospital,  hah). I&amp;#39;ve  always been considered pretty smart as well,  but this semester &amp;#39;s been wrecked by being constantly on the edge of suicide. I hope that this isn&amp;#39;t normal for the sake of everyone else, but it&amp;#39;s all I&amp;#39;ve really known. &lt;/p&gt;\n\n&lt;p&gt;Not trying to just blab about myself here, just trying to say that I know where you&amp;#39;re coming from kind of. And I want you to know that  as someone that&amp;#39;s tried it before.  The gun&amp;#39;s always heavier when it&amp;#39;s against your head, the pills are always harder to swallow and there&amp;#39;s always the terrible guilty feeling from the cutting. It&amp;#39;s easier said than done. &lt;/p&gt;\n\n&lt;p&gt;As for the situation with your friend,  you must mean a lot to her if you&amp;#39;re the only person she&amp;#39;s told. I don&amp;#39;t think you telling her about what you&amp;#39;re going through will put her over the edge as much as you may think.  She could even help you through it, us depressed people know a lot about how to deal with it :)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m nit going to go preachy about drugs and drinking, since the occasional drunk still helps me mellow out. Frankly I don&amp;#39;t mind the lighter drugs like weed or LSD, but I do recommend quitting anything harder than that. All depends on your morals though.&lt;/p&gt;\n\n&lt;p&gt;This may seem a bit like just rambling, or not really useful, and if it is either of those then I&amp;#39;m sorry and I&amp;#39;ll delete it. Long story short, nip depression in the bud and don&amp;#39;t bescaredto asasked help.  Your friend&amp;#39;s there for you as much as you are for her :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24z74n", "score_hidden": false, "name": "t1_chcf2le", "created": 1399546344.0, "author_flair_text": null, "created_utc": 1399517544.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]