[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not actively suicidal, but I do think I would objectively be better off dead, as would society as a whole.  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t work.  Haven&amp;#39;t had a job in six years.  The last job I had was a student helper in the library at school.  Why don&amp;#39;t I work now?  Where to start ... useless degree, &lt;em&gt;bad grades&lt;/em&gt; in useless degree, no experience, no motivation to do anything, no motivation to get out of bed or feed myself most days, the economy ... you name it, it&amp;#39;s a reason I can&amp;#39;t work.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;No friends and no money.  Related to not working, I don&amp;#39;t have any friends or any money.  The people I went to school with, &lt;em&gt;they&lt;/em&gt; have jobs, and are starting families, and have hobbies and interests and money to pursue them.  They&amp;#39;ve all moved on.  I dragged them down, they defriended me, they blocked me, they stopped returning my calls or emails or texts.  Anything they wanted to do, I&amp;#39;d have to leech off of them because I don&amp;#39;t have any money to do things with.  They stopped asking me to do things, and I don&amp;#39;t blame them, because they&amp;#39;ve got families to look after and I&amp;#39;m just a leech.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;No romance.  Ever.  Never been kissed.  Only reason I ever held hands with someone who wasn&amp;#39;t family was by accident.  I&amp;#39;m ugly, I&amp;#39;m broke, I&amp;#39;m sad, I&amp;#39;m just a fucking loser, so no one is going to have any interest in me, and I don&amp;#39;t blame them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Things are never going to get better.  Social Security denied my Disability claim for the second time today.  Maybe sixth?  I don&amp;#39;t know how it works; I got denied once, denied again, then got a lawyer and went to court and got denied &lt;em&gt;again&lt;/em&gt;, then the lawyer said we were going to apply again, and I got denied again ... and again, and had another trial in front of another judge who denied me again, according to the letter I just got.  My lawyer said he can&amp;#39;t help me any more and is going to send a letter to &amp;quot;formally withdraw&amp;quot; or something.  Disability was my one chance to have any kind of financial independence, the one shot I had to get out of my parents&amp;#39; house, and there it just went.  I can&amp;#39;t even get a job interview; I don&amp;#39;t know what an &amp;quot;Optics Assembler&amp;quot; is, why the judge thinks I can do that, or how I&amp;#39;m supposed to get one of those jobs when I can&amp;#39;t get an interview doing &lt;em&gt;retail&lt;/em&gt;--I handed my resume to the manager at one retail store, and they actually threw it away before I&amp;#39;d even left.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Family hates me.  I live with my parents.  They&amp;#39;re the only people I talk to.  They hate me and want me gone.  They don&amp;#39;t talk to me if they can avoid it, they take my clothes out of the laundry when they do a load.  When my mom read the letter I got from Social Security, she just sighed, wadded it up, handed it back to me, and left the room.  She told me to go away when I asked if she was mad.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;No hobbies or interests.  Sort of tied to the no money, but also a lack of energy or motivation.  I don&amp;#39;t &lt;em&gt;do&lt;/em&gt; anything.  I don&amp;#39;t &lt;em&gt;want&lt;/em&gt; to do anything.  I just want to not exist.  I just want to not wake up one morning.  I just want a bus to hit me or a plane to fall on me so I&amp;#39;m dead in an instant and don&amp;#39;t have to know I&amp;#39;ve got &lt;em&gt;the rest of my life&lt;/em&gt; to go through, one day at a time, with nothing to look forward to, no friends, no happiness, no one who loves me, and being a failure all the time.  I just want it to end.  But I&amp;#39;m too lazy and scared to actually &lt;em&gt;do&lt;/em&gt; anything.  &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;So, let&amp;#39;s say you were going through all that.  What would make YOU want to live through it?  I&amp;#39;ve thought about this every day for years now, and I can&amp;#39;t come up with an answer.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not actively suicidal, but I do think I would objectively be better off dead, as would society as a whole.  \n\n1. I don't work.  Haven't had a job in six years.  The last job I had was a student helper in the library at school.  Why don't I work now?  Where to start ... useless degree, *bad grades* in useless degree, no experience, no motivation to do anything, no motivation to get out of bed or feed myself most days, the economy ... you name it, it's a reason I can't work.\n\n2. No friends and no money.  Related to not working, I don't have any friends or any money.  The people I went to school with, *they* have jobs, and are starting families, and have hobbies and interests and money to pursue them.  They've all moved on.  I dragged them down, they defriended me, they blocked me, they stopped returning my calls or emails or texts.  Anything they wanted to do, I'd have to leech off of them because I don't have any money to do things with.  They stopped asking me to do things, and I don't blame them, because they've got families to look after and I'm just a leech.\n\n3. No romance.  Ever.  Never been kissed.  Only reason I ever held hands with someone who wasn't family was by accident.  I'm ugly, I'm broke, I'm sad, I'm just a fucking loser, so no one is going to have any interest in me, and I don't blame them.\n\n4. Things are never going to get better.  Social Security denied my Disability claim for the second time today.  Maybe sixth?  I don't know how it works; I got denied once, denied again, then got a lawyer and went to court and got denied *again*, then the lawyer said we were going to apply again, and I got denied again ... and again, and had another trial in front of another judge who denied me again, according to the letter I just got.  My lawyer said he can't help me any more and is going to send a letter to \"formally withdraw\" or something.  Disability was my one chance to have any kind of financial independence, the one shot I had to get out of my parents' house, and there it just went.  I can't even get a job interview; I don't know what an \"Optics Assembler\" is, why the judge thinks I can do that, or how I'm supposed to get one of those jobs when I can't get an interview doing *retail*--I handed my resume to the manager at one retail store, and they actually threw it away before I'd even left.\n\n5. Family hates me.  I live with my parents.  They're the only people I talk to.  They hate me and want me gone.  They don't talk to me if they can avoid it, they take my clothes out of the laundry when they do a load.  When my mom read the letter I got from Social Security, she just sighed, wadded it up, handed it back to me, and left the room.  She told me to go away when I asked if she was mad.\n\n6. No hobbies or interests.  Sort of tied to the no money, but also a lack of energy or motivation.  I don't *do* anything.  I don't *want* to do anything.  I just want to not exist.  I just want to not wake up one morning.  I just want a bus to hit me or a plane to fall on me so I'm dead in an instant and don't have to know I've got *the rest of my life* to go through, one day at a time, with nothing to look forward to, no friends, no happiness, no one who loves me, and being a failure all the time.  I just want it to end.  But I'm too lazy and scared to actually *do* anything.  \n\nSo, let's say you were going through all that.  What would make YOU want to live through it?  I've thought about this every day for years now, and I can't come up with an answer.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23ysho", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 5, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23ysho/just_curious_what_would_make_you_want_to_live/", "name": "t3_23ysho", "created": 1398475282.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23ysho/just_curious_what_would_make_you_want_to_live/", "author_flair_text": null, "title": "Just curious, what would make YOU want to live through this?", "created_utc": 1398446482.0, "ups": 5, "num_comments": 27, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch24uvr", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch24t56", "approved_by": null, "body": "Oh Lordy, I didn't realize how much I'd gone on--but I want you to know that I'm in your corner--I've been through what almost exactly what you're going through, it's almost a bit eerie.  So feel free to PM me about anything, even if it's just to chat and complain about doctors and SSI attorneys.  :)", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh Lordy, I didn&amp;#39;t realize how much I&amp;#39;d gone on--but I want you to know that I&amp;#39;m in your corner--I&amp;#39;ve been through what almost exactly what you&amp;#39;re going through, it&amp;#39;s almost a bit eerie.  So feel free to PM me about anything, even if it&amp;#39;s just to chat and complain about doctors and SSI attorneys.  :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch24uvr", "created": 1398469934.0, "author_flair_text": null, "created_utc": 1398466334.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch27hb1", "children": ["ch27m4j"], "name": "t1_ch27m4j", "id": "ch27m4j"}}], "after": null, "before": null}}, "saved": false, "id": "ch27hb1", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch27d1r", "approved_by": null, "body": "I never even got to talk to him, just his secretary.  I said I was sorry my parents had stopped paying him and asked if he could recommend anywhere else nearby to go to for help.  She (his secretary) said she'd ask him and they'd call me back, and they never did.  I waited two weeks and called again, this time didn't even get the secretary, just the voicemail.  I've been waiting a month now and don't think I'm ever going to hear back.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never even got to talk to him, just his secretary.  I said I was sorry my parents had stopped paying him and asked if he could recommend anywhere else nearby to go to for help.  She (his secretary) said she&amp;#39;d ask him and they&amp;#39;d call me back, and they never did.  I waited two weeks and called again, this time didn&amp;#39;t even get the secretary, just the voicemail.  I&amp;#39;ve been waiting a month now and don&amp;#39;t think I&amp;#39;m ever going to hear back.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch27hb1", "created": 1398476522.0, "author_flair_text": null, "created_utc": 1398472922.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch27d1r", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch2775b", "approved_by": null, "body": "My family is small and spread out, too, so I completely understand that.  What did you say to your psychiatrist, out of curiosity?  You can PM it to me if you don't feel comfortable saying it on the thread.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My family is small and spread out, too, so I completely understand that.  What did you say to your psychiatrist, out of curiosity?  You can PM it to me if you don&amp;#39;t feel comfortable saying it on the thread.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch27d1r", "created": 1398476237.0, "author_flair_text": null, "created_utc": 1398472637.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2775b", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch26lld", "approved_by": null, "body": "No.  My family is small and spread out, and they all hate me.  I tried to talk to my psychiatrist earlier and got nowhere, and my psychologist is angry at me because my parents never paid him for our last session.  ", "edited": 1398472597.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No.  My family is small and spread out, and they all hate me.  I tried to talk to my psychiatrist earlier and got nowhere, and my psychologist is angry at me because my parents never paid him for our last session.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch2775b", "created": 1398475828.0, "author_flair_text": null, "created_utc": 1398472228.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch26lld", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch26cfd", "approved_by": null, "body": "I completely understand about the musicology.  My mother's boyfriend is heavily into music education, so I get the scoop on music funding (or rather, lack thereof) all the time.  I also understand that you don't trust me with your locale--hell, I'm just some lady on reddit.  So no worries about that.  You might try putting your location into google along with the words 'free clinic' or 'mental health services' or 'health services'.  Even getting on just a prescription may help you to lessen your anxiety and depression to the point you can be a little more active.  You've been suffering from depression and anxiety for a long time now, and it's going to take a little bit of effort to start to affect change, but it's change that's worth it.  \nDo you have any other relatives that you trust, such as a brother or sister or grandparent or aunt or uncle that may be able to provide financial assistance for you to see a physician and transportation?  Finally, consider calling your psychiatrist or psychologists office and ask to speak with them directly.  Explain to them what you explained to me--that you're extremely depressed, that you don't have any funds to pay for medication or treatment, and that you need help.  Ask them if they know of any services in your town of which you can avail yourself--trust me, if anyone knows, they will.", "edited": 1398471863.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely understand about the musicology.  My mother&amp;#39;s boyfriend is heavily into music education, so I get the scoop on music funding (or rather, lack thereof) all the time.  I also understand that you don&amp;#39;t trust me with your locale--hell, I&amp;#39;m just some lady on reddit.  So no worries about that.  You might try putting your location into google along with the words &amp;#39;free clinic&amp;#39; or &amp;#39;mental health services&amp;#39; or &amp;#39;health services&amp;#39;.  Even getting on just a prescription may help you to lessen your anxiety and depression to the point you can be a little more active.  You&amp;#39;ve been suffering from depression and anxiety for a long time now, and it&amp;#39;s going to take a little bit of effort to start to affect change, but it&amp;#39;s change that&amp;#39;s worth it.&lt;br/&gt;\nDo you have any other relatives that you trust, such as a brother or sister or grandparent or aunt or uncle that may be able to provide financial assistance for you to see a physician and transportation?  Finally, consider calling your psychiatrist or psychologists office and ask to speak with them directly.  Explain to them what you explained to me--that you&amp;#39;re extremely depressed, that you don&amp;#39;t have any funds to pay for medication or treatment, and that you need help.  Ask them if they know of any services in your town of which you can avail yourself--trust me, if anyone knows, they will.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch26lld", "created": 1398474314.0, "author_flair_text": null, "created_utc": 1398470714.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch26cfd", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch25pjo", "approved_by": null, "body": "I *was* going to a psychiatrist and a psychologist, up until my second hearing/trial.  Then my parents stopped paying so I had to stop going.  \n\nMy degree is in Musicology, and even there I barely scraped by with a 2.7 GPA (so yes, I was a c-major).  To go anywhere or do anything with a Musicology degree, I'd have to go to grad school or not get terrifying stage fright whenever I'm in front of a room of people I don't know, and neither of those are going to happen, period.  The first thing I did after getting my diploma (actually before I got it, because my school handed out empty cardboard tubes at the ceremony, as if to tell us none of us were ever going anywhere in life) was smash my violin because I was *sick* of music and everything to do with it by then.\n\nI don't live anywhere near a bus line, sorry, and even if I did I just can't get on a bus full of strangers.\n\nThe last three times I asked my parents if there was anything I could do around the house, they said no.  Even today.  I tried doing chores earlier, but I always forgot or gave up halfway through, so they don't trust me to do anything, and I can't say I blame them.  They had to replace the trash can last year after they left for a week and trusted me to take out the trash, and I just couldn't.  By the time they got back, the smell was so bad I was just lying and crying in my room and the can was full of flies and maggots.  I wouldn't trust anyone who fucked up taking out the trash that badly.\n\nI'm not comfortable telling you where I live, either.  I've had a couple people PM me in response to this thread and even that is making me edgy and jumpy, because it feels like my privacy has been invaded (and I know how fucking stupid it is for me to think that, so please don't go on and on about it).\n\nSorry, I'm getting too wound up between this and my parents arguing outside.  My hands are shaking and I literally saw red for a second.  I need to take a break now.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I &lt;em&gt;was&lt;/em&gt; going to a psychiatrist and a psychologist, up until my second hearing/trial.  Then my parents stopped paying so I had to stop going.  &lt;/p&gt;\n\n&lt;p&gt;My degree is in Musicology, and even there I barely scraped by with a 2.7 GPA (so yes, I was a c-major).  To go anywhere or do anything with a Musicology degree, I&amp;#39;d have to go to grad school or not get terrifying stage fright whenever I&amp;#39;m in front of a room of people I don&amp;#39;t know, and neither of those are going to happen, period.  The first thing I did after getting my diploma (actually before I got it, because my school handed out empty cardboard tubes at the ceremony, as if to tell us none of us were ever going anywhere in life) was smash my violin because I was &lt;em&gt;sick&lt;/em&gt; of music and everything to do with it by then.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t live anywhere near a bus line, sorry, and even if I did I just can&amp;#39;t get on a bus full of strangers.&lt;/p&gt;\n\n&lt;p&gt;The last three times I asked my parents if there was anything I could do around the house, they said no.  Even today.  I tried doing chores earlier, but I always forgot or gave up halfway through, so they don&amp;#39;t trust me to do anything, and I can&amp;#39;t say I blame them.  They had to replace the trash can last year after they left for a week and trusted me to take out the trash, and I just couldn&amp;#39;t.  By the time they got back, the smell was so bad I was just lying and crying in my room and the can was full of flies and maggots.  I wouldn&amp;#39;t trust anyone who fucked up taking out the trash that badly.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not comfortable telling you where I live, either.  I&amp;#39;ve had a couple people PM me in response to this thread and even that is making me edgy and jumpy, because it feels like my privacy has been invaded (and I know how fucking stupid it is for me to think that, so please don&amp;#39;t go on and on about it).&lt;/p&gt;\n\n&lt;p&gt;Sorry, I&amp;#39;m getting too wound up between this and my parents arguing outside.  My hands are shaking and I literally saw red for a second.  I need to take a break now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch26cfd", "created": 1398473655.0, "author_flair_text": null, "created_utc": 1398470055.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}, "saved": false, "id": "ch25pjo", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch2537t", "approved_by": null, "body": "I'm a bit confused, so please tell me, how did your attorney provide the medical proof of your disability, then?  In my experience, a physician or several physicians have to provide statements attesting to your disability.  And just for the record, if you can't care for yourself--you are disabled.  Nothing the government says or doesn't say means you aren't disabled.  \nCan I ask what your degree is in?  Keep in mind that even if you can't use your degree for the specific field that you want to pursue, it's still a sign that you have a great many skills which puts you ahead of many other applicants.  \nAnd don't count out social services in your town/city/county.  There may be clinics that provide very low cost or no cost services of which you can avail yourself.  If you PM me your location (if you trust me, I won't be hurt if you don't) I can take a look and see what resources may be available to you.  Taking the bus or using public transportation to get out of the house and attend to medical appointments would also help with the socialization and human interaction portion of things.  I know that even being out and about and part of society helped me quite a bit, even if it was just shopping for groceries or sitting in a coffee shop.  \nAlso consider asking your mom if there's anything you can help do around the house.  Even if its just taking out the trash once a week or unloading the dishwasher. Showing her that you're making an effort towards relieving some of her burden may really help the relationship between you two.  ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bit confused, so please tell me, how did your attorney provide the medical proof of your disability, then?  In my experience, a physician or several physicians have to provide statements attesting to your disability.  And just for the record, if you can&amp;#39;t care for yourself--you are disabled.  Nothing the government says or doesn&amp;#39;t say means you aren&amp;#39;t disabled.&lt;br/&gt;\nCan I ask what your degree is in?  Keep in mind that even if you can&amp;#39;t use your degree for the specific field that you want to pursue, it&amp;#39;s still a sign that you have a great many skills which puts you ahead of many other applicants.&lt;br/&gt;\nAnd don&amp;#39;t count out social services in your town/city/county.  There may be clinics that provide very low cost or no cost services of which you can avail yourself.  If you PM me your location (if you trust me, I won&amp;#39;t be hurt if you don&amp;#39;t) I can take a look and see what resources may be available to you.  Taking the bus or using public transportation to get out of the house and attend to medical appointments would also help with the socialization and human interaction portion of things.  I know that even being out and about and part of society helped me quite a bit, even if it was just shopping for groceries or sitting in a coffee shop.&lt;br/&gt;\nAlso consider asking your mom if there&amp;#39;s anything you can help do around the house.  Even if its just taking out the trash once a week or unloading the dishwasher. Showing her that you&amp;#39;re making an effort towards relieving some of her burden may really help the relationship between you two.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch25pjo", "created": 1398472036.0, "author_flair_text": null, "created_utc": 1398468436.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2537t", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch24t56", "approved_by": null, "body": "No, my disability is entirely depression (well, depression and anxiety), so I don't have a physician.  My parents stopped paying for psychiatry care or therapy because it was too much of a burden on them, so I'm without any sort of treatment at all.  My lawyer said I do not qualify for SSI because of my living arrangement with my parents and some assets I technically have an interest in, even if I can never get anything out of them; my claim was under SSD and DIB (unless those are the same thing, different people at the office said different things), which I no longer qualify for because it's been so long since I worked enough to matter to the government.  So I don't qualify for SSI, SSD, or DIB.\n\nI know you had a good experience with going back to school and I'm glad you did, but I can't afford to take on even more debt for another degree that I don't want and can't use, and my parents can't and won't help at all.  I'm very worried that they might throw me out of the house altogether soon, since it's clear now that I can't contribute anything and will only continue to be a burden on them.  Well, \"worried\" isn't exactly right, because that would just mean I'd starve or die of exposure, which would mean I'd finally stop having to live, but I'm afraid of how long and painful that will be.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, my disability is entirely depression (well, depression and anxiety), so I don&amp;#39;t have a physician.  My parents stopped paying for psychiatry care or therapy because it was too much of a burden on them, so I&amp;#39;m without any sort of treatment at all.  My lawyer said I do not qualify for SSI because of my living arrangement with my parents and some assets I technically have an interest in, even if I can never get anything out of them; my claim was under SSD and DIB (unless those are the same thing, different people at the office said different things), which I no longer qualify for because it&amp;#39;s been so long since I worked enough to matter to the government.  So I don&amp;#39;t qualify for SSI, SSD, or DIB.&lt;/p&gt;\n\n&lt;p&gt;I know you had a good experience with going back to school and I&amp;#39;m glad you did, but I can&amp;#39;t afford to take on even more debt for another degree that I don&amp;#39;t want and can&amp;#39;t use, and my parents can&amp;#39;t and won&amp;#39;t help at all.  I&amp;#39;m very worried that they might throw me out of the house altogether soon, since it&amp;#39;s clear now that I can&amp;#39;t contribute anything and will only continue to be a burden on them.  Well, &amp;quot;worried&amp;quot; isn&amp;#39;t exactly right, because that would just mean I&amp;#39;d starve or die of exposure, which would mean I&amp;#39;d finally stop having to live, but I&amp;#39;m afraid of how long and painful that will be.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch2537t", "created": 1398470488.0, "author_flair_text": null, "created_utc": 1398466888.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch24t56", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch22igf", "approved_by": null, "body": "Well, to put things very simply, I've been there.  I'm disabled, and although I do qualify for SSI, I find that it's very important to my mental health to have a job to go to every day and interact with people.  I implore you not to give up on finding a job, even a part-time one at a fast food restaurant. Having a purpose and being around other, healthy adults can do a lot for a people like us.  I remember when I started my classes for my second degree, I made sure to have at least one class where I went and physically sat in the classroom, as opposed to taking it on line.  We're social creatures and we crave relationships and connections to others.  Have you thought about taking a class?  It wouldn't have to be academic in nature, it could be something along the lines of a craft, woodworking, etc. or even volunteering at a local place of worship or animal shelter--something that allows you to create a bit of a community.  It's important to do something with your time--anything--that brings you outside of yourself, that keeps you from focusing primarily on your depression and your disability.   It can also help in the friend department--even if those people are more 'friendly' as opposed to 'friends', if that makes any sense.  \n\nI understand that therapy can be very expensive, and I'm going to take a guess and assume you're in the US, which is a very difficult place to obtain mental health services.  Do you see a physician for your disability at all?  If you do, I'd encourage you to speak with that physician about your depression.  He or she can, at the very least, perhaps prescribe some anti-depressants for you that may ease things a bit.  I'd also encourage you to look into any social services that may be available in your community, for example, if there is a university nearby, it may provide free counseling by students--which may sound a bit scary, but I assure you they wouldn't be allowed to counsel patients if they weren't completely qualified and overseen by a competent professor.  Also, if you do consider becoming a student again in any capacity, there's a good chance that the university will have a student health center where you can obtain free or low-cost healthcare.  Just some options to think about down the line.  I know that transportation is an issue, but would you be able to obtain transport on one of your city/town's bus lines?  Many of them now are required to have wheel-chair ramps, if that's an issue.  A big issue with the disabled is having some degree of independence, and it sounds like you're having some issues with that.  You're still a person even if you're disabled, and still want to be reasonably self-sufficient, even if that's not entirely an option.\n\nGetting out of the house a bit may help your relationship with your parents, too.  I lived with my mother right before and after the suicide attempt when I went back to school.  Not moping around the house all day and seeing me up, showered, dressed, and conscious did a lot for our relationship.  A lot of our fighting was caused by the fact that she was worried and stressed out about me and about the future.  No parent (even the shittiest, as I can personally vouch for) wants to see their child miserable.  A lot of the hostility you feel may be stress--over money, over time, over resources--and while they're directed at you (unfairly, in my personal opinion), they're not your fault.  You didn't ask for this--who on earth would?\nSocial security is a tough thing in this country.  I've seen people that couldn't tie their shoelaces that have been denied several times for the most ludicrous reasons imaginable.  I've seen people get denied multiple times simply because they're young and the government doesn't want to be responsible for them for the next 50 or 60 years.  Then again, I've seen some people that were quite self-sufficient qualify and get checks.  It's an aggravating and infuriating system to say the least.  I will say this, though--if your disability is not depression, adding the fact that you suffer from depression can make a big difference in your claim.  It would require documentation from a mental health professional, so this may be a reason to tell your parents that you think you should start seeing a therapist--because a documented mental illness in addition to your physical disability will improve your next claim.  Also mention that if you improve your claim and get approved for SSI, you get Medicare and then you have insurance to pay for therapy and mental health medications, so it's a win-win.\nJust as an aside to answer your question, I got into social work because I loved being around people.  At first, I didn't realize how much having a mental illness and a disability would help me in this field and allow me to better understand my clients, but it does.  It also helps that I've been through the 'system', so to speak.  I know how to answer people's questions because I've been there myself.  I know how frightening it is to feel hopeless and unloved.  The people (my social worker, my therapist, my physicians, my family) made such a huge difference in my recovery that I feel the need to give back somehow.  My social worker was the one that inspired me to get into the field.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, to put things very simply, I&amp;#39;ve been there.  I&amp;#39;m disabled, and although I do qualify for SSI, I find that it&amp;#39;s very important to my mental health to have a job to go to every day and interact with people.  I implore you not to give up on finding a job, even a part-time one at a fast food restaurant. Having a purpose and being around other, healthy adults can do a lot for a people like us.  I remember when I started my classes for my second degree, I made sure to have at least one class where I went and physically sat in the classroom, as opposed to taking it on line.  We&amp;#39;re social creatures and we crave relationships and connections to others.  Have you thought about taking a class?  It wouldn&amp;#39;t have to be academic in nature, it could be something along the lines of a craft, woodworking, etc. or even volunteering at a local place of worship or animal shelter--something that allows you to create a bit of a community.  It&amp;#39;s important to do something with your time--anything--that brings you outside of yourself, that keeps you from focusing primarily on your depression and your disability.   It can also help in the friend department--even if those people are more &amp;#39;friendly&amp;#39; as opposed to &amp;#39;friends&amp;#39;, if that makes any sense.  &lt;/p&gt;\n\n&lt;p&gt;I understand that therapy can be very expensive, and I&amp;#39;m going to take a guess and assume you&amp;#39;re in the US, which is a very difficult place to obtain mental health services.  Do you see a physician for your disability at all?  If you do, I&amp;#39;d encourage you to speak with that physician about your depression.  He or she can, at the very least, perhaps prescribe some anti-depressants for you that may ease things a bit.  I&amp;#39;d also encourage you to look into any social services that may be available in your community, for example, if there is a university nearby, it may provide free counseling by students--which may sound a bit scary, but I assure you they wouldn&amp;#39;t be allowed to counsel patients if they weren&amp;#39;t completely qualified and overseen by a competent professor.  Also, if you do consider becoming a student again in any capacity, there&amp;#39;s a good chance that the university will have a student health center where you can obtain free or low-cost healthcare.  Just some options to think about down the line.  I know that transportation is an issue, but would you be able to obtain transport on one of your city/town&amp;#39;s bus lines?  Many of them now are required to have wheel-chair ramps, if that&amp;#39;s an issue.  A big issue with the disabled is having some degree of independence, and it sounds like you&amp;#39;re having some issues with that.  You&amp;#39;re still a person even if you&amp;#39;re disabled, and still want to be reasonably self-sufficient, even if that&amp;#39;s not entirely an option.&lt;/p&gt;\n\n&lt;p&gt;Getting out of the house a bit may help your relationship with your parents, too.  I lived with my mother right before and after the suicide attempt when I went back to school.  Not moping around the house all day and seeing me up, showered, dressed, and conscious did a lot for our relationship.  A lot of our fighting was caused by the fact that she was worried and stressed out about me and about the future.  No parent (even the shittiest, as I can personally vouch for) wants to see their child miserable.  A lot of the hostility you feel may be stress--over money, over time, over resources--and while they&amp;#39;re directed at you (unfairly, in my personal opinion), they&amp;#39;re not your fault.  You didn&amp;#39;t ask for this--who on earth would?\nSocial security is a tough thing in this country.  I&amp;#39;ve seen people that couldn&amp;#39;t tie their shoelaces that have been denied several times for the most ludicrous reasons imaginable.  I&amp;#39;ve seen people get denied multiple times simply because they&amp;#39;re young and the government doesn&amp;#39;t want to be responsible for them for the next 50 or 60 years.  Then again, I&amp;#39;ve seen some people that were quite self-sufficient qualify and get checks.  It&amp;#39;s an aggravating and infuriating system to say the least.  I will say this, though--if your disability is not depression, adding the fact that you suffer from depression can make a big difference in your claim.  It would require documentation from a mental health professional, so this may be a reason to tell your parents that you think you should start seeing a therapist--because a documented mental illness in addition to your physical disability will improve your next claim.  Also mention that if you improve your claim and get approved for SSI, you get Medicare and then you have insurance to pay for therapy and mental health medications, so it&amp;#39;s a win-win.\nJust as an aside to answer your question, I got into social work because I loved being around people.  At first, I didn&amp;#39;t realize how much having a mental illness and a disability would help me in this field and allow me to better understand my clients, but it does.  It also helps that I&amp;#39;ve been through the &amp;#39;system&amp;#39;, so to speak.  I know how to answer people&amp;#39;s questions because I&amp;#39;ve been there myself.  I know how frightening it is to feel hopeless and unloved.  The people (my social worker, my therapist, my physicians, my family) made such a huge difference in my recovery that I feel the need to give back somehow.  My social worker was the one that inspired me to get into the field.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch24t56", "created": 1398469820.0, "author_flair_text": null, "created_utc": 1398466220.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch22igf", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch1vwzv", "approved_by": null, "body": "Thank you for responding and I'm glad you had the will and desire and interest to push on.  What motivated you into social work?  Based on my experience with a Social Security lawyer, I would never enter that field; there are people worse off than me there, and I cannot handle myself on a good day.\n\nI am not currently in therapy, and would depend on my parents to pay for it and even take me there.  They have refused.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding and I&amp;#39;m glad you had the will and desire and interest to push on.  What motivated you into social work?  Based on my experience with a Social Security lawyer, I would never enter that field; there are people worse off than me there, and I cannot handle myself on a good day.&lt;/p&gt;\n\n&lt;p&gt;I am not currently in therapy, and would depend on my parents to pay for it and even take me there.  They have refused.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch22igf", "created": 1398464501.0, "author_flair_text": null, "created_utc": 1398460901.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch1vwzv", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23ysho", "approved_by": null, "body": "Well, I had a situation on my hand that was very similar to yours.  I have chronic back pain and a degree in history that only helped if someone wanted to know who was president in 1834.  I was getting a divorce and I was extremely depressed.  Due to the back pain and a husband that didn't want me to work, I had very little job experience and absolutely zero friends--I remember that I had only 23 people that were facebook friends with me--all family members.  I tried to commit suicide, and for some reason, I lived.  After getting out of the hospital, I changed my psychiatrist and my medication.  I went back to school to obtain a degree in social work.  I met friends through university classes and activities.  Using that degree, I got a job I love working with the intellectually disabled.  My life, right now, is more than I ever dreamed or imagined it could possibly be in the depths of my clinical depression.\nI want you to know that this can happen for you, too.  A lot of the symptoms your describing can be attributed to clinical depression--the not being able to get out of bed, the hopelessness, feeling like you're a failure, the lack of motivation.  This can be improved through cognitive therapy and medication.  If you're in pain due to your disability, be aware that depression, while not causing your pain, can act like an amplifier to make it worse.  I want you to know that there is so much hope, even if you don't see it right now.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I had a situation on my hand that was very similar to yours.  I have chronic back pain and a degree in history that only helped if someone wanted to know who was president in 1834.  I was getting a divorce and I was extremely depressed.  Due to the back pain and a husband that didn&amp;#39;t want me to work, I had very little job experience and absolutely zero friends--I remember that I had only 23 people that were facebook friends with me--all family members.  I tried to commit suicide, and for some reason, I lived.  After getting out of the hospital, I changed my psychiatrist and my medication.  I went back to school to obtain a degree in social work.  I met friends through university classes and activities.  Using that degree, I got a job I love working with the intellectually disabled.  My life, right now, is more than I ever dreamed or imagined it could possibly be in the depths of my clinical depression.\nI want you to know that this can happen for you, too.  A lot of the symptoms your describing can be attributed to clinical depression--the not being able to get out of bed, the hopelessness, feeling like you&amp;#39;re a failure, the lack of motivation.  This can be improved through cognitive therapy and medication.  If you&amp;#39;re in pain due to your disability, be aware that depression, while not causing your pain, can act like an amplifier to make it worse.  I want you to know that there is so much hope, even if you don&amp;#39;t see it right now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch1vwzv", "created": 1398450949.0, "author_flair_text": null, "created_utc": 1398447349.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch22onr", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch20a3b", "approved_by": null, "body": "Thank you for responding.  I didn't think the rambling was bad at all, but I've tried and failed, repeatedly, to find any joy or meaning in anything, really since sophomore year.  To me, a tree is just wood that hasn't died yet, and is crawling with disgusting pollen and vermin.  Subatomic particles may as well not exist, because I cannot see them and have never been able to understand them.  I hate food, I hate dreams, I hate anything that I can remember it experience, because it just reminds me that I have so many more days to go until my body shuts down and I stop having to live.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding.  I didn&amp;#39;t think the rambling was bad at all, but I&amp;#39;ve tried and failed, repeatedly, to find any joy or meaning in anything, really since sophomore year.  To me, a tree is just wood that hasn&amp;#39;t died yet, and is crawling with disgusting pollen and vermin.  Subatomic particles may as well not exist, because I cannot see them and have never been able to understand them.  I hate food, I hate dreams, I hate anything that I can remember it experience, because it just reminds me that I have so many more days to go until my body shuts down and I stop having to live.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch22onr", "created": 1398490075.0, "author_flair_text": null, "created_utc": 1398461275.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch20a3b", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23ysho", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch20a3b", "created": 1398459732.0, "author_flair_text": null, "created_utc": 1398456132.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch22k10", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch1w897", "approved_by": null, "body": "Thank you for responding.  Unfortunately you are right, the faint glimmer of some possible, unknown improvement at some indeterminate point in the future is not appealing in the slightest.  ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding.  Unfortunately you are right, the faint glimmer of some possible, unknown improvement at some indeterminate point in the future is not appealing in the slightest.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch22k10", "created": 1398464596.0, "author_flair_text": null, "created_utc": 1398460996.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1w897", "gilded": 0, "author": "HP_Housecat", "parent_id": "t3_23ysho", "approved_by": null, "body": "I wouldn't want to. Of course you want to stop what you're experiencing, all of those things are terrible to go through and continue to go through.\n\nI don't think it's usually death we truly want, just to stop suffering. I don't think there's much that is more natural than that.\n\nI don't know what you should do, honestly. I can tell you to see more doctors, to keep trying, to live for yourself, but I can't point to a clear path you should take. I wish I could. You haven't killed yourself because you said that you're too lazy and scared. However, the body's dumb will to live can be contradictory to our wish to end things. So your fear and inaction make perfect sense. I personally don't think you should ignore that. I don't mean to say that there's some secret strength inside of you or that willpower conquers all but there is absolutely something to listen to when it comes to our biological instincts. (I don't mean to say that instinct is always right or that is the end all be all either.)\n\nI think to sum up what I'm trying to get at: You're a human being. You're not \"meant to\" want to suffer through those things. Human beings often have \"built in\" systems to keep us from ending through suicide. Two conflicting forces keeping you trapped. I personally would want you to continue living in the hopes that things change for you. That something happens or you find some other avenue that you can follow. I also know that in the same situation, I think that some vague future possibility would be meaningless to me. I hope that someone can truly answer your question. (And I apologize for the rambling response.)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t want to. Of course you want to stop what you&amp;#39;re experiencing, all of those things are terrible to go through and continue to go through.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s usually death we truly want, just to stop suffering. I don&amp;#39;t think there&amp;#39;s much that is more natural than that.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what you should do, honestly. I can tell you to see more doctors, to keep trying, to live for yourself, but I can&amp;#39;t point to a clear path you should take. I wish I could. You haven&amp;#39;t killed yourself because you said that you&amp;#39;re too lazy and scared. However, the body&amp;#39;s dumb will to live can be contradictory to our wish to end things. So your fear and inaction make perfect sense. I personally don&amp;#39;t think you should ignore that. I don&amp;#39;t mean to say that there&amp;#39;s some secret strength inside of you or that willpower conquers all but there is absolutely something to listen to when it comes to our biological instincts. (I don&amp;#39;t mean to say that instinct is always right or that is the end all be all either.)&lt;/p&gt;\n\n&lt;p&gt;I think to sum up what I&amp;#39;m trying to get at: You&amp;#39;re a human being. You&amp;#39;re not &amp;quot;meant to&amp;quot; want to suffer through those things. Human beings often have &amp;quot;built in&amp;quot; systems to keep us from ending through suicide. Two conflicting forces keeping you trapped. I personally would want you to continue living in the hopes that things change for you. That something happens or you find some other avenue that you can follow. I also know that in the same situation, I think that some vague future possibility would be meaningless to me. I hope that someone can truly answer your question. (And I apologize for the rambling response.)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch1w897", "created": 1398476759.0, "author_flair_text": null, "created_utc": 1398447959.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch22faw", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch1xh1g", "approved_by": null, "body": "Thank you for responding, but I don't think you fully understand: *I can't get interviews*.  Not with retail, not with staffing agencies, not *anywhere*, and I have *tried*.  I also have neither the money nor inclination nor talent nor interest nor support needed to even enroll in a \"trade.\"  Most of the trades it seems like you are suggesting would never touch someone like me, regardless.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding, but I don&amp;#39;t think you fully understand: &lt;em&gt;I can&amp;#39;t get interviews&lt;/em&gt;.  Not with retail, not with staffing agencies, not &lt;em&gt;anywhere&lt;/em&gt;, and I have &lt;em&gt;tried&lt;/em&gt;.  I also have neither the money nor inclination nor talent nor interest nor support needed to even enroll in a &amp;quot;trade.&amp;quot;  Most of the trades it seems like you are suggesting would never touch someone like me, regardless.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch22faw", "created": 1398464314.0, "author_flair_text": null, "created_utc": 1398460714.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch1xh1g", "gilded": 0, "author": "cptginyu", "parent_id": "t3_23ysho", "approved_by": null, "body": "If temporary work agencies don't tickle your fancy, start working in the trades. It's easy and very rewarding skilled labour. Knowing how to do stuff gives you an extreme confidence boost and you'll get more fit in the process. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If temporary work agencies don&amp;#39;t tickle your fancy, start working in the trades. It&amp;#39;s easy and very rewarding skilled labour. Knowing how to do stuff gives you an extreme confidence boost and you&amp;#39;ll get more fit in the process. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch1xh1g", "created": 1398454024.0, "author_flair_text": null, "created_utc": 1398450424.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2a43x", "gilded": 0, "author": "HP_Housecat", "parent_id": "t1_ch27dm6", "approved_by": null, "body": "I know you've deleted, but in case you look under another name: I'm sorry you had this experience here. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you&amp;#39;ve deleted, but in case you look under another name: I&amp;#39;m sorry you had this experience here. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch2a43x", "created": 1398483169.0, "author_flair_text": null, "created_utc": 1398479569.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch27dm6", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch27cgx", "approved_by": null, "body": "Please, please, **PLEASE** just stop coming here and saying things.  **I DO NOT FEEL SAFE WITH YOU COMING HERE AND CONTINUING TO TALK EVEN AFTER I ASKED YOU TO PLEASE LEAVE ME ALONE**", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please, please, &lt;strong&gt;PLEASE&lt;/strong&gt; just stop coming here and saying things.  &lt;strong&gt;I DO NOT FEEL SAFE WITH YOU COMING HERE AND CONTINUING TO TALK EVEN AFTER I ASKED YOU TO PLEASE LEAVE ME ALONE&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch27dm6", "created": 1398501477.0, "author_flair_text": null, "created_utc": 1398472677.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch27cgx", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2746o", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch27cgx", "created": 1398476200.0, "author_flair_text": null, "created_utc": 1398472600.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2746o", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch26yls", "approved_by": null, "body": "I'm glad the quote helped you, but please just leave me alone.  It did *not* help me, nor did the rest of your post.  I feel threatened and attacked by you simply being here and continuing to post after you or someone else deleted your comment.  Please, just leave me alone.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad the quote helped you, but please just leave me alone.  It did &lt;em&gt;not&lt;/em&gt; help me, nor did the rest of your post.  I feel threatened and attacked by you simply being here and continuing to post after you or someone else deleted your comment.  Please, just leave me alone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch2746o", "created": 1398475618.0, "author_flair_text": null, "created_utc": 1398472018.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch26yls", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch22kuk", "approved_by": null, "body": "[deleted]", "edited": 1398472146.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch26yls", "created": 1398475220.0, "author_flair_text": null, "created_utc": 1398471620.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch22kuk", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch1ycj9", "approved_by": null, "body": "I don't appreciate this comment at all.  I find your language threatening and your message confused and unhelpful.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t appreciate this comment at all.  I find your language threatening and your message confused and unhelpful.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch22kuk", "created": 1398464644.0, "author_flair_text": null, "created_utc": 1398461044.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch1ycj9", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23ysho", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ysho", "score_hidden": false, "name": "t1_ch1ycj9", "created": 1398455781.0, "author_flair_text": null, "created_utc": 1398452181.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]