[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Straight to the point. &lt;/p&gt;\n\n&lt;p&gt;If I fail these school exams, it&amp;#39;s over. I have NOTHING in life. If I fail school, all I have is the fat in my body. Plenty of it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure how i&amp;#39;ll end it all. If I would rather end my life or end my current life by just traveling randomly. Maybe i&amp;#39;ll starve to death or get ran over or something. Perhaps i&amp;#39;ll kill myself anyway after all of that. I&amp;#39;m not too sure if I&amp;#39;d like living as a traveler. I&amp;#39;d have to steal all my food together and sleep in a tent or something during the winter. I could go south towards Italy or Spain but language barriers and such. Would be a fabulous place to die, though. Maybe on the Vesuvius or so. &lt;/p&gt;\n\n&lt;p&gt;So yeah. At least I have a plan. And if all goes well, which I give about 70% chance, I have 3 years to think of my next step. If that fails I can always go back to the plan I&amp;#39;ve laid out here. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Straight to the point. \n\nIf I fail these school exams, it's over. I have NOTHING in life. If I fail school, all I have is the fat in my body. Plenty of it. \n\nI'm not sure how i'll end it all. If I would rather end my life or end my current life by just traveling randomly. Maybe i'll starve to death or get ran over or something. Perhaps i'll kill myself anyway after all of that. I'm not too sure if I'd like living as a traveler. I'd have to steal all my food together and sleep in a tent or something during the winter. I could go south towards Italy or Spain but language barriers and such. Would be a fabulous place to die, though. Maybe on the Vesuvius or so. \n\nSo yeah. At least I have a plan. And if all goes well, which I give about 70% chance, I have 3 years to think of my next step. If that fails I can always go back to the plan I've laid out here. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25a4qa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Ignoremepl0x", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25a4qa/last_hope_and_a_new_way_of_suicide/", "name": "t3_25a4qa", "created": 1399847508.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25a4qa/last_hope_and_a_new_way_of_suicide/", "author_flair_text": null, "title": "Last hope and a new way of suicide.", "created_utc": 1399818708.0, "ups": 9, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf9oon", "gilded": 0, "author": "KittyKami", "parent_id": "t1_chf8go2", "approved_by": null, "body": "It made sense to me, there's no need to apologise. It's understandable that you'd have trouble getting your thoughts in order with all that's rushing through your mind, it sounds like everything's very confusing for you right now.\n\nYou're clearly struggling with suicidal thoughts, and it seems that only being able to see failure, misery and worthlessness is really wearing you down. You identify positive things about yourself, being intelligent, logical and creative, but the depression and anxiety is leaving you unable to see beyond that. I wonder if some of these negative thoughts come from how you feel about having asperger's and possibly ADD, as you're listing these as mental flaws.\n\nI imagine that with people avoiding you and your feeling that they would be happier without you, you're feeling isolated and unwanted, that must be so hard for you. And you're right that hearing somebody say that they don't have time for you is destroying, that's no friendship that anyone could be happy in. Socially you say that you feel that you don't know what you're doing, is this more from anxiety or asperger's, or something else?\n\nUnderstandably feeling rejected and avoided by the people around you, in addition to the mental struggles you're facing, leaves you feeling worthless. But then you talk about having some positive self image, and having a nice time with friends when you do accidentally meet up, and having potential to improve your music skills, it sounds to me like you've not completely given up hope of feeling that you have worth.\n\nBeing able to believe in yourself is a huge and painful struggle, overcoming what's happened in the past, your worries about the present and the thoughts of things not improving in the future. It's not an easy thing, from what you're saying it seems to me like you're being very hard on yourself. \n\nYou say that just about nobody believes in you, that it seems like you're not worth too much and that a massive inferiority complex is a huge thing in your life right now, but know that we internet strangers on Reddit believe that you are worthy and have value. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It made sense to me, there&amp;#39;s no need to apologise. It&amp;#39;s understandable that you&amp;#39;d have trouble getting your thoughts in order with all that&amp;#39;s rushing through your mind, it sounds like everything&amp;#39;s very confusing for you right now.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re clearly struggling with suicidal thoughts, and it seems that only being able to see failure, misery and worthlessness is really wearing you down. You identify positive things about yourself, being intelligent, logical and creative, but the depression and anxiety is leaving you unable to see beyond that. I wonder if some of these negative thoughts come from how you feel about having asperger&amp;#39;s and possibly ADD, as you&amp;#39;re listing these as mental flaws.&lt;/p&gt;\n\n&lt;p&gt;I imagine that with people avoiding you and your feeling that they would be happier without you, you&amp;#39;re feeling isolated and unwanted, that must be so hard for you. And you&amp;#39;re right that hearing somebody say that they don&amp;#39;t have time for you is destroying, that&amp;#39;s no friendship that anyone could be happy in. Socially you say that you feel that you don&amp;#39;t know what you&amp;#39;re doing, is this more from anxiety or asperger&amp;#39;s, or something else?&lt;/p&gt;\n\n&lt;p&gt;Understandably feeling rejected and avoided by the people around you, in addition to the mental struggles you&amp;#39;re facing, leaves you feeling worthless. But then you talk about having some positive self image, and having a nice time with friends when you do accidentally meet up, and having potential to improve your music skills, it sounds to me like you&amp;#39;ve not completely given up hope of feeling that you have worth.&lt;/p&gt;\n\n&lt;p&gt;Being able to believe in yourself is a huge and painful struggle, overcoming what&amp;#39;s happened in the past, your worries about the present and the thoughts of things not improving in the future. It&amp;#39;s not an easy thing, from what you&amp;#39;re saying it seems to me like you&amp;#39;re being very hard on yourself. &lt;/p&gt;\n\n&lt;p&gt;You say that just about nobody believes in you, that it seems like you&amp;#39;re not worth too much and that a massive inferiority complex is a huge thing in your life right now, but know that we internet strangers on Reddit believe that you are worthy and have value. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf9oon", "created": 1399857299.0, "author_flair_text": null, "created_utc": 1399828499.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfeurt", "gilded": 0, "author": "kkin1995", "parent_id": "t1_chf8go2", "approved_by": null, "body": "Hi, first as /u/KittyKami said there's no need to apologise. You may have aspergers but you shouldn't let it affect you. And you should ask your Mom about what she said again, because you might have misunderstood. I'm saying that she might have meant that if you do not do well in your exams, it would be hard for you to apply for college. And scrap that plan you came up with, because you are in control with your life. Let's start with: What do you want to take up as a career? And, please message me if you want to talk, I'm here to help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, first as &lt;a href=\"/u/KittyKami\"&gt;/u/KittyKami&lt;/a&gt; said there&amp;#39;s no need to apologise. You may have aspergers but you shouldn&amp;#39;t let it affect you. And you should ask your Mom about what she said again, because you might have misunderstood. I&amp;#39;m saying that she might have meant that if you do not do well in your exams, it would be hard for you to apply for college. And scrap that plan you came up with, because you are in control with your life. Let&amp;#39;s start with: What do you want to take up as a career? And, please message me if you want to talk, I&amp;#39;m here to help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chfeurt", "created": 1399870511.0, "author_flair_text": null, "created_utc": 1399841711.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf8go2", "gilded": 0, "author": "Ignoremepl0x", "parent_id": "t1_chf7iis", "approved_by": null, "body": "Thank you. \n\nWell I don't really know where to start. So i'm starting with myself. I have depression. I guess it escalated to the point of Major Depression since suicidal thoughts for months aren't healthy, right? I come from the Netherlands, am 18 years old and about to finish high school - at least I hope. \n\nI think of myself as being somewhat intelligent, creative and good with logic. Also, I can have a good conversation with people, sometimes. That's about the end of my happy self image. For all I see further on is failure after failure, misery upon worthlessness - and really anxious and at times angsty, I guess. \n\nI have asperger's, and possibly traces of ADD. Depression is just next in the list of mental flaws. \n\nSocially, I have no clue what i'm doing, except that it is ALL WRONG. I see people occasionally, but I think they'd be happier without me. I *know* they would be. Sometimes I meet someone somewhere, always accidentally, and have some nice time, but that's it. \n\nPeople seem to avoid me. And those that say they don't never have time for me. Which may be true, but what kind of friendship is that?\n\nSo it seems like I am not worth too much. A massive inferiority complex is my closest friend. Then comes depression, followed by worries about the future and worries about the present. \n\nI don't think I have much talent in anything, really. I mean yeah I may have great potential for music skills but I never have time for it. I may possibly be a great thinker but I don't know what I could ever do with that.\n\nAll of that, and so indescribably much more, makes me feel bad. There is nothing i'm good at. Rarely anyone who would spend their time with me. Just about nobody who believes in me. And I, myself, might be the biggest disbeliever.\n\nSorry if this is all messy. I have the biggest trouble getting my thoughts in line. It's all one big mess. Thoughts rushing through my head uncontrollably. The only thing I can really say with confidence is \"I don't know.\" which may be the most ironic thing ever. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. &lt;/p&gt;\n\n&lt;p&gt;Well I don&amp;#39;t really know where to start. So i&amp;#39;m starting with myself. I have depression. I guess it escalated to the point of Major Depression since suicidal thoughts for months aren&amp;#39;t healthy, right? I come from the Netherlands, am 18 years old and about to finish high school - at least I hope. &lt;/p&gt;\n\n&lt;p&gt;I think of myself as being somewhat intelligent, creative and good with logic. Also, I can have a good conversation with people, sometimes. That&amp;#39;s about the end of my happy self image. For all I see further on is failure after failure, misery upon worthlessness - and really anxious and at times angsty, I guess. &lt;/p&gt;\n\n&lt;p&gt;I have asperger&amp;#39;s, and possibly traces of ADD. Depression is just next in the list of mental flaws. &lt;/p&gt;\n\n&lt;p&gt;Socially, I have no clue what i&amp;#39;m doing, except that it is ALL WRONG. I see people occasionally, but I think they&amp;#39;d be happier without me. I &lt;em&gt;know&lt;/em&gt; they would be. Sometimes I meet someone somewhere, always accidentally, and have some nice time, but that&amp;#39;s it. &lt;/p&gt;\n\n&lt;p&gt;People seem to avoid me. And those that say they don&amp;#39;t never have time for me. Which may be true, but what kind of friendship is that?&lt;/p&gt;\n\n&lt;p&gt;So it seems like I am not worth too much. A massive inferiority complex is my closest friend. Then comes depression, followed by worries about the future and worries about the present. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I have much talent in anything, really. I mean yeah I may have great potential for music skills but I never have time for it. I may possibly be a great thinker but I don&amp;#39;t know what I could ever do with that.&lt;/p&gt;\n\n&lt;p&gt;All of that, and so indescribably much more, makes me feel bad. There is nothing i&amp;#39;m good at. Rarely anyone who would spend their time with me. Just about nobody who believes in me. And I, myself, might be the biggest disbeliever.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this is all messy. I have the biggest trouble getting my thoughts in line. It&amp;#39;s all one big mess. Thoughts rushing through my head uncontrollably. The only thing I can really say with confidence is &amp;quot;I don&amp;#39;t know.&amp;quot; which may be the most ironic thing ever. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf8go2", "created": 1399854008.0, "author_flair_text": null, "created_utc": 1399825208.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf7iis", "gilded": 0, "author": "KittyKami", "parent_id": "t1_chf7b3x", "approved_by": null, "body": "That's awful to hear such a thing from your mom, no wonder you're feeling so torn up about the idea of failing when she's not supportive of you through your exams. With your dad soon to be homeless, of course you're worried about not having anywhere to go. Age doesn't necessarily define when you have to be taking care of yourself: everyone needs support no matter how old we are. \n\nDo you want to talk about the other stuff that's going on in your life? I care about you and want to support you as best as I can.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s awful to hear such a thing from your mom, no wonder you&amp;#39;re feeling so torn up about the idea of failing when she&amp;#39;s not supportive of you through your exams. With your dad soon to be homeless, of course you&amp;#39;re worried about not having anywhere to go. Age doesn&amp;#39;t necessarily define when you have to be taking care of yourself: everyone needs support no matter how old we are. &lt;/p&gt;\n\n&lt;p&gt;Do you want to talk about the other stuff that&amp;#39;s going on in your life? I care about you and want to support you as best as I can.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf7iis", "created": 1399851471.0, "author_flair_text": null, "created_utc": 1399822671.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf7b3x", "gilded": 0, "author": "Ignoremepl0x", "parent_id": "t1_chf75eq", "approved_by": null, "body": "Yes. Totally yes. But there is more. My mom simply told me to fuck off if I fail this. Like I said; ending up with literally nothing but the fat on my bones. Where could I go? My dad is soon to be homeless too. There is so much more going on than I posted here. \n\nFinishing my exams is literally the only shot at life I have, due to so much shit going on. I'm 18 now and supposed to take care of myself but truth be told; I don't know.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Totally yes. But there is more. My mom simply told me to fuck off if I fail this. Like I said; ending up with literally nothing but the fat on my bones. Where could I go? My dad is soon to be homeless too. There is so much more going on than I posted here. &lt;/p&gt;\n\n&lt;p&gt;Finishing my exams is literally the only shot at life I have, due to so much shit going on. I&amp;#39;m 18 now and supposed to take care of myself but truth be told; I don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf7b3x", "created": 1399850890.0, "author_flair_text": null, "created_utc": 1399822090.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf75eq", "gilded": 0, "author": "KittyKami", "parent_id": "t1_chf6xwv", "approved_by": null, "body": "That's hopeful that you can see a bit of a future for yourself. I'm wondering if that makes the idea of failing your exams more stressful, that you have this plan to go into IT training and that it might not happen depending on your exam results. If you don't pass your school exams, are there any other options so that you could still get a job you'd want, e.g. re-taking exams / doing a conversion course / getting a temporary job to build your skills and experience?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s hopeful that you can see a bit of a future for yourself. I&amp;#39;m wondering if that makes the idea of failing your exams more stressful, that you have this plan to go into IT training and that it might not happen depending on your exam results. If you don&amp;#39;t pass your school exams, are there any other options so that you could still get a job you&amp;#39;d want, e.g. re-taking exams / doing a conversion course / getting a temporary job to build your skills and experience?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf75eq", "created": 1399850452.0, "author_flair_text": null, "created_utc": 1399821652.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf6xwv", "gilded": 0, "author": "Ignoremepl0x", "parent_id": "t1_chf6smj", "approved_by": null, "body": "Well when I have success at school I can focus on getting a job. I will follow 3 years of IT training and then go into the real world. No idea what'll happen next but it's a bit of a future at least. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well when I have success at school I can focus on getting a job. I will follow 3 years of IT training and then go into the real world. No idea what&amp;#39;ll happen next but it&amp;#39;s a bit of a future at least. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf6xwv", "created": 1399849861.0, "author_flair_text": null, "created_utc": 1399821061.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf6smj", "gilded": 0, "author": "KittyKami", "parent_id": "t1_chf6kkz", "approved_by": null, "body": "Thinking that things would get to a point where you wouldn't have anything must feel awful, I'm so sorry. Do you feel that if you passed your exams it would help things, or is it more that it would put off making the decision about ending things for another three years?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thinking that things would get to a point where you wouldn&amp;#39;t have anything must feel awful, I&amp;#39;m so sorry. Do you feel that if you passed your exams it would help things, or is it more that it would put off making the decision about ending things for another three years?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf6smj", "created": 1399849440.0, "author_flair_text": null, "created_utc": 1399820640.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf6kkz", "gilded": 0, "author": "Ignoremepl0x", "parent_id": "t1_chf6icq", "approved_by": null, "body": "It would be the end of the life and everything I know. I would have no money. Actually I wouldn't have anything. I think the question is more; What gets to me first? The cold, starvation, disease, depression or a jail sentence? \n\nI doubt if I am ever going to see the next new years fireworks. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be the end of the life and everything I know. I would have no money. Actually I wouldn&amp;#39;t have anything. I think the question is more; What gets to me first? The cold, starvation, disease, depression or a jail sentence? &lt;/p&gt;\n\n&lt;p&gt;I doubt if I am ever going to see the next new years fireworks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf6kkz", "created": 1399848768.0, "author_flair_text": null, "created_utc": 1399819968.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf6icq", "gilded": 0, "author": "KittyKami", "parent_id": "t3_25a4qa", "approved_by": null, "body": "That's such a big pressure you're under, to have to pass your exams to feel that you have something in life. On the chance that your exams don't go so well, does the plan of becoming a traveller offer any comfort, or does it still feel like a way of ending it all?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s such a big pressure you&amp;#39;re under, to have to pass your exams to feel that you have something in life. On the chance that your exams don&amp;#39;t go so well, does the plan of becoming a traveller offer any comfort, or does it still feel like a way of ending it all?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25a4qa", "score_hidden": false, "name": "t1_chf6icq", "created": 1399848585.0, "author_flair_text": null, "created_utc": 1399819785.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]