[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if this is the right place to post this, but I figured it was probably more appropriate than askreddit...&lt;/p&gt;\n\n&lt;p&gt;As the title says, last night I called 911 for a friend who I believed may have been suicidal. She&amp;#39;s had a bunch of things dragging her down in the past couple years and she started opening up about some of it last night while we chatted on facebook... Her father died and her mother hasn&amp;#39;t been dealing with it so well. The pressure from that has been making it hard for her to move out of the house, despite being in her mid 20&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;Her and her boyfriend of two years had been falling out for some time and she told me that he&amp;#39;s put her down and made her feel bad since the start of the relationship - the last thing she said in the conversation was the comment that just me talking to her was me showing that I cared more than he ever did the whole time they&amp;#39;ve been together. Then suddenly she said, &amp;quot;I think we just broke up&amp;quot; and started talking about how all she could think about was a suicide attempt she made years ago.&lt;/p&gt;\n\n&lt;p&gt;I now live about two hours away from where she does, so I haven&amp;#39;t seen her in person for over a year, plus I&amp;#39;ve only been to her home once, so when she started talking like this I told her to give me her address, I was coming over to keep her company. She said &amp;quot;Not relevant&amp;quot; and then made the comment about me caring more than her boyfriend. That was the last I heard from her.&lt;/p&gt;\n\n&lt;p&gt;She stopped responding on facebook. She wouldn&amp;#39;t answer the phone or respond to text messages. I sent her a message on facebook and a text message that said if she didn&amp;#39;t start responding I was going to call 911.&lt;/p&gt;\n\n&lt;p&gt;So I called... After giving the police as much information as I could, they tracked her address down and said they were sending an officer to the home. I never found out exactly what happened. I still haven&amp;#39;t heard from her. I think she&amp;#39;s alright, though honestly the only indicator I have is that her facebook account has come online in the chat box a couple times today.&lt;/p&gt;\n\n&lt;p&gt;I want to reach out to her, but I&amp;#39;m not sure that now is the time. If she wanted to hear from me, wouldn&amp;#39;t she have responded in some way by now? I&amp;#39;m worried that she&amp;#39;s mad at me for getting the police involved, though it&amp;#39;s not about me, I don&amp;#39;t want to hound her while she&amp;#39;s upset or potentially unstable. I&amp;#39;m just genuinely concerned for her and I want to offer my support. How can I do that going forward from here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not sure if this is the right place to post this, but I figured it was probably more appropriate than askreddit...\n\nAs the title says, last night I called 911 for a friend who I believed may have been suicidal. She's had a bunch of things dragging her down in the past couple years and she started opening up about some of it last night while we chatted on facebook... Her father died and her mother hasn't been dealing with it so well. The pressure from that has been making it hard for her to move out of the house, despite being in her mid 20's. \n\nHer and her boyfriend of two years had been falling out for some time and she told me that he's put her down and made her feel bad since the start of the relationship - the last thing she said in the conversation was the comment that just me talking to her was me showing that I cared more than he ever did the whole time they've been together. Then suddenly she said, \"I think we just broke up\" and started talking about how all she could think about was a suicide attempt she made years ago.\n\nI now live about two hours away from where she does, so I haven't seen her in person for over a year, plus I've only been to her home once, so when she started talking like this I told her to give me her address, I was coming over to keep her company. She said \"Not relevant\" and then made the comment about me caring more than her boyfriend. That was the last I heard from her.\n\nShe stopped responding on facebook. She wouldn't answer the phone or respond to text messages. I sent her a message on facebook and a text message that said if she didn't start responding I was going to call 911.\n\nSo I called... After giving the police as much information as I could, they tracked her address down and said they were sending an officer to the home. I never found out exactly what happened. I still haven't heard from her. I think she's alright, though honestly the only indicator I have is that her facebook account has come online in the chat box a couple times today.\n\nI want to reach out to her, but I'm not sure that now is the time. If she wanted to hear from me, wouldn't she have responded in some way by now? I'm worried that she's mad at me for getting the police involved, though it's not about me, I don't want to hound her while she's upset or potentially unstable. I'm just genuinely concerned for her and I want to offer my support. How can I do that going forward from here?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25cho2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "digitalsmear", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25cho2/last_night_i_called_911_for_a_friend/", "name": "t3_25cho2", "created": 1399914932.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25cho2/last_night_i_called_911_for_a_friend/", "author_flair_text": null, "title": "Last night I called 911 for a friend...", "created_utc": 1399886132.0, "ups": 9, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfug15", "gilded": 0, "author": "BigRiGoo", "parent_id": "t3_25cho2", "approved_by": null, "body": "Sounds like you did the right thing. The best any of us can do is just be there when and if they call on us. Even if she is mad right now, she will understand why you did what you did in time and recognize the caring that motivated your actions.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you did the right thing. The best any of us can do is just be there when and if they call on us. Even if she is mad right now, she will understand why you did what you did in time and recognize the caring that motivated your actions.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25cho2", "score_hidden": false, "name": "t1_chfug15", "created": 1399919611.0, "author_flair_text": null, "created_utc": 1399890811.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfy8fg", "gilded": 0, "author": "kkin1995", "parent_id": "t3_25cho2", "approved_by": null, "body": "You did the right thing. Now, the best you can do is wait for her to respond. If she does not for a long time, then you should maybe go over to her house, don't send a message. Go over sometime when you think she is free.\n\nGive her time, even if she is mad at you, as /u/BigRiGoo said, she will understand your actions.", "edited": 1399958164.0, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did the right thing. Now, the best you can do is wait for her to respond. If she does not for a long time, then you should maybe go over to her house, don&amp;#39;t send a message. Go over sometime when you think she is free.&lt;/p&gt;\n\n&lt;p&gt;Give her time, even if she is mad at you, as &lt;a href=\"/u/BigRiGoo\"&gt;/u/BigRiGoo&lt;/a&gt; said, she will understand your actions.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25cho2", "score_hidden": false, "name": "t1_chfy8fg", "created": 1399933802.0, "author_flair_text": null, "created_utc": 1399905002.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]