[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After being in a relationship with someone who cheated on me with 5 different girls, I held myself together as best as I could. Now that it&amp;#39;s passed, every day is just a carbon copy of the one before.  Same routine, with slight changes. Get up, make food, pack a lunch, go to work, pack boxes, go home, take a shower, go to bed; repeat. As I walk through this warehouse on a daily bases I think about why I&amp;#39;m really here.  Every thought just brings me more comfortable with the idea of lynching myself, and hanging like the piece of meat I am. A person full of regret and, now, disease.  I&amp;#39;ve wanted to kill myself a few times before, but I&amp;#39;ve never really been so comfortable with the idea. I&amp;#39;ve never really felt so numb to the bad news given to me, or the thought of never seeing my family again, or how my significantly younger siblings would feel. I&amp;#39;ve tried local mental health facilities in the past, but it always catches up and haunts me. Something is always around to trigger the sadness, but never anything to keep it away long enough to fully recover from it. Have you ever genuinely wanted to be dead? It&amp;#39;s like a veil that hangs over all that is good on life, and reminds you of why life is not good. I&amp;#39;m to the point where I genuinely believe that my life is a dead end and not worth living. I&amp;#39;m going nowhere, I will become nothing.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After being in a relationship with someone who cheated on me with 5 different girls, I held myself together as best as I could. Now that it's passed, every day is just a carbon copy of the one before.  Same routine, with slight changes. Get up, make food, pack a lunch, go to work, pack boxes, go home, take a shower, go to bed; repeat. As I walk through this warehouse on a daily bases I think about why I'm really here.  Every thought just brings me more comfortable with the idea of lynching myself, and hanging like the piece of meat I am. A person full of regret and, now, disease.  I've wanted to kill myself a few times before, but I've never really been so comfortable with the idea. I've never really felt so numb to the bad news given to me, or the thought of never seeing my family again, or how my significantly younger siblings would feel. I've tried local mental health facilities in the past, but it always catches up and haunts me. Something is always around to trigger the sadness, but never anything to keep it away long enough to fully recover from it. Have you ever genuinely wanted to be dead? It's like a veil that hangs over all that is good on life, and reminds you of why life is not good. I'm to the point where I genuinely believe that my life is a dead end and not worth living. I'm going nowhere, I will become nothing.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24f37d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Unoiseau", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24f37d/lately_the_thought_of_dying_seems_the_best_route/", "name": "t3_24f37d", "created": 1398935856.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24f37d/lately_the_thought_of_dying_seems_the_best_route/", "author_flair_text": null, "title": "Lately the thought of dying seems the best route", "created_utc": 1398907056.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6jnqt", "gilded": 0, "author": "Unoiseau", "parent_id": "t3_24f37d", "approved_by": null, "body": "And as a last resort to reach out to somebody for help, or explain how I feel, i have again failed. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And as a last resort to reach out to somebody for help, or explain how I feel, i have again failed. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24f37d", "score_hidden": false, "name": "t1_ch6jnqt", "created": 1398914838.0, "author_flair_text": null, "created_utc": 1398911238.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]