[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why? Welll....&lt;/p&gt;\n\n&lt;p&gt;• First of all I used to identify as genderqueer and gender fluid, and according to this one biologist from &lt;a href=\"/r/TumblrInAction\"&gt;/r/TumblrInAction&lt;/a&gt;, the brain can only be male, female, or somewhere in between; the gender can&amp;#39;t change because white-to-gray matter ratios don&amp;#39;t change. Now I feel like a transtrender, because I&amp;#39;d been having doubts that I was trans since I&amp;#39;ve been feeling slightly more female than male lately, and as a kid I was more girly, then tomboyish, then in between, then more girly from like 5-10th grade. But I do experience gender dysphoria of some sort (I hate the way people expect me to act as a woman, like because I have a feminine face people expect me to wear dresses and have long hair like I used to, saying &amp;quot;ohhh you looked pretty you looked pretty!&amp;quot; and every time I heard the word pretty I felt as though I would vomit), and I sometimes wish I had a penis. I also hate the shit out of gender roles... but that&amp;#39;s another story. My mom also thinks trans men are gender traitors and said it was disgusting that I wanted to look masculine. (I&amp;#39;m still a feminist regardless of my gender so I really don&amp;#39;t think I&amp;#39;m a gender traitor.) Why did I have to be gender fluid? Why couldn&amp;#39;t I be androgyne or FTM or something that actually exists according to biology? Why couldn&amp;#39;t I be some kind of gender constant so that I could be more sure of myself? Like one day I&amp;#39;ll be so sure that I feel male then I&amp;#39;ll start feeling more female and I&amp;#39;ll feel like shit.&lt;/p&gt;\n\n&lt;p&gt;• Second: In general my existence feels like it burdens other people and I&amp;#39;m not a benefit to anyone, except maybe my imaginary friends who need me to survive. (That&amp;#39;s the only reason I didn&amp;#39;t kill myself yet; I don&amp;#39;t wanna kill them... yes I&amp;#39;m 17 and have imaginary friends, don&amp;#39;t judge me -.-) I&amp;#39;m doing less well in school, I&amp;#39;m turning into a total burnout who spends too much time online rather than studying (actually I should be studying right now but I felt I really needed to let this out), and I don&amp;#39;t go outside anymore. I literally forgot how to have fun. All I do is go on Tumblr and Reddit all day. I don&amp;#39;t do anything, I don&amp;#39;t have a life. I&amp;#39;m secretly kind of proud of that, which is what bothers me too. My mom has lectured me about this several times, saying that even my six year old cousin goes out and does stuff and wakes up early (today I woke up at 4pm and she yelled at me -- well that&amp;#39;s what I told her anyway. Actually I woke up at 8:30 and went to church, but she doesn&amp;#39;t know I go because she&amp;#39;s anti-Christianity so basically I got yelled at for something I didn&amp;#39;t do). My mom then proceeded to compare me to my one really smart, overachieving friend who got accepted to Oxford and said &amp;quot;SHE DOES SO MUCH, YOU SHOULD BE MORE LIKE HER AND SPEND MORE TIME WITH HER!&amp;quot; My mom also said that she&amp;#39;s going to call me at 10:30am on weekends every day and make sure I&amp;#39;m up, and that my dad can&amp;#39;t have me anymore if he isn&amp;#39;t home. (My dad&amp;#39;s house is kinda my safe space because my mom&amp;#39;s really overly critical and sometimes emotionally abusive.) I don&amp;#39;t do enough with my life because there are kids volunteering, doing two jobs at once, and actually working whereas I just sit around and exist all day. I already feel like enough of a nobody without her dissing me. Ugh, great, Mom. Everyone you know is fucking so much better than I am! GOOD FOR THEM, WOULD THEY LIKE A COOKIE? And if you love them so much, Mom, &lt;em&gt;why don&amp;#39;t you fucking marry them&lt;/em&gt;? (I know that sounds childish but that&amp;#39;s just how I feel, what of it.)&lt;/p&gt;\n\n&lt;p&gt;• I&amp;#39;m just so fucked up in general. My life literally &lt;em&gt;is&lt;/em&gt; a cautionary tale. Too many relationships gone wrong, too many dick moves on my part, too much idiot stuff that I said and did and regret and the worst part is &lt;em&gt;I remember every single bad move I made&lt;/em&gt;. I get mad at myself very, very easily and I hardly think that I&amp;#39;m wrong for doing so. (I&amp;#39;d rather not say what specifically I did, but let&amp;#39;s just say I&amp;#39;m not exactly the Virgin Mary nor am I one who has a perfect clean mouth and actually watches their mouth 100% of the time)&lt;/p&gt;\n\n&lt;p&gt;• I find that the more time I spend online, the worse I feel... on Tumblr &lt;em&gt;and&lt;/em&gt; Reddit. It seems like all people care about these days is being right; they don&amp;#39;t actually care about the people reading what they write. (Yeah I know, hypocritical, because I&amp;#39;m a huge douche myself.) If I were to write something back to them, they&amp;#39;d just be even more hurtful. (Again, maybe what they write isn&amp;#39;t meant to be hurtful. Maybe I&amp;#39;m just overreacting. But I am REALLY sensitive.)&lt;/p&gt;\n\n&lt;p&gt;• There is one more thing but if I say it, it&amp;#39;ll sound like I&amp;#39;m trolling.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this was incoherent, I&amp;#39;m happy to answer questions if you want.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Why? Welll....\n\n• First of all I used to identify as genderqueer and gender fluid, and according to this one biologist from /r/TumblrInAction, the brain can only be male, female, or somewhere in between; the gender can't change because white-to-gray matter ratios don't change. Now I feel like a transtrender, because I'd been having doubts that I was trans since I've been feeling slightly more female than male lately, and as a kid I was more girly, then tomboyish, then in between, then more girly from like 5-10th grade. But I do experience gender dysphoria of some sort (I hate the way people expect me to act as a woman, like because I have a feminine face people expect me to wear dresses and have long hair like I used to, saying \"ohhh you looked pretty you looked pretty!\" and every time I heard the word pretty I felt as though I would vomit), and I sometimes wish I had a penis. I also hate the shit out of gender roles... but that's another story. My mom also thinks trans men are gender traitors and said it was disgusting that I wanted to look masculine. (I'm still a feminist regardless of my gender so I really don't think I'm a gender traitor.) Why did I have to be gender fluid? Why couldn't I be androgyne or FTM or something that actually exists according to biology? Why couldn't I be some kind of gender constant so that I could be more sure of myself? Like one day I'll be so sure that I feel male then I'll start feeling more female and I'll feel like shit.\n\n• Second: In general my existence feels like it burdens other people and I'm not a benefit to anyone, except maybe my imaginary friends who need me to survive. (That's the only reason I didn't kill myself yet; I don't wanna kill them... yes I'm 17 and have imaginary friends, don't judge me -.-) I'm doing less well in school, I'm turning into a total burnout who spends too much time online rather than studying (actually I should be studying right now but I felt I really needed to let this out), and I don't go outside anymore. I literally forgot how to have fun. All I do is go on Tumblr and Reddit all day. I don't do anything, I don't have a life. I'm secretly kind of proud of that, which is what bothers me too. My mom has lectured me about this several times, saying that even my six year old cousin goes out and does stuff and wakes up early (today I woke up at 4pm and she yelled at me -- well that's what I told her anyway. Actually I woke up at 8:30 and went to church, but she doesn't know I go because she's anti-Christianity so basically I got yelled at for something I didn't do). My mom then proceeded to compare me to my one really smart, overachieving friend who got accepted to Oxford and said \"SHE DOES SO MUCH, YOU SHOULD BE MORE LIKE HER AND SPEND MORE TIME WITH HER!\" My mom also said that she's going to call me at 10:30am on weekends every day and make sure I'm up, and that my dad can't have me anymore if he isn't home. (My dad's house is kinda my safe space because my mom's really overly critical and sometimes emotionally abusive.) I don't do enough with my life because there are kids volunteering, doing two jobs at once, and actually working whereas I just sit around and exist all day. I already feel like enough of a nobody without her dissing me. Ugh, great, Mom. Everyone you know is fucking so much better than I am! GOOD FOR THEM, WOULD THEY LIKE A COOKIE? And if you love them so much, Mom, *why don't you fucking marry them*? (I know that sounds childish but that's just how I feel, what of it.)\n\n• I'm just so fucked up in general. My life literally *is* a cautionary tale. Too many relationships gone wrong, too many dick moves on my part, too much idiot stuff that I said and did and regret and the worst part is *I remember every single bad move I made*. I get mad at myself very, very easily and I hardly think that I'm wrong for doing so. (I'd rather not say what specifically I did, but let's just say I'm not exactly the Virgin Mary nor am I one who has a perfect clean mouth and actually watches their mouth 100% of the time)\n\n• I find that the more time I spend online, the worse I feel... on Tumblr *and* Reddit. It seems like all people care about these days is being right; they don't actually care about the people reading what they write. (Yeah I know, hypocritical, because I'm a huge douche myself.) If I were to write something back to them, they'd just be even more hurtful. (Again, maybe what they write isn't meant to be hurtful. Maybe I'm just overreacting. But I am REALLY sensitive.)\n\n• There is one more thing but if I say it, it'll sound like I'm trolling.\n\nSorry if this was incoherent, I'm happy to answer questions if you want.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24qtvy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway2394239847", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24qtvy/legitimately_think_the_world_would_be_better_off/", "name": "t3_24qtvy", "created": 1399287484.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24qtvy/legitimately_think_the_world_would_be_better_off/", "author_flair_text": null, "title": "Legitimately think the world would be better off without me", "created_utc": 1399258684.0, "ups": 3, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9uh8z", "gilded": 0, "author": "razzliox", "parent_id": "t1_ch9u4hn", "approved_by": null, "body": "&gt; I just feel like I've wronged too many people.\n\nI don't think that this is a valid thought. You've wronged too many people for what? To deserve to live? No, if you've truly wronged that many people (which I doubt), then the logical conclucsion is that you're obligated to live - to make up for your wrongs.\n\nI mean, yeah, singing in class could be obnoxious, but I don't see why that makes you a bad person. Even the other things. I've done bad things too. We all have. And even if you are a bad person, that doesn't mean you can't change.\n\nI don't think that nobody would notice if you drowned yourself. I'm sure someone would. We always give ourselves less credit than we should. I think you're important, and I barely know you.\n\n&gt;I should have less than the poor kid because I'm trash, human trash. I don't deserve to live.\n\nPeople don't earn the right to live. Life is an inherent right. People can *lose* the right to live, but you haven't. You don't owe people your own success - you owe yourself your success. Everything that has been given to you is a gift; you haven't signed a contract saying that you will help humanity. \n\nIt's not your fault that your mom is an angry, yelling person. While you can make a person's life worse, you can't make that person worse. I think that you can only make a person better; making them worse is on them. Besides, if you could, would you really be a worse person for it? If you turned someone into a loving person, and that person did good in the world, would you take credit for that good? Of course not. The logical extension follows.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I just feel like I&amp;#39;ve wronged too many people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think that this is a valid thought. You&amp;#39;ve wronged too many people for what? To deserve to live? No, if you&amp;#39;ve truly wronged that many people (which I doubt), then the logical conclucsion is that you&amp;#39;re obligated to live - to make up for your wrongs.&lt;/p&gt;\n\n&lt;p&gt;I mean, yeah, singing in class could be obnoxious, but I don&amp;#39;t see why that makes you a bad person. Even the other things. I&amp;#39;ve done bad things too. We all have. And even if you are a bad person, that doesn&amp;#39;t mean you can&amp;#39;t change.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think that nobody would notice if you drowned yourself. I&amp;#39;m sure someone would. We always give ourselves less credit than we should. I think you&amp;#39;re important, and I barely know you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I should have less than the poor kid because I&amp;#39;m trash, human trash. I don&amp;#39;t deserve to live.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;People don&amp;#39;t earn the right to live. Life is an inherent right. People can &lt;em&gt;lose&lt;/em&gt; the right to live, but you haven&amp;#39;t. You don&amp;#39;t owe people your own success - you owe yourself your success. Everything that has been given to you is a gift; you haven&amp;#39;t signed a contract saying that you will help humanity. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not your fault that your mom is an angry, yelling person. While you can make a person&amp;#39;s life worse, you can&amp;#39;t make that person worse. I think that you can only make a person better; making them worse is on them. Besides, if you could, would you really be a worse person for it? If you turned someone into a loving person, and that person did good in the world, would you take credit for that good? Of course not. The logical extension follows.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qtvy", "score_hidden": false, "name": "t1_ch9uh8z", "created": 1399295582.0, "author_flair_text": null, "created_utc": 1399266782.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9u4hn", "gilded": 0, "author": "throwaway2394239847", "parent_id": "t1_ch9sxz5", "approved_by": null, "body": "I just feel like I've wronged too many people. I acted up in class for the first time on Friday, which wasn't really acting up but when I was called on it I realized how stupid I was being. (Basically what happened is people were talking to each other and I started singing. The teacher called me out on it and told me people were trying to study. I was like, FUCK, I GUESS I'M A BAD PERSON NOW! WOW, WHY DO I SUCK SO MUCH?) On top of that I have cheated on people before and dumped people for people.\n\nI don't know... in general I feel like I'm taking up space. My parents pay for my food and shelter and it's going to... who? Some stupid dumbshit with life aspirations sie'll never fulfill, who would never get accepted to some fucking Ivy League school, who used to be smart but no longer is (I was a baby genius and then became boring when I got older), whose bratty six year old cousin is actually superior to hir in some ways.\n\nIf I just drowned myself in the river some blocks from my house and didn't tell anyone, nobody would notice. Nobody but my dad, and my mom would care but she would also think I'm pathetic and stupid. (Not even exaggerating, I once told her that I self harm and she said it was stupid and she didn't care about my feelings.)\n\nI haven't been studying as much. I enjoy learning things but never memorize. I even have exams and I already think I'm going to fail. I'm nothing more than stupid. I know it too. All my friends are smarter than me and will be more successful in life. Sometimes it feels like I may as well commit suicide because it's better than just having the world keep wasting its resources on me when it could go to someone more deserving. Why can't they kill me and just give everything I have to some poor kid in Africa? It's not like I should have it. I should have less than the poor kid because I'm trash, human trash. I don't deserve to live.\n\n&gt;  I can't say you're helpful to other people.\n\nNeither can I. I don't help. As much as I hate to admit it, I only seem to care about myself and do what helps me most. I made my poor mom into an angry, yelling person, which she apparently wasn't originally.\n\n&gt; The past is the past. Try to leave it there. \n\nI have flashbacks too much. I have a really, really good memory and it's so hard to forget certain stuff even though I want to.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just feel like I&amp;#39;ve wronged too many people. I acted up in class for the first time on Friday, which wasn&amp;#39;t really acting up but when I was called on it I realized how stupid I was being. (Basically what happened is people were talking to each other and I started singing. The teacher called me out on it and told me people were trying to study. I was like, FUCK, I GUESS I&amp;#39;M A BAD PERSON NOW! WOW, WHY DO I SUCK SO MUCH?) On top of that I have cheated on people before and dumped people for people.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know... in general I feel like I&amp;#39;m taking up space. My parents pay for my food and shelter and it&amp;#39;s going to... who? Some stupid dumbshit with life aspirations sie&amp;#39;ll never fulfill, who would never get accepted to some fucking Ivy League school, who used to be smart but no longer is (I was a baby genius and then became boring when I got older), whose bratty six year old cousin is actually superior to hir in some ways.&lt;/p&gt;\n\n&lt;p&gt;If I just drowned myself in the river some blocks from my house and didn&amp;#39;t tell anyone, nobody would notice. Nobody but my dad, and my mom would care but she would also think I&amp;#39;m pathetic and stupid. (Not even exaggerating, I once told her that I self harm and she said it was stupid and she didn&amp;#39;t care about my feelings.)&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t been studying as much. I enjoy learning things but never memorize. I even have exams and I already think I&amp;#39;m going to fail. I&amp;#39;m nothing more than stupid. I know it too. All my friends are smarter than me and will be more successful in life. Sometimes it feels like I may as well commit suicide because it&amp;#39;s better than just having the world keep wasting its resources on me when it could go to someone more deserving. Why can&amp;#39;t they kill me and just give everything I have to some poor kid in Africa? It&amp;#39;s not like I should have it. I should have less than the poor kid because I&amp;#39;m trash, human trash. I don&amp;#39;t deserve to live.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t say you&amp;#39;re helpful to other people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Neither can I. I don&amp;#39;t help. As much as I hate to admit it, I only seem to care about myself and do what helps me most. I made my poor mom into an angry, yelling person, which she apparently wasn&amp;#39;t originally.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The past is the past. Try to leave it there. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have flashbacks too much. I have a really, really good memory and it&amp;#39;s so hard to forget certain stuff even though I want to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qtvy", "score_hidden": false, "name": "t1_ch9u4hn", "created": 1399269262.0, "author_flair_text": null, "created_utc": 1399265662.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9sxz5", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24qtvy", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qtvy", "score_hidden": false, "name": "t1_ch9sxz5", "created": 1399265894.0, "author_flair_text": null, "created_utc": 1399262294.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]