[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I&amp;#39;m going to kill myself.\nNo, nobody in my close family recently died, my girlfriend didn&amp;#39;t left me. I never had any problems in my life.\nI have a normal family. Money is not a problem, I can make any amount which isn&amp;#39;t sky high without hard work. I am currently in college and have great grades. So lets take all that away because none of it matters to me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m guessing you are asking why am I going to kill myself then? Well.. I no longer have interest in life. Since age of 10 I always wanted to know why am I alive, what is the point of all this? Nobody could give me an answer which wasn&amp;#39;t some religion-spiritual-moral stuff. I mean, you are born, you go to school, make friends, get a job, get married and then repeat everything for 30 years until you die? Seriously?! That&amp;#39;s it? Are you fucking kidding me? And then there is religion which claims that this is my destiny or that I will go to heaven? I don&amp;#39;t know about you, but I just can&amp;#39;t live without purpose, why should I go through all that just to die on end? Whats the point of all this? Experiencing every possible emotion? Let me tell you about emotion, I no longer feel it. Have you ever gone to a gore website, read a story, a person died and that made you sad and depressed? Yeah, that never happened to me, I had 3 family deaths and none of them made me sad, I&amp;#39;ve been on their funerals where everyone cried and I couldn&amp;#39;t even feel sad. I have spent days upon days sitting here on reddit reading the most soul crushing stories I could find in hope to at least feel human for a bit, but the more I searched for the more I was realizing that I just can&amp;#39;t feel it.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s all there is to life. Learn,sleep, have fun,get a girlfriend,work = repeat till death. I just can&amp;#39;t live with that. I want to know the point of life, why and how we got on planet Earth, what made this universe? Is there so called God? Are we alone in the universe? Am I a simulation? These are just some questions I want answered, many others reside in my brain.&lt;/p&gt;\n\n&lt;p&gt;And no, I cant find answer to these questions if I&amp;#39;m alive, this world is based on corruption, money and death.&lt;/p&gt;\n\n&lt;p&gt;TL;DR- Can&amp;#39;t feel any emotion, want to find answer questions above.&lt;/p&gt;\n\n&lt;p&gt;For all those intelligent individuals which will reply to my post, please take the &amp;#39;good guy white knight&amp;#39; mask off and answer as I&amp;#39;m your best friend. Looking forward to your answers! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yes, I'm going to kill myself.\nNo, nobody in my close family recently died, my girlfriend didn't left me. I never had any problems in my life.\nI have a normal family. Money is not a problem, I can make any amount which isn't sky high without hard work. I am currently in college and have great grades. So lets take all that away because none of it matters to me.\n\n\nI'm guessing you are asking why am I going to kill myself then? Well.. I no longer have interest in life. Since age of 10 I always wanted to know why am I alive, what is the point of all this? Nobody could give me an answer which wasn't some religion-spiritual-moral stuff. I mean, you are born, you go to school, make friends, get a job, get married and then repeat everything for 30 years until you die? Seriously?! That's it? Are you fucking kidding me? And then there is religion which claims that this is my destiny or that I will go to heaven? I don't know about you, but I just can't live without purpose, why should I go through all that just to die on end? Whats the point of all this? Experiencing every possible emotion? Let me tell you about emotion, I no longer feel it. Have you ever gone to a gore website, read a story, a person died and that made you sad and depressed? Yeah, that never happened to me, I had 3 family deaths and none of them made me sad, I've been on their funerals where everyone cried and I couldn't even feel sad. I have spent days upon days sitting here on reddit reading the most soul crushing stories I could find in hope to at least feel human for a bit, but the more I searched for the more I was realizing that I just can't feel it.\n\n\nSo that's all there is to life. Learn,sleep, have fun,get a girlfriend,work = repeat till death. I just can't live with that. I want to know the point of life, why and how we got on planet Earth, what made this universe? Is there so called God? Are we alone in the universe? Am I a simulation? These are just some questions I want answered, many others reside in my brain.\n\nAnd no, I cant find answer to these questions if I'm alive, this world is based on corruption, money and death.\n\nTL;DR- Can't feel any emotion, want to find answer questions above.\n\nFor all those intelligent individuals which will reply to my post, please take the 'good guy white knight' mask off and answer as I'm your best friend. Looking forward to your answers! ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23vb9v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nogodnomenonlydeath", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23vb9v/let_me_tell_you_about_life/", "name": "t3_23vb9v", "created": 1398384826.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23vb9v/let_me_tell_you_about_life/", "author_flair_text": null, "title": "Let me tell you about life.", "created_utc": 1398356026.0, "ups": 10, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch16n39", "gilded": 0, "author": "UnitCuboid", "parent_id": "t3_23vb9v", "approved_by": null, "body": "Can I ask what program you are in in school?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can I ask what program you are in in school?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vb9v", "score_hidden": false, "name": "t1_ch16n39", "created": 1398379491.0, "author_flair_text": null, "created_utc": 1398375891.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1c2ou", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23vb9v", "approved_by": null, "body": "'Let me tell you about emotion, I no longer feel it.'\n\nI want you to know that this is a classic sign of clinical depression.  Have you ever thought about seeking help from a mental health professional?  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#39;Let me tell you about emotion, I no longer feel it.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;I want you to know that this is a classic sign of clinical depression.  Have you ever thought about seeking help from a mental health professional?  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vb9v", "score_hidden": false, "name": "t1_ch1c2ou", "created": 1398391599.0, "author_flair_text": null, "created_utc": 1398387999.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]