[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately over the course of my life I have adopted a nihilistic view on the world, that is to say, I believe everything that ever was and ever will has no inherent meaning objectively and that any meaning humans have ever stamped and re-stamped on things are pointless and only there to suit our emotions or thoughts.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 17 and I&amp;#39;m not going to lie, my life is pretty darn privileged. My family is too good for me, they take me to the best school around, they try to give me the best education available, and they are the nicest people I&amp;#39;ve ever known. I&amp;#39;ve developed my own interests and life is looking bright for me in the future. Unlike many other suicidal people which I respect, they have gone through much worse things than I have gone through. My life could very well be the butt of a joke.&lt;/p&gt;\n\n&lt;p&gt;This however does not stop me from trying to understand the world around me. The more I think about life and the universe, the more I see that everything around me is pointless, in other words, things simply exist because they &lt;em&gt;can&lt;/em&gt;. This alone is not enough to make me feel like ending my life, it does not incline me to. However, in the big picture, I think it does.&lt;/p&gt;\n\n&lt;p&gt;I feel like I&amp;#39;m on predetermined rollercoaster built for me by society itself. Be born, go to kindergarden, go to school, go to high school, go to college, work on your favorite topic, become certified, work to sustain your life in society, perhaps make friends along the way, and &lt;strong&gt;eventually die&lt;/strong&gt;. And then it hit me, if I&amp;#39;m going to eventually die.. no.. if EVERYONE is going to eventually die and effectively make all their careers, all their social progress, all their happiness and dreams, all their emotions and desires, everything that we are, collectively become null. Then what is the point of riding this roller coaster of life? Because its &lt;em&gt;fun&lt;/em&gt;? Because there is nothing before and after the rollercoaster? Because the next riders will remember us? That&amp;#39;s not good enough for me. I don&amp;#39;t want to exist simply because I can, because the more I build of my life the more regret I will have on my deathbed. &lt;em&gt;WHY&lt;/em&gt; should I work for my entire life to appease the goals ingrained in my head by society, only to let it go in the end in heartbeat? Is it worth caring about my family&amp;#39;s emotions when my death or their death is going to happen regardless if it happens now or later?&lt;/p&gt;\n\n&lt;p&gt;TL:DR; Everyone&amp;#39;s life always ends with death, why not kill myself now and save myself the grief?&lt;/p&gt;\n\n&lt;p&gt;Please help me reddit, I don&amp;#39;t know what to do anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Unfortunately over the course of my life I have adopted a nihilistic view on the world, that is to say, I believe everything that ever was and ever will has no inherent meaning objectively and that any meaning humans have ever stamped and re-stamped on things are pointless and only there to suit our emotions or thoughts.\n\nI'm 17 and I'm not going to lie, my life is pretty darn privileged. My family is too good for me, they take me to the best school around, they try to give me the best education available, and they are the nicest people I've ever known. I've developed my own interests and life is looking bright for me in the future. Unlike many other suicidal people which I respect, they have gone through much worse things than I have gone through. My life could very well be the butt of a joke.\n\nThis however does not stop me from trying to understand the world around me. The more I think about life and the universe, the more I see that everything around me is pointless, in other words, things simply exist because they *can*. This alone is not enough to make me feel like ending my life, it does not incline me to. However, in the big picture, I think it does.\n\nI feel like I'm on predetermined rollercoaster built for me by society itself. Be born, go to kindergarden, go to school, go to high school, go to college, work on your favorite topic, become certified, work to sustain your life in society, perhaps make friends along the way, and **eventually die**. And then it hit me, if I'm going to eventually die.. no.. if EVERYONE is going to eventually die and effectively make all their careers, all their social progress, all their happiness and dreams, all their emotions and desires, everything that we are, collectively become null. Then what is the point of riding this roller coaster of life? Because its *fun*? Because there is nothing before and after the rollercoaster? Because the next riders will remember us? That's not good enough for me. I don't want to exist simply because I can, because the more I build of my life the more regret I will have on my deathbed. *WHY* should I work for my entire life to appease the goals ingrained in my head by society, only to let it go in the end in heartbeat? Is it worth caring about my family's emotions when my death or their death is going to happen regardless if it happens now or later?\n\nTL:DR; Everyone's life always ends with death, why not kill myself now and save myself the grief?\n\nPlease help me reddit, I don't know what to do anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24r44y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway21056", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24r44y/life_is_meaningless_in_my_opinion/", "name": "t3_24r44y", "created": 1399295526.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24r44y/life_is_meaningless_in_my_opinion/", "author_flair_text": null, "title": "Life is meaningless (in my opinion)", "created_utc": 1399266726.0, "ups": 2, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9vcg9", "gilded": 0, "author": "Sir_Henry", "parent_id": "t3_24r44y", "approved_by": null, "body": "Hi. I might not be very helpful here... I struggle with those same exact thoughts myself and can't really rationalize my way out of them. Sometimes [this relevant xkcd](https://xkcd.com/167/) helps, sometimes it doesn't. I don't want to do anything 'extraordinary' with my life, I don't want to show off to other people, because they're just \"part of the same compost heap\" and it doesn't matter. I'd like to enjoy myself, climb things for the sake of climbing things, run for the sake of running, drink tea for the sake of tea... when I'm feeling optimistic, I can hold on to that comic and these thoughts. But it doesn't always help.\n\nI feel like I'm missing something everyone else is getting. Why do they want to live? Is there some secret to life I have forgotten? I think I wouldn't want to live even if everything was perfect. Although when I'm feeling better - which would be more often if I didn't struggle with depression, anxiety, eating disorders and self injury - I find the thought of meaninglessness comforting. Liberating. It seems that however I screw up - however fat or thin I get, however many scars I have, however many tests I fail - it doesn't matter. I'm still alive, I can still keep talking \"deep\" with my friends, I can still climb things, I can still run... \n\nI can keep myself alive by thinking about things I'm looking forward to. I'm going to London with a friend, I'm going to turn 18, I'm going to study biomedicine, I'm going to watch movies at full volume in the middle of the night, etc... It works both ways, though. Do you have things to look forward to? Sometimes it is hard to keep living, even if you try to think of these things. But I think that even if you feel rational about it, emotional states of mind have something to do with it.\n\nWell, this kinda became a rant about myself. Sorry about that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I might not be very helpful here... I struggle with those same exact thoughts myself and can&amp;#39;t really rationalize my way out of them. Sometimes &lt;a href=\"https://xkcd.com/167/\"&gt;this relevant xkcd&lt;/a&gt; helps, sometimes it doesn&amp;#39;t. I don&amp;#39;t want to do anything &amp;#39;extraordinary&amp;#39; with my life, I don&amp;#39;t want to show off to other people, because they&amp;#39;re just &amp;quot;part of the same compost heap&amp;quot; and it doesn&amp;#39;t matter. I&amp;#39;d like to enjoy myself, climb things for the sake of climbing things, run for the sake of running, drink tea for the sake of tea... when I&amp;#39;m feeling optimistic, I can hold on to that comic and these thoughts. But it doesn&amp;#39;t always help.&lt;/p&gt;\n\n&lt;p&gt;I feel like I&amp;#39;m missing something everyone else is getting. Why do they want to live? Is there some secret to life I have forgotten? I think I wouldn&amp;#39;t want to live even if everything was perfect. Although when I&amp;#39;m feeling better - which would be more often if I didn&amp;#39;t struggle with depression, anxiety, eating disorders and self injury - I find the thought of meaninglessness comforting. Liberating. It seems that however I screw up - however fat or thin I get, however many scars I have, however many tests I fail - it doesn&amp;#39;t matter. I&amp;#39;m still alive, I can still keep talking &amp;quot;deep&amp;quot; with my friends, I can still climb things, I can still run... &lt;/p&gt;\n\n&lt;p&gt;I can keep myself alive by thinking about things I&amp;#39;m looking forward to. I&amp;#39;m going to London with a friend, I&amp;#39;m going to turn 18, I&amp;#39;m going to study biomedicine, I&amp;#39;m going to watch movies at full volume in the middle of the night, etc... It works both ways, though. Do you have things to look forward to? Sometimes it is hard to keep living, even if you try to think of these things. But I think that even if you feel rational about it, emotional states of mind have something to do with it.&lt;/p&gt;\n\n&lt;p&gt;Well, this kinda became a rant about myself. Sorry about that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r44y", "score_hidden": false, "name": "t1_ch9vcg9", "created": 1399298654.0, "author_flair_text": null, "created_utc": 1399269854.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9vml2", "gilded": 0, "author": "PotentNative", "parent_id": "t1_ch9veoq", "approved_by": null, "body": "We are alive, so we have a choice to make: we can either terminate life now, or we can choose what we want to live for. If you're living in terrible pain and suffering with no possibility of reprieve, then *maybe* the former is a justifiable course of action. But otherwise, you can think of life as this elaborate game where you get to decide what the goal is, and what points are. Even if you believe that the game is objectively meaningless, you give it meaning through those decisions. That's not an attempt to forget the meaninglessness, it's sort-of celebrating it.\n\nAll the factors that you highlight have an enormous influence on my life, my opinions and my actions. But that's not to say that I have no choice in the matter. Whatever your views on free will and determinism, there is a subjective belief (illusion?) of choice that's undeniable. \n\nIt's also true that my choice to do what is morally right comes from the fact that it makes me feel better about myself, and that not doing so would wrack me with guilt. But does that make my actions any less \"right\"?\n\nNone of this means that life is not worth living. If the sum-total of happiness/accomplishments (as defined by you) over your future is likely to be greater than unhappiness, then there is no reason to terminate life prematurely. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are alive, so we have a choice to make: we can either terminate life now, or we can choose what we want to live for. If you&amp;#39;re living in terrible pain and suffering with no possibility of reprieve, then &lt;em&gt;maybe&lt;/em&gt; the former is a justifiable course of action. But otherwise, you can think of life as this elaborate game where you get to decide what the goal is, and what points are. Even if you believe that the game is objectively meaningless, you give it meaning through those decisions. That&amp;#39;s not an attempt to forget the meaninglessness, it&amp;#39;s sort-of celebrating it.&lt;/p&gt;\n\n&lt;p&gt;All the factors that you highlight have an enormous influence on my life, my opinions and my actions. But that&amp;#39;s not to say that I have no choice in the matter. Whatever your views on free will and determinism, there is a subjective belief (illusion?) of choice that&amp;#39;s undeniable. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also true that my choice to do what is morally right comes from the fact that it makes me feel better about myself, and that not doing so would wrack me with guilt. But does that make my actions any less &amp;quot;right&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;None of this means that life is not worth living. If the sum-total of happiness/accomplishments (as defined by you) over your future is likely to be greater than unhappiness, then there is no reason to terminate life prematurely. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r44y", "score_hidden": false, "name": "t1_ch9vml2", "created": 1399299765.0, "author_flair_text": null, "created_utc": 1399270965.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9veoq", "gilded": 0, "author": "throwaway21056", "parent_id": "t1_ch9v60a", "approved_by": null, "body": "If objectively life has no inherent meaning then I perceive any attempt at defining my own meaning for life as a weak attempt at escaping (what I consider to be) the truth.  I think it's a way for someone to repress the thought that maybe all they've worked for could be for naught. \n\nI believe that to be truly free you have to understand that you are not free at all. Every decision you have ever taken is due to a combination of ingrained social influence, tradition, emotions, \"morality\", past experiences, and millions of years of evolution. Nothing anyone ever does is done for the purpose of being \"right\", but for the purpose of pleasing their neurochemistry and standards they were raised into.", "edited": 1399270296.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If objectively life has no inherent meaning then I perceive any attempt at defining my own meaning for life as a weak attempt at escaping (what I consider to be) the truth.  I think it&amp;#39;s a way for someone to repress the thought that maybe all they&amp;#39;ve worked for could be for naught. &lt;/p&gt;\n\n&lt;p&gt;I believe that to be truly free you have to understand that you are not free at all. Every decision you have ever taken is due to a combination of ingrained social influence, tradition, emotions, &amp;quot;morality&amp;quot;, past experiences, and millions of years of evolution. Nothing anyone ever does is done for the purpose of being &amp;quot;right&amp;quot;, but for the purpose of pleasing their neurochemistry and standards they were raised into.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r44y", "score_hidden": false, "name": "t1_ch9veoq", "created": 1399298890.0, "author_flair_text": null, "created_utc": 1399270090.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch9v60a", "gilded": 0, "author": "PotentNative", "parent_id": "t3_24r44y", "approved_by": null, "body": "I too believe that life doesn't have any inherent meaning. We're all just carbon-based lifeforms momentarily taking this shape for a short time, in the larger scheme of things. And you're right, that's no reason to die. That thought sort-of frees you up in a way: you get to *choose* what meaning you want to give your life. I love learning more about the world around me, and that pursuit of knowledge is partly how I define meaning in my life. Isn't that reason enough to live?\n\nI too come from a rather privileged background, having suffered few hardships in life and being the benefactor of a lot of endowments that I didn't earn. So another thing that keeps me going is the idea that it is my obligation to use my (metaphorical) fortune to recognize and work for causes that benefit others the most. Even though I realize people are just bags of meat and water, their emotions, whether happiness or sorrow; fear or gratitude; is very much real, and if I can make a positive contribution to it in any way at all, it is almost incumbent upon me to do so. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I too believe that life doesn&amp;#39;t have any inherent meaning. We&amp;#39;re all just carbon-based lifeforms momentarily taking this shape for a short time, in the larger scheme of things. And you&amp;#39;re right, that&amp;#39;s no reason to die. That thought sort-of frees you up in a way: you get to &lt;em&gt;choose&lt;/em&gt; what meaning you want to give your life. I love learning more about the world around me, and that pursuit of knowledge is partly how I define meaning in my life. Isn&amp;#39;t that reason enough to live?&lt;/p&gt;\n\n&lt;p&gt;I too come from a rather privileged background, having suffered few hardships in life and being the benefactor of a lot of endowments that I didn&amp;#39;t earn. So another thing that keeps me going is the idea that it is my obligation to use my (metaphorical) fortune to recognize and work for causes that benefit others the most. Even though I realize people are just bags of meat and water, their emotions, whether happiness or sorrow; fear or gratitude; is very much real, and if I can make a positive contribution to it in any way at all, it is almost incumbent upon me to do so. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r44y", "score_hidden": false, "name": "t1_ch9v60a", "created": 1399297981.0, "author_flair_text": null, "created_utc": 1399269181.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9z0jo", "gilded": 0, "author": "Havasufalls", "parent_id": "t3_24r44y", "approved_by": null, "body": "What makes you so sure that death is oblivion? There is a great deal of evidence that death is like the end of a movie where we are playing one of the roles in the story.\n\nIf that is the case, then it is entirely possible, even probable, that our life here is profoundly important.\n\nIt's certainly worth investigating before you kill yourself over a belief that may be completely incorrect.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What makes you so sure that death is oblivion? There is a great deal of evidence that death is like the end of a movie where we are playing one of the roles in the story.&lt;/p&gt;\n\n&lt;p&gt;If that is the case, then it is entirely possible, even probable, that our life here is profoundly important.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s certainly worth investigating before you kill yourself over a belief that may be completely incorrect.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24r44y", "score_hidden": false, "name": "t1_ch9z0jo", "created": 1399318806.0, "author_flair_text": null, "created_utc": 1399290006.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]