[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been depressed ever since my mother passed away in 2011. I enrolled into college because my family believed that it&amp;#39;s the only way to find a job and make a living off it. I enrolled to a SUNY because I wanted to get away from home. I have no idea why I did that. The first year I was doing well in some required courses. I did well in them and got a 3.6 for the first semester. But I felt home-sick. I hated living on campus where it felt like I was trapped and I had trouble meeting new people. A few friends from highschool had gone to the same college as me but I did not enjoy hanging out with them. But since I longed for some social interactions I hung out with them and really felt awkward most of the time. I hated hanging out with them but I really needed it too. I tried to transfer back to CUNY so I would be able to live at home, but I screwed up some paper work and was stuck in the SUNY for 3 semesters in total.&lt;/p&gt;\n\n&lt;p&gt;During the last two semesters I stopped hanging out with people and just stayed in my room all day to play leagueoflegends. I had started to cut classes and my grades took a hit. I started feeling upset because I had no idea what I wanted to to in college and I felt pressured into taking these courses for premed because my sister said it was the smarter choice and my dad really wants me to become a doctor. I stopped paying attention when I questioned why I forced myself to take these courses that I really have no interest in. I skipped more classes and soon I just stopped going. At this point I&amp;#39;ve basically took out loans that accumulate to probably 15grand to stay in a shitty dorm to play games and hide from the world. I knew my family, especially my dad would hate me a shit load if I let them know how horrible I&amp;#39;ve been doing in class so I told them I was doing okay.\nI managed to transfer over to a CUNY so I could hang out with my close friends and stay at home where I was familiar. Luckily I had some financial aid to take care of 1 semester at this school but soon I messed that up too. I had lost my financial aid for the following semester because my GPA had dropped too low. Now I&amp;#39;m in my 3rd semester at this school and I owe 6grand for the past two semesters. and have no job. For some reason they let me take classes even though I owed money.&lt;/p&gt;\n\n&lt;p&gt;Now I think the truth is about to come out because I really don&amp;#39;t want to take another semester and dig a deeper hole into this crater of failures. I&amp;#39;m really scared that I will get thrown out of the house and live homeless. I think my dad is the type of person to do something like that... I know I definitely deserve it for lying for so many years and making such a mess...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been thinking about writing a note to apologize to my family and girlfriend and then ending it all..&lt;/p&gt;\n\n&lt;p&gt;What should I do reddit?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been depressed ever since my mother passed away in 2011. I enrolled into college because my family believed that it's the only way to find a job and make a living off it. I enrolled to a SUNY because I wanted to get away from home. I have no idea why I did that. The first year I was doing well in some required courses. I did well in them and got a 3.6 for the first semester. But I felt home-sick. I hated living on campus where it felt like I was trapped and I had trouble meeting new people. A few friends from highschool had gone to the same college as me but I did not enjoy hanging out with them. But since I longed for some social interactions I hung out with them and really felt awkward most of the time. I hated hanging out with them but I really needed it too. I tried to transfer back to CUNY so I would be able to live at home, but I screwed up some paper work and was stuck in the SUNY for 3 semesters in total.\n\n\nDuring the last two semesters I stopped hanging out with people and just stayed in my room all day to play leagueoflegends. I had started to cut classes and my grades took a hit. I started feeling upset because I had no idea what I wanted to to in college and I felt pressured into taking these courses for premed because my sister said it was the smarter choice and my dad really wants me to become a doctor. I stopped paying attention when I questioned why I forced myself to take these courses that I really have no interest in. I skipped more classes and soon I just stopped going. At this point I've basically took out loans that accumulate to probably 15grand to stay in a shitty dorm to play games and hide from the world. I knew my family, especially my dad would hate me a shit load if I let them know how horrible I've been doing in class so I told them I was doing okay.\nI managed to transfer over to a CUNY so I could hang out with my close friends and stay at home where I was familiar. Luckily I had some financial aid to take care of 1 semester at this school but soon I messed that up too. I had lost my financial aid for the following semester because my GPA had dropped too low. Now I'm in my 3rd semester at this school and I owe 6grand for the past two semesters. and have no job. For some reason they let me take classes even though I owed money.\n\n\nNow I think the truth is about to come out because I really don't want to take another semester and dig a deeper hole into this crater of failures. I'm really scared that I will get thrown out of the house and live homeless. I think my dad is the type of person to do something like that... I know I definitely deserve it for lying for so many years and making such a mess...\n\n\nI've been thinking about writing a note to apologize to my family and girlfriend and then ending it all..\n\n\nWhat should I do reddit?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24luh6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway112331", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24luh6/life_is_a_wreck_family_might_kick_me_out_if_they/", "name": "t3_24luh6", "created": 1399128820.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24luh6/life_is_a_wreck_family_might_kick_me_out_if_they/", "author_flair_text": null, "title": "Life is a wreck. Family might kick me out if they found out the truth.", "created_utc": 1399100020.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]