[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Feelings are very difficult to convey (as many of you here probably know) and I wish to rid myself of them.&lt;/p&gt;\n\n&lt;p&gt;For just about my entire life I&amp;#39;ve had some degree of depression. Just the other day I found an old journal of mine from when I was 11 or 12 and it said something along the lines of, &amp;quot;I&amp;#39;m sad all the time and I don&amp;#39;t know why. I hope it gets better.&amp;quot; This kind of though process has continued through my teenage years and now is still affecting me now that I&amp;#39;m in my 20s&lt;/p&gt;\n\n&lt;p&gt;At this stage of my life it seems to me that all the sadness and panic and despair just seem to be increasing as my ability to tolerate it doesn&amp;#39;t move. I have tried so many things to help me. A younger self was very religious - praying for strength and what not. Then a little bit older self tried cognitive behavioral therapy. Medication doesn&amp;#39;t seem to work, being very social has only exacerbated it, and cutting really only works for a short amount of time (which I&amp;#39;ve had to do just now to get through writing all of this)&lt;/p&gt;\n\n&lt;p&gt;I have not really tried suicide many times, but the idea has been there for so long. It seems to me that any joy that may come from living life is not worth the pain that I suffer. I am failing my college courses, I am constantly failing my boss at work, and I can&amp;#39;t even get up the motivation to do laundry most of the time (even if there is nothing clean left)&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I want someone to say. I&amp;#39;ve already sought so much psychiatric help and it has done very little good. I&amp;#39;m just too fucked up to be a productive member of society and should rid myself of the world so no one has to deal with me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Feelings are very difficult to convey (as many of you here probably know) and I wish to rid myself of them.\n\nFor just about my entire life I've had some degree of depression. Just the other day I found an old journal of mine from when I was 11 or 12 and it said something along the lines of, \"I'm sad all the time and I don't know why. I hope it gets better.\" This kind of though process has continued through my teenage years and now is still affecting me now that I'm in my 20s\n\nAt this stage of my life it seems to me that all the sadness and panic and despair just seem to be increasing as my ability to tolerate it doesn't move. I have tried so many things to help me. A younger self was very religious - praying for strength and what not. Then a little bit older self tried cognitive behavioral therapy. Medication doesn't seem to work, being very social has only exacerbated it, and cutting really only works for a short amount of time (which I've had to do just now to get through writing all of this)\n\nI have not really tried suicide many times, but the idea has been there for so long. It seems to me that any joy that may come from living life is not worth the pain that I suffer. I am failing my college courses, I am constantly failing my boss at work, and I can't even get up the motivation to do laundry most of the time (even if there is nothing clean left)\n\nI don't know what I want someone to say. I've already sought so much psychiatric help and it has done very little good. I'm just too fucked up to be a productive member of society and should rid myself of the world so no one has to deal with me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24sgu2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ThrowFromTheRiver", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24sgu2/life_goes_on_except_when_youre_dead/", "name": "t3_24sgu2", "created": 1399339896.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24sgu2/life_goes_on_except_when_youre_dead/", "author_flair_text": null, "title": "Life goes on... except when you're dead.", "created_utc": 1399311096.0, "ups": 5, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaczou", "gilded": 0, "author": "chaseoc", "parent_id": "t3_24sgu2", "approved_by": null, "body": "What does being a productive member of society actually mean? Is it graduating college? Is it holding down a desk job? Is it making a lot of money? Is it buying a lot of things? \n\nDon't let yourself get held down by this stuff because its pretty meaningless. What matters is what is important to you because it is your life.\n\nNow I'm not gonna tell you some cliche shit like \"you have to pull your grades up\" or \"try harder at work\" or \"find a new job and start a new life\" because in the end I think the ability to cope with all the stresses has to come from within.\n\nI know this is pretty stupid but it helps me. You should take a day and really think about your life. Not the superficial things like work and school, but just life in general. Try to separate yourself from all these societal expectations and just think about what it means to be a living breathing human with the ability to feel and love and cry. Try to look at the big picture of what we are and how we live and why. Let this perspective center your thoughts and try and let your problems melt away.\n\nPM me anytime if you want to talk bud. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does being a productive member of society actually mean? Is it graduating college? Is it holding down a desk job? Is it making a lot of money? Is it buying a lot of things? &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let yourself get held down by this stuff because its pretty meaningless. What matters is what is important to you because it is your life.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m not gonna tell you some cliche shit like &amp;quot;you have to pull your grades up&amp;quot; or &amp;quot;try harder at work&amp;quot; or &amp;quot;find a new job and start a new life&amp;quot; because in the end I think the ability to cope with all the stresses has to come from within.&lt;/p&gt;\n\n&lt;p&gt;I know this is pretty stupid but it helps me. You should take a day and really think about your life. Not the superficial things like work and school, but just life in general. Try to separate yourself from all these societal expectations and just think about what it means to be a living breathing human with the ability to feel and love and cry. Try to look at the big picture of what we are and how we live and why. Let this perspective center your thoughts and try and let your problems melt away.&lt;/p&gt;\n\n&lt;p&gt;PM me anytime if you want to talk bud. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24sgu2", "score_hidden": false, "name": "t1_chaczou", "created": 1399351671.0, "author_flair_text": null, "created_utc": 1399322871.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]