[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If anybody is/was a smoker, they&amp;#39;ll understand that feeling when you really want a cigarette but you can&amp;#39;t (or won&amp;#39;t) have one. It&amp;#39;s a gnawing feeling with fear attached to it because you know what is coming and you can&amp;#39;t do anything to stop your body&amp;#39;s natural response to withdrawal.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going through that discomfort about killing myself. Last time I was in hospital I managed to find a pencil sharpener and take the blade out of that to cut my throat with. I only lived because of 15-minute checks. But I want that pencil sharpener back right now. There&amp;#39;s a gnawing at the back of my head and all it wants is for me to go into the bathroom and slit my throat and then wait to just go into blackness.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lived with mental illness for long enough now that I know what depression is. That&amp;#39;s the weird thing. I can&amp;#39;t feel, I can&amp;#39;t see love within me or outside of me, nothing is exciting or anything but...there. The world is a large, inert, object and I&amp;#39;m just sitting around waiting for something to move to at least make me feel &lt;em&gt;something&lt;/em&gt; that isn&amp;#39;t this urge to end it all. I know this is depression, but I can&amp;#39;t reason my way out of this. I can&amp;#39;t see that there&amp;#39;s anything at the end of it. There&amp;#39;s not a light at the end, there&amp;#39;s just a brick wall in the darkness.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve spoken to doctors, I&amp;#39;ve spoken to my loved ones...I guess this is my last &amp;quot;spoken to someone&amp;quot;. I&amp;#39;ve done all the steps I&amp;#39;m supposed to. If I check off all the boxes and it doesn&amp;#39;t get better, then I have my solution and it involves a date with a razor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If anybody is/was a smoker, they'll understand that feeling when you really want a cigarette but you can't (or won't) have one. It's a gnawing feeling with fear attached to it because you know what is coming and you can't do anything to stop your body's natural response to withdrawal.\n\nI'm going through that discomfort about killing myself. Last time I was in hospital I managed to find a pencil sharpener and take the blade out of that to cut my throat with. I only lived because of 15-minute checks. But I want that pencil sharpener back right now. There's a gnawing at the back of my head and all it wants is for me to go into the bathroom and slit my throat and then wait to just go into blackness.\n\nI've lived with mental illness for long enough now that I know what depression is. That's the weird thing. I can't feel, I can't see love within me or outside of me, nothing is exciting or anything but...there. The world is a large, inert, object and I'm just sitting around waiting for something to move to at least make me feel *something* that isn't this urge to end it all. I know this is depression, but I can't reason my way out of this. I can't see that there's anything at the end of it. There's not a light at the end, there's just a brick wall in the darkness.\n\nI've spoken to doctors, I've spoken to my loved ones...I guess this is my last \"spoken to someone\". I've done all the steps I'm supposed to. If I check off all the boxes and it doesn't get better, then I have my solution and it involves a date with a razor.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249w5b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "waytoomuchrightnow", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249w5b/like_wanting_a_cigarette/", "name": "t3_249w5b", "created": 1398806755.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249w5b/like_wanting_a_cigarette/", "author_flair_text": null, "title": "Like wanting a cigarette", "created_utc": 1398777955.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch51vj2", "gilded": 0, "author": "fishbonez", "parent_id": "t3_249w5b", "approved_by": null, "body": "We've been there. I just want you to know that you are not alone in this and we are fighting it together. Don't end the fight.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve been there. I just want you to know that you are not alone in this and we are fighting it together. Don&amp;#39;t end the fight.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249w5b", "score_hidden": false, "name": "t1_ch51vj2", "created": 1398785862.0, "author_flair_text": null, "created_utc": 1398782262.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]