[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(I&amp;#39;m sorry it&amp;#39;s king and confusing)&lt;/p&gt;\n\n&lt;p&gt;First I want to say that I don&amp;#39;t want to commit suicide for real, I just can&amp;#39;t stop thinking about it, about killing or hurting myself. I feel powerless about my problems and I cannot look at a window without thinking about jumping from it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently living abroad and I&amp;#39;m going home in a month. I already have the ticket. I also have tickets to a trip I&amp;#39;m taking in one week to a few places in Europe.&lt;/p&gt;\n\n&lt;p&gt;So what happened: I came to study and I work and I was sold by a story that living here was great, high wages and low living cost. What I found out after I had invested a lot of money on it was the opposite. I&amp;#39;m living in Dublin and there is an absurd shortage of rooms to rent, I ended up living in hostels for most of the time. \nI had a hard time finding a job and the one I got was very demanding with a shitty wage that was barely enough to pay my hostel and food. A few weeks later I was fired after I got sick and missed two days. &lt;/p&gt;\n\n&lt;p&gt;I saw myself in the following situation: no job, no place to live and with not enough money for all the things I need. I tried to be responsible with money and save it, but somehow it finished. My parents have been sending me what they can, but this month they haven&amp;#39;t been able to send me anything yet and all the money I have it&amp;#39;s gonna be used to pay a few more days in my accommodation. Today I ran out of food.\nI have three people I&amp;#39;m close with here, but only one of them, A.,  knows about my depression and depersonalization disorder (which I found out about when everything was already set to travel). I&amp;#39;ve been romantically involved with A. since September/October, but we have had more downs than ups. I love him, but he can&amp;#39;t deal with my problems anymore and he gets distant. He is great! He has done for me more than anybody else in my life, but he has his own problems and he is tired of my shit.&lt;/p&gt;\n\n&lt;p&gt;Today I wanted his attention but he said he needs to stay away otherwise I&amp;#39;ll lose him. We had been fighting and he told me he needs his space. I&amp;#39;m OK with it, but he&amp;#39;ll have all the space he needs in a month and all I want right now is that our relationship to be strong, so we don&amp;#39;t lose each other after I leave. I feel that if I give him space now, he&amp;#39;ll lose me. I tend to push people away. I also feel shitty and ashamed for ruining this relationship with my money problems and my psychological problems.&lt;/p&gt;\n\n&lt;p&gt;I talked to my parents, but it&amp;#39;s no help. They can&amp;#39;t send me money before the weekend, which means I might end up in the streets. They worry about it, of course, and I&amp;#39;m pretty sure they are doing what they can to send me something, but they just don&amp;#39;t get how I feel. They don&amp;#39;t know about the depersonalization and they don&amp;#39;t know about the nature of my relationship with A.\nI feel completely lonely and desperate right now. &lt;/p&gt;\n\n&lt;p&gt;The worst part is that I was feeling so good today and I wanted to share with A. Last Friday I felt really real for the first time in months and the sense of reality was strong still and I was happy, I wanted to share with with him, and I haven&amp;#39;t had the chance yet, but he keeps pushing me away because he knows about my money problems and he don&amp;#39;t want to deal with it. &lt;/p&gt;\n\n&lt;p&gt;After talking to him and feeling him getting more and more distant, it didn&amp;#39;t matter anymore. I kept thinking &amp;quot;what is the point if being aware of reality? there is nothing good about reality&amp;quot;. I&amp;#39;m not happy anymore. I just feel angry about everything and I want to throw thing and hurt myself.&lt;/p&gt;\n\n&lt;p&gt;I know I might end up with no money for food or shelter and I don&amp;#39;t know what to do. I don&amp;#39;t have any coping mechanism. I don&amp;#39;t know how to deal with it and I lost any wish of being alive. I don&amp;#39;t feel that I have the energy to keep living. I just want to hide, to disappear, but if I go back to this (I spent years sleeping all day, doing nothing all night), I prefer to die.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(I'm sorry it's king and confusing)\n\nFirst I want to say that I don't want to commit suicide for real, I just can't stop thinking about it, about killing or hurting myself. I feel powerless about my problems and I cannot look at a window without thinking about jumping from it.\n\nI'm currently living abroad and I'm going home in a month. I already have the ticket. I also have tickets to a trip I'm taking in one week to a few places in Europe.\n\nSo what happened: I came to study and I work and I was sold by a story that living here was great, high wages and low living cost. What I found out after I had invested a lot of money on it was the opposite. I'm living in Dublin and there is an absurd shortage of rooms to rent, I ended up living in hostels for most of the time. \nI had a hard time finding a job and the one I got was very demanding with a shitty wage that was barely enough to pay my hostel and food. A few weeks later I was fired after I got sick and missed two days. \n\nI saw myself in the following situation: no job, no place to live and with not enough money for all the things I need. I tried to be responsible with money and save it, but somehow it finished. My parents have been sending me what they can, but this month they haven't been able to send me anything yet and all the money I have it's gonna be used to pay a few more days in my accommodation. Today I ran out of food.\nI have three people I'm close with here, but only one of them, A.,  knows about my depression and depersonalization disorder (which I found out about when everything was already set to travel). I've been romantically involved with A. since September/October, but we have had more downs than ups. I love him, but he can't deal with my problems anymore and he gets distant. He is great! He has done for me more than anybody else in my life, but he has his own problems and he is tired of my shit.\n\nToday I wanted his attention but he said he needs to stay away otherwise I'll lose him. We had been fighting and he told me he needs his space. I'm OK with it, but he'll have all the space he needs in a month and all I want right now is that our relationship to be strong, so we don't lose each other after I leave. I feel that if I give him space now, he'll lose me. I tend to push people away. I also feel shitty and ashamed for ruining this relationship with my money problems and my psychological problems.\n\nI talked to my parents, but it's no help. They can't send me money before the weekend, which means I might end up in the streets. They worry about it, of course, and I'm pretty sure they are doing what they can to send me something, but they just don't get how I feel. They don't know about the depersonalization and they don't know about the nature of my relationship with A.\nI feel completely lonely and desperate right now. \n\nThe worst part is that I was feeling so good today and I wanted to share with A. Last Friday I felt really real for the first time in months and the sense of reality was strong still and I was happy, I wanted to share with with him, and I haven't had the chance yet, but he keeps pushing me away because he knows about my money problems and he don't want to deal with it. \n\nAfter talking to him and feeling him getting more and more distant, it didn't matter anymore. I kept thinking \"what is the point if being aware of reality? there is nothing good about reality\". I'm not happy anymore. I just feel angry about everything and I want to throw thing and hurt myself.\n\nI know I might end up with no money for food or shelter and I don't know what to do. I don't have any coping mechanism. I don't know how to deal with it and I lost any wish of being alive. I don't feel that I have the energy to keep living. I just want to hide, to disappear, but if I go back to this (I spent years sleeping all day, doing nothing all night), I prefer to die.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24zwf6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "vanilladream", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24zwf6/living_abroad_no_money_no_friends_no_family/", "name": "t3_24zwf6", "created": 1399535215.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24zwf6/living_abroad_no_money_no_friends_no_family/", "author_flair_text": null, "title": "Living abroad, no money, no friends, no family around, nowhere to run", "created_utc": 1399506415.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chclkej", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_24zwf6", "approved_by": null, "body": "Nothing good about reality?  You just described a couple good things about it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing good about reality?  You just described a couple good things about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24zwf6", "score_hidden": false, "name": "t1_chclkej", "created": 1399570982.0, "author_flair_text": null, "created_utc": 1399542182.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]