[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi. since I don&amp;#39;t feel like using a throwaway, let&amp;#39;s just say I&amp;#39;m a 16 year old from Ireland. I&amp;#39;ve spent some time reading other people&amp;#39;s posts, and it&amp;#39;s high time I made my own.&lt;/p&gt;\n\n&lt;p&gt;I honestly do not know if how I feel can be construed as &amp;quot;depression&amp;quot;, I feel like it is, but I can&amp;#39;t be certain. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not like I have a bad life, or any kind of abusive life, I&amp;#39;ve just been down for so long that it&amp;#39;s eating away at me. For context, I have Asperger&amp;#39;s Syndrome, whether that makes any difference I can&amp;#39;t say, but it&amp;#39;s there nonetheless.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been slowly getting more down since I was very young, I remember nearly attempting suicide at 11, very few other people know this, but I want people to know, just because you&amp;#39;re young, doesn&amp;#39;t mean you can&amp;#39;t be depressed.&lt;/p&gt;\n\n&lt;p&gt;I have talked to people, I talked to my Mom, who convinced me I wasn&amp;#39;t depressed. I understand her concern and that she is trying to help, but I didn&amp;#39;t want to be told I wasn&amp;#39;t depressed, I wanted advice.&lt;/p&gt;\n\n&lt;p&gt;Same story with my dad, albeit he was a little more open to listening to me first. My parents do live together. I live with them and 3 younger brothers.&lt;/p&gt;\n\n&lt;p&gt;After about 13 or so, it died down for a while. I was somewhat more lively, but never truly happy. &lt;/p&gt;\n\n&lt;p&gt;The only time I have ever been truly and honestly happy, without any of this hanging over me, was on stage. I love acting, for a long time it was my biggest passion. And I, according to those around me, was damned good at it too. My proudest moment, was after a production of &amp;quot;James and the Giant Peach&amp;quot;, being pushed to the front of the stage by my friends and given a standing ovation of my own.&lt;/p&gt;\n\n&lt;p&gt;Sadly, our acting group disbanded permanently, and my lifelong dream of being an actor died with it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been called a gifted child, even when very young. Before I was diagnosed with Aspergers, I was &amp;quot;gifted with behavioral issues&amp;quot;. I hated authority, still do. Maybe I&amp;#39;m just rebellious for the sake of rebellion but I despise being in the system.&lt;/p&gt;\n\n&lt;p&gt;Onwards to secondary school, the first 3 years there were hell on earth. With a few exceptions. I held onto a childhood friend, who I had met in Primary school. He was being bullied pretty severely, verbally and even physically, of course my naive sense of justice had me defend him tooth and nail. I was never beaten up, but I was the new target. We have remained friends to this day, and he is one of the only 3 people in my life who ever listened to what I said and accepted that I wasn&amp;#39;t being melodramatic.&lt;/p&gt;\n\n&lt;p&gt;Come 4th year of secondary school, November 18th, I finally admit to my other best friend that I&amp;#39;ve been in love with her for years. She says she loves me too. It was a huge relief, for a brief moment I felt good about myself.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re still together a year and a half later, she&amp;#39;s so supportive of me. The reason I&amp;#39;m writing this is because I had a big breakdown while talking to her, she comforted me and was so helpful. She is the second of the 3 people who actually listened to me.&lt;/p&gt;\n\n&lt;p&gt;The other was my old child psychologist, while the conversation was brief, he was very helpful, I didn&amp;#39;t really express that I was depressed, but he understood I was not myself. I talked to him regularly because of my Aspergers.&lt;/p&gt;\n\n&lt;p&gt;I do have other friends, I tend to befriend other social outcasts, oh, did I mention I&amp;#39;m a social outcast? I don&amp;#39;t get on with people easily. I&amp;#39;m a fat, white, greasy, long haired boy who loves anime and video games. Outcast in all his glory. I&amp;#39;m lucky to know other people similar to me, but I still feel like shit. &lt;/p&gt;\n\n&lt;p&gt;I talk a lot, for someone who feels dead inside, I talk a LOT. I think it&amp;#39;s a coping mechanism, when I&amp;#39;m talking I&amp;#39;m not thinking, because when I think, the suicidal thoughts come back. I&amp;#39;ve had regular suicidal thoughts, never gone through with any. I don&amp;#39;t really plan to either, but I have a bit of a hairpin trigger with my temper/emotions, and I could turn, I don&amp;#39;t want to, but I could.&lt;/p&gt;\n\n&lt;p&gt;I have other coping mechanisms, namely banging my head on walls/desks. I do it rhythmically and it helps me focus on one thing, which calms me down.&lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t like school, I&amp;#39;ve always been made out to be some overachiever, but really I&amp;#39;m lazy and unfocused and uninterested. Any attempt to communicate my feelings to my parents as of late has resulted in accusations of just not wanting to work hard at school. They only want what&amp;#39;s best for me, but I&amp;#39;d really prefer for them to take some time and listen. Not that it matters anymore, I can&amp;#39;t being myself to talk to them.&lt;/p&gt;\n\n&lt;p&gt;No the school guidance counselor is not an option, it would have been a few years ago, but our most recent one is not someone I get on with. Other teachers aren&amp;#39;t a good idea either, I&amp;#39;m sure they&amp;#39;d be happy to help, but I wouldn&amp;#39;t feel comfortable talking to them.&lt;/p&gt;\n\n&lt;p&gt;To re-iterate, I don&amp;#39;t have a bad life, I just am so tired, all the time. No matter how much I do, how much I sleep, I always feel exhausted and lethargic. My schoolwork is slipping, I haven&amp;#39;t done any homework for a long long time, I just don&amp;#39;t care. I get by on a silver tongue, I know how to talk to people, distract them, so I never have my homework checked. &lt;/p&gt;\n\n&lt;p&gt;I keep trying to convince myself that I want to do some sort of science in University, but being entire honest, I&amp;#39;m so sick shit of science. I just wanna be an actor, it&amp;#39;s all I&amp;#39;ve ever wanted, but acting groups/lessons are so expensive and time consuming, it would be hard to do that and school. &lt;/p&gt;\n\n&lt;p&gt;I just feel hollowed out, exhausted, depressed, like I&amp;#39;m ready to move on ya know?&lt;/p&gt;\n\n&lt;p&gt;The only thing stopping me is I know I would devastate my family/friends. I really don&amp;#39;t want to hurt them. I&amp;#39;ve tried pushing them away, in hopes I would soften the blow, but I can&amp;#39;t do that, it would be terrible.&lt;/p&gt;\n\n&lt;p&gt;Just an hour ago, I was crying (again) in my room, and my two younger brothers came in to make sure I was alright, my youngest brother, only 8, was in more of a state than I was. I can&amp;#39;t imagine how he&amp;#39;d feel if I killed myself. So I really don&amp;#39;t want to. But it&amp;#39;s so tempting, to just let go.&lt;/p&gt;\n\n&lt;p&gt;I feel like everything I do is a failure, every project I&amp;#39;ve done is shit, every piece of art I do is shit, everything I write is shit. People try and tell me it&amp;#39;s not, but the only person I want to like the things I do is me, and I think it&amp;#39;s all rubbish.&lt;/p&gt;\n\n&lt;p&gt;I had 2 weeks to do an art history essay, I didn&amp;#39;t pick up a pen once, now it&amp;#39;s due for about 7 hours from now. It&amp;#39;s not very long, it would take 40 minutes max, but I&amp;#39;m so tired all the time, I can&amp;#39;t bring myself to do it.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t focus on anything for more than 5 minutes, I tried watching Game of Thrones, I had to get up and walk around for a bit every 10 or so minutes because I lost focus. I can&amp;#39;t read anymore, because I can&amp;#39;t focus, I can&amp;#39;t play video games anymore, or anything.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna stop here because this got waaaay longer than I intended. If you read all the way through, thanks, I appreciate it.&lt;/p&gt;\n\n&lt;p&gt;Goodnight all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi. since I don't feel like using a throwaway, let's just say I'm a 16 year old from Ireland. I've spent some time reading other people's posts, and it's high time I made my own.\n\nI honestly do not know if how I feel can be construed as \"depression\", I feel like it is, but I can't be certain. \n\nIt's not like I have a bad life, or any kind of abusive life, I've just been down for so long that it's eating away at me. For context, I have Asperger's Syndrome, whether that makes any difference I can't say, but it's there nonetheless.\n\nI've been slowly getting more down since I was very young, I remember nearly attempting suicide at 11, very few other people know this, but I want people to know, just because you're young, doesn't mean you can't be depressed.\n\nI have talked to people, I talked to my Mom, who convinced me I wasn't depressed. I understand her concern and that she is trying to help, but I didn't want to be told I wasn't depressed, I wanted advice.\n\nSame story with my dad, albeit he was a little more open to listening to me first. My parents do live together. I live with them and 3 younger brothers.\n\nAfter about 13 or so, it died down for a while. I was somewhat more lively, but never truly happy. \n\nThe only time I have ever been truly and honestly happy, without any of this hanging over me, was on stage. I love acting, for a long time it was my biggest passion. And I, according to those around me, was damned good at it too. My proudest moment, was after a production of \"James and the Giant Peach\", being pushed to the front of the stage by my friends and given a standing ovation of my own.\n\nSadly, our acting group disbanded permanently, and my lifelong dream of being an actor died with it.\n\nI've always been called a gifted child, even when very young. Before I was diagnosed with Aspergers, I was \"gifted with behavioral issues\". I hated authority, still do. Maybe I'm just rebellious for the sake of rebellion but I despise being in the system.\n\nOnwards to secondary school, the first 3 years there were hell on earth. With a few exceptions. I held onto a childhood friend, who I had met in Primary school. He was being bullied pretty severely, verbally and even physically, of course my naive sense of justice had me defend him tooth and nail. I was never beaten up, but I was the new target. We have remained friends to this day, and he is one of the only 3 people in my life who ever listened to what I said and accepted that I wasn't being melodramatic.\n\nCome 4th year of secondary school, November 18th, I finally admit to my other best friend that I've been in love with her for years. She says she loves me too. It was a huge relief, for a brief moment I felt good about myself.\n\nWe're still together a year and a half later, she's so supportive of me. The reason I'm writing this is because I had a big breakdown while talking to her, she comforted me and was so helpful. She is the second of the 3 people who actually listened to me.\n\nThe other was my old child psychologist, while the conversation was brief, he was very helpful, I didn't really express that I was depressed, but he understood I was not myself. I talked to him regularly because of my Aspergers.\n\nI do have other friends, I tend to befriend other social outcasts, oh, did I mention I'm a social outcast? I don't get on with people easily. I'm a fat, white, greasy, long haired boy who loves anime and video games. Outcast in all his glory. I'm lucky to know other people similar to me, but I still feel like shit. \n\nI talk a lot, for someone who feels dead inside, I talk a LOT. I think it's a coping mechanism, when I'm talking I'm not thinking, because when I think, the suicidal thoughts come back. I've had regular suicidal thoughts, never gone through with any. I don't really plan to either, but I have a bit of a hairpin trigger with my temper/emotions, and I could turn, I don't want to, but I could.\n\nI have other coping mechanisms, namely banging my head on walls/desks. I do it rhythmically and it helps me focus on one thing, which calms me down.\n\nI really don't like school, I've always been made out to be some overachiever, but really I'm lazy and unfocused and uninterested. Any attempt to communicate my feelings to my parents as of late has resulted in accusations of just not wanting to work hard at school. They only want what's best for me, but I'd really prefer for them to take some time and listen. Not that it matters anymore, I can't being myself to talk to them.\n\nNo the school guidance counselor is not an option, it would have been a few years ago, but our most recent one is not someone I get on with. Other teachers aren't a good idea either, I'm sure they'd be happy to help, but I wouldn't feel comfortable talking to them.\n\nTo re-iterate, I don't have a bad life, I just am so tired, all the time. No matter how much I do, how much I sleep, I always feel exhausted and lethargic. My schoolwork is slipping, I haven't done any homework for a long long time, I just don't care. I get by on a silver tongue, I know how to talk to people, distract them, so I never have my homework checked. \n\nI keep trying to convince myself that I want to do some sort of science in University, but being entire honest, I'm so sick shit of science. I just wanna be an actor, it's all I've ever wanted, but acting groups/lessons are so expensive and time consuming, it would be hard to do that and school. \n\nI just feel hollowed out, exhausted, depressed, like I'm ready to move on ya know?\n\nThe only thing stopping me is I know I would devastate my family/friends. I really don't want to hurt them. I've tried pushing them away, in hopes I would soften the blow, but I can't do that, it would be terrible.\n\nJust an hour ago, I was crying (again) in my room, and my two younger brothers came in to make sure I was alright, my youngest brother, only 8, was in more of a state than I was. I can't imagine how he'd feel if I killed myself. So I really don't want to. But it's so tempting, to just let go.\n\nI feel like everything I do is a failure, every project I've done is shit, every piece of art I do is shit, everything I write is shit. People try and tell me it's not, but the only person I want to like the things I do is me, and I think it's all rubbish.\n\nI had 2 weeks to do an art history essay, I didn't pick up a pen once, now it's due for about 7 hours from now. It's not very long, it would take 40 minutes max, but I'm so tired all the time, I can't bring myself to do it.\n\nI can't focus on anything for more than 5 minutes, I tried watching Game of Thrones, I had to get up and walk around for a bit every 10 or so minutes because I lost focus. I can't read anymore, because I can't focus, I can't play video games anymore, or anything.\n\nI'm gonna stop here because this got waaaay longer than I intended. If you read all the way through, thanks, I appreciate it.\n\nGoodnight all.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2452kc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TheTurretCube", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2452kc/long_time_lurker_first_time_poster_i_just_need_to/", "name": "t3_2452kc", "created": 1398668865.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2452kc/long_time_lurker_first_time_poster_i_just_need_to/", "author_flair_text": null, "title": "Long time lurker, first time poster. I just need to rant a bit, if anyone cares to listen. (Warning: Long Post)", "created_utc": 1398640065.0, "ups": 2, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3q4qm", "gilded": 0, "author": "TheTurretCube", "parent_id": "t1_ch3q0s1", "approved_by": null, "body": "Thanks for reading man, as to local theater groups, the good ones are fairly elite. The cheaper ones are more performing arts, dancing and music, and acting.\n\nYeah there's an acting group at the Uni, but I'm really debating now whether to stick to science based stuff, or do a drama and theater course.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for reading man, as to local theater groups, the good ones are fairly elite. The cheaper ones are more performing arts, dancing and music, and acting.&lt;/p&gt;\n\n&lt;p&gt;Yeah there&amp;#39;s an acting group at the Uni, but I&amp;#39;m really debating now whether to stick to science based stuff, or do a drama and theater course.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3q4qm", "created": 1398649056.0, "author_flair_text": null, "created_utc": 1398645456.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3q0s1", "gilded": 0, "author": "thr0waw4y45", "parent_id": "t3_2452kc", "approved_by": null, "body": "Ok, I'm not an expert on depression, but I did read your whole post and you mention your love of acting and the stage several times. It is unfortunate your original group disbanded, but did that really end all your opportunities for acting locally? Are there any theatre groups locally you can join? In particular how about amateur theatre groups? Also if you're attending University soon will there be any student based theatre groups you can join there? Many modern film and stage actors started their acting careers as students performing in University theatre groups.\n\nI'm 45 years old and I would like to say if acting is what you love doing and what makes you truly happy then I believe you should pursue every possible avenue you can to continue acting. \n\nAlso you mention disliking your creative projects, but also being complemented on them by others. First I'm impressed by anybody that can expend the energy, or has the imagination to create anything original, and secondly I don't think there is a harsher critic of a creative work than the creator themselves. Listen to the compliments, and keep creating!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, I&amp;#39;m not an expert on depression, but I did read your whole post and you mention your love of acting and the stage several times. It is unfortunate your original group disbanded, but did that really end all your opportunities for acting locally? Are there any theatre groups locally you can join? In particular how about amateur theatre groups? Also if you&amp;#39;re attending University soon will there be any student based theatre groups you can join there? Many modern film and stage actors started their acting careers as students performing in University theatre groups.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 45 years old and I would like to say if acting is what you love doing and what makes you truly happy then I believe you should pursue every possible avenue you can to continue acting. &lt;/p&gt;\n\n&lt;p&gt;Also you mention disliking your creative projects, but also being complemented on them by others. First I&amp;#39;m impressed by anybody that can expend the energy, or has the imagination to create anything original, and secondly I don&amp;#39;t think there is a harsher critic of a creative work than the creator themselves. Listen to the compliments, and keep creating!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3q0s1", "created": 1398648795.0, "author_flair_text": null, "created_utc": 1398645195.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3uj70", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3ugkk", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3uj70", "created": 1398684072.0, "author_flair_text": null, "created_utc": 1398655272.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3ugkk", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3uemz", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3ugkk", "created": 1398683911.0, "author_flair_text": null, "created_utc": 1398655111.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3un76", "gilded": 0, "author": "thr0waw4y45", "parent_id": "t1_ch3uemz", "approved_by": null, "body": "Good luck!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3un76", "created": 1398659121.0, "author_flair_text": null, "created_utc": 1398655521.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3uemz", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3uc9h", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3uemz", "created": 1398683788.0, "author_flair_text": null, "created_utc": 1398654988.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3uc9h", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3t2iq", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3uc9h", "created": 1398683636.0, "author_flair_text": null, "created_utc": 1398654836.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3t2iq", "gilded": 0, "author": "TheTurretCube", "parent_id": "t1_ch3t01e", "approved_by": null, "body": "Very inspiring, I'm making plans as we speak.\n\nSince posting this, I have actually recieved word of upcoming auditions for a veeeery interesting film, 3 hours from where I live.(Spoiler alert, it's Star Wars EpVII)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very inspiring, I&amp;#39;m making plans as we speak.&lt;/p&gt;\n\n&lt;p&gt;Since posting this, I have actually recieved word of upcoming auditions for a veeeery interesting film, 3 hours from where I live.(Spoiler alert, it&amp;#39;s Star Wars EpVII)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3t2iq", "created": 1398655638.0, "author_flair_text": null, "created_utc": 1398652038.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3t01e", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3syfh", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3t01e", "created": 1398680690.0, "author_flair_text": null, "created_utc": 1398651890.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3syfh", "gilded": 0, "author": "TheTurretCube", "parent_id": "t1_ch3sxwx", "approved_by": null, "body": "Thanks, I appreciate that :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I appreciate that :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3syfh", "created": 1398655398.0, "author_flair_text": null, "created_utc": 1398651798.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3sxwx", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2452kc", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2452kc", "score_hidden": false, "name": "t1_ch3sxwx", "created": 1398655366.0, "author_flair_text": null, "created_utc": 1398651766.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]