[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to jump with my bedsheets tied around my neck, but can only assume hell would await me at the bottom. I grew up Christian and believed in treating people right. After repeated rejection I turned to the red pill. It got me laid a few times but I hate the person I&amp;#39;ve become.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve started to isolate myself from everyone, alternating between working myself sick and drinking myself sick. I have no sense of identity, no goals, no dreams; yet, an aimless ambition burns within me. Unfortunately, I am all too aware that someday I will die and all memory of anything I have ever done will die. It is all meaningless, a chasing after the wind.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'd like to jump with my bedsheets tied around my neck, but can only assume hell would await me at the bottom. I grew up Christian and believed in treating people right. After repeated rejection I turned to the red pill. It got me laid a few times but I hate the person I've become.  \n\nI've started to isolate myself from everyone, alternating between working myself sick and drinking myself sick. I have no sense of identity, no goals, no dreams; yet, an aimless ambition burns within me. Unfortunately, I am all too aware that someday I will die and all memory of anything I have ever done will die. It is all meaningless, a chasing after the wind.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wvte", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "readytorest", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wvte/looking_out_my_balcony/", "name": "t3_24wvte", "created": 1399453095.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wvte/looking_out_my_balcony/", "author_flair_text": null, "title": "Looking out my balcony...", "created_utc": 1399424295.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbhvwq", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24wvte", "approved_by": null, "body": "Do NOT isolate yourself. That might seem like the right thing to do because of the depression but it will only make it worse. If anything reach out and meet new people. Get a new lead on life. \n\nYou are aware that you will die someday and everything you have worked for will be gone? I understand that feeling. I myself am atheist. I used to think why try if it will all be gone when I die anyways? Then I realized something. I am here right now and that in itself is a miracle. NOBODY else on earth is like me or you. We are unique. Memories of you will live on through the ones you love if not through an afterlife. The thing that keeps me going everyday is optimism and telling myself if I make one person's day better today then it was worth me being here.\n\nTL;DR: You will live on through the ones you love.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do NOT isolate yourself. That might seem like the right thing to do because of the depression but it will only make it worse. If anything reach out and meet new people. Get a new lead on life. &lt;/p&gt;\n\n&lt;p&gt;You are aware that you will die someday and everything you have worked for will be gone? I understand that feeling. I myself am atheist. I used to think why try if it will all be gone when I die anyways? Then I realized something. I am here right now and that in itself is a miracle. NOBODY else on earth is like me or you. We are unique. Memories of you will live on through the ones you love if not through an afterlife. The thing that keeps me going everyday is optimism and telling myself if I make one person&amp;#39;s day better today then it was worth me being here.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: You will live on through the ones you love.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wvte", "score_hidden": false, "name": "t1_chbhvwq", "created": 1399457554.0, "author_flair_text": null, "created_utc": 1399428754.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]