[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t blame anyone for laughing or just ignoring this. I know it&amp;#39;s pitiful and whiny and a joke of a problem compared to other people&amp;#39;s issues.&lt;/p&gt;\n\n&lt;p&gt;To save time and make this as efficient as possible, I&amp;#39;m just going to lay out the issue(s).&lt;/p&gt;\n\n&lt;p&gt;Years ago I made the biggest mistake of my life and went to college. Today, I sit, still without the degree, over $100k in debt, out of money, separated from everything I came to love in my time at university. I work a shitty job that used to make me hate humanity more and more every day. I have parents who seem to genuinely enjoy telling me how much I&amp;#39;ve fucked up. Even if I am able to miraculously come up with the money to finish (minimum another year, more if the college keeps up their behavior since I&amp;#39;ve had to leave), I&amp;#39;m essentially fucked for the next 30 years. Again, maybe more.&lt;/p&gt;\n\n&lt;p&gt;To be fair, I did really fuck up. I let a bad professor get under my skin, changed majors when I shouldn&amp;#39;t have, to something I enjoyed at the time, but has little financial viability as a career. My fault. I admit that. I could&amp;#39;ve spent less time trying to make friends and more time studying and taking full course loads. Probably could&amp;#39;ve finished in 3 years. I admit that too.&lt;/p&gt;\n\n&lt;p&gt;These days, I seem to oscillate between just not caring and actively wanting to be dead. My significant other, now miles away, once kept me sane. We talk every day, but I can feel everything else pressing in on me. Much worse, I can&amp;#39;t have a life with him until I&amp;#39;m 100% financially independent, which seems to be a goal post that constantly moves further away.&lt;/p&gt;\n\n&lt;p&gt;That alone wouldn&amp;#39;t be so bad, I guess...putting off the endgame goal for a year or two. But that would assume that it&amp;#39;s only one or two years. It could be many more. Maybe he&amp;#39;ll come to his senses and ask why he&amp;#39;s even bothering with me. Maybe my attitude toward him will have changed before we can make this thing happen. It also assumes I have something else to keep me going. Things I used to do, hobbies I used to enjoy, music that once sounded good...aren&amp;#39;t doing it anymore. I spend my days going to work, coming home, sleeping, then doing it again the next day. I hate it. My old gaming computer sits mostly unused these days. Projects I started hoping to find a spark of enjoyment now lay strewn around my room, unfinished. Even getting up to go to work blows. I&amp;#39;m constantly tired, no matter how much sleep I get. I&amp;#39;m starting to not even get mad at the moronic customers I have to deal with day in and day out. In a way, that&amp;#39;s nice. In another way, it&amp;#39;s the worst feeling (or lack thereof) ever.&lt;/p&gt;\n\n&lt;p&gt;They say think of the people who would miss you, and I do, and it makes me feel terrible for even considering that death would cross my mind. But at a certain point, when it feels like you&amp;#39;re just running in place, you&amp;#39;re not happy, and you&amp;#39;re just &lt;em&gt;tired&lt;/em&gt;, you start looking at other ways out.&lt;/p&gt;\n\n&lt;p&gt;I used to be frustrated. I went in with a plan that, based on the information I had at the time, was airtight. I had a direction and a purpose. But things changed, and that can cause even the best laid plans to crumble. I&amp;#39;m not frustrated anymore. Now I&amp;#39;m just tired.&lt;/p&gt;\n\n&lt;p&gt;To lighten the mood, I&amp;#39;ll say that I&amp;#39;m not on the edge this very moment. Just feeling very...flat, I suppose. But it changes. I haven&amp;#39;t felt happy or angry in a while, just somewhere between empty and hopeless.&lt;/p&gt;\n\n&lt;p&gt;This turned out longer than I thought it would.  TL;DR: There&amp;#39;s a situation that sucks and I need advice for handling it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I won't blame anyone for laughing or just ignoring this. I know it's pitiful and whiny and a joke of a problem compared to other people's issues.\n\nTo save time and make this as efficient as possible, I'm just going to lay out the issue(s).\n\nYears ago I made the biggest mistake of my life and went to college. Today, I sit, still without the degree, over $100k in debt, out of money, separated from everything I came to love in my time at university. I work a shitty job that used to make me hate humanity more and more every day. I have parents who seem to genuinely enjoy telling me how much I've fucked up. Even if I am able to miraculously come up with the money to finish (minimum another year, more if the college keeps up their behavior since I've had to leave), I'm essentially fucked for the next 30 years. Again, maybe more.\n\nTo be fair, I did really fuck up. I let a bad professor get under my skin, changed majors when I shouldn't have, to something I enjoyed at the time, but has little financial viability as a career. My fault. I admit that. I could've spent less time trying to make friends and more time studying and taking full course loads. Probably could've finished in 3 years. I admit that too.\n\nThese days, I seem to oscillate between just not caring and actively wanting to be dead. My significant other, now miles away, once kept me sane. We talk every day, but I can feel everything else pressing in on me. Much worse, I can't have a life with him until I'm 100% financially independent, which seems to be a goal post that constantly moves further away.\n\nThat alone wouldn't be so bad, I guess...putting off the endgame goal for a year or two. But that would assume that it's only one or two years. It could be many more. Maybe he'll come to his senses and ask why he's even bothering with me. Maybe my attitude toward him will have changed before we can make this thing happen. It also assumes I have something else to keep me going. Things I used to do, hobbies I used to enjoy, music that once sounded good...aren't doing it anymore. I spend my days going to work, coming home, sleeping, then doing it again the next day. I hate it. My old gaming computer sits mostly unused these days. Projects I started hoping to find a spark of enjoyment now lay strewn around my room, unfinished. Even getting up to go to work blows. I'm constantly tired, no matter how much sleep I get. I'm starting to not even get mad at the moronic customers I have to deal with day in and day out. In a way, that's nice. In another way, it's the worst feeling (or lack thereof) ever.\n\nThey say think of the people who would miss you, and I do, and it makes me feel terrible for even considering that death would cross my mind. But at a certain point, when it feels like you're just running in place, you're not happy, and you're just *tired*, you start looking at other ways out.\n\nI used to be frustrated. I went in with a plan that, based on the information I had at the time, was airtight. I had a direction and a purpose. But things changed, and that can cause even the best laid plans to crumble. I'm not frustrated anymore. Now I'm just tired.\n\nTo lighten the mood, I'll say that I'm not on the edge this very moment. Just feeling very...flat, I suppose. But it changes. I haven't felt happy or angry in a while, just somewhere between empty and hopeless.\n\nThis turned out longer than I thought it would.  TL;DR: There's a situation that sucks and I need advice for handling it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2540g4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "disposablename52014", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2540g4/looking_for_advice_for_a_probably_really_stupid/", "name": "t3_2540g4", "created": 1399647478.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2540g4/looking_for_advice_for_a_probably_really_stupid/", "author_flair_text": null, "title": "Looking for advice for a probably really stupid situation.", "created_utc": 1399618678.0, "ups": 2, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che7zyz", "gilded": 0, "author": "sardonic_clam", "parent_id": "t1_che7mhg", "approved_by": null, "body": "It seemed they would be happy to support you living at home while you pay off your debt.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seemed they would be happy to support you living at home while you pay off your debt.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_che7zyz", "created": 1399698194.0, "author_flair_text": null, "created_utc": 1399694594.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "che7mhg", "gilded": 0, "author": "disposablename52014", "parent_id": "t1_chdzp3b", "approved_by": null, "body": "Dude my parents are the opposite of supportive. If I move in with him I get completely cut off. Not just financially but entirely.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude my parents are the opposite of supportive. If I move in with him I get completely cut off. Not just financially but entirely.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_che7mhg", "created": 1399722248.0, "author_flair_text": null, "created_utc": 1399693448.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdzp3b", "gilded": 0, "author": "sardonic_clam", "parent_id": "t1_chdur1d", "approved_by": null, "body": "It sounds like your parents are supportive, and thats great, why not discuss things with them. It might mean living with them longer term but you will eventually pay off your debt. Think about it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your parents are supportive, and thats great, why not discuss things with them. It might mean living with them longer term but you will eventually pay off your debt. Think about it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chdzp3b", "created": 1399701375.0, "author_flair_text": null, "created_utc": 1399672575.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdur1d", "gilded": 0, "author": "disposablename52014", "parent_id": "t1_chdiiso", "approved_by": null, "body": "I can be with him before all the debt is paid off but after doing some math, I'll be in my mid 40s by the time the debt is gone and I will have paid almost half a million dollars by then due to compounding interest. Housing where I live is too expensive for me to move out any time soon. If I were to try getting out now, I would need to be prepared to pay for everything by myself because the minute I tell my parents I'm moving in with him, I'll lose everything they support right now. I'm prepared for that, but I need to be in a place I'm not sure I'll get to.\n\nDo I foresee paying it down? It could happen, but at the cost of any kind of long term financial stability. My estimates include paying the minimum, which it turns out is more than half of what I could expect in an optimistic entry level job. By that time, there's barely enough for an optimistic rent, much less necessities like internet, phone and food.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can be with him before all the debt is paid off but after doing some math, I&amp;#39;ll be in my mid 40s by the time the debt is gone and I will have paid almost half a million dollars by then due to compounding interest. Housing where I live is too expensive for me to move out any time soon. If I were to try getting out now, I would need to be prepared to pay for everything by myself because the minute I tell my parents I&amp;#39;m moving in with him, I&amp;#39;ll lose everything they support right now. I&amp;#39;m prepared for that, but I need to be in a place I&amp;#39;m not sure I&amp;#39;ll get to.&lt;/p&gt;\n\n&lt;p&gt;Do I foresee paying it down? It could happen, but at the cost of any kind of long term financial stability. My estimates include paying the minimum, which it turns out is more than half of what I could expect in an optimistic entry level job. By that time, there&amp;#39;s barely enough for an optimistic rent, much less necessities like internet, phone and food.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chdur1d", "created": 1399690629.0, "author_flair_text": null, "created_utc": 1399661829.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdiiso", "gilded": 0, "author": "sardonic_clam", "parent_id": "t3_2540g4", "approved_by": null, "body": "Hi sounds rough, why cant you be with your significant other before paying off your debt? Is the interest rate on your loan reasonable? What I mean is.. can you foresee yourself paying it off?", "edited": 1399631003.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi sounds rough, why cant you be with your significant other before paying off your debt? Is the interest rate on your loan reasonable? What I mean is.. can you foresee yourself paying it off?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chdiiso", "created": 1399657399.0, "author_flair_text": null, "created_utc": 1399628599.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgniyw", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_chduik1", "approved_by": null, "body": "Could you go back to CS?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you go back to CS?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chgniyw", "created": 1399990752.0, "author_flair_text": null, "created_utc": 1399961952.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chduik1", "gilded": 0, "author": "disposablename52014", "parent_id": "t1_chdiizr", "approved_by": null, "body": "Originally computer science, then behavioral science which the university discontinued while I was balls deep in the major. I switched to sociology but none of the behavioral science classes counted towards it, putting me very far behind. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Originally computer science, then behavioral science which the university discontinued while I was balls deep in the major. I switched to sociology but none of the behavioral science classes counted towards it, putting me very far behind. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chduik1", "created": 1399690142.0, "author_flair_text": null, "created_utc": 1399661342.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdiizr", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_2540g4", "approved_by": null, "body": "What subject were you working on a degree in?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What subject were you working on a degree in?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2540g4", "score_hidden": false, "name": "t1_chdiizr", "created": 1399657436.0, "author_flair_text": null, "created_utc": 1399628636.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]