[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I look them just in pain phyiscal, mental emotional. And I know that going to be my future.&lt;/p&gt;\n\n&lt;p&gt;I see them dealing with so many different thing so painful issues and I look at my like and I know there nothing I really do to not end up as the people who rised me. They are obese, broke, shit relationship with families, drug addicted, in poor health, divorced, and now in shitty relationship with women that harass and  belittling then constantly. They are dying chasing dreams but I look them in their eyes they tell me how they best chance as gone left. there is nothing I can do stop it I&amp;#39;m too far in to the hole I&amp;#39;m headed in the same path as them of being 35 - 40 years old and I going to have nothing.&lt;/p&gt;\n\n&lt;p&gt;Drive me insane cause I know how hard they work how much they struggle to get to shitty point they are at with nothing. Im 27 now and see that I have no chance to live happy life im going to follow in there foot step. I just know im going to live my life struggling every day like I do now there is never going to be easy time in my life where im going to be happy. Its the reminder that is what I have to look forward to I been thuought to much shit growning up that I dont want to deal with everything this anymore. From they day I was born someone hated me its great start that is was my mother. Cause I almost killed here in birth, then I never had a father my parents got divorced when I was 2 - 3 years old. They have been phyiscal abused violently my whole from my mother mostly and sister when I was really young, to even my first grade teach push me and grab me by the handle on my backpack throw me on the ground to the point one day he had get in cardboard box with hole cut out and had the other kids throw beanbag at me as reward for answering question correctly. &lt;/p&gt;\n\n&lt;p&gt;I now that nothing I do I will never be happy I will never find someone to love me. How does it make sense that every ex-girlfriend I had have told that great boyfriend and best boyfriend but they all have cheated on, or have chosen leave me abandon me when I shit time in my life. I see that I will never be happy and I just tried of pain I need to end this false ideas of hope I dream up when other people tell its ok things will get better will never come I will never know happiness cause I will never know what love feel like I will never know the love of mother or father. From other family like a sister or cousin they are all fake hateful twisted liars. I will never know the love of all women cause that something that will never happen for me. I will never know love. That something I will never see or understand so I need to stop lying to myself and end it now cause I no path to be successful happy loved person I will always just be worry and waste so I do need to kill myself cause I jist taking up clean air from the people that will have great things in there lives &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I look them just in pain phyiscal, mental emotional. And I know that going to be my future.\n\nI see them dealing with so many different thing so painful issues and I look at my like and I know there nothing I really do to not end up as the people who rised me. They are obese, broke, shit relationship with families, drug addicted, in poor health, divorced, and now in shitty relationship with women that harass and  belittling then constantly. They are dying chasing dreams but I look them in their eyes they tell me how they best chance as gone left. there is nothing I can do stop it I'm too far in to the hole I'm headed in the same path as them of being 35 - 40 years old and I going to have nothing.\n\nDrive me insane cause I know how hard they work how much they struggle to get to shitty point they are at with nothing. Im 27 now and see that I have no chance to live happy life im going to follow in there foot step. I just know im going to live my life struggling every day like I do now there is never going to be easy time in my life where im going to be happy. Its the reminder that is what I have to look forward to I been thuought to much shit growning up that I dont want to deal with everything this anymore. From they day I was born someone hated me its great start that is was my mother. Cause I almost killed here in birth, then I never had a father my parents got divorced when I was 2 - 3 years old. They have been phyiscal abused violently my whole from my mother mostly and sister when I was really young, to even my first grade teach push me and grab me by the handle on my backpack throw me on the ground to the point one day he had get in cardboard box with hole cut out and had the other kids throw beanbag at me as reward for answering question correctly. \n\n\nI now that nothing I do I will never be happy I will never find someone to love me. How does it make sense that every ex-girlfriend I had have told that great boyfriend and best boyfriend but they all have cheated on, or have chosen leave me abandon me when I shit time in my life. I see that I will never be happy and I just tried of pain I need to end this false ideas of hope I dream up when other people tell its ok things will get better will never come I will never know happiness cause I will never know what love feel like I will never know the love of mother or father. From other family like a sister or cousin they are all fake hateful twisted liars. I will never know the love of all women cause that something that will never happen for me. I will never know love. That something I will never see or understand so I need to stop lying to myself and end it now cause I no path to be successful happy loved person I will always just be worry and waste so I do need to kill myself cause I jist taking up clean air from the people that will have great things in there lives \n \n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243sfl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "hek_sd", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243sfl/looking_at_my_older_friends_it_reaffirms_to_me/", "name": "t3_243sfl", "created": 1398637293.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243sfl/looking_at_my_older_friends_it_reaffirms_to_me/", "author_flair_text": null, "title": "Looking at my older friends it reaffirms to me why I should kill myself", "created_utc": 1398608493.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3avt6", "gilded": 0, "author": "remington259", "parent_id": "t3_243sfl", "approved_by": null, "body": "Dear friend. We all get older but we are not all on the same path in life. We have choices we can make and goals we can make which set us off in different directions. No path is truly set in stone. \r\rIt seems to me that what you need most isn't to dwell on their misfortune but to readjust your own life. It is simple advice but well worth considering. There is always a reason to continue on. Always something new to do, see, feel, or experience. Life is beautiful like that. Always varies. Always full of possibilities.\r\rYou will find love. If I could despite crippling shyness and (in my opinion) not the best looks, anyone can. You have to keep trying.\r\rOne is never too old to try something new if they really want to try. By writing here, you've proven there's a part of you that still wants to try. \rPerhaps this would be an ideal time to take up a new hobby. Something to occupy some time up each day or week which can help you relax. Perhaps reading mystery novels or going out and learning photography. Going for hikes or learning to cook. Whatever you can do, within reason, to brighten up your life...even if it comes at a moderate cost. You happiness and mental health are more important than anything else in life.\r\rAt the most extreme, maybe you should consider moving or taking a short trip somewhere. I realize this isn't financially viable for everyone but it can be done on a tight budget if one tries. \r\rWhatever the case, find something to love and hold onto it. And please, consider seeing some professional help. Even a social worker may be able to help.\r\rGood luck and give it a try. Life can be better. You will find your happiness. It is out there waiting in someone or something amazing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear friend. We all get older but we are not all on the same path in life. We have choices we can make and goals we can make which set us off in different directions. No path is truly set in stone. &lt;/p&gt;\n\n&lt;p&gt;It seems to me that what you need most isn&amp;#39;t to dwell on their misfortune but to readjust your own life. It is simple advice but well worth considering. There is always a reason to continue on. Always something new to do, see, feel, or experience. Life is beautiful like that. Always varies. Always full of possibilities.&lt;/p&gt;\n\n&lt;p&gt;You will find love. If I could despite crippling shyness and (in my opinion) not the best looks, anyone can. You have to keep trying.&lt;/p&gt;\n\n&lt;p&gt;One is never too old to try something new if they really want to try. By writing here, you&amp;#39;ve proven there&amp;#39;s a part of you that still wants to try. \nPerhaps this would be an ideal time to take up a new hobby. Something to occupy some time up each day or week which can help you relax. Perhaps reading mystery novels or going out and learning photography. Going for hikes or learning to cook. Whatever you can do, within reason, to brighten up your life...even if it comes at a moderate cost. You happiness and mental health are more important than anything else in life.&lt;/p&gt;\n\n&lt;p&gt;At the most extreme, maybe you should consider moving or taking a short trip somewhere. I realize this isn&amp;#39;t financially viable for everyone but it can be done on a tight budget if one tries. &lt;/p&gt;\n\n&lt;p&gt;Whatever the case, find something to love and hold onto it. And please, consider seeing some professional help. Even a social worker may be able to help.&lt;/p&gt;\n\n&lt;p&gt;Good luck and give it a try. Life can be better. You will find your happiness. It is out there waiting in someone or something amazing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243sfl", "score_hidden": false, "name": "t1_ch3avt6", "created": 1398638336.0, "author_flair_text": null, "created_utc": 1398609536.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]