[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to die, I feel like it&amp;#39;s the only option. I want to no longer be alive, but I don&amp;#39;t know if I can accept the reality of it. The reality that I can never come back, never do the things I love again, and never be &lt;em&gt;me&lt;/em&gt; again. Often times, I like that last part. I don&amp;#39;t like who I am anymore. I&amp;#39;m bad for everyone around me. Part of me wants to do it just for me, but another part wants to do it just so I can feel like people give a shit. I know that&amp;#39;s a wrong reason, and besides I won&amp;#39;t actually see how they react because I&amp;#39;ll be dead. The girl I&amp;#39;ve loved for 5 years decided recently that she doesn&amp;#39;t love me anymore. However, she still wants to be friends. I can&amp;#39;t help but think that she is completely in denial about how much it hurts me even though I&amp;#39;ve told her multiple times. She&amp;#39;s basically already with some other guy who apparently has been in the process of sweeping her off her feet even while we were still together. I feel like such a shithead sometimes because I feel like I don&amp;#39;t really want her to be happy even though I say I do. That just makes me feel worse about myself. I don&amp;#39;t want to be the person that makes her feel guilty about falling out of love. It was my fault. The point is, I feel like such a failure. I had one thing in life and I ruined it. She has taken all of our friends and they have adjusted to her new life while I&amp;#39;ve been left in the dust. I just don&amp;#39;t know how much longer I can handle being reduced to &amp;quot;buddy&amp;quot; after being what she used to say was &amp;quot;her whole world.&amp;quot; I&amp;#39;ve been researching how to make an exit by helium bag and there&amp;#39;s actually quite a bit of content on it. I feel confident that I will do it right and maybe that&amp;#39;s what scares me the most. I&amp;#39;m planning on seeing how May works out for me and I&amp;#39;ll have made my decision by the 31st. So obviously this isn&amp;#39;t an immediate &amp;quot;save me now or I&amp;#39;m gone&amp;quot; type of situation. I&amp;#39;m just looking to talk to people, hear stories, anything you want to say. I just want to feel like other people exist. Being left with nothing makes me pretty damn hopeless. I&amp;#39;ve been on the brink for quite a few weeks now and I&amp;#39;ve never felt so strongly about killing myself. I hope this made sense to you guys at least a little bit. I&amp;#39;m so confused right now. I feel so lost. I never thought that I could lose all hope so quickly and it absolutely terrifies me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I want to die, I feel like it's the only option. I want to no longer be alive, but I don't know if I can accept the reality of it. The reality that I can never come back, never do the things I love again, and never be *me* again. Often times, I like that last part. I don't like who I am anymore. I'm bad for everyone around me. Part of me wants to do it just for me, but another part wants to do it just so I can feel like people give a shit. I know that's a wrong reason, and besides I won't actually see how they react because I'll be dead. The girl I've loved for 5 years decided recently that she doesn't love me anymore. However, she still wants to be friends. I can't help but think that she is completely in denial about how much it hurts me even though I've told her multiple times. She's basically already with some other guy who apparently has been in the process of sweeping her off her feet even while we were still together. I feel like such a shithead sometimes because I feel like I don't really want her to be happy even though I say I do. That just makes me feel worse about myself. I don't want to be the person that makes her feel guilty about falling out of love. It was my fault. The point is, I feel like such a failure. I had one thing in life and I ruined it. She has taken all of our friends and they have adjusted to her new life while I've been left in the dust. I just don't know how much longer I can handle being reduced to \"buddy\" after being what she used to say was \"her whole world.\" I've been researching how to make an exit by helium bag and there's actually quite a bit of content on it. I feel confident that I will do it right and maybe that's what scares me the most. I'm planning on seeing how May works out for me and I'll have made my decision by the 31st. So obviously this isn't an immediate \"save me now or I'm gone\" type of situation. I'm just looking to talk to people, hear stories, anything you want to say. I just want to feel like other people exist. Being left with nothing makes me pretty damn hopeless. I've been on the brink for quite a few weeks now and I've never felt so strongly about killing myself. I hope this made sense to you guys at least a little bit. I'm so confused right now. I feel so lost. I never thought that I could lose all hope so quickly and it absolutely terrifies me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "247awh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ofmiceomen", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/247awh/lost_confused_and_left_behind/", "name": "t3_247awh", "created": 1398735602.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/247awh/lost_confused_and_left_behind/", "author_flair_text": null, "title": "Lost, Confused, and Left Behind", "created_utc": 1398706802.0, "ups": 3, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4fsk3", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4fnq3", "approved_by": null, "body": "From what I can hear, you've not made any mistake, you're here looking for help before you do. I know some bad stuff has happened to you, and you feel like this is your fault, but it isn't. No one deserves to be feeling like this at all. If you had broken an arm, you would go see a doctor. If you had some virus, you would go see a doctor. Mental health diseases are the same thing. Sometimes without help this stuff won't get better on it's own. An I know what it's like to feel like you don't deserve help with this stuff, but that isn't you talking, that is the depression.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I can hear, you&amp;#39;ve not made any mistake, you&amp;#39;re here looking for help before you do. I know some bad stuff has happened to you, and you feel like this is your fault, but it isn&amp;#39;t. No one deserves to be feeling like this at all. If you had broken an arm, you would go see a doctor. If you had some virus, you would go see a doctor. Mental health diseases are the same thing. Sometimes without help this stuff won&amp;#39;t get better on it&amp;#39;s own. An I know what it&amp;#39;s like to feel like you don&amp;#39;t deserve help with this stuff, but that isn&amp;#39;t you talking, that is the depression.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4fsk3", "created": 1398722022.0, "author_flair_text": null, "created_utc": 1398718422.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4fnq3", "gilded": 0, "author": "ofmiceomen", "parent_id": "t1_ch4avcy", "approved_by": null, "body": "Like I said, I think I'm honestly afraid of being told what I need to hear. I don't want to recover, I don't want to start believing that this is for the best, I just don't feel like I deserve to feel that. I have made such a terrible mistake and I just want to pay for it. But I just don't know how to handle no longer being alive. I don't know if I'm ready to feel the absolute terror of instantly regretting doing something it's too late to take back in the final moments.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like I said, I think I&amp;#39;m honestly afraid of being told what I need to hear. I don&amp;#39;t want to recover, I don&amp;#39;t want to start believing that this is for the best, I just don&amp;#39;t feel like I deserve to feel that. I have made such a terrible mistake and I just want to pay for it. But I just don&amp;#39;t know how to handle no longer being alive. I don&amp;#39;t know if I&amp;#39;m ready to feel the absolute terror of instantly regretting doing something it&amp;#39;s too late to take back in the final moments.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4fnq3", "created": 1398721751.0, "author_flair_text": null, "created_utc": 1398718151.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4avcy", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4arik", "approved_by": null, "body": "I know what you mean, you want to be able to recover on your own, but that's not always possible. If you had any other disease you would go see a doctor, this isn't any difference. These feelings are being caused y a chemical imbalance, it can be fixed if you get professional help. And it may not feel right now that you both want both of you to be happy, but you will, everyone deserves to be happy. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean, you want to be able to recover on your own, but that&amp;#39;s not always possible. If you had any other disease you would go see a doctor, this isn&amp;#39;t any difference. These feelings are being caused y a chemical imbalance, it can be fixed if you get professional help. And it may not feel right now that you both want both of you to be happy, but you will, everyone deserves to be happy. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4avcy", "created": 1398712147.0, "author_flair_text": null, "created_utc": 1398708547.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4d7l5", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4arik", "approved_by": null, "body": "Let me know how things are going man, we're all here to help you out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let me know how things are going man, we&amp;#39;re all here to help you out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4d7l5", "created": 1398716888.0, "author_flair_text": null, "created_utc": 1398713288.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4arik", "gilded": 0, "author": "ofmiceomen", "parent_id": "t1_ch4a854", "approved_by": null, "body": "I appreciate the response, and for some reason I'm surprised that someone even did. It feels stupid saying that because I know how helpful this sub is. Anyway, I don't know if this makes sense but I feel like I *want* to be without professional help. I don't understand why because what if it did help me? I can't shake the desire to just let my willpower fade away until I have nothing left to do but kill myself. Maybe I hate myself so much that I feel like I don't deserve help. Maybe I'm afraid of the thought that I could *actually* be happy without her at some point and I could be okay with her being happy without me. I don't know if I want to feel that. And I know that you can't really give any advice on the relationship itself. I don't expect anyone to. I just wanted to give the source of my feelings. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate the response, and for some reason I&amp;#39;m surprised that someone even did. It feels stupid saying that because I know how helpful this sub is. Anyway, I don&amp;#39;t know if this makes sense but I feel like I &lt;em&gt;want&lt;/em&gt; to be without professional help. I don&amp;#39;t understand why because what if it did help me? I can&amp;#39;t shake the desire to just let my willpower fade away until I have nothing left to do but kill myself. Maybe I hate myself so much that I feel like I don&amp;#39;t deserve help. Maybe I&amp;#39;m afraid of the thought that I could &lt;em&gt;actually&lt;/em&gt; be happy without her at some point and I could be okay with her being happy without me. I don&amp;#39;t know if I want to feel that. And I know that you can&amp;#39;t really give any advice on the relationship itself. I don&amp;#39;t expect anyone to. I just wanted to give the source of my feelings. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4arik", "created": 1398711934.0, "author_flair_text": null, "created_utc": 1398708334.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4a854", "gilded": 0, "author": "[deleted]", "parent_id": "t3_247awh", "approved_by": null, "body": "We exist, we understand you and we want to help. I know what it's like when you're depressed to feel like you can't ever enjoy anything again, you feel like things can never be how they were before. I'm still pretty much in that point myself, by I know a lot of people who have been through the same thing and it is always possible to have a reason to live again. I know it may not be an option you want to hear, but professional help is just that, helpful. there's no shame in seeing a therapist to help you work through this stuff, and you will be able to work through it. \n\nI honestly can't really comment on the relationship situation, relationships are always fucking complicated, but although it feels like the end now, and you probably don't want to hear what I have to say, but things can still get better. I know what it's like to feel hopeless and alone, but if you want someone to talk to I'll do my best. I hope you find a way to sort things out man.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We exist, we understand you and we want to help. I know what it&amp;#39;s like when you&amp;#39;re depressed to feel like you can&amp;#39;t ever enjoy anything again, you feel like things can never be how they were before. I&amp;#39;m still pretty much in that point myself, by I know a lot of people who have been through the same thing and it is always possible to have a reason to live again. I know it may not be an option you want to hear, but professional help is just that, helpful. there&amp;#39;s no shame in seeing a therapist to help you work through this stuff, and you will be able to work through it. &lt;/p&gt;\n\n&lt;p&gt;I honestly can&amp;#39;t really comment on the relationship situation, relationships are always fucking complicated, but although it feels like the end now, and you probably don&amp;#39;t want to hear what I have to say, but things can still get better. I know what it&amp;#39;s like to feel hopeless and alone, but if you want someone to talk to I&amp;#39;ll do my best. I hope you find a way to sort things out man.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4a854", "created": 1398710851.0, "author_flair_text": null, "created_utc": 1398707251.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4fd9w", "gilded": 0, "author": "ofmiceomen", "parent_id": "t1_ch4bo08", "approved_by": null, "body": "Thanks, and trust me if it were just the relationship I wouldn't feel as terrible. But it's the fact that I will never feel the same love again. I'll never find anyone like that again. Honestly, I hate girls. Girls are stupid, but she was not just some girl. She was my one. It's just so damn heartbreaking to know that she didn't feel the same way as I did.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, and trust me if it were just the relationship I wouldn&amp;#39;t feel as terrible. But it&amp;#39;s the fact that I will never feel the same love again. I&amp;#39;ll never find anyone like that again. Honestly, I hate girls. Girls are stupid, but she was not just some girl. She was my one. It&amp;#39;s just so damn heartbreaking to know that she didn&amp;#39;t feel the same way as I did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4fd9w", "created": 1398721176.0, "author_flair_text": null, "created_utc": 1398717576.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4bo08", "gilded": 0, "author": "muffinmolotov", "parent_id": "t3_247awh", "approved_by": null, "body": "I know how you feel and I've felt the same way before but more so with family. Everyday I just feel more and more that they don't want me here and they all just left anyway. It's tough to watch people you love leave, but it's these hard times that will make the next better, as often as you probably hear that. I can't say I'm much better, sometimes I feel like I'm hanging on a string and my SO is the only one still pulling. Yet I always try to tell myself that this is the life I have and I don't know what's coming next. Life is a fragile gift, why waste it on people that shouldn't of been there in the first place? Try telling yourself that, they don't matter and there are still people that love you and would pull for you if you gave them the chance. I've been through therapy in and out and it's what you do with it and you deserve all the help you can get. You are just as valuable as the next and don't doubt it.\n\nThis is a bit of a ramble, but don't leave this world for that, there's so much that is to be found. You just have to go out and find it.\n\nAnd if you ever need to talk, I may be a stranger but I understand a lot. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know how you feel and I&amp;#39;ve felt the same way before but more so with family. Everyday I just feel more and more that they don&amp;#39;t want me here and they all just left anyway. It&amp;#39;s tough to watch people you love leave, but it&amp;#39;s these hard times that will make the next better, as often as you probably hear that. I can&amp;#39;t say I&amp;#39;m much better, sometimes I feel like I&amp;#39;m hanging on a string and my SO is the only one still pulling. Yet I always try to tell myself that this is the life I have and I don&amp;#39;t know what&amp;#39;s coming next. Life is a fragile gift, why waste it on people that shouldn&amp;#39;t of been there in the first place? Try telling yourself that, they don&amp;#39;t matter and there are still people that love you and would pull for you if you gave them the chance. I&amp;#39;ve been through therapy in and out and it&amp;#39;s what you do with it and you deserve all the help you can get. You are just as valuable as the next and don&amp;#39;t doubt it.&lt;/p&gt;\n\n&lt;p&gt;This is a bit of a ramble, but don&amp;#39;t leave this world for that, there&amp;#39;s so much that is to be found. You just have to go out and find it.&lt;/p&gt;\n\n&lt;p&gt;And if you ever need to talk, I may be a stranger but I understand a lot. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_247awh", "score_hidden": false, "name": "t1_ch4bo08", "created": 1398713789.0, "author_flair_text": null, "created_utc": 1398710189.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]