[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have no idea why I am writing this, but let me start off saying the obvious: My life sucks. I have no friends, a shitty job, shit grades, and, to top it all off, a fucking anxiety disorder. No girl wants to touch with a ten foot pole, because I am at the most a 4/10 on the attractiveness scale. There are 36 people in my high school class, who I have been with since first fucking grade, yet somehow I feel close to literally none of them. The only day of the week that I ever am hopeful for is the day that I have counseling, because its the only time in the entire week I will feel good about myself.&lt;/p&gt;\n\n&lt;p&gt;On May 31st I am supposed to be graduating high school. I am supposed to be having fun with my family. I am supposed to be leaving to go on the funnest trip of my entire high school career: senior trip at Panama City Beach. I am supposed to be happy. But in reality I will probably not experience any of that. In reality the only members of my family that will be there will be my mother and father. In reality my &amp;quot;friends&amp;quot; will be driving down to Florida without me. In reality I will be probably be floating down a river with a bullet in my head by the end of the night.&lt;/p&gt;\n\n&lt;p&gt;As I have said above I really have no friends and I am not even hyperbolizing that. In my entire high school career I was only invited to one party, and that was only because the person who threw it invited the entire grade. When our boys basketball team went to sectionals I ask on twitter if someone could give me a ride to it because I would not have been able to get to on my own. Despite the fact that I had mentioned that there was no other way that I could go to that game, only a single person said they could give me a ride 30 minutes before the game was about to start. Yesterday I asked again on twitter if anyone could possibly give me a ride to PCB, and as I expected not a single fucking person responded.&lt;/p&gt;\n\n&lt;p&gt;All I really want in life is to be excepted by the people around me. Although my case might seem like case of loneliness, the one thing that depresses me is that even though I had lost 70 god damn pounds, even though I raised my gpa to 2.2 to a 3.0 in just three years, even though I try to be nice and smile at everyone I know every time I see them, not a single fucking person cares even a little about me.&lt;/p&gt;\n\n&lt;p&gt;The way I see it there are three options I have for the thirty first. I could go to my graduation, and force myself to suffer the greatest anxiety attack I have ever experienced as I fully grasp the realization that even though I tried as hard as I could to make people like me no one actually does or ever will. I also have the option to just run away and start a new life somewhere else, but that one will, most likely, fail tremendously. Finally I do have a third option: to just end it before my life gets any worse. As of right now, the third option is the one that I think I will most likely choose. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have no idea why I am writing this, but let me start off saying the obvious: My life sucks. I have no friends, a shitty job, shit grades, and, to top it all off, a fucking anxiety disorder. No girl wants to touch with a ten foot pole, because I am at the most a 4/10 on the attractiveness scale. There are 36 people in my high school class, who I have been with since first fucking grade, yet somehow I feel close to literally none of them. The only day of the week that I ever am hopeful for is the day that I have counseling, because its the only time in the entire week I will feel good about myself.\n\nOn May 31st I am supposed to be graduating high school. I am supposed to be having fun with my family. I am supposed to be leaving to go on the funnest trip of my entire high school career: senior trip at Panama City Beach. I am supposed to be happy. But in reality I will probably not experience any of that. In reality the only members of my family that will be there will be my mother and father. In reality my \"friends\" will be driving down to Florida without me. In reality I will be probably be floating down a river with a bullet in my head by the end of the night.\n\nAs I have said above I really have no friends and I am not even hyperbolizing that. In my entire high school career I was only invited to one party, and that was only because the person who threw it invited the entire grade. When our boys basketball team went to sectionals I ask on twitter if someone could give me a ride to it because I would not have been able to get to on my own. Despite the fact that I had mentioned that there was no other way that I could go to that game, only a single person said they could give me a ride 30 minutes before the game was about to start. Yesterday I asked again on twitter if anyone could possibly give me a ride to PCB, and as I expected not a single fucking person responded.\n\nAll I really want in life is to be excepted by the people around me. Although my case might seem like case of loneliness, the one thing that depresses me is that even though I had lost 70 god damn pounds, even though I raised my gpa to 2.2 to a 3.0 in just three years, even though I try to be nice and smile at everyone I know every time I see them, not a single fucking person cares even a little about me.\n\nThe way I see it there are three options I have for the thirty first. I could go to my graduation, and force myself to suffer the greatest anxiety attack I have ever experienced as I fully grasp the realization that even though I tried as hard as I could to make people like me no one actually does or ever will. I also have the option to just run away and start a new life somewhere else, but that one will, most likely, fail tremendously. Finally I do have a third option: to just end it before my life gets any worse. As of right now, the third option is the one that I think I will most likely choose. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25br0q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "peeing_throwaway", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25br0q/may_the_thirty_first_a_day_that_is_supposed_to_be/", "name": "t3_25br0q", "created": 1399889122.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25br0q/may_the_thirty_first_a_day_that_is_supposed_to_be/", "author_flair_text": null, "title": "May the thirty first: A day that is supposed to be one of my happiest in life, might just end up being my last.", "created_utc": 1399860322.0, "ups": 15, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfo99x", "gilded": 0, "author": "crazylighter", "parent_id": "t1_chfnzn1", "approved_by": null, "body": "To answer your questions- I know it seems like you will never make more friends based on your experiences up till now, but a lot of the time the friends you make in high school, middle school or elementary school won't be your friends later on in life. This is because everyone's interests \"grow up\" and they go different ways.\n\nTo make friends, you could try to change what's inside of you as much as what is outside of you. For example, when you leave highschool, and either join the work world or higher education, it's a new opportunity to meet people who have never met you before. This means it's a new time to make them meet the new you. \n\nWhat could the new you look like? Smile, be positive even if you don't really feel that way- it's called faking it till you make it. How to do that around other people? Ask them questions about themselves, about their lives, and be considerate and relate to them. People love talking about themselves, and smiling makes them feel good. \n\nMeanwhile, do activities that make you feel good. Like exercise, or picking up a new hobby, or a volunteer group, or something that will change your perspectives and give you experiences to understand others.\n\nAs for college, if you can't be where you want to be, is there somewhere close to that, which can make you feel content? If you can't be a software developer because of the math involved, is there something related to developing products or working with computers, that will interest you? Look for universities or colleges that accept your GPA, that have disability services on campus and have clubs for your interests. Look for a degree that can work at your intelligence level while being good in this economy, and having your interest. For example, have you considered a business degree? ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To answer your questions- I know it seems like you will never make more friends based on your experiences up till now, but a lot of the time the friends you make in high school, middle school or elementary school won&amp;#39;t be your friends later on in life. This is because everyone&amp;#39;s interests &amp;quot;grow up&amp;quot; and they go different ways.&lt;/p&gt;\n\n&lt;p&gt;To make friends, you could try to change what&amp;#39;s inside of you as much as what is outside of you. For example, when you leave highschool, and either join the work world or higher education, it&amp;#39;s a new opportunity to meet people who have never met you before. This means it&amp;#39;s a new time to make them meet the new you. &lt;/p&gt;\n\n&lt;p&gt;What could the new you look like? Smile, be positive even if you don&amp;#39;t really feel that way- it&amp;#39;s called faking it till you make it. How to do that around other people? Ask them questions about themselves, about their lives, and be considerate and relate to them. People love talking about themselves, and smiling makes them feel good. &lt;/p&gt;\n\n&lt;p&gt;Meanwhile, do activities that make you feel good. Like exercise, or picking up a new hobby, or a volunteer group, or something that will change your perspectives and give you experiences to understand others.&lt;/p&gt;\n\n&lt;p&gt;As for college, if you can&amp;#39;t be where you want to be, is there somewhere close to that, which can make you feel content? If you can&amp;#39;t be a software developer because of the math involved, is there something related to developing products or working with computers, that will interest you? Look for universities or colleges that accept your GPA, that have disability services on campus and have clubs for your interests. Look for a degree that can work at your intelligence level while being good in this economy, and having your interest. For example, have you considered a business degree? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfo99x", "created": 1399894011.0, "author_flair_text": null, "created_utc": 1399865211.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfyjgb", "gilded": 0, "author": "dinosaur_train", "parent_id": "t1_chfnzn1", "approved_by": null, "body": "&gt; I want to be a software developer, but I am still in Algebra two as a senior in High School.\n\nOne of my friends has a learning disability in math. He ended up dropping out of high school. He's a software dev now, self taught. Never went to college.. nothing. Worked his way up from shitty minimum wage phone tech support. High school doesn't even matter, seriously. \n\nThe problem with high school is all the lies adults and teachers tell you. For 12 years this big theater has been put on to convince you that what the fuck you do in school matters. Shit no it doesn't. Not really. What you do at work tends to matter.. so work some small job.. cruise through a community college at your leisure and take it easy. Try many jobs and don't think about the future so much. With depression the future is always black, so just do what you can and want today. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I want to be a software developer, but I am still in Algebra two as a senior in High School.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;One of my friends has a learning disability in math. He ended up dropping out of high school. He&amp;#39;s a software dev now, self taught. Never went to college.. nothing. Worked his way up from shitty minimum wage phone tech support. High school doesn&amp;#39;t even matter, seriously. &lt;/p&gt;\n\n&lt;p&gt;The problem with high school is all the lies adults and teachers tell you. For 12 years this big theater has been put on to convince you that what the fuck you do in school matters. Shit no it doesn&amp;#39;t. Not really. What you do at work tends to matter.. so work some small job.. cruise through a community college at your leisure and take it easy. Try many jobs and don&amp;#39;t think about the future so much. With depression the future is always black, so just do what you can and want today. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfyjgb", "created": 1399934553.0, "author_flair_text": null, "created_utc": 1399905753.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfssls", "gilded": 0, "author": "yoghurtsnake", "parent_id": "t1_chfnzn1", "approved_by": null, "body": "I'd like to disagree if I might! I'm halfway decent at Python to the point where I can interact with APIs, request data and research what I need to learn with the language. While it's not software per se, I even won an award for being top of my year in Web Design so I'm fairly versed in HTML, CSS and even a bit of PHP and I'm not much older than you!\n\nAlgebra? Forget that, I'm awful at it. My final year? Hah! Not only did I take the easy route of Maths (Statistics over Algebra), I didn't even turn up to half of my classes! You know why? Because I was hiding in the library with my laptop pretending to be part of an Economics class doing Web Design and writing silly little Python scripts because it was what I enjoyed!\n\nOh and Chemistry? I dropped the sciences as soon as I could, not because I don't understand their importance but because I knew that wasn't what I wanted to do. I mean, it's the internet, all human knowledge! I don't necessarily need to know the period table off by hear t since I'm unlikely to need that information in the blink of an eye.\n\nYou could look at doing a community college course (I think that's the equivalent? Here we have Polytechnics which are like an alternative to university) or a specialist school perhaps? Heck, there are even plenty of useful websites to learn from online. I mean, all university does is set you up to go out and research topics in your own time right? That said, I'm not in any way endorsing opting in or out of university. That's your own choice to make and neither choice is \"wrong\". I mean, that is to say, wrong is just a concept so it can be whatever you like!\n\nOh, speaking of which, I did go through a mental facility at one point and I met one of the workers there and he went to a community college fairly late in his career and he ended developing internal management software for a large insurance company as well as a few other freelance projects over in the UK and he said he was awful at Maths as well. I think when people say you need to be good at Maths, in some ways, they mean the mindset of a mathematician in that you can think logically in a set order which you can definitely teach yourself to do.\n\nAs for being awkward and all that? There are plans of people like that! I mean, the world would be a boring place if everyone just talked all the time in a perfect manner. I do agree with the other comments in that while it doesn't feel like it, everything does change after High School. You can still keep in touch with people should you choose but friendships change and you meet new people either where you are now or in other places if you choose to travel.\n\nHmm, I think I probably went on a bit too much there but ah well!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to disagree if I might! I&amp;#39;m halfway decent at Python to the point where I can interact with APIs, request data and research what I need to learn with the language. While it&amp;#39;s not software per se, I even won an award for being top of my year in Web Design so I&amp;#39;m fairly versed in HTML, CSS and even a bit of PHP and I&amp;#39;m not much older than you!&lt;/p&gt;\n\n&lt;p&gt;Algebra? Forget that, I&amp;#39;m awful at it. My final year? Hah! Not only did I take the easy route of Maths (Statistics over Algebra), I didn&amp;#39;t even turn up to half of my classes! You know why? Because I was hiding in the library with my laptop pretending to be part of an Economics class doing Web Design and writing silly little Python scripts because it was what I enjoyed!&lt;/p&gt;\n\n&lt;p&gt;Oh and Chemistry? I dropped the sciences as soon as I could, not because I don&amp;#39;t understand their importance but because I knew that wasn&amp;#39;t what I wanted to do. I mean, it&amp;#39;s the internet, all human knowledge! I don&amp;#39;t necessarily need to know the period table off by hear t since I&amp;#39;m unlikely to need that information in the blink of an eye.&lt;/p&gt;\n\n&lt;p&gt;You could look at doing a community college course (I think that&amp;#39;s the equivalent? Here we have Polytechnics which are like an alternative to university) or a specialist school perhaps? Heck, there are even plenty of useful websites to learn from online. I mean, all university does is set you up to go out and research topics in your own time right? That said, I&amp;#39;m not in any way endorsing opting in or out of university. That&amp;#39;s your own choice to make and neither choice is &amp;quot;wrong&amp;quot;. I mean, that is to say, wrong is just a concept so it can be whatever you like!&lt;/p&gt;\n\n&lt;p&gt;Oh, speaking of which, I did go through a mental facility at one point and I met one of the workers there and he went to a community college fairly late in his career and he ended developing internal management software for a large insurance company as well as a few other freelance projects over in the UK and he said he was awful at Maths as well. I think when people say you need to be good at Maths, in some ways, they mean the mindset of a mathematician in that you can think logically in a set order which you can definitely teach yourself to do.&lt;/p&gt;\n\n&lt;p&gt;As for being awkward and all that? There are plans of people like that! I mean, the world would be a boring place if everyone just talked all the time in a perfect manner. I do agree with the other comments in that while it doesn&amp;#39;t feel like it, everything does change after High School. You can still keep in touch with people should you choose but friendships change and you meet new people either where you are now or in other places if you choose to travel.&lt;/p&gt;\n\n&lt;p&gt;Hmm, I think I probably went on a bit too much there but ah well!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfssls", "created": 1399909367.0, "author_flair_text": null, "created_utc": 1399880567.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfnzn1", "gilded": 0, "author": "peeing_throwaway", "parent_id": "t1_chfmljs", "approved_by": null, "body": "How can I make any friends when throughout my entire life I have only managed to make 6 and none of them talk to me now? Every one of those dudes, as well as I, were considered \"odd balls\", and being friends with them has only made me more ostracized from the people around me. I don't hate them for being \"odd balls\" though, because they were nice and genuine people, but in my post when I said \"all I wanted was to be excepted\" I guess it could have been better phrased as \"All I want is to be considered normal\". I hate feeling as though people don't like because I am different from the rest of the croup which is why I lost 70 pounds and why I chose to improve my grades.\n\nAs for college: I will never be what I want to be, because I am just too fucking stupid. I want to be a software developer, but I am still in Algebra two as a senior in High School. That boat has already sailed and was the original thing that caused me depression. \n\n ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How can I make any friends when throughout my entire life I have only managed to make 6 and none of them talk to me now? Every one of those dudes, as well as I, were considered &amp;quot;odd balls&amp;quot;, and being friends with them has only made me more ostracized from the people around me. I don&amp;#39;t hate them for being &amp;quot;odd balls&amp;quot; though, because they were nice and genuine people, but in my post when I said &amp;quot;all I wanted was to be excepted&amp;quot; I guess it could have been better phrased as &amp;quot;All I want is to be considered normal&amp;quot;. I hate feeling as though people don&amp;#39;t like because I am different from the rest of the croup which is why I lost 70 pounds and why I chose to improve my grades.&lt;/p&gt;\n\n&lt;p&gt;As for college: I will never be what I want to be, because I am just too fucking stupid. I want to be a software developer, but I am still in Algebra two as a senior in High School. That boat has already sailed and was the original thing that caused me depression. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfnzn1", "created": 1399893338.0, "author_flair_text": null, "created_utc": 1399864538.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chfmljs", "gilded": 0, "author": "crazylighter", "parent_id": "t3_25br0q", "approved_by": null, "body": "The thing is, you are in high school right now. You may not feel like it right now, but high school is just a bubble, a blip, a small part of life that can be looked back upon as a hyped-up hormones gone wild kind of a place that may or may not be very pleasant for many.\n\nHigh school is not real life. The people you meet there have a ton of problems but they hide their insecurities through making friends, joining teams, acting tough/cool/however they think will get them by, through partying/drugs/alcohol, being responsible or whatever else makes them feel good.\n\nSo what I am trying to say as you are about to end up a cross road where there is another choice- keep living your life this miserable way until you or it ends it, or find a new way to live.\n\nThe second choice opens up several possibilities but it starts by asking yourself what would your ideal life look like within your means and resources. For me, I realized I would be happy if I got my bachelor of science, worked in a health field, made some real friends, exercised and ate good food. I put my \"My Life Goals\" right on my wall by my desk so I would always remember what i was working towards and that kept me a live.\n\nA 3.0 GPA can get you into college, community college, university, some kind of education. What kind of career has the best environment, most chance of monetary value, a growing trend of employing people, and meets your interests? Go to school for it, and make friends there. Find friends that are the \"odd balls\", the real deal- they have problems too, and can relate to you as they don't fit in either.\n\nIf you run away, you may fail- but failure is in the eyes of the beholder. Failure says \"you're not doing it right, try some other way\". I failed chemistry and math- it told me, that's not my interest and I realized I had ADHD and got help. Failure is good sometimes.\n\nGood luck and don't give up yet, high school just isn't real.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is, you are in high school right now. You may not feel like it right now, but high school is just a bubble, a blip, a small part of life that can be looked back upon as a hyped-up hormones gone wild kind of a place that may or may not be very pleasant for many.&lt;/p&gt;\n\n&lt;p&gt;High school is not real life. The people you meet there have a ton of problems but they hide their insecurities through making friends, joining teams, acting tough/cool/however they think will get them by, through partying/drugs/alcohol, being responsible or whatever else makes them feel good.&lt;/p&gt;\n\n&lt;p&gt;So what I am trying to say as you are about to end up a cross road where there is another choice- keep living your life this miserable way until you or it ends it, or find a new way to live.&lt;/p&gt;\n\n&lt;p&gt;The second choice opens up several possibilities but it starts by asking yourself what would your ideal life look like within your means and resources. For me, I realized I would be happy if I got my bachelor of science, worked in a health field, made some real friends, exercised and ate good food. I put my &amp;quot;My Life Goals&amp;quot; right on my wall by my desk so I would always remember what i was working towards and that kept me a live.&lt;/p&gt;\n\n&lt;p&gt;A 3.0 GPA can get you into college, community college, university, some kind of education. What kind of career has the best environment, most chance of monetary value, a growing trend of employing people, and meets your interests? Go to school for it, and make friends there. Find friends that are the &amp;quot;odd balls&amp;quot;, the real deal- they have problems too, and can relate to you as they don&amp;#39;t fit in either.&lt;/p&gt;\n\n&lt;p&gt;If you run away, you may fail- but failure is in the eyes of the beholder. Failure says &amp;quot;you&amp;#39;re not doing it right, try some other way&amp;quot;. I failed chemistry and math- it told me, that&amp;#39;s not my interest and I realized I had ADHD and got help. Failure is good sometimes.&lt;/p&gt;\n\n&lt;p&gt;Good luck and don&amp;#39;t give up yet, high school just isn&amp;#39;t real.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfmljs", "created": 1399890133.0, "author_flair_text": null, "created_utc": 1399861333.0, "distinguished": null, "num_reports": null, "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfp8cj", "gilded": 0, "author": "doctorprestige", "parent_id": "t3_25br0q", "approved_by": null, "body": "Life gets SO much better after High School. Power through the next few months, and you'll thank yourself. Trust me.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life gets SO much better after High School. Power through the next few months, and you&amp;#39;ll thank yourself. Trust me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfp8cj", "created": 1399896574.0, "author_flair_text": null, "created_utc": 1399867774.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfvedf", "gilded": 0, "author": "Altruizzy", "parent_id": "t3_25br0q", "approved_by": null, "body": "You sound hurt :( did something happen? Please have a good day", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound hurt :( did something happen? Please have a good day&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfvedf", "created": 1399924646.0, "author_flair_text": null, "created_utc": 1399895846.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfyfn1", "gilded": 0, "author": "dinosaur_train", "parent_id": "t3_25br0q", "approved_by": null, "body": "I understand where you are coming from. But, here is the thing. Anxiety and depression lie to you about reality. They put this narrative in your head that isn't true. So, when everyone is seeing the sky is blue you are seeing a black sky and nobody can convince you otherwise because that is reality, for you. \n\nI get it. It's downward thinking to the max. Having PTSD I've fought these thoughts and can identify with what you are going through. \n\nThat being said, while your feelings, belief, and reality are what they are, they are wrong. Once your depression and anxiety gets managed, you will see. It's akin to suffering a headache every painful day and then finally getting some tylenol. Bam - suddenly there is this new life. And, that's what you can have, op. \n\nCompounded with your problems, high school is the furthest thing from reality possible. It's this manufactured group of kids put together because of location and education needs. It's not organic. Once you are in the real world, you'll meet people organically. Friends become real friends because you were grouped based on interests and not a district line. Down the road, people don't keep high school friends anyway. I had a great clique, now I'm lucky to still talk to one girl every now and again. That's how everyone gets down the road. \n\nDownward thinking - \n\n&gt;  I could go to my graduation, and force myself to suffer the greatest anxiety attack I have ever experienced \n\nNo. Or you could skip graduation, like I did because it's completely arbitrary. I can't believe anyone even cares about that silly shit. People used to tell me I'd regret skipping - HAHAHAH - yea, NOPE.  \n\nOr, you could go and just observe the finality of this silly manufactured group of people and be happy to move to the next phase of life. \n\n&gt; as I fully grasp the realization that even though I tried as hard as I could to make people like me no one actually does or ever will. \n\nOnce you like yourself, people will like you. You'd be surprised how few of the kids around you are actually happy with themselves too. Hence the great finding of yourself in early college begins... \n\nIf you kill yourself it will be like a nuclear bomb going off. It will take EVERYONE out with you. People who you didn't even have an idea that cared will suffer for the rest of their lives. It's a horrible experience for survivors. Horrible. It affects how people will raise their kids, affecting grandkids, and on and on... the absolute trauma suicide brings to people is catastrophic and not to be underestimated. \n\nWhen I felt suicidal, I couldn't act on it because I had seen how it hurt people as I described. I decided I had to hurt and suffer beyond measure just to keep people from that. I thought the pain I endured would go on forever. But, it didn't. \n\nTrust me op, all of this is temporary even though I know you feel it isn't. It all feels very permanent. THAT is the cloud of depression and downward thinking. You have to fight that. It's like being on acid. You have to tell yourself that purple dinosaur in the room isn't real. These thoughts of failure, they are like that tripping dinosaur. It looks like it's there if you are on acid, but it's just not real. It's hard to fight your mind but you can do it! \n\nPlease, tell your therapist the complete truth about what's going on. Talk to your parents too, if you can. \n\nYou can win! Good luck.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand where you are coming from. But, here is the thing. Anxiety and depression lie to you about reality. They put this narrative in your head that isn&amp;#39;t true. So, when everyone is seeing the sky is blue you are seeing a black sky and nobody can convince you otherwise because that is reality, for you. &lt;/p&gt;\n\n&lt;p&gt;I get it. It&amp;#39;s downward thinking to the max. Having PTSD I&amp;#39;ve fought these thoughts and can identify with what you are going through. &lt;/p&gt;\n\n&lt;p&gt;That being said, while your feelings, belief, and reality are what they are, they are wrong. Once your depression and anxiety gets managed, you will see. It&amp;#39;s akin to suffering a headache every painful day and then finally getting some tylenol. Bam - suddenly there is this new life. And, that&amp;#39;s what you can have, op. &lt;/p&gt;\n\n&lt;p&gt;Compounded with your problems, high school is the furthest thing from reality possible. It&amp;#39;s this manufactured group of kids put together because of location and education needs. It&amp;#39;s not organic. Once you are in the real world, you&amp;#39;ll meet people organically. Friends become real friends because you were grouped based on interests and not a district line. Down the road, people don&amp;#39;t keep high school friends anyway. I had a great clique, now I&amp;#39;m lucky to still talk to one girl every now and again. That&amp;#39;s how everyone gets down the road. &lt;/p&gt;\n\n&lt;p&gt;Downward thinking - &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I could go to my graduation, and force myself to suffer the greatest anxiety attack I have ever experienced &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. Or you could skip graduation, like I did because it&amp;#39;s completely arbitrary. I can&amp;#39;t believe anyone even cares about that silly shit. People used to tell me I&amp;#39;d regret skipping - HAHAHAH - yea, NOPE.  &lt;/p&gt;\n\n&lt;p&gt;Or, you could go and just observe the finality of this silly manufactured group of people and be happy to move to the next phase of life. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;as I fully grasp the realization that even though I tried as hard as I could to make people like me no one actually does or ever will. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Once you like yourself, people will like you. You&amp;#39;d be surprised how few of the kids around you are actually happy with themselves too. Hence the great finding of yourself in early college begins... &lt;/p&gt;\n\n&lt;p&gt;If you kill yourself it will be like a nuclear bomb going off. It will take EVERYONE out with you. People who you didn&amp;#39;t even have an idea that cared will suffer for the rest of their lives. It&amp;#39;s a horrible experience for survivors. Horrible. It affects how people will raise their kids, affecting grandkids, and on and on... the absolute trauma suicide brings to people is catastrophic and not to be underestimated. &lt;/p&gt;\n\n&lt;p&gt;When I felt suicidal, I couldn&amp;#39;t act on it because I had seen how it hurt people as I described. I decided I had to hurt and suffer beyond measure just to keep people from that. I thought the pain I endured would go on forever. But, it didn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Trust me op, all of this is temporary even though I know you feel it isn&amp;#39;t. It all feels very permanent. THAT is the cloud of depression and downward thinking. You have to fight that. It&amp;#39;s like being on acid. You have to tell yourself that purple dinosaur in the room isn&amp;#39;t real. These thoughts of failure, they are like that tripping dinosaur. It looks like it&amp;#39;s there if you are on acid, but it&amp;#39;s just not real. It&amp;#39;s hard to fight your mind but you can do it! &lt;/p&gt;\n\n&lt;p&gt;Please, tell your therapist the complete truth about what&amp;#39;s going on. Talk to your parents too, if you can. &lt;/p&gt;\n\n&lt;p&gt;You can win! Good luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfyfn1", "created": 1399934293.0, "author_flair_text": null, "created_utc": 1399905493.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfor25", "gilded": 0, "author": "myowmyow", "parent_id": "t3_25br0q", "approved_by": null, "body": "Please, not on my birthday :(\n\n\n\n\n\nI more than understand the whirlpool thoughts of dreading the future and how easy it is to get sucked under.\n\nHey on May 31st in 2012, I graduated high school (never thought I would) and turned 18 on the same god damn day, and no one got a picture of me crossing the stage to get my diploma. So. There's that. But really, like crazylighter says, high school is a tiny cesspool of bullshit that is such a relief to escape. Things don't magically get easier and there's always something new, but they are things that you can conquer.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please, not on my birthday :(&lt;/p&gt;\n\n&lt;p&gt;I more than understand the whirlpool thoughts of dreading the future and how easy it is to get sucked under.&lt;/p&gt;\n\n&lt;p&gt;Hey on May 31st in 2012, I graduated high school (never thought I would) and turned 18 on the same god damn day, and no one got a picture of me crossing the stage to get my diploma. So. There&amp;#39;s that. But really, like crazylighter says, high school is a tiny cesspool of bullshit that is such a relief to escape. Things don&amp;#39;t magically get easier and there&amp;#39;s always something new, but they are things that you can conquer.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25br0q", "score_hidden": false, "name": "t1_chfor25", "created": 1399895275.0, "author_flair_text": null, "created_utc": 1399866475.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]