[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve hit an all time low. I have withdrew from all my classes this semester and because of that my financial aid will go under review and there is a low chance of me ever finishing college. I have been so sad and anxious for the last 4 months and I can&amp;#39;t take it anymore. I&amp;#39;m miserable and lonely at college, and I&amp;#39;m completely alone when I go home. I finished high-school with absolutely no friends and have no friends anywhere near my home. When I came to college last year I changed, and started making a few connections. But those have all fell through as just casual acquiesces this year. All I had this whole year in terms of friends is my roommate who spends every second of his life with his girlfriend, and my former best friend (the girl I was in live with). Her and I expressed feelings for each other about 4 months ago and &amp;quot;hooked up&amp;quot;. I was very hopeful that this would be the start of an awesome relationship with my best friend. It was not. She told me that she wasn&amp;#39;t ready to be in a relationship and then went out and hooked up with some other guy a week later. We haven&amp;#39;t talked since. I felt cheated on, so I avoided her for about 2 months and when I finally moved on and just wanted my best friend back as a friend she told me she wanted nothing to do with me. So here I am, failing out of college to the point where I have to withdraw and only one friend left in the world who cares more about his girlfriend then spending time with me. I&amp;#39;m not happy in school, and I&amp;#39;m so lonely when I&amp;#39;m at home that I just sleep 18 hours a day and cry. I&amp;#39;m not happy anywhere and I just feel like I have no future. I&amp;#39;ve been thinking about dying all semester, and I don&amp;#39;t know how serious I am about it, but it feels like a good option compared to not being able to finish school and being over 50k In debt with no friends. I don&amp;#39;t know how to function any longer. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've hit an all time low. I have withdrew from all my classes this semester and because of that my financial aid will go under review and there is a low chance of me ever finishing college. I have been so sad and anxious for the last 4 months and I can't take it anymore. I'm miserable and lonely at college, and I'm completely alone when I go home. I finished high-school with absolutely no friends and have no friends anywhere near my home. When I came to college last year I changed, and started making a few connections. But those have all fell through as just casual acquiesces this year. All I had this whole year in terms of friends is my roommate who spends every second of his life with his girlfriend, and my former best friend (the girl I was in live with). Her and I expressed feelings for each other about 4 months ago and \"hooked up\". I was very hopeful that this would be the start of an awesome relationship with my best friend. It was not. She told me that she wasn't ready to be in a relationship and then went out and hooked up with some other guy a week later. We haven't talked since. I felt cheated on, so I avoided her for about 2 months and when I finally moved on and just wanted my best friend back as a friend she told me she wanted nothing to do with me. So here I am, failing out of college to the point where I have to withdraw and only one friend left in the world who cares more about his girlfriend then spending time with me. I'm not happy in school, and I'm so lonely when I'm at home that I just sleep 18 hours a day and cry. I'm not happy anywhere and I just feel like I have no future. I've been thinking about dying all semester, and I don't know how serious I am about it, but it feels like a good option compared to not being able to finish school and being over 50k In debt with no friends. I don't know how to function any longer. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242gvw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwaway5415", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242gvw/maybe_writing_this_out_in_a_public_place_will_help/", "name": "t3_242gvw", "created": 1398586426.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242gvw/maybe_writing_this_out_in_a_public_place_will_help/", "author_flair_text": null, "title": "Maybe writing this out in a public place will help.", "created_utc": 1398557626.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ygjg", "gilded": 0, "author": "yummycorndog", "parent_id": "t1_ch2y67r", "approved_by": null, "body": "You can make minimum possible payments monthly. Or drop out of college, declare bankruptcy and wipe it all out, and try to get a minimum wage job. I understand it sounds like shit, but if you're going to kill yourself, anything is better than suicide right? \n\nBetter yet, when you lose everything, you have nothing to lose. And you can just starting acting like a total dick and throw a middle finger to the world. Of course, that's just temporary and you won't be indignant forever.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can make minimum possible payments monthly. Or drop out of college, declare bankruptcy and wipe it all out, and try to get a minimum wage job. I understand it sounds like shit, but if you&amp;#39;re going to kill yourself, anything is better than suicide right? &lt;/p&gt;\n\n&lt;p&gt;Better yet, when you lose everything, you have nothing to lose. And you can just starting acting like a total dick and throw a middle finger to the world. Of course, that&amp;#39;s just temporary and you won&amp;#39;t be indignant forever.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242gvw", "score_hidden": false, "name": "t1_ch2ygjg", "created": 1398564068.0, "author_flair_text": null, "created_utc": 1398560468.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2y67r", "gilded": 0, "author": "Throwaway5415", "parent_id": "t1_ch2y1rb", "approved_by": null, "body": "To live yes, but they can not help me at all with debt, I owe more than my dad makes a year ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To live yes, but they can not help me at all with debt, I owe more than my dad makes a year &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242gvw", "score_hidden": false, "name": "t1_ch2y67r", "created": 1398563299.0, "author_flair_text": null, "created_utc": 1398559699.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2y1rb", "gilded": 0, "author": "yummycorndog", "parent_id": "t3_242gvw", "approved_by": null, "body": "Do you have your parents you can fall back on?\n\nEdit: Financially, and for somewhere to live", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have your parents you can fall back on?&lt;/p&gt;\n\n&lt;p&gt;Edit: Financially, and for somewhere to live&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242gvw", "score_hidden": false, "name": "t1_ch2y1rb", "created": 1398562949.0, "author_flair_text": null, "created_utc": 1398559349.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]