[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m breaking up with my fiancé tomorrow. He was diagnosed with a sexual addiction four years ago and with depression last year. As our relationship has slowly gone south he&amp;#39;s made it clear just how suicidal he is. Yesterday we had a relatively normal fight and i got a random text saying &amp;quot;sorry for thinking about crashing my car just to show you what you were losing.&amp;quot; Sure, it might partially be a manipulation tactic because he knows that I&amp;#39;m considering leaving, but with how many of his exes i know and how many stunts he pulled with them I&amp;#39;m concerned for his life.&lt;/p&gt;\n\n&lt;p&gt;Hes 21 and still lives with his parents, but by the same token he has a concealed carry permit and has a 45 on him at all times. That doesnt take long to do its job if they look the other way for a few minutes. I still love him and care about his well being so i dont want him hurting himself. What do i need to do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm breaking up with my fiancé tomorrow. He was diagnosed with a sexual addiction four years ago and with depression last year. As our relationship has slowly gone south he's made it clear just how suicidal he is. Yesterday we had a relatively normal fight and i got a random text saying \"sorry for thinking about crashing my car just to show you what you were losing.\" Sure, it might partially be a manipulation tactic because he knows that I'm considering leaving, but with how many of his exes i know and how many stunts he pulled with them I'm concerned for his life.\n\nHes 21 and still lives with his parents, but by the same token he has a concealed carry permit and has a 45 on him at all times. That doesnt take long to do its job if they look the other way for a few minutes. I still love him and care about his well being so i dont want him hurting himself. What do i need to do?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241oui", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "bizombie", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241oui/maybe_not_your_usual_post_but/", "name": "t3_241oui", "created": 1398566001.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241oui/maybe_not_your_usual_post_but/", "author_flair_text": null, "title": "Maybe not your usual post, but...", "created_utc": 1398537201.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2trll", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_241oui", "approved_by": null, "body": "I don't know what you need to do, because the fact that he's armed makes this situation very very dangerous. (unless I'm overreacting here, but I don't think that I am?) I think that the number one thing you need to do is to make sure you are not in harms way, and that guilt does not play a role in your decision making.\n\nHe obviously needs an outlet emotionally, but it does *not* have to be you (unless you truly feel safe being this). I don't know if his parents are caring or not, but my first thought would be to contact them, and to make sure that they know how he's feeling. He really *does* need emotional support, but so do you, and it may not be safe for you to be around him at all.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what you need to do, because the fact that he&amp;#39;s armed makes this situation very very dangerous. (unless I&amp;#39;m overreacting here, but I don&amp;#39;t think that I am?) I think that the number one thing you need to do is to make sure you are not in harms way, and that guilt does not play a role in your decision making.&lt;/p&gt;\n\n&lt;p&gt;He obviously needs an outlet emotionally, but it does &lt;em&gt;not&lt;/em&gt; have to be you (unless you truly feel safe being this). I don&amp;#39;t know if his parents are caring or not, but my first thought would be to contact them, and to make sure that they know how he&amp;#39;s feeling. He really &lt;em&gt;does&lt;/em&gt; need emotional support, but so do you, and it may not be safe for you to be around him at all.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241oui", "score_hidden": false, "name": "t1_ch2trll", "created": 1398576769.0, "author_flair_text": null, "created_utc": 1398547969.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2tz27", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_241oui", "approved_by": null, "body": "It's very very common for people who are in this place to not be able to see a future for themselves.\n\nor feel very little life or hope at all, especially when it comes to romance, it can feel like life is being taken from him (obviously he's putting it in these terms). It may help him to understand that there is support out there, and reddit can be a form where he can find other people who are going through what he's going through and what he's feeling.\n\nIf he can connect to other people who have been through these dark and heavy places, it may help him not feel so alone with his own desperation. I don't think anyone should have to go through that alone.\n\nBasically, it may help to tell him about these reddits, but again, that's a very tricky situation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s very very common for people who are in this place to not be able to see a future for themselves.&lt;/p&gt;\n\n&lt;p&gt;or feel very little life or hope at all, especially when it comes to romance, it can feel like life is being taken from him (obviously he&amp;#39;s putting it in these terms). It may help him to understand that there is support out there, and reddit can be a form where he can find other people who are going through what he&amp;#39;s going through and what he&amp;#39;s feeling.&lt;/p&gt;\n\n&lt;p&gt;If he can connect to other people who have been through these dark and heavy places, it may help him not feel so alone with his own desperation. I don&amp;#39;t think anyone should have to go through that alone.&lt;/p&gt;\n\n&lt;p&gt;Basically, it may help to tell him about these reddits, but again, that&amp;#39;s a very tricky situation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241oui", "score_hidden": false, "name": "t1_ch2tz27", "created": 1398577304.0, "author_flair_text": null, "created_utc": 1398548504.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2tva4", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_241oui", "approved_by": null, "body": "That being said, I think it is good to make sure to just listen to him as best as you can and what he's feeling (in a medium that feels safe, like texting?/phone). He may need to know that despite not being together, it does not mean that the gulf between the two of you will always be uncrossable.\n\nHe may need just an outlet and someone to just listen to him and his texts/calls. I understand that that may be a burden mentally and emotionally, but it might be a good idea to continue that correspondence, at least for a little bit. \n\nIt may help to help him understand that you need to focus on your dreams/passions and that having another person in your life at this moment is just too much to focus on and that you are barely keeping things together as is, sometimes it's just *too* much to have anyone too close, and that you need to find your own stability, and that you encourage him to reach for his dreams/passions and find his own stability too, because he needs to have that to truly be there for someone else.\n\n I just wouldn't meet him alone, make sure people know where you are etc. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That being said, I think it is good to make sure to just listen to him as best as you can and what he&amp;#39;s feeling (in a medium that feels safe, like texting?/phone). He may need to know that despite not being together, it does not mean that the gulf between the two of you will always be uncrossable.&lt;/p&gt;\n\n&lt;p&gt;He may need just an outlet and someone to just listen to him and his texts/calls. I understand that that may be a burden mentally and emotionally, but it might be a good idea to continue that correspondence, at least for a little bit. &lt;/p&gt;\n\n&lt;p&gt;It may help to help him understand that you need to focus on your dreams/passions and that having another person in your life at this moment is just too much to focus on and that you are barely keeping things together as is, sometimes it&amp;#39;s just &lt;em&gt;too&lt;/em&gt; much to have anyone too close, and that you need to find your own stability, and that you encourage him to reach for his dreams/passions and find his own stability too, because he needs to have that to truly be there for someone else.&lt;/p&gt;\n\n&lt;p&gt;I just wouldn&amp;#39;t meet him alone, make sure people know where you are etc. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241oui", "score_hidden": false, "name": "t1_ch2tva4", "created": 1398577032.0, "author_flair_text": null, "created_utc": 1398548232.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]