[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be home alone with a gun, I could do it. A part of me resists, however, it isn&amp;#39;t strong enough to push the feelings away entirely. &lt;/p&gt;\n\n&lt;p&gt;Edit: I should say, I&amp;#39;m not trying to take a stubborn position and just seem narrow minded and short sighted. I don&amp;#39;t want to kill myself, but when I think about my life and trying to change it so that I don&amp;#39;t feel like dying it will bring tears to my eyes because it seems so difficult and impossible. I&amp;#39;m posting here because I&amp;#39;m desperate for any sort of input and can&amp;#39;t talk to anyone in person.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll be home alone with a gun, I could do it. A part of me resists, however, it isn't strong enough to push the feelings away entirely. \n\nEdit: I should say, I'm not trying to take a stubborn position and just seem narrow minded and short sighted. I don't want to kill myself, but when I think about my life and trying to change it so that I don't feel like dying it will bring tears to my eyes because it seems so difficult and impossible. I'm posting here because I'm desperate for any sort of input and can't talk to anyone in person.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24l0y5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "curiousquestions23", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399088514.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24l0y5/might_kill_myself_monday_why_shouldnt_i/", "name": "t3_24l0y5", "created": 1399102957.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24l0y5/might_kill_myself_monday_why_shouldnt_i/", "author_flair_text": null, "title": "Might kill myself Monday, why shouldn't I?", "created_utc": 1399074157.0, "ups": 10, "num_comments": 20, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9dc0f", "gilded": 0, "author": "larsinblack", "parent_id": "t1_ch9aqrv", "approved_by": null, "body": "I think it's to increase awareness of how you react at times so you know what you need to help you feel better. Also if you know what you're experiencing, if you get help from a professional like a psychologist or a therapy group, they will be better to tailor a program for your needs. \n\nTo me what depersonalization says is you've lived with stress for so long that your identity has been altered as a side-effect. And if you are so deattached from your identity that you are breaking bonds with reality, ie. packing boxes and giving away your belongings, than it's a red flag about the severity of how far your mental illness has progressed.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s to increase awareness of how you react at times so you know what you need to help you feel better. Also if you know what you&amp;#39;re experiencing, if you get help from a professional like a psychologist or a therapy group, they will be better to tailor a program for your needs. &lt;/p&gt;\n\n&lt;p&gt;To me what depersonalization says is you&amp;#39;ve lived with stress for so long that your identity has been altered as a side-effect. And if you are so deattached from your identity that you are breaking bonds with reality, ie. packing boxes and giving away your belongings, than it&amp;#39;s a red flag about the severity of how far your mental illness has progressed.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch9dc0f", "created": 1399254799.0, "author_flair_text": null, "created_utc": 1399225999.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch9aqrv", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8rtm7", "approved_by": null, "body": "Your description about depersonalization actually does sound like something I've maybe experienced, but perhaps to a lesser degree. There are times where I'll feel very strongly like hurting myself that seem a little like what you describe. Out of curiosity, what's the significance of it? Like, if I could say with certainty that there are certain times I experience, what's the practical implication? I mean, it's interesting to have a term to help describe those moments, but a term alone doesn't provide much to me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your description about depersonalization actually does sound like something I&amp;#39;ve maybe experienced, but perhaps to a lesser degree. There are times where I&amp;#39;ll feel very strongly like hurting myself that seem a little like what you describe. Out of curiosity, what&amp;#39;s the significance of it? Like, if I could say with certainty that there are certain times I experience, what&amp;#39;s the practical implication? I mean, it&amp;#39;s interesting to have a term to help describe those moments, but a term alone doesn&amp;#39;t provide much to me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch9aqrv", "created": 1399248473.0, "author_flair_text": null, "created_utc": 1399219673.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8rtm7", "gilded": 0, "author": "larsinblack", "parent_id": "t1_ch8gvrf", "approved_by": null, "body": "&gt; Those words, of hopelessness and of being overwhelmed, can apply I guess, for me I tend to quit trying to explain my feelings to myself when it becomes too complicated.\n\nYou know what, that makes sense. When I was at the hospital, the psychiatrist told me when I start feeling really bad, it's because the amygdala in the brain starts to receive too much blood, and then it's like a self-fulfilling prophecy, and it escalates from there. And she said that in moments like that, it is best to do something physical just to stop thinking and get out of the mind for a bit, so the blood goes down in that part of the brain. She suggested small activities like taking out the trash, taking a shower, organizing the room a little bit, or taking one of these loxapine pills too I guess. So you're right, it makes sense not to want to think any more when you're already knee-deep in thought. I feel that way too sometimes.\n\n&gt; What is it exactly that makes your mood a lot better, in your opinion?\n\nI feel like the medication removes the anxiety from the experience. So even though my life circumstances are the same, nothing has changed, being in that moment no longer makes me so anxious and stressful that I shut down. So the medication is like a permission slip to allow myself to relax and chill.\n\n&gt; Regarding depersonalization, I don't believe this is something I've experienced, except in maybe seldom and small ways, however I could be mistaken.\n\nI'm not sure if I have this either, but the description that sticks out is that -- after being inundated with stress for too long, and not being able to cope with it, you begin to separate from reality like nothing matters anymore. And I think when I have suicidal thought, I feel like that a lot, like I'm so tired of all the stress/pain that the reality isn't as real anymore. And that is why suicide might seem like a pipe-dream for some people, but for me it is very real and present, because reality no longer calls me .... sort of thing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Those words, of hopelessness and of being overwhelmed, can apply I guess, for me I tend to quit trying to explain my feelings to myself when it becomes too complicated.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You know what, that makes sense. When I was at the hospital, the psychiatrist told me when I start feeling really bad, it&amp;#39;s because the amygdala in the brain starts to receive too much blood, and then it&amp;#39;s like a self-fulfilling prophecy, and it escalates from there. And she said that in moments like that, it is best to do something physical just to stop thinking and get out of the mind for a bit, so the blood goes down in that part of the brain. She suggested small activities like taking out the trash, taking a shower, organizing the room a little bit, or taking one of these loxapine pills too I guess. So you&amp;#39;re right, it makes sense not to want to think any more when you&amp;#39;re already knee-deep in thought. I feel that way too sometimes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What is it exactly that makes your mood a lot better, in your opinion?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I feel like the medication removes the anxiety from the experience. So even though my life circumstances are the same, nothing has changed, being in that moment no longer makes me so anxious and stressful that I shut down. So the medication is like a permission slip to allow myself to relax and chill.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Regarding depersonalization, I don&amp;#39;t believe this is something I&amp;#39;ve experienced, except in maybe seldom and small ways, however I could be mistaken.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if I have this either, but the description that sticks out is that -- after being inundated with stress for too long, and not being able to cope with it, you begin to separate from reality like nothing matters anymore. And I think when I have suicidal thought, I feel like that a lot, like I&amp;#39;m so tired of all the stress/pain that the reality isn&amp;#39;t as real anymore. And that is why suicide might seem like a pipe-dream for some people, but for me it is very real and present, because reality no longer calls me .... sort of thing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8rtm7", "created": 1399155079.0, "author_flair_text": null, "created_utc": 1399151479.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8gvrf", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8f1y9", "approved_by": null, "body": "Those words, of hopelessness and of being overwhelmed, can apply I guess, for me I tend to quit trying to explain my feelings to myself when it becomes too complicated.\n\nYou have interesting advice about getting access to medications. I do have access to them already however, and have seen a psychiatrist for over a year, but most things I tried would make me feel sick, or they'd not have an effect at all. What is it exactly that makes your mood a lot better, in your opinion?\n\nRegarding depersonalization, I don't believe this is something I've experienced, except in maybe seldom and small ways, however I could be mistaken. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those words, of hopelessness and of being overwhelmed, can apply I guess, for me I tend to quit trying to explain my feelings to myself when it becomes too complicated.&lt;/p&gt;\n\n&lt;p&gt;You have interesting advice about getting access to medications. I do have access to them already however, and have seen a psychiatrist for over a year, but most things I tried would make me feel sick, or they&amp;#39;d not have an effect at all. What is it exactly that makes your mood a lot better, in your opinion?&lt;/p&gt;\n\n&lt;p&gt;Regarding depersonalization, I don&amp;#39;t believe this is something I&amp;#39;ve experienced, except in maybe seldom and small ways, however I could be mistaken. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8gvrf", "created": 1399148269.0, "author_flair_text": null, "created_utc": 1399119469.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8f1y9", "gilded": 0, "author": "larsinblack", "parent_id": "t3_24l0y5", "approved_by": null, "body": "From what I understand in your post, you say you are feeling hopeless? And when you think about changing your life for the better, you say you are feeling overwhelmed? I don't think I can help much, I just wanted to help you reach for the right words. I find that in my hard moments, it helps to be able to put a word to how I feel.\n\nI was feeling hopeless and overwhelmed just 7-10 days ago myself. And with that, I was also feeling anxious, but that anxiety was less noticeable. But I could feel the anxiety a little bit, at times, in my chest, making it harder for me to breath, making my head heavy and harder to hold up. \n\nI've been taking anti-depressants again after not taking them for a while, and my mood is a lot better, and I feel a lot more balanced. My doctor also gave me a pill to help me fall asleep, because the racing thoughts were making it impossible for me to fall asleep. I would lie in bed for 3-4 hours trying to fall asleep, and I would still be fully awake, thinking of suicide, financial troubles, etc. So I'm using a pill called Remeron before sleep now. And my doctor also gave me a pill called Loxapine that I can take in severe situations when I feel stressed or anxious, like when I have suicidal thought or am too strung up from depressive thinking, and it relaxes me in those tense moments. \n\nSo I hope that helps you in some way. The medication is working really well, covering all bases. But it took me years to get to this place. I was finding it hard to get a doctor to listen to me. But last week I was taken to ER by police because of my suicidal thought, and the psychiatrist at the hospital hooked me up, including access to free medication. So it's worth a shot, if you don't know what else to do, is to call 911... or go stand on a bridge, but let them talk you down. \n\nMaybe you feel a little like [depersonalization](http://en.wikipedia.org/wiki/Depersonalization) too?", "edited": 1399107221.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand in your post, you say you are feeling hopeless? And when you think about changing your life for the better, you say you are feeling overwhelmed? I don&amp;#39;t think I can help much, I just wanted to help you reach for the right words. I find that in my hard moments, it helps to be able to put a word to how I feel.&lt;/p&gt;\n\n&lt;p&gt;I was feeling hopeless and overwhelmed just 7-10 days ago myself. And with that, I was also feeling anxious, but that anxiety was less noticeable. But I could feel the anxiety a little bit, at times, in my chest, making it harder for me to breath, making my head heavy and harder to hold up. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been taking anti-depressants again after not taking them for a while, and my mood is a lot better, and I feel a lot more balanced. My doctor also gave me a pill to help me fall asleep, because the racing thoughts were making it impossible for me to fall asleep. I would lie in bed for 3-4 hours trying to fall asleep, and I would still be fully awake, thinking of suicide, financial troubles, etc. So I&amp;#39;m using a pill called Remeron before sleep now. And my doctor also gave me a pill called Loxapine that I can take in severe situations when I feel stressed or anxious, like when I have suicidal thought or am too strung up from depressive thinking, and it relaxes me in those tense moments. &lt;/p&gt;\n\n&lt;p&gt;So I hope that helps you in some way. The medication is working really well, covering all bases. But it took me years to get to this place. I was finding it hard to get a doctor to listen to me. But last week I was taken to ER by police because of my suicidal thought, and the psychiatrist at the hospital hooked me up, including access to free medication. So it&amp;#39;s worth a shot, if you don&amp;#39;t know what else to do, is to call 911... or go stand on a bridge, but let them talk you down. &lt;/p&gt;\n\n&lt;p&gt;Maybe you feel a little like &lt;a href=\"http://en.wikipedia.org/wiki/Depersonalization\"&gt;depersonalization&lt;/a&gt; too?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8f1y9", "created": 1399110142.0, "author_flair_text": null, "created_utc": 1399106542.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch8iwxr", "children": ["ch8ldyf"], "name": "t1_ch8ldyf", "id": "ch8ldyf"}}], "after": null, "before": null}}, "saved": false, "id": "ch8iwxr", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8i2dj", "approved_by": null, "body": "For me those concepts speak more towards me being a burden and a waste of resources. I'm not sure what personal definition I could give to those concepts either, but when I feel they are true I just want to die. I'll feel there's no hope of me not being lazy, and so I should remove myself and any embarrassment I may cause.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me those concepts speak more towards me being a burden and a waste of resources. I&amp;#39;m not sure what personal definition I could give to those concepts either, but when I feel they are true I just want to die. I&amp;#39;ll feel there&amp;#39;s no hope of me not being lazy, and so I should remove myself and any embarrassment I may cause.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8iwxr", "created": 1399156715.0, "author_flair_text": null, "created_utc": 1399127915.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8i2dj", "gilded": 0, "author": "circinia", "parent_id": "t1_ch8h7kf", "approved_by": null, "body": "Text is a difficult medium to communicate over sometimes, and that's especially true when talking about intensely personal topics like these. I do try to only to assert things that are what I see in what you've written to the best of my ability to understand it; it would, as you clearly realize, be worse than useless to tell you things I didn't believe were true.\n\nSometimes how we perceive ourselves and how the people around us perceive us are really different, which is sometimes helpful to know, but other times it can feel really invalidating of your own experience of yourself--I'm sorry that I misjudged here. Thank you for being honest about your reactions and for elaborating.\n\n&gt; In general I feel less deserving and less like an authentic human, what I mean is that it will seem like others experience things in the real and true way, while what I feel is more of a shadow/fake version. Other people can be sad or happy or hungry or sleepy, but I just exist.\n\n::nods:: This does sound more rooted in your experience of depression, yes.\n\n&gt; What if what you call depressive voices aren't just compelling but are correct? \n\nIt's true that the concepts of laziness, disappointingness, and hopelessness have no universal definition. What do they mean to you? And what does it seem to you you should do if they are true, and why?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Text is a difficult medium to communicate over sometimes, and that&amp;#39;s especially true when talking about intensely personal topics like these. I do try to only to assert things that are what I see in what you&amp;#39;ve written to the best of my ability to understand it; it would, as you clearly realize, be worse than useless to tell you things I didn&amp;#39;t believe were true.&lt;/p&gt;\n\n&lt;p&gt;Sometimes how we perceive ourselves and how the people around us perceive us are really different, which is sometimes helpful to know, but other times it can feel really invalidating of your own experience of yourself--I&amp;#39;m sorry that I misjudged here. Thank you for being honest about your reactions and for elaborating.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In general I feel less deserving and less like an authentic human, what I mean is that it will seem like others experience things in the real and true way, while what I feel is more of a shadow/fake version. Other people can be sad or happy or hungry or sleepy, but I just exist.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;::nods:: This does sound more rooted in your experience of depression, yes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if what you call depressive voices aren&amp;#39;t just compelling but are correct? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s true that the concepts of laziness, disappointingness, and hopelessness have no universal definition. What do they mean to you? And what does it seem to you you should do if they are true, and why?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8i2dj", "created": 1399153756.0, "author_flair_text": null, "created_utc": 1399124956.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8h7kf", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8dklz", "approved_by": null, "body": "I'm not sure how to feel about what you say. I feel like you are taking pity on me and it upsets me a little for some reason, it brings a false sense to what you say. I'm not saying you're being deceptive or anything, but the judgments you have made (like in your last paragraph) seem very off.\n\nWhen I spoke about not deserving the same as others it wasn't specifically because of experiences with anxiety in social situations, not that you're saying that that was the case, I'm just trying to elaborate on the point. In general I feel less deserving and less like an authentic human, what I mean is that it will seem like others experience things in the real and true way, while what I feel is more of a shadow/fake version. Other people can be sad or happy or hungry or sleepy, but I just exist.\n\nWhat if what you call depressive voices aren't just compelling but are correct? I know an immediate response might be, 'What if they aren't correct?' but I can't think along that line much, it feels too contrary to my view of life.\n\nAlso, about making personal changes, one thing I meant to add was that even changes that seem small can feel too big. Even just trying to get myself to exercise (even if it's just taking a short walk) feels wrong and brings up an array of issues. I'll try and do it because it's supposed to help elevate people's moods, but then I'll not want my mood to change because a part of me wants to kill myself and sees that as counterproductive. It's like a tug of war that's keeping me from doing anything truly harmful or helpful. \n\n ", "edited": 1399122901.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure how to feel about what you say. I feel like you are taking pity on me and it upsets me a little for some reason, it brings a false sense to what you say. I&amp;#39;m not saying you&amp;#39;re being deceptive or anything, but the judgments you have made (like in your last paragraph) seem very off.&lt;/p&gt;\n\n&lt;p&gt;When I spoke about not deserving the same as others it wasn&amp;#39;t specifically because of experiences with anxiety in social situations, not that you&amp;#39;re saying that that was the case, I&amp;#39;m just trying to elaborate on the point. In general I feel less deserving and less like an authentic human, what I mean is that it will seem like others experience things in the real and true way, while what I feel is more of a shadow/fake version. Other people can be sad or happy or hungry or sleepy, but I just exist.&lt;/p&gt;\n\n&lt;p&gt;What if what you call depressive voices aren&amp;#39;t just compelling but are correct? I know an immediate response might be, &amp;#39;What if they aren&amp;#39;t correct?&amp;#39; but I can&amp;#39;t think along that line much, it feels too contrary to my view of life.&lt;/p&gt;\n\n&lt;p&gt;Also, about making personal changes, one thing I meant to add was that even changes that seem small can feel too big. Even just trying to get myself to exercise (even if it&amp;#39;s just taking a short walk) feels wrong and brings up an array of issues. I&amp;#39;ll try and do it because it&amp;#39;s supposed to help elevate people&amp;#39;s moods, but then I&amp;#39;ll not want my mood to change because a part of me wants to kill myself and sees that as counterproductive. It&amp;#39;s like a tug of war that&amp;#39;s keeping me from doing anything truly harmful or helpful. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8h7kf", "created": 1399149982.0, "author_flair_text": null, "created_utc": 1399121182.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8dklz", "gilded": 0, "author": "circinia", "parent_id": "t1_ch884su", "approved_by": null, "body": "Surmounting one's own anxieties about being around other people can be challenging, especially when you're overcoming patterns of reaction you've been using your entire life... but it's not necessary to do so in order to deserve the same things as everyone else. \n\n&gt; Maybe this is me being ignorant of mental disease, but what makes depression separate from a personality or a set of personality traits?\n\nNo, this is actually a really good question! Obviously, both things shape how we experience and interact with the world. While I'm not in any position to answer authoritatively, the distinction I'm trying to make is that a lot of the ways you're experiencing the world right now are frequently correlated with depression (and maybe social anxiety?) and become less overwhelming when those conditions lift. That being said, no, who you *are* doesn't need to necessarily radically change, and you'll certainly still always be yourself in the most fundamental sense. \n\n&gt; What you're saying about struggling makes sense but it's hard to apply it to myself. I don't feel like I'm struggling, I just feel like I'm lazy and hopeless and disappointing.\n\nThat's the depressive voices in your mind being remarkably compelling... it's astonishing how believable they can make themselves. You are here and alive right now, in spite of all the parts of you that would have you be otherwise; as long as you are here, there is still hope, however hard it is to feel.\n\nI'm sorry your experiences of therapy and medication haven't been helpful! It's sometimes hard to find something that works for you--and yes, that can be particularly true in a rural area where there aren't many options for who to work with.\n\nI'm talking to you because you deserve to have someone to talk to about what you're going through! I've had a number of experiences with anxiety, depression, and suicidal ideation and I know how painful and overwhelming it can be to have all these thoughts and feelings in your head, and nobody should have to go through that alone. \n\nI'm also trying to help you find the answer to the question you asked in the title of your thread--each person's reasons for living and dying are their own, so I can't tell you why you should live, but hopefully by talking it through we can discover it together. It's very common for people who are thinking about suicide to be ambivalent about it, to have reasons for living *and* reasons for dying--you're insightful to realize this about yourself, and hopefully this will help you navigate both sides. \n\nIn general, you come across as thoughtful and well-spoken, and you strike me as someone who would be very capable of making connections with others (we're making a connection right now, even though you don't know me; so this says something about your ability to do this!) and making meaningful contributions once you overcome the feelings of hopelessness besieging you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surmounting one&amp;#39;s own anxieties about being around other people can be challenging, especially when you&amp;#39;re overcoming patterns of reaction you&amp;#39;ve been using your entire life... but it&amp;#39;s not necessary to do so in order to deserve the same things as everyone else. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Maybe this is me being ignorant of mental disease, but what makes depression separate from a personality or a set of personality traits?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, this is actually a really good question! Obviously, both things shape how we experience and interact with the world. While I&amp;#39;m not in any position to answer authoritatively, the distinction I&amp;#39;m trying to make is that a lot of the ways you&amp;#39;re experiencing the world right now are frequently correlated with depression (and maybe social anxiety?) and become less overwhelming when those conditions lift. That being said, no, who you &lt;em&gt;are&lt;/em&gt; doesn&amp;#39;t need to necessarily radically change, and you&amp;#39;ll certainly still always be yourself in the most fundamental sense. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What you&amp;#39;re saying about struggling makes sense but it&amp;#39;s hard to apply it to myself. I don&amp;#39;t feel like I&amp;#39;m struggling, I just feel like I&amp;#39;m lazy and hopeless and disappointing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s the depressive voices in your mind being remarkably compelling... it&amp;#39;s astonishing how believable they can make themselves. You are here and alive right now, in spite of all the parts of you that would have you be otherwise; as long as you are here, there is still hope, however hard it is to feel.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry your experiences of therapy and medication haven&amp;#39;t been helpful! It&amp;#39;s sometimes hard to find something that works for you--and yes, that can be particularly true in a rural area where there aren&amp;#39;t many options for who to work with.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m talking to you because you deserve to have someone to talk to about what you&amp;#39;re going through! I&amp;#39;ve had a number of experiences with anxiety, depression, and suicidal ideation and I know how painful and overwhelming it can be to have all these thoughts and feelings in your head, and nobody should have to go through that alone. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also trying to help you find the answer to the question you asked in the title of your thread--each person&amp;#39;s reasons for living and dying are their own, so I can&amp;#39;t tell you why you should live, but hopefully by talking it through we can discover it together. It&amp;#39;s very common for people who are thinking about suicide to be ambivalent about it, to have reasons for living &lt;em&gt;and&lt;/em&gt; reasons for dying--you&amp;#39;re insightful to realize this about yourself, and hopefully this will help you navigate both sides. &lt;/p&gt;\n\n&lt;p&gt;In general, you come across as thoughtful and well-spoken, and you strike me as someone who would be very capable of making connections with others (we&amp;#39;re making a connection right now, even though you don&amp;#39;t know me; so this says something about your ability to do this!) and making meaningful contributions once you overcome the feelings of hopelessness besieging you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8dklz", "created": 1399102047.0, "author_flair_text": null, "created_utc": 1399098447.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch884su", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch87c76", "approved_by": null, "body": "In regards to the barriers I experience, this is difficult for me to explain. I don't feel like as much of a person almost, I don't deserve the same things as others and this might include emotional closeness. There's a pervasive sense of something being wrong with me. Some of these barriers come from my own difficulty communicating with others, I can be very nervous around people outside of my close family and I feel like I just don't relate to others, and have felt this way most of my life. \n\nMaybe this is me being ignorant of mental disease, but what makes depression separate from a personality or a set of personality traits? Sometimes trying to imagine myself as having a different or altered personality makes me sick and makes me want to die as well.\n\nWhat you're saying about struggling makes sense but it's hard to apply it to myself. I don't feel like I'm struggling, I just feel like I'm lazy and hopeless and disappointing. \n\nWhat I've tried hasn't felt helpful. I live in a rural area however and my options seem limited. Also, why are you talking to me? ", "edited": 1399088839.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In regards to the barriers I experience, this is difficult for me to explain. I don&amp;#39;t feel like as much of a person almost, I don&amp;#39;t deserve the same things as others and this might include emotional closeness. There&amp;#39;s a pervasive sense of something being wrong with me. Some of these barriers come from my own difficulty communicating with others, I can be very nervous around people outside of my close family and I feel like I just don&amp;#39;t relate to others, and have felt this way most of my life. &lt;/p&gt;\n\n&lt;p&gt;Maybe this is me being ignorant of mental disease, but what makes depression separate from a personality or a set of personality traits? Sometimes trying to imagine myself as having a different or altered personality makes me sick and makes me want to die as well.&lt;/p&gt;\n\n&lt;p&gt;What you&amp;#39;re saying about struggling makes sense but it&amp;#39;s hard to apply it to myself. I don&amp;#39;t feel like I&amp;#39;m struggling, I just feel like I&amp;#39;m lazy and hopeless and disappointing. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;ve tried hasn&amp;#39;t felt helpful. I live in a rural area however and my options seem limited. Also, why are you talking to me? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch884su", "created": 1399110442.0, "author_flair_text": null, "created_utc": 1399081642.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch87c76", "gilded": 0, "author": "circinia", "parent_id": "t1_ch863sc", "approved_by": null, "body": "I know I'm asking difficult questions, and please feel free to answer as much or as little as is helpful for you!\n\n&gt; I'll feel awful because I can't make myself work, and because I feel like there's no sort of future in front of me.\n\n::nods:: This can turn into a cycle, too, where when you're feeling awful it's hard to get any work done, which leads you to feel bad about not being able to do work, and makes it hard for you to imagine a future you who *would* be capable of doing work. It's certainly one I've experienced.\n\n&gt; I'll feel bad due to how I respond to things, when an issue comes up and I can't handle it. I'll feel like I will always be alone, that there are barriers between myself and others that nothing can trespass.\n\nWhat are these barriers? If you'd like to share about these things, please know I would be honored to listen. (If not, that's okay as well.)\n\n&gt; I guess in order for me to feel life is livable I'd need a different personality.\n\nSometimes it becomes hard to distinguish between one's depression and one's personality, especially for someone who's been suffering from it for a long time. I don't know if that's been the case for you. \n\n&gt;  I'll feel bad about this, like it's wasted time, because none of those spent hours help make me what I'd imagine to be productive or of value.\n\nSometimes surviving those hours is value enough; sometimes when you're struggling that's as much as you can do with those hours. That you have more hours in which to live can be redemption enough in itself; were you to give up, in some sense that would be wasting all the future hours of your life (although I imagine it feels qualitatively different from this!).\n\n&gt; Also, I see a therapist, I've been seeing them for almost a year. I've tried a handful of different antidepressants, for over a year or so. I'm currently not taking any and of course I'm considering whether to continue psychotherapy.\n\nHave you found anything you've tried helpful? It sounds like it feels like it hasn't been helpful enough, if it's still hurting this much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I&amp;#39;m asking difficult questions, and please feel free to answer as much or as little as is helpful for you!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ll feel awful because I can&amp;#39;t make myself work, and because I feel like there&amp;#39;s no sort of future in front of me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;::nods:: This can turn into a cycle, too, where when you&amp;#39;re feeling awful it&amp;#39;s hard to get any work done, which leads you to feel bad about not being able to do work, and makes it hard for you to imagine a future you who &lt;em&gt;would&lt;/em&gt; be capable of doing work. It&amp;#39;s certainly one I&amp;#39;ve experienced.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ll feel bad due to how I respond to things, when an issue comes up and I can&amp;#39;t handle it. I&amp;#39;ll feel like I will always be alone, that there are barriers between myself and others that nothing can trespass.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What are these barriers? If you&amp;#39;d like to share about these things, please know I would be honored to listen. (If not, that&amp;#39;s okay as well.)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I guess in order for me to feel life is livable I&amp;#39;d need a different personality.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sometimes it becomes hard to distinguish between one&amp;#39;s depression and one&amp;#39;s personality, especially for someone who&amp;#39;s been suffering from it for a long time. I don&amp;#39;t know if that&amp;#39;s been the case for you. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ll feel bad about this, like it&amp;#39;s wasted time, because none of those spent hours help make me what I&amp;#39;d imagine to be productive or of value.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sometimes surviving those hours is value enough; sometimes when you&amp;#39;re struggling that&amp;#39;s as much as you can do with those hours. That you have more hours in which to live can be redemption enough in itself; were you to give up, in some sense that would be wasting all the future hours of your life (although I imagine it feels qualitatively different from this!).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also, I see a therapist, I&amp;#39;ve been seeing them for almost a year. I&amp;#39;ve tried a handful of different antidepressants, for over a year or so. I&amp;#39;m currently not taking any and of course I&amp;#39;m considering whether to continue psychotherapy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you found anything you&amp;#39;ve tried helpful? It sounds like it feels like it hasn&amp;#39;t been helpful enough, if it&amp;#39;s still hurting this much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch87c76", "created": 1399083092.0, "author_flair_text": null, "created_utc": 1399079492.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch863sc", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch85u72", "approved_by": null, "body": "These are difficult questions to answer, and a part of me doesn't want to bother, but I'll try. In response to the first, I think the things that will make me feel like a failure and like life is too hard are a mix of things. I'll feel awful because I can't make myself work, and because I feel like there's no sort of future in front of me. I'll feel bad due to how I respond to things, when an issue comes up and I can't handle it. I'll feel like I will always be alone, that there are barriers between myself and others that nothing can trespass. \n\nI guess in order for me to feel life is livable I'd need a different personality. \n\nThe things that bring me pleasure can be simple, looking at the clouds in the sky can make me feel calm and at ease. It doesn't fill up the day though, most hours are spent playing video games, reading (books or online stuff), or watching shows/movies. I'll feel bad about this, like it's wasted time, because none of those spent hours help make me what I'd imagine to be productive or of value. I'll feel like it's wasted time but not be sure of what I should/could have done anyway, but it'll feel pointless because all those wasted hours can't be redeemed and make me want to give up.\n\nAlso, I see a therapist, I've been seeing them for almost a year. I've tried a handful of different antidepressants, for over a year or so. I'm currently not taking any and of course I'm considering whether to continue psychotherapy. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These are difficult questions to answer, and a part of me doesn&amp;#39;t want to bother, but I&amp;#39;ll try. In response to the first, I think the things that will make me feel like a failure and like life is too hard are a mix of things. I&amp;#39;ll feel awful because I can&amp;#39;t make myself work, and because I feel like there&amp;#39;s no sort of future in front of me. I&amp;#39;ll feel bad due to how I respond to things, when an issue comes up and I can&amp;#39;t handle it. I&amp;#39;ll feel like I will always be alone, that there are barriers between myself and others that nothing can trespass. &lt;/p&gt;\n\n&lt;p&gt;I guess in order for me to feel life is livable I&amp;#39;d need a different personality. &lt;/p&gt;\n\n&lt;p&gt;The things that bring me pleasure can be simple, looking at the clouds in the sky can make me feel calm and at ease. It doesn&amp;#39;t fill up the day though, most hours are spent playing video games, reading (books or online stuff), or watching shows/movies. I&amp;#39;ll feel bad about this, like it&amp;#39;s wasted time, because none of those spent hours help make me what I&amp;#39;d imagine to be productive or of value. I&amp;#39;ll feel like it&amp;#39;s wasted time but not be sure of what I should/could have done anyway, but it&amp;#39;ll feel pointless because all those wasted hours can&amp;#39;t be redeemed and make me want to give up.&lt;/p&gt;\n\n&lt;p&gt;Also, I see a therapist, I&amp;#39;ve been seeing them for almost a year. I&amp;#39;ve tried a handful of different antidepressants, for over a year or so. I&amp;#39;m currently not taking any and of course I&amp;#39;m considering whether to continue psychotherapy. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch863sc", "created": 1399104927.0, "author_flair_text": null, "created_utc": 1399076127.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch85u72", "gilded": 0, "author": "circinia", "parent_id": "t1_ch85phn", "approved_by": null, "body": "What things in life are weighing on you when you feel like life is too hard and that you're a failure? What would need to change about your place in life for it to be livable? And what things bring you pleasure? \n\nYou're right to be cautious of making a decision that can't be reversed and that impacts the people around you--especially because there's a significant part of you that's unsure of this decision. At the same time, it's understandable that it doesn't fully counteract the intensity of your feelings.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What things in life are weighing on you when you feel like life is too hard and that you&amp;#39;re a failure? What would need to change about your place in life for it to be livable? And what things bring you pleasure? &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right to be cautious of making a decision that can&amp;#39;t be reversed and that impacts the people around you--especially because there&amp;#39;s a significant part of you that&amp;#39;s unsure of this decision. At the same time, it&amp;#39;s understandable that it doesn&amp;#39;t fully counteract the intensity of your feelings.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch85u72", "created": 1399104204.0, "author_flair_text": null, "created_utc": 1399075404.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch85phn", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch85g6h", "approved_by": null, "body": "The things that make me want to stop living have to do with my self and how I feel about my place in life in general. I feel like a failure and like life is too hard, and I just can't be dissuaded from that feeling.\n\nThe things that make me keep living are material pleasures I suppose, and fear of making a large and permanent decision. Also, more prominent to this, is the knowledge that some people, i.e. my family, might be hurt by my death. It'll depend on my frame of mind.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The things that make me want to stop living have to do with my self and how I feel about my place in life in general. I feel like a failure and like life is too hard, and I just can&amp;#39;t be dissuaded from that feeling.&lt;/p&gt;\n\n&lt;p&gt;The things that make me keep living are material pleasures I suppose, and fear of making a large and permanent decision. Also, more prominent to this, is the knowledge that some people, i.e. my family, might be hurt by my death. It&amp;#39;ll depend on my frame of mind.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch85phn", "created": 1399103855.0, "author_flair_text": null, "created_utc": 1399075055.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch85g6h", "gilded": 0, "author": "circinia", "parent_id": "t3_24l0y5", "approved_by": null, "body": "What thoughts and feelings are you experiencing that make the idea of suicide look appealing? And what thoughts and feelings do you have that support the idea of continuing to live?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What thoughts and feelings are you experiencing that make the idea of suicide look appealing? And what thoughts and feelings do you have that support the idea of continuing to live?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch85g6h", "created": 1399103189.0, "author_flair_text": null, "created_utc": 1399074389.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch86dr1", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8673w", "approved_by": null, "body": "I could go deep in the woods to do it, there are miles of forest right in my backyard. What makes the events of the hypothetical tomorrow matter? Also, I don't really buy into that saying, I may not know with full certainty what the future will bring, but I have a strong foundation of past experiences to form projections with. It's similar with my view on death, there are elements I might not be able to be certain of but I have a very good idea of what will happen and it is appealing.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could go deep in the woods to do it, there are miles of forest right in my backyard. What makes the events of the hypothetical tomorrow matter? Also, I don&amp;#39;t really buy into that saying, I may not know with full certainty what the future will bring, but I have a strong foundation of past experiences to form projections with. It&amp;#39;s similar with my view on death, there are elements I might not be able to be certain of but I have a very good idea of what will happen and it is appealing.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch86dr1", "created": 1399105682.0, "author_flair_text": null, "created_utc": 1399076882.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch8673w", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24l0y5", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8673w", "created": 1399105177.0, "author_flair_text": null, "created_utc": 1399076377.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8gpwd", "gilded": 0, "author": "curiousquestions23", "parent_id": "t1_ch8ek8q", "approved_by": null, "body": "I can't think of changes that would make me feel different, beyond killing myself. Maybe I'm not trying hard enough or maybe there isn't anything that can be changed in my situation. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t think of changes that would make me feel different, beyond killing myself. Maybe I&amp;#39;m not trying hard enough or maybe there isn&amp;#39;t anything that can be changed in my situation. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8gpwd", "created": 1399147374.0, "author_flair_text": null, "created_utc": 1399118574.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8ek8q", "gilded": 0, "author": "Su_Co", "parent_id": "t3_24l0y5", "approved_by": null, "body": "What is one(or more) change you think if changed would make you feel different?\n\nWhat does this say about the cause of your distress?\n\nAnd do you really believe you can'y change it? Or do you just want to because it's easier?\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is one(or more) change you think if changed would make you feel different?&lt;/p&gt;\n\n&lt;p&gt;What does this say about the cause of your distress?&lt;/p&gt;\n\n&lt;p&gt;And do you really believe you can&amp;#39;y change it? Or do you just want to because it&amp;#39;s easier?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24l0y5", "score_hidden": false, "name": "t1_ch8ek8q", "created": 1399132200.0, "author_flair_text": null, "created_utc": 1399103400.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]