[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 19 years old mtf transgender pre everything. I recently came out to my parents as transgender and they think I am just confused and want me to take medicine and the feelings of me being transgender will go away as if it is some sort of phase. They refused to accept me because it isnt part of &amp;quot;gods&amp;quot; plan. I was tired of being taken as a joke and continue to &amp;quot;rot&amp;quot; in this body i didnt want so I attempted suicide by hanging on wednesday and survived but I plan on finishing myself off with a shotgun.  It wasnt how I planned it to be but I guess we cant all have happy endings  can we?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am 19 years old mtf transgender pre everything. I recently came out to my parents as transgender and they think I am just confused and want me to take medicine and the feelings of me being transgender will go away as if it is some sort of phase. They refused to accept me because it isnt part of \"gods\" plan. I was tired of being taken as a joke and continue to \"rot\" in this body i didnt want so I attempted suicide by hanging on wednesday and survived but I plan on finishing myself off with a shotgun.  It wasnt how I planned it to be but I guess we cant all have happy endings  can we?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24jypc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cooltoast300", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24jypc/misunderstood_being_transgender/", "name": "t3_24jypc", "created": 1399078642.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24jypc/misunderstood_being_transgender/", "author_flair_text": null, "title": "Misunderstood being transgender", "created_utc": 1399049842.0, "ups": 10, "num_comments": 10, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch828qn", "gilded": 0, "author": "PinkiePai", "parent_id": "t3_24jypc", "approved_by": null, "body": "Hello. I'm a trans lady named Jess. I don't look much like a lady yet, but someday I will. \n\nI'm 21 years old, and I've been on HRT for a little over 2 months. When I started HRT I wasn't even out to my parents yet. I didn't have the guts. You seem stronger than I, because of this. \n\nI started seeing a therapist and got him to write me a letter recommending HRT to an Endocrinologist in a nearby city. I got a lift from a friend to get to my appointment, I can't afford transportation. \n\nSince you're young, your parents' insurance should still cover you, whether they want it to or not. Use it. \n\nWhere I'm going with this is that you can start taking serious steps towards transitioning with or without their knowledge or consent. I only came out to my parents after nearly a month on the little blue pills. \n\nAre you willing to start planning to build your new life, and take steps towards it every day to become the woman you feel you are inside? I will help you with this as best as I am capable of, any questions you may have, anything you want to know. Even if you just need a friend. \n\n***\"Time is a sort of river of passing events, and strong is its current; no sooner is a thing brought to sight than it is swept by and another takes its place, and this too will be swept away.\"***\n\nWhat is your name, dear?\n\n**Edit:** Let me know you're still out there so I can stop wondering if I was too late. \n\n**Double edit:** Seems your user has been deleted. ", "edited": 1399070643.0, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello. I&amp;#39;m a trans lady named Jess. I don&amp;#39;t look much like a lady yet, but someday I will. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 21 years old, and I&amp;#39;ve been on HRT for a little over 2 months. When I started HRT I wasn&amp;#39;t even out to my parents yet. I didn&amp;#39;t have the guts. You seem stronger than I, because of this. &lt;/p&gt;\n\n&lt;p&gt;I started seeing a therapist and got him to write me a letter recommending HRT to an Endocrinologist in a nearby city. I got a lift from a friend to get to my appointment, I can&amp;#39;t afford transportation. &lt;/p&gt;\n\n&lt;p&gt;Since you&amp;#39;re young, your parents&amp;#39; insurance should still cover you, whether they want it to or not. Use it. &lt;/p&gt;\n\n&lt;p&gt;Where I&amp;#39;m going with this is that you can start taking serious steps towards transitioning with or without their knowledge or consent. I only came out to my parents after nearly a month on the little blue pills. &lt;/p&gt;\n\n&lt;p&gt;Are you willing to start planning to build your new life, and take steps towards it every day to become the woman you feel you are inside? I will help you with this as best as I am capable of, any questions you may have, anything you want to know. Even if you just need a friend. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;quot;Time is a sort of river of passing events, and strong is its current; no sooner is a thing brought to sight than it is swept by and another takes its place, and this too will be swept away.&amp;quot;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;What is your name, dear?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; Let me know you&amp;#39;re still out there so I can stop wondering if I was too late. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Double edit:&lt;/strong&gt; Seems your user has been deleted. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch828qn", "created": 1399095167.0, "author_flair_text": null, "created_utc": 1399066367.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7z54i", "gilded": 0, "author": "JustJaneAlice", "parent_id": "t3_24jypc", "approved_by": null, "body": "Are you transitioning? If not why not try that first? If you are 19 then you don't have to do what your parents say and it would be a better option then suicide.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you transitioning? If not why not try that first? If you are 19 then you don&amp;#39;t have to do what your parents say and it would be a better option then suicide.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch7z54i", "created": 1399088310.0, "author_flair_text": null, "created_utc": 1399059510.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch80usy", "gilded": 0, "author": "AmalgamatedMan", "parent_id": "t3_24jypc", "approved_by": null, "body": "You're old enough that your parents have no legal control of you. You can go to your doctor and discuss the matter with him and even start HRT if you're ready for that.\n\nWhat are your plans for the future, in regards to your living situation? By the sound of things, you should probably get away from them as soon as you can. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re old enough that your parents have no legal control of you. You can go to your doctor and discuss the matter with him and even start HRT if you&amp;#39;re ready for that.&lt;/p&gt;\n\n&lt;p&gt;What are your plans for the future, in regards to your living situation? By the sound of things, you should probably get away from them as soon as you can. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch80usy", "created": 1399092028.0, "author_flair_text": null, "created_utc": 1399063228.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch82f6n", "gilded": 0, "author": "dinosaur_train", "parent_id": "t3_24jypc", "approved_by": null, "body": "a good friend of mine was like you except further down the line. she didn't come out until she was 30 and by then she was the father of two children. the mother was very religious, all from the south, bible belt, and all of that. at first, things didn't go well. the mother was uneducated on the issue and her idea of helping was by trying to convince my friend she was a man... let me say, these actions had good intent, but they were disastrous. \n\ni think your parents might be the same, they have good intent as in they naively think their way will make you happy. that's just not so but they just learned about this, they have a long way to go.\n\nfast forward with my friend. it takes about 3 years of education all around for people to truly learn what being transgendered means. but, long story short, where my friend was once suicidal, now she's living authentically, has a relationship with her kids, and all is pretty damn happy. therapy and HRT combined seemed to also make a big difference. \n\nyou would have never thought these god-nuts where were saying the most crazy shit at the beginning would turn around, but they did. change, from parents and people takes years. if you can't handle that time, that's perfectly fine. find people who will support and love you on your journey. they are out there. \n\nthere is hope! Please hold on, you never know if where you'll find it or how you might offer it to others. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a good friend of mine was like you except further down the line. she didn&amp;#39;t come out until she was 30 and by then she was the father of two children. the mother was very religious, all from the south, bible belt, and all of that. at first, things didn&amp;#39;t go well. the mother was uneducated on the issue and her idea of helping was by trying to convince my friend she was a man... let me say, these actions had good intent, but they were disastrous. &lt;/p&gt;\n\n&lt;p&gt;i think your parents might be the same, they have good intent as in they naively think their way will make you happy. that&amp;#39;s just not so but they just learned about this, they have a long way to go.&lt;/p&gt;\n\n&lt;p&gt;fast forward with my friend. it takes about 3 years of education all around for people to truly learn what being transgendered means. but, long story short, where my friend was once suicidal, now she&amp;#39;s living authentically, has a relationship with her kids, and all is pretty damn happy. therapy and HRT combined seemed to also make a big difference. &lt;/p&gt;\n\n&lt;p&gt;you would have never thought these god-nuts where were saying the most crazy shit at the beginning would turn around, but they did. change, from parents and people takes years. if you can&amp;#39;t handle that time, that&amp;#39;s perfectly fine. find people who will support and love you on your journey. they are out there. &lt;/p&gt;\n\n&lt;p&gt;there is hope! Please hold on, you never know if where you&amp;#39;ll find it or how you might offer it to others. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch82f6n", "created": 1399095583.0, "author_flair_text": null, "created_utc": 1399066783.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch83r4x", "gilded": 0, "author": "Blenderhead36", "parent_id": "t3_24jypc", "approved_by": null, "body": "I'm sad that your parents didn't immediately come around.  That's rough, it really is.\n\nBut you know what?  You're not doing it for them.  You're making a major life change because it's what will make you feel comfortable in your own skin.  That's no one's business but yours.  Your parents' approval would be nice, but it's not something you need.\n\nImagine what it would be like for everyone to see the person you know you are inside.  To live like someone who doesn't feel like they're \"rotting\" inside their own body.  That's what you want, right?\n\nA shotgun won't get you there.\n\nI don't see anything in your post about starting Hormone Replacement Therapy yet.  Contact your doctor; if you don't have one, hit up Google and you should be able to find one and make an appointment with him/her within an hour.  That's something that you can do *today* to start getting where you want to be.  Talk to your doctor about wanting to get started on Hormone Replacement Therapy.  Don't worry, he/she is a nonjudgmental professional who will help you.\n\nDoing this without your parents' approval will make it harder, but you might be surprised about how easy progress actually is.  In the end, it's likely that your parents are afraid that they're going to lose their son.  Not today, if you can help it, but show them that they're not going to lose a son or even gain a daughter--they're going to keep the same child that they raised, just with slightly different packaging.  Your memories, morals, and love for each other are all going to stay the same, that's what important.\n\nAlso, /u/PinkiePai seems like exactly the sort of person who can help you through this time.  It's not the easiest thing you've ever done, but there are people who want to help make it easier for you.  And it *will* be worth the struggle.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sad that your parents didn&amp;#39;t immediately come around.  That&amp;#39;s rough, it really is.&lt;/p&gt;\n\n&lt;p&gt;But you know what?  You&amp;#39;re not doing it for them.  You&amp;#39;re making a major life change because it&amp;#39;s what will make you feel comfortable in your own skin.  That&amp;#39;s no one&amp;#39;s business but yours.  Your parents&amp;#39; approval would be nice, but it&amp;#39;s not something you need.&lt;/p&gt;\n\n&lt;p&gt;Imagine what it would be like for everyone to see the person you know you are inside.  To live like someone who doesn&amp;#39;t feel like they&amp;#39;re &amp;quot;rotting&amp;quot; inside their own body.  That&amp;#39;s what you want, right?&lt;/p&gt;\n\n&lt;p&gt;A shotgun won&amp;#39;t get you there.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see anything in your post about starting Hormone Replacement Therapy yet.  Contact your doctor; if you don&amp;#39;t have one, hit up Google and you should be able to find one and make an appointment with him/her within an hour.  That&amp;#39;s something that you can do &lt;em&gt;today&lt;/em&gt; to start getting where you want to be.  Talk to your doctor about wanting to get started on Hormone Replacement Therapy.  Don&amp;#39;t worry, he/she is a nonjudgmental professional who will help you.&lt;/p&gt;\n\n&lt;p&gt;Doing this without your parents&amp;#39; approval will make it harder, but you might be surprised about how easy progress actually is.  In the end, it&amp;#39;s likely that your parents are afraid that they&amp;#39;re going to lose their son.  Not today, if you can help it, but show them that they&amp;#39;re not going to lose a son or even gain a daughter--they&amp;#39;re going to keep the same child that they raised, just with slightly different packaging.  Your memories, morals, and love for each other are all going to stay the same, that&amp;#39;s what important.&lt;/p&gt;\n\n&lt;p&gt;Also, &lt;a href=\"/u/PinkiePai\"&gt;/u/PinkiePai&lt;/a&gt; seems like exactly the sort of person who can help you through this time.  It&amp;#39;s not the easiest thing you&amp;#39;ve ever done, but there are people who want to help make it easier for you.  And it &lt;em&gt;will&lt;/em&gt; be worth the struggle.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch83r4x", "created": 1399098827.0, "author_flair_text": null, "created_utc": 1399070027.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7zzhu", "gilded": 0, "author": "imagine_if_you_can", "parent_id": "t3_24jypc", "approved_by": null, "body": "I am a Christian and as far as I'm concerned, everything is pretty much God's plan.  You are perfect just as you are.  Please try and educate them. Maybe show them some facts about being transgender and what it is like for YOU.  Christian's especially should be emphatic towards one another in my opinion. I'm sorry you have to go through that. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a Christian and as far as I&amp;#39;m concerned, everything is pretty much God&amp;#39;s plan.  You are perfect just as you are.  Please try and educate them. Maybe show them some facts about being transgender and what it is like for YOU.  Christian&amp;#39;s especially should be emphatic towards one another in my opinion. I&amp;#39;m sorry you have to go through that. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch7zzhu", "created": 1399090133.0, "author_flair_text": null, "created_utc": 1399061333.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7zl27", "gilded": 0, "author": "imagine_if_you_can", "parent_id": "t1_ch7z7e1", "approved_by": null, "body": "This is exactly what I was thinking.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly what I was thinking.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch7zl27", "created": 1399064058.0, "author_flair_text": null, "created_utc": 1399060458.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7z7e1", "gilded": 0, "author": "Prothyne", "parent_id": "t3_24jypc", "approved_by": null, "body": "Why don't you educate them on the matter? Show them some data that employs that this is a perfectly normal occurrence and it isn't anything to be ashamed off. You can't change who you are, so you best express it, in time you can hope that your parents are understanding. Of course they might not know how to act at first, especially with religion having an influence on their perception. ", "edited": 1399060671.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why don&amp;#39;t you educate them on the matter? Show them some data that employs that this is a perfectly normal occurrence and it isn&amp;#39;t anything to be ashamed off. You can&amp;#39;t change who you are, so you best express it, in time you can hope that your parents are understanding. Of course they might not know how to act at first, especially with religion having an influence on their perception. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch7z7e1", "created": 1399088451.0, "author_flair_text": null, "created_utc": 1399059651.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch88upg", "gilded": 0, "author": "dinosaur_train", "parent_id": "t3_24jypc", "approved_by": null, "body": "OP, I think you are shadowbanned. When your username is hit, it's a 404 and we can't see any thread replies, if you've made any. Perhaps, jump on a throwaway here or message the powers that be about your ban.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I think you are shadowbanned. When your username is hit, it&amp;#39;s a 404 and we can&amp;#39;t see any thread replies, if you&amp;#39;ve made any. Perhaps, jump on a throwaway here or message the powers that be about your ban.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24jypc", "score_hidden": false, "name": "t1_ch88upg", "created": 1399112416.0, "author_flair_text": null, "created_utc": 1399083616.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]