[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been struggling recently, I&amp;#39;ve been lower than I&amp;#39;ve ever been and it isn&amp;#39;t over. But I&amp;#39;ve decided from today that I&amp;#39;m going to change. I know I can&amp;#39;t control my emotions, but that doesn&amp;#39;t mean I have to let them control me. Life is what you make of it. Your problems may seem like they are bigger than you are, but you aren&amp;#39;t always right. They may be bigger or they may be smaller. &lt;/p&gt;\n\n&lt;p&gt;You guys helped me a lot. Even by just listening and giving an upvote to show that you read this, to show that I wasn&amp;#39;t calling out into nothing. I&amp;#39;m going on Friday to see a doctor. I&amp;#39;ve bitten the bullet, and I&amp;#39;m getting professional help. That, and I&amp;#39;ve decided to stop wallowing in self pity.&lt;/p&gt;\n\n&lt;p&gt;There is no doubt it won&amp;#39;t be as easy as I&amp;#39;m making it out to be, but I have to try. So I&amp;#39;m certain I will be back here, but at least I would be making progress.&lt;/p&gt;\n\n&lt;p&gt;Thank you for all your help, and for just showing me there are people going through the same kind of junk I am, and that they have recovered. &lt;/p&gt;\n\n&lt;p&gt;If anyone wants to know, there are two things I remember being told, that made me decide this, someone here told me something along the lines of this: Life has its seasons, you may be experiencing Winter now, but eventually the snow will melt and you&amp;#39;ll see a long awaited Spring. It can&amp;#39;t snow all the time. &lt;/p&gt;\n\n&lt;p&gt;The other thing was something that I actually told someone else a long time ago when I was &amp;#39;helping&amp;#39; him, I told him in a harsh manner that he was a slave to his emotions, I told him to look where it has gotten him, then I told him not to let his emotions control him, so today, years later, he told me the same thing and he told me how seriously he took that and how much it&amp;#39;s worked. &lt;/p&gt;\n\n&lt;p&gt;Wish me luck, guys! (sorry if the formatting is kinda&amp;#39; all over the place)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; ,&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been struggling recently, I've been lower than I've ever been and it isn't over. But I've decided from today that I'm going to change. I know I can't control my emotions, but that doesn't mean I have to let them control me. Life is what you make of it. Your problems may seem like they are bigger than you are, but you aren't always right. They may be bigger or they may be smaller. \n\nYou guys helped me a lot. Even by just listening and giving an upvote to show that you read this, to show that I wasn't calling out into nothing. I'm going on Friday to see a doctor. I've bitten the bullet, and I'm getting professional help. That, and I've decided to stop wallowing in self pity.\n\nThere is no doubt it won't be as easy as I'm making it out to be, but I have to try. So I'm certain I will be back here, but at least I would be making progress.\n\nThank you for all your help, and for just showing me there are people going through the same kind of junk I am, and that they have recovered. \n\nIf anyone wants to know, there are two things I remember being told, that made me decide this, someone here told me something along the lines of this: Life has its seasons, you may be experiencing Winter now, but eventually the snow will melt and you'll see a long awaited Spring. It can't snow all the time. \n\nThe other thing was something that I actually told someone else a long time ago when I was 'helping' him, I told him in a harsh manner that he was a slave to his emotions, I told him to look where it has gotten him, then I told him not to let his emotions control him, so today, years later, he told me the same thing and he told me how seriously he took that and how much it's worked. \n\nWish me luck, guys! (sorry if the formatting is kinda' all over the place)\n\n**Edit:** ,", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24vcfg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NomOnBacon", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399390842.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24vcfg/moving_on/", "name": "t3_24vcfg", "created": 1399419295.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24vcfg/moving_on/", "author_flair_text": null, "title": "Moving on", "created_utc": 1399390495.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chb238y", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24vcfg", "approved_by": null, "body": "Glad you are getting help! It is hard to get help at first but once you realize that you can get yourself out life seems so much better!\nCheers!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you are getting help! It is hard to get help at first but once you realize that you can get yourself out life seems so much better!\nCheers!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24vcfg", "score_hidden": false, "name": "t1_chb238y", "created": 1399399311.0, "author_flair_text": null, "created_utc": 1399395711.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]