[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little backstory, first. I&amp;#39;m 14. I just got out of a mental hospital for depression, anxiety, alcohol abuse, and suicidal thoughts. I&amp;#39;m on new medicine and I was feeling much better, until this afternoon.&lt;/p&gt;\n\n&lt;p&gt;Please stay with me. This has a point. I got home from school and was making myself some food. I had actually had a fairly good week, for once. Testing is over, and my grades are rocketing up. My brother asks to use my laptop. I say he may. I ask what he wants it for and he says he needs to print something. Now, our printer has not worked in a long time. It does not work, and he knows this. He asks if he can still try, and I say no, because it is pointless and the printer is not physically capable of printing. He keeps insisting on using it and tells me I&amp;#39;m being selfish, even though I&amp;#39;m saying he can use it, as long as he doesn&amp;#39;t print. He is mildly irritated and begins to pout. I offer to make him food, he refuses. I offer to try and find another way to entertain him, he refuses. I was trying really hard to be nice, because I had had a great day.&lt;/p&gt;\n\n&lt;p&gt;10 minutes or so pass and he&amp;#39;s mostly over it. He&amp;#39;s still begging, but not mad. He&amp;#39;s finishing homework and accidentally cut himself on something. He asked me to help him get something to help. I say that I really can&amp;#39;t because the medicine cabinet is locked.\nHe looks at me and says the most hurtful words I&amp;#39;ve ever fucking heard, &lt;em&gt;&amp;quot;God. I can&amp;#39;t even go into the cabinet to get a Band-Aid and it&amp;#39;s all because of you.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I just stood there in shock. He is 11, but he knows what I&amp;#39;m going through. He was talked to about how serious my condition was and to be careful of what is said. He knows that my parents now keep the medicine cabinet locked because I may kill myself. He knows I was in a hospital. He knows it all and still said that to me. In those few seconds, I went from having a great few days, to terrible. My own brother said this to me.&lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t give a shit that I want to die so long as he gets a Band-Aid. On top of all this, it is the weekend of my motherfucking BIRTHDAY. Not only did he want to hurt me so much over a cabinet lock, he decided the weekend of my birthday, a month after I was released from a hospital, would be a good time.&lt;/p&gt;\n\n&lt;p&gt;He hasn&amp;#39;t even apologized once, either. I just stared at him with an open-mouthed stare of disbelief, anger, sadness, and betrayal. He doesn&amp;#39;t care at all. He&amp;#39;s always been very self-centered, but this was just kicking me in the groin. I feel like utter shit. I&amp;#39;m not allowed to take an Aspirin by myself because I may chug the whole bottle and he sees this as fair game. It&amp;#39;s now 5 in the morning, the day before my birthday, and I don&amp;#39;t feel any happiness at all.&lt;/p&gt;\n\n&lt;p&gt;Happy fucking birthday to me, I guess.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A little backstory, first. I'm 14. I just got out of a mental hospital for depression, anxiety, alcohol abuse, and suicidal thoughts. I'm on new medicine and I was feeling much better, until this afternoon.\n\n\nPlease stay with me. This has a point. I got home from school and was making myself some food. I had actually had a fairly good week, for once. Testing is over, and my grades are rocketing up. My brother asks to use my laptop. I say he may. I ask what he wants it for and he says he needs to print something. Now, our printer has not worked in a long time. It does not work, and he knows this. He asks if he can still try, and I say no, because it is pointless and the printer is not physically capable of printing. He keeps insisting on using it and tells me I'm being selfish, even though I'm saying he can use it, as long as he doesn't print. He is mildly irritated and begins to pout. I offer to make him food, he refuses. I offer to try and find another way to entertain him, he refuses. I was trying really hard to be nice, because I had had a great day.\n\n\n10 minutes or so pass and he's mostly over it. He's still begging, but not mad. He's finishing homework and accidentally cut himself on something. He asked me to help him get something to help. I say that I really can't because the medicine cabinet is locked.\nHe looks at me and says the most hurtful words I've ever fucking heard, *\"God. I can't even go into the cabinet to get a Band-Aid and it's all because of you.\"*\n\n\nI just stood there in shock. He is 11, but he knows what I'm going through. He was talked to about how serious my condition was and to be careful of what is said. He knows that my parents now keep the medicine cabinet locked because I may kill myself. He knows I was in a hospital. He knows it all and still said that to me. In those few seconds, I went from having a great few days, to terrible. My own brother said this to me.\n\n\nHe doesn't give a shit that I want to die so long as he gets a Band-Aid. On top of all this, it is the weekend of my motherfucking BIRTHDAY. Not only did he want to hurt me so much over a cabinet lock, he decided the weekend of my birthday, a month after I was released from a hospital, would be a good time.\n\n\nHe hasn't even apologized once, either. I just stared at him with an open-mouthed stare of disbelief, anger, sadness, and betrayal. He doesn't care at all. He's always been very self-centered, but this was just kicking me in the groin. I feel like utter shit. I'm not allowed to take an Aspirin by myself because I may chug the whole bottle and he sees this as fair game. It's now 5 in the morning, the day before my birthday, and I don't feel any happiness at all.\n\n\nHappy fucking birthday to me, I guess.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25763d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SilverMars", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 6, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25763d/my_brother_dropped_a_bombshell_on_me_today/", "name": "t3_25763d", "created": 1399745637.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25763d/my_brother_dropped_a_bombshell_on_me_today/", "author_flair_text": null, "title": "My brother dropped a bombshell on me today...", "created_utc": 1399716837.0, "ups": 11, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chedhi3", "gilded": 0, "author": "roast_spud", "parent_id": "t3_25763d", "approved_by": null, "body": "Oh, mate.\n\nYour brother is a kid. He said a really mean thing to you, and it sounds like it was at the end of a frustrating afternoon for him.\n\nPlease, please don't let his insensitive comment affect the amazing progress you have made. It's likely not going to be the last time someone says something that smacks you straight across the face - whether it's deliberately hurtful or not.\n\nYou clearly have a pretty good sense of self-awareness, and are incredibly mature. Unlike your little bro.  I hope you know that his comment was more about him than it was about you. He's probably heard nothing but 'be nice to SilverMars, he's blah blah blah' from your folks. \n\nYou'll likely not forget the comment, but maybe with time you will remember this as a stepping stone in your progress. One day the cabinets won't need locks.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, mate.&lt;/p&gt;\n\n&lt;p&gt;Your brother is a kid. He said a really mean thing to you, and it sounds like it was at the end of a frustrating afternoon for him.&lt;/p&gt;\n\n&lt;p&gt;Please, please don&amp;#39;t let his insensitive comment affect the amazing progress you have made. It&amp;#39;s likely not going to be the last time someone says something that smacks you straight across the face - whether it&amp;#39;s deliberately hurtful or not.&lt;/p&gt;\n\n&lt;p&gt;You clearly have a pretty good sense of self-awareness, and are incredibly mature. Unlike your little bro.  I hope you know that his comment was more about him than it was about you. He&amp;#39;s probably heard nothing but &amp;#39;be nice to SilverMars, he&amp;#39;s blah blah blah&amp;#39; from your folks. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll likely not forget the comment, but maybe with time you will remember this as a stepping stone in your progress. One day the cabinets won&amp;#39;t need locks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25763d", "score_hidden": false, "name": "t1_chedhi3", "created": 1399751024.0, "author_flair_text": null, "created_utc": 1399722224.0, "distinguished": null, "num_reports": null, "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chedsi5", "gilded": 0, "author": "dinosaur_train", "parent_id": "t3_25763d", "approved_by": null, "body": "Op, think about the physical brain of a 1 year old baby. You can imagine that the brain the infant's head is growing, changing, and developing. An infant doesn't have mature reasoning, empathy, or many other things, because the brain has not yet matured. \n\nThere isn't too much difference between that one year old and an 11 year old. Sure, they can walk, talk, reason a bit, ride a bike, but his brain is a child's brain and not yet developed in maturity. \n\nWhatever is popping off in that gray sack of his should have NO bearing on your happiness. Yes, words hurt, especially from those you love, but you are just going to have to see him for what he is, a child, a baby brain in comparison. \n\nTake care of yourself, op. You will be undergoing a lot of neurological development for the next ten years, too. During this time, you'll do a lot of things that hurt other people too. That's actually normal. Kids hurt people, teenagers hurt people, it's like we are these awful things until early 20s, most people are anyway. So, just try to roll with the punches a bit. \n\nCongrats on all the progress! You sound smart and adaptable. Happy Birthday.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op, think about the physical brain of a 1 year old baby. You can imagine that the brain the infant&amp;#39;s head is growing, changing, and developing. An infant doesn&amp;#39;t have mature reasoning, empathy, or many other things, because the brain has not yet matured. &lt;/p&gt;\n\n&lt;p&gt;There isn&amp;#39;t too much difference between that one year old and an 11 year old. Sure, they can walk, talk, reason a bit, ride a bike, but his brain is a child&amp;#39;s brain and not yet developed in maturity. &lt;/p&gt;\n\n&lt;p&gt;Whatever is popping off in that gray sack of his should have NO bearing on your happiness. Yes, words hurt, especially from those you love, but you are just going to have to see him for what he is, a child, a baby brain in comparison. &lt;/p&gt;\n\n&lt;p&gt;Take care of yourself, op. You will be undergoing a lot of neurological development for the next ten years, too. During this time, you&amp;#39;ll do a lot of things that hurt other people too. That&amp;#39;s actually normal. Kids hurt people, teenagers hurt people, it&amp;#39;s like we are these awful things until early 20s, most people are anyway. So, just try to roll with the punches a bit. &lt;/p&gt;\n\n&lt;p&gt;Congrats on all the progress! You sound smart and adaptable. Happy Birthday.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25763d", "score_hidden": false, "name": "t1_chedsi5", "created": 1399752705.0, "author_flair_text": null, "created_utc": 1399723905.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chedveo", "gilded": 0, "author": "KurtisGG", "parent_id": "t3_25763d", "approved_by": null, "body": "I work with kids the same age as your brother, and the things they come out with is unbelievable. When we talk to them about what they have said they are gobsmacked at the things they say. I imagine it's hard for your brother because he probably feels a bit left out. I think maybe you could try and forget about it or maybe talk to him about it because he probably didn't even realize what he said. I also have a lot of the same stuff as you and people really don't realize how much we take these things to heart. If you need anyone to talk to just msg me.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work with kids the same age as your brother, and the things they come out with is unbelievable. When we talk to them about what they have said they are gobsmacked at the things they say. I imagine it&amp;#39;s hard for your brother because he probably feels a bit left out. I think maybe you could try and forget about it or maybe talk to him about it because he probably didn&amp;#39;t even realize what he said. I also have a lot of the same stuff as you and people really don&amp;#39;t realize how much we take these things to heart. If you need anyone to talk to just msg me.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25763d", "score_hidden": false, "name": "t1_chedveo", "created": 1399753097.0, "author_flair_text": null, "created_utc": 1399724297.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf22lo", "gilded": 0, "author": "vanilladream", "parent_id": "t3_25763d", "approved_by": null, "body": "Your brother might be having a hard time to deal with the whole situation. If you are depressed and suicidal it affects the entire family. He is not happy and maybe he blames you. I know my older sister used to resent me when we were teenagers because of some sort of \"attention\" I was getting. If only she knew how bad this attention was and how it only made me feel like shit...\nI don't know how your family is dealing with it in general, but maybe it would be good for your brother to talk to a therapist. He seems to be full of anger and it's not good for him or the family.\n\nAlso, a simple solution for the locked cabin could be leave out things that you cannot harm yourself with. Like the band-aids, a couple of aspirins and things like that. If you need the aspirin you take it and tell your parents to replace it for the next time you need it.\n\nYou are doing great! Don't let things put you down, and it does, be strong and get up again. I hope you keep getting better! \n\nAnd happy birthday!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your brother might be having a hard time to deal with the whole situation. If you are depressed and suicidal it affects the entire family. He is not happy and maybe he blames you. I know my older sister used to resent me when we were teenagers because of some sort of &amp;quot;attention&amp;quot; I was getting. If only she knew how bad this attention was and how it only made me feel like shit...\nI don&amp;#39;t know how your family is dealing with it in general, but maybe it would be good for your brother to talk to a therapist. He seems to be full of anger and it&amp;#39;s not good for him or the family.&lt;/p&gt;\n\n&lt;p&gt;Also, a simple solution for the locked cabin could be leave out things that you cannot harm yourself with. Like the band-aids, a couple of aspirins and things like that. If you need the aspirin you take it and tell your parents to replace it for the next time you need it.&lt;/p&gt;\n\n&lt;p&gt;You are doing great! Don&amp;#39;t let things put you down, and it does, be strong and get up again. I hope you keep getting better! &lt;/p&gt;\n\n&lt;p&gt;And happy birthday!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25763d", "score_hidden": false, "name": "t1_chf22lo", "created": 1399825509.0, "author_flair_text": null, "created_utc": 1399796709.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chefcxm", "gilded": 0, "author": "reaching-out", "parent_id": "t3_25763d", "approved_by": null, "body": "I'm amazed at what progress you are making and so happy for you. If you are this resilient at age 14 then you are looking towards a fantastic future for yourself. Please don't let this off-hand comment be a setback for you. \n\nYour brother, being the age he is, is likely confused about the entire situation and doesn't have the ability to grasp the finer details, like the fact that you have experienced a genuine illness. Children crave stability and I imagine having a little bit of change in routine for a while has just taken him aback slightly. What he said was more likely him lashing out as a result of his confusion rather than wanting to hurt you. If he had the capacity to understand the depth of your pain he would never have said that. He may understand you have hurt yourself or been in hospital but these are very basic details and the only ones he can really grasp at his age.\n\nDon't let this ruin your birthday and certainly don't let it ruin your recovery :) Could you talk the incident through with your parents perhaps? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m amazed at what progress you are making and so happy for you. If you are this resilient at age 14 then you are looking towards a fantastic future for yourself. Please don&amp;#39;t let this off-hand comment be a setback for you. &lt;/p&gt;\n\n&lt;p&gt;Your brother, being the age he is, is likely confused about the entire situation and doesn&amp;#39;t have the ability to grasp the finer details, like the fact that you have experienced a genuine illness. Children crave stability and I imagine having a little bit of change in routine for a while has just taken him aback slightly. What he said was more likely him lashing out as a result of his confusion rather than wanting to hurt you. If he had the capacity to understand the depth of your pain he would never have said that. He may understand you have hurt yourself or been in hospital but these are very basic details and the only ones he can really grasp at his age.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let this ruin your birthday and certainly don&amp;#39;t let it ruin your recovery :) Could you talk the incident through with your parents perhaps? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25763d", "score_hidden": false, "name": "t1_chefcxm", "created": 1399759400.0, "author_flair_text": null, "created_utc": 1399730600.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]