[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi. My friend has started cutting again recently. She did it before but apparently stopped and has now started it again. The difference is that this time she is more serious. A friend of hers (Let&amp;#39;s call her B) is a serious cutter and now they are looking for good disinfectants, ways to hide it, etc. My point is, I think that B is dragging my friend into cutting. As far as friends are concerned, most of her friends are suicidal/depressed, and that has taken its toll on her too. I don&amp;#39;t know what to do and am really worried. Any advice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi. My friend has started cutting again recently. She did it before but apparently stopped and has now started it again. The difference is that this time she is more serious. A friend of hers (Let's call her B) is a serious cutter and now they are looking for good disinfectants, ways to hide it, etc. My point is, I think that B is dragging my friend into cutting. As far as friends are concerned, most of her friends are suicidal/depressed, and that has taken its toll on her too. I don't know what to do and am really worried. Any advice?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25eb9y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cuttingthro", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25eb9y/my_friend_is_cutting_again/", "name": "t3_25eb9y", "created": 1399961613.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25eb9y/my_friend_is_cutting_again/", "author_flair_text": null, "title": "My friend is cutting again", "created_utc": 1399932813.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgtstp", "gilded": 0, "author": "twinsfan68", "parent_id": "t1_chgqcdt", "approved_by": null, "body": "I would say act normal but concerned. Be very serious with her when you approach her to talk about this. Voice your concern to her in a straightforward, honest way, but try to be gentle as well. Show her how troubled you are with the BEHAVIOR itself, rather than come off as \"judging\" her for cutting. Just be there for her, be the friend you have always been, but show her love through your concern. Best of luck.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say act normal but concerned. Be very serious with her when you approach her to talk about this. Voice your concern to her in a straightforward, honest way, but try to be gentle as well. Show her how troubled you are with the BEHAVIOR itself, rather than come off as &amp;quot;judging&amp;quot; her for cutting. Just be there for her, be the friend you have always been, but show her love through your concern. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25eb9y", "score_hidden": false, "name": "t1_chgtstp", "created": 1400019022.0, "author_flair_text": null, "created_utc": 1399990222.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgqcdt", "gilded": 0, "author": "cuttingthro", "parent_id": "t1_chgc1qh", "approved_by": null, "body": "Thank you very much for your reply. I am trying my best to not freak out. \n\nShould I act completely normal? I don't want to scare her off, but I don't want to trivialize the situation either. How should I express my concern without making her defensive (because then she will keep it to herself). She certainly is not suicidal (not yet), but self-harm itself is not something trivial either. \n\nAs for why she is choosing to do this, most of her stress comes from her friends. As I said earlier, most of them are depressed and some of them have seriously attempted suicide a few times before. For some reason, they all chose to confide in her and most of them are depressed. All of this really gets to her. I don't have good access to professionals (stuck in a third-world country) and we are thousands of miles apart. I don't know her friends either, so there isn't much I can do about them. I can't help but get worried about them, and even more, about her.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for your reply. I am trying my best to not freak out. &lt;/p&gt;\n\n&lt;p&gt;Should I act completely normal? I don&amp;#39;t want to scare her off, but I don&amp;#39;t want to trivialize the situation either. How should I express my concern without making her defensive (because then she will keep it to herself). She certainly is not suicidal (not yet), but self-harm itself is not something trivial either. &lt;/p&gt;\n\n&lt;p&gt;As for why she is choosing to do this, most of her stress comes from her friends. As I said earlier, most of them are depressed and some of them have seriously attempted suicide a few times before. For some reason, they all chose to confide in her and most of them are depressed. All of this really gets to her. I don&amp;#39;t have good access to professionals (stuck in a third-world country) and we are thousands of miles apart. I don&amp;#39;t know her friends either, so there isn&amp;#39;t much I can do about them. I can&amp;#39;t help but get worried about them, and even more, about her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25eb9y", "score_hidden": false, "name": "t1_chgqcdt", "created": 1400006180.0, "author_flair_text": null, "created_utc": 1399977380.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgc1qh", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_25eb9y", "approved_by": null, "body": "This is a tricky one. SIB is a very serious issue, and is a unique problem with each \"user\". My best advice would be to try talking, in a totally comfortable, non-judgmental way, to your friend about her behavior. Voice your concerns to her, and tell her how you feel about it and why. Try to understand why she is resorting to self-harm without going on the offensive or getting emotional. I would also try speaking with a professional to get some expert advice on the issue and how to approach your friend in a non-hostile way that will get your point across most effectively. \n\nI hope this helps.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a tricky one. SIB is a very serious issue, and is a unique problem with each &amp;quot;user&amp;quot;. My best advice would be to try talking, in a totally comfortable, non-judgmental way, to your friend about her behavior. Voice your concerns to her, and tell her how you feel about it and why. Try to understand why she is resorting to self-harm without going on the offensive or getting emotional. I would also try speaking with a professional to get some expert advice on the issue and how to approach your friend in a non-hostile way that will get your point across most effectively. &lt;/p&gt;\n\n&lt;p&gt;I hope this helps.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25eb9y", "score_hidden": false, "name": "t1_chgc1qh", "created": 1399962870.0, "author_flair_text": null, "created_utc": 1399934070.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]