[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 17, I dropped out of school, I&amp;#39;m not going back to school, I plan on taking a GED test next spring, I have no license, I have no job, and my mother is dead. I&amp;#39;m 100% sure I have ADHD but my father thinks that is not a real disorder and I am looking for an excuse to fail and he refuses to take me to a psychiatrist and it&amp;#39;s really fucking with my brain. I can&amp;#39;t fucking deal with this shit right now I just want to fucking go rob a gun store and shoot myself in the fucking face as much as I fucking possibly can. He refuses to pay for driver&amp;#39;s education even though he paid for my brother and sister to take driver&amp;#39;s education. My brother is 22 and he&amp;#39;s a loser who still lives at home, isn&amp;#39;t going to college, and works at family video. My sister is turning 20 in August, she&amp;#39;s pregnant from some 36 year old she&amp;#39;s only known for half a year and they&amp;#39;re relationship is destined to fail. I&amp;#39;m seriously fucking done with this. I just want to die but I&amp;#39;m afraid of death. The few things keeping me alive are video games and masturbation and anything that gives me immediate satisfaction like Mountain Dew or watching SeaNanners&amp;#39; videos. Speaking of masturbation, I think Audrey Hepburn was probably the most beautiful woman to ever live. Anyways, what the fuck can I do? I&amp;#39;m literally powerless here. I have no fucking family to talk to, no one to take my fucking side, nowhere to live, no fucking thing. My father is threatening to kick me out the day I turn 18 and he won&amp;#39;t pay for my GED test or my driver&amp;#39;s license test or anything. He gets like at least 400 dollars a month cause my mom is dead but I don&amp;#39;t see any of that money. I don&amp;#39;t have any new clothes, the only laptop I have is one I took from my school and they never asked for it back so I just kept it, I know a laptop isn&amp;#39;t that important but it&amp;#39;s the only thing that keeps me sane and yet my dad still has the audacity to call me spoiled when he goes out to eat with his girlfriend and my brother like 5 days a week and tells me I&amp;#39;m on my own to have frozen pizza and macaroni and cheese five days in a row. Then he goes and plays golf every day with my brother, never takes me, and says he never gets to do anything and then he complains when I play video games. He says I&amp;#39;m a Billy Bad Ass and I&amp;#39;m not as tough as I think I am (let it be known I&amp;#39;ve never claimed to be tough and I would never hit my father but that fucking bastard better know that if he fucking pushes me any further I could easily knock his teeth down his fucking throat and gouge his eyes out) just because he was a fucking Seabee! A FUCKING GLORIFIED FUCKING CARPENTER. WHAT THE FUCK CAN I FUCKING DO!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 17, I dropped out of school, I'm not going back to school, I plan on taking a GED test next spring, I have no license, I have no job, and my mother is dead. I'm 100% sure I have ADHD but my father thinks that is not a real disorder and I am looking for an excuse to fail and he refuses to take me to a psychiatrist and it's really fucking with my brain. I can't fucking deal with this shit right now I just want to fucking go rob a gun store and shoot myself in the fucking face as much as I fucking possibly can. He refuses to pay for driver's education even though he paid for my brother and sister to take driver's education. My brother is 22 and he's a loser who still lives at home, isn't going to college, and works at family video. My sister is turning 20 in August, she's pregnant from some 36 year old she's only known for half a year and they're relationship is destined to fail. I'm seriously fucking done with this. I just want to die but I'm afraid of death. The few things keeping me alive are video games and masturbation and anything that gives me immediate satisfaction like Mountain Dew or watching SeaNanners' videos. Speaking of masturbation, I think Audrey Hepburn was probably the most beautiful woman to ever live. Anyways, what the fuck can I do? I'm literally powerless here. I have no fucking family to talk to, no one to take my fucking side, nowhere to live, no fucking thing. My father is threatening to kick me out the day I turn 18 and he won't pay for my GED test or my driver's license test or anything. He gets like at least 400 dollars a month cause my mom is dead but I don't see any of that money. I don't have any new clothes, the only laptop I have is one I took from my school and they never asked for it back so I just kept it, I know a laptop isn't that important but it's the only thing that keeps me sane and yet my dad still has the audacity to call me spoiled when he goes out to eat with his girlfriend and my brother like 5 days a week and tells me I'm on my own to have frozen pizza and macaroni and cheese five days in a row. Then he goes and plays golf every day with my brother, never takes me, and says he never gets to do anything and then he complains when I play video games. He says I'm a Billy Bad Ass and I'm not as tough as I think I am (let it be known I've never claimed to be tough and I would never hit my father but that fucking bastard better know that if he fucking pushes me any further I could easily knock his teeth down his fucking throat and gouge his eyes out) just because he was a fucking Seabee! A FUCKING GLORIFIED FUCKING CARPENTER. WHAT THE FUCK CAN I FUCKING DO!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24rpe5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399292657.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24rpe5/my_father_is_driving_me_to_suicide/", "name": "t3_24rpe5", "created": 1399321168.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24rpe5/my_father_is_driving_me_to_suicide/", "author_flair_text": null, "title": "My Father is Driving Me to Suicide", "created_utc": 1399292368.0, "ups": 3, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha0p3s", "gilded": 0, "author": "SuaveDuvet", "parent_id": "t1_cha0hm8", "approved_by": null, "body": "That sounds like a solid plan.\n\nHmm dish washing...well it might not be your dream job but no one's first job is. It'll be hard work and probably pretty boring but hey, it's called *work* for a reason.\n\nWork hard, show you're willing to do the jobs other people don't want to and after awhile you might get more responsibilities, more tasks to do and more pay. \n\nMost importantly you'll be independent. You'll have *your own money* that you can do whatever you want with and with this comes more freedom. You'll also have a job where it is *your* responsibility and no one else's to get that shit done. So what if its washing dishes, someone's gotta wash them and if you show that you can do it well, people will respect that and respect you.\n\nHopefully getting out there will put things into perspective. Your father is just a person that you had to live with for a bit. He doesn't control your future. You do.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds like a solid plan.&lt;/p&gt;\n\n&lt;p&gt;Hmm dish washing...well it might not be your dream job but no one&amp;#39;s first job is. It&amp;#39;ll be hard work and probably pretty boring but hey, it&amp;#39;s called &lt;em&gt;work&lt;/em&gt; for a reason.&lt;/p&gt;\n\n&lt;p&gt;Work hard, show you&amp;#39;re willing to do the jobs other people don&amp;#39;t want to and after awhile you might get more responsibilities, more tasks to do and more pay. &lt;/p&gt;\n\n&lt;p&gt;Most importantly you&amp;#39;ll be independent. You&amp;#39;ll have &lt;em&gt;your own money&lt;/em&gt; that you can do whatever you want with and with this comes more freedom. You&amp;#39;ll also have a job where it is &lt;em&gt;your&lt;/em&gt; responsibility and no one else&amp;#39;s to get that shit done. So what if its washing dishes, someone&amp;#39;s gotta wash them and if you show that you can do it well, people will respect that and respect you.&lt;/p&gt;\n\n&lt;p&gt;Hopefully getting out there will put things into perspective. Your father is just a person that you had to live with for a bit. He doesn&amp;#39;t control your future. You do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0p3s", "created": 1399325310.0, "author_flair_text": null, "created_utc": 1399296510.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha1rho", "gilded": 0, "author": "Andreab61", "parent_id": "t1_cha0hm8", "approved_by": null, "body": "I washed dishes at a pizza parlor to put myself through college. I excelled at it so much that it wasn't long before I was busing  tables and after that taking counter orders. It was not my dream job but so what? Actually think I enjoyed washing dishes the most because the time went by quickly and for the most part I was left alone.  Jobs were scarce in my college town. I am short- 5'2\" btw, and I survived the physicality involved. ", "edited": 1399302872.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I washed dishes at a pizza parlor to put myself through college. I excelled at it so much that it wasn&amp;#39;t long before I was busing  tables and after that taking counter orders. It was not my dream job but so what? Actually think I enjoyed washing dishes the most because the time went by quickly and for the most part I was left alone.  Jobs were scarce in my college town. I am short- 5&amp;#39;2&amp;quot; btw, and I survived the physicality involved. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha1rho", "created": 1399328288.0, "author_flair_text": null, "created_utc": 1399299488.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha0hm8", "gilded": 0, "author": "[deleted]", "parent_id": "t1_cha0f5m", "approved_by": null, "body": "Not really. My best option at the moment seems to be get a job, suffer through living here until I can afford my own place, then go to college, transfer to a university, then go to law school and follow my dreams.\n\nQuestion, how bad is a dish washing job? My local hospital is hiring a dish washer (well, food services associate but they said it's mainly for dish washing) and apparently I'd be working 72 hours per two weeks. It doesn't seem bad but I've heard terrible things about dish washing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. My best option at the moment seems to be get a job, suffer through living here until I can afford my own place, then go to college, transfer to a university, then go to law school and follow my dreams.&lt;/p&gt;\n\n&lt;p&gt;Question, how bad is a dish washing job? My local hospital is hiring a dish washer (well, food services associate but they said it&amp;#39;s mainly for dish washing) and apparently I&amp;#39;d be working 72 hours per two weeks. It doesn&amp;#39;t seem bad but I&amp;#39;ve heard terrible things about dish washing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0hm8", "created": 1399324656.0, "author_flair_text": null, "created_utc": 1399295856.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha0f5m", "gilded": 0, "author": "SuaveDuvet", "parent_id": "t1_cha0b8e", "approved_by": null, "body": "Damn. Well you know what they say, that *you can't pick your family*. I guess you got screwed by that :(\n\nBut you're pretty much old enough to go out into the world and start to recreate yourself in any way you want to. You need to get out of that poisonous place and not let your past/family determine the person you can be.\n\nFor now, haven't you got any other family that you could talk to? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn. Well you know what they say, that &lt;em&gt;you can&amp;#39;t pick your family&lt;/em&gt;. I guess you got screwed by that :(&lt;/p&gt;\n\n&lt;p&gt;But you&amp;#39;re pretty much old enough to go out into the world and start to recreate yourself in any way you want to. You need to get out of that poisonous place and not let your past/family determine the person you can be.&lt;/p&gt;\n\n&lt;p&gt;For now, haven&amp;#39;t you got any other family that you could talk to? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0f5m", "created": 1399324436.0, "author_flair_text": null, "created_utc": 1399295636.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha0b8e", "gilded": 0, "author": "[deleted]", "parent_id": "t1_cha09kr", "approved_by": null, "body": "I really have no clue. Maybe it's because I'm the youngest or I'm the only person in his life right now that dares to contradict his way of thinking.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really have no clue. Maybe it&amp;#39;s because I&amp;#39;m the youngest or I&amp;#39;m the only person in his life right now that dares to contradict his way of thinking.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0b8e", "created": 1399324071.0, "author_flair_text": null, "created_utc": 1399295271.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha09kr", "gilded": 0, "author": "SuaveDuvet", "parent_id": "t3_24rpe5", "approved_by": null, "body": "Well shit, that sounds like a horrendous situation. Why does he treat you that way? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well shit, that sounds like a horrendous situation. Why does he treat you that way? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha09kr", "created": 1399323917.0, "author_flair_text": null, "created_utc": 1399295117.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha0y1s", "gilded": 0, "author": "babygaleva7", "parent_id": "t1_cha0k9j", "approved_by": null, "body": "I agree with what suaveDuvet said noone's first job is ideal but it's a start.\n\nTake the pain and breaks whenever you can and just be positive about everything.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with what suaveDuvet said noone&amp;#39;s first job is ideal but it&amp;#39;s a start.&lt;/p&gt;\n\n&lt;p&gt;Take the pain and breaks whenever you can and just be positive about everything.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0y1s", "created": 1399326045.0, "author_flair_text": null, "created_utc": 1399297245.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha0k9j", "gilded": 0, "author": "[deleted]", "parent_id": "t1_cha0h5c", "approved_by": null, "body": "I literally tell my friends that that is my reasoning for everything \"hope for the best and expect the worse.\" Also, I said this in another reply but what do you think about a dish washing job at a hospital? The only issue I guess I would have is due to my height I sometimes get a sore back from standing after a long time and apparently the average work day there is 2:00 to 10:30.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I literally tell my friends that that is my reasoning for everything &amp;quot;hope for the best and expect the worse.&amp;quot; Also, I said this in another reply but what do you think about a dish washing job at a hospital? The only issue I guess I would have is due to my height I sometimes get a sore back from standing after a long time and apparently the average work day there is 2:00 to 10:30.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0k9j", "created": 1399324890.0, "author_flair_text": null, "created_utc": 1399296090.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha0h5c", "gilded": 0, "author": "babygaleva7", "parent_id": "t1_cha0c36", "approved_by": null, "body": "Hope for the best, but expect the worst.\n\nMaybe he is starting to take interest, I hope so.\n\nIt's sad that there aren't more Job opportunities for teens but I hope you'll find one other that a fast food joint(they can be the worst)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope for the best, but expect the worst.&lt;/p&gt;\n\n&lt;p&gt;Maybe he is starting to take interest, I hope so.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad that there aren&amp;#39;t more Job opportunities for teens but I hope you&amp;#39;ll find one other that a fast food joint(they can be the worst)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0h5c", "created": 1399324614.0, "author_flair_text": null, "created_utc": 1399295814.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha0c36", "gilded": 0, "author": "[deleted]", "parent_id": "t1_cha0a1s", "approved_by": null, "body": "Thanks, I guess all I can do right now is try to find a job. I really don't want to work at a fast food joint so I'll see what other options I have.\n\nSomething that surprised me is he just told me I have an appointment with my psychologist at 6:30 today but that doesn't mean that I'll see a psychiatrist soon or that he'll pay for the medication but I'm hoping for the best.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I guess all I can do right now is try to find a job. I really don&amp;#39;t want to work at a fast food joint so I&amp;#39;ll see what other options I have.&lt;/p&gt;\n\n&lt;p&gt;Something that surprised me is he just told me I have an appointment with my psychologist at 6:30 today but that doesn&amp;#39;t mean that I&amp;#39;ll see a psychiatrist soon or that he&amp;#39;ll pay for the medication but I&amp;#39;m hoping for the best.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0c36", "created": 1399324147.0, "author_flair_text": null, "created_utc": 1399295347.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha0a1s", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24rpe5", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0a1s", "created": 1399323963.0, "author_flair_text": null, "created_utc": 1399295163.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha0vi9", "gilded": 0, "author": "ultrapreneruship", "parent_id": "t3_24rpe5", "approved_by": null, "body": "First I will try to treat myself from the ADHD, so first try to get a job, go to a psychiatrist and pay for your meds, once you start dealing with ADHD I bet your life is gonna get a lot better \n\nI send you a hug\n\nI personally know what is a dad driving you to suicide, but I know that it is me leting him drive me into that, if you hang in there trust me thinks will get better. But you have to try new methods, new stuff so you can get new results from your life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First I will try to treat myself from the ADHD, so first try to get a job, go to a psychiatrist and pay for your meds, once you start dealing with ADHD I bet your life is gonna get a lot better &lt;/p&gt;\n\n&lt;p&gt;I send you a hug&lt;/p&gt;\n\n&lt;p&gt;I personally know what is a dad driving you to suicide, but I know that it is me leting him drive me into that, if you hang in there trust me thinks will get better. But you have to try new methods, new stuff so you can get new results from your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rpe5", "score_hidden": false, "name": "t1_cha0vi9", "created": 1399325842.0, "author_flair_text": null, "created_utc": 1399297042.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]