[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So here I am, laying in my bed, pondering some dark thoughts.  &amp;quot;Should I just end it all?&amp;quot;  I feel like I&amp;#39;m sitting in front of the scales, placing the positive and negative aspects of my being and my influences on life, and even though I am struggling and squinting at this scale, it&amp;#39;s no use -- the side with the large bold minus sign is nearly touching the ground.&lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;ve always been depressed.  I grew up in a single-parent household.  My mom divorced my dad when I was 5 or 6.  Coincidentally, the earliest memory of my childhood is the entire ordeal.  I kicked and screamed and cried at my mother.  Our relationship was always difficult.  Depression was always lurking around the corner, but it seems as if it mustered enough strength to finally pounce.  I was always sort of an outcast.  I didn&amp;#39;t have a male role model in my childhood, so I was never that much of a macho dude.  I&amp;#39;m not gay or effeminate, but was &amp;quot;weird&amp;quot; and as a result had little social interaction throughout my school days.  I finally sort of broke out of my shell in high school, but as a shy extrovert, this provided very little.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to last year.  I started university and once again, struggled to hold relationships, both platonic and romantic.  Social anxiety took over completely.  This lead to poor performance in school.  I just had NO drive at all, and then my dog of 14 years passed.  Even though this might seem menial as shit to you guys, he was my only real friend that was always beside me.  That was the final straw.  Depression was training, drooling at the thought of crushing me, and it saw an opening.  In November, 2013, I attempted suicide in my dorm room via strangulation.  Surprise, it didn&amp;#39;t work.  I failed the semester with the exception of one class, and was berated by my family until I confessed the reason.  We held a family meeting where everything was discussed and I agreed to see a counselor.  I hated counseling.  I used it more as a social experiment than anything, but I could tell that the counselor was just doing their job.  Fake empathy is worse than apathy, and since it was their job to &amp;quot;care&amp;quot;, it just felt plastic.  I eventually &amp;quot;beat&amp;quot; my depression by trying to forget about it.  I got medicated and even though the Prozac did nothing, I convinced my family and counselor that everything was going to be ok, that next semester everything was going to go smoothly and I was going to have a promising future.  That was until I got my grades today, and surprise surprise, all F&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;I know that 99% of you reading are thinking something to the effect of, &amp;quot;You&amp;#39;re fucking suicidal because you failed uni?  Because you dissapointed your parents?  I would KILL to have a life as easy as you!&amp;quot;  As silly as it seems, yes.  That is why I&amp;#39;m depressed, with a few underlying issues as well.  I have no fucking clue why my menial problems that are minuscule to the majority of your average Joe are causing me to want to die.  The only thing preventing me from just going outside and jumping in front of a car, aside from the fact that I&amp;#39;m a gigantic pussy, is that I don&amp;#39;t want to be any more of an inconvenience to the human race than I already have.  People literally kill to have half of my life, and here I am, typing on my $1300 laptop on high-speed internet about how my bullshit problems are causing me to think about ending my privileged life.  I wish I could explain why.  Tomorrow I&amp;#39;m going to purchase a firearm after liquidating some of my assets to pay for my college debt.  I would trade this life for anything in a heartbeat, because this monster that has been lurking around me for my entire life has finally pounced.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So here I am, laying in my bed, pondering some dark thoughts.  \"Should I just end it all?\"  I feel like I'm sitting in front of the scales, placing the positive and negative aspects of my being and my influences on life, and even though I am struggling and squinting at this scale, it's no use -- the side with the large bold minus sign is nearly touching the ground.\n\nI guess I've always been depressed.  I grew up in a single-parent household.  My mom divorced my dad when I was 5 or 6.  Coincidentally, the earliest memory of my childhood is the entire ordeal.  I kicked and screamed and cried at my mother.  Our relationship was always difficult.  Depression was always lurking around the corner, but it seems as if it mustered enough strength to finally pounce.  I was always sort of an outcast.  I didn't have a male role model in my childhood, so I was never that much of a macho dude.  I'm not gay or effeminate, but was \"weird\" and as a result had little social interaction throughout my school days.  I finally sort of broke out of my shell in high school, but as a shy extrovert, this provided very little.\n\nFast forward to last year.  I started university and once again, struggled to hold relationships, both platonic and romantic.  Social anxiety took over completely.  This lead to poor performance in school.  I just had NO drive at all, and then my dog of 14 years passed.  Even though this might seem menial as shit to you guys, he was my only real friend that was always beside me.  That was the final straw.  Depression was training, drooling at the thought of crushing me, and it saw an opening.  In November, 2013, I attempted suicide in my dorm room via strangulation.  Surprise, it didn't work.  I failed the semester with the exception of one class, and was berated by my family until I confessed the reason.  We held a family meeting where everything was discussed and I agreed to see a counselor.  I hated counseling.  I used it more as a social experiment than anything, but I could tell that the counselor was just doing their job.  Fake empathy is worse than apathy, and since it was their job to \"care\", it just felt plastic.  I eventually \"beat\" my depression by trying to forget about it.  I got medicated and even though the Prozac did nothing, I convinced my family and counselor that everything was going to be ok, that next semester everything was going to go smoothly and I was going to have a promising future.  That was until I got my grades today, and surprise surprise, all F's.\n\nI know that 99% of you reading are thinking something to the effect of, \"You're fucking suicidal because you failed uni?  Because you dissapointed your parents?  I would KILL to have a life as easy as you!\"  As silly as it seems, yes.  That is why I'm depressed, with a few underlying issues as well.  I have no fucking clue why my menial problems that are minuscule to the majority of your average Joe are causing me to want to die.  The only thing preventing me from just going outside and jumping in front of a car, aside from the fact that I'm a gigantic pussy, is that I don't want to be any more of an inconvenience to the human race than I already have.  People literally kill to have half of my life, and here I am, typing on my $1300 laptop on high-speed internet about how my bullshit problems are causing me to think about ending my privileged life.  I wish I could explain why.  Tomorrow I'm going to purchase a firearm after liquidating some of my assets to pay for my college debt.  I would trade this life for anything in a heartbeat, because this monster that has been lurking around me for my entire life has finally pounced.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259154", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stopbeingafuckup", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259154/my_life_is_damnnear_perfect_but_i_still_want_to/", "name": "t3_259154", "created": 1399801444.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259154/my_life_is_damnnear_perfect_but_i_still_want_to/", "author_flair_text": null, "title": "My life is damn-near perfect, but I still want to die.", "created_utc": 1399772644.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chevuwq", "gilded": 0, "author": "samcarroll", "parent_id": "t3_259154", "approved_by": null, "body": "I don't believe anyone is looking down on you for being so down. You have gone through a lot in a short space of time and this is always a hard thing to recover from. For me it's pretty understandable why you feel so down. \n\nWould you like to try again with Uni? \n\nP.S, trust me; you're definitely no inconvenience to anyone. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t believe anyone is looking down on you for being so down. You have gone through a lot in a short space of time and this is always a hard thing to recover from. For me it&amp;#39;s pretty understandable why you feel so down. &lt;/p&gt;\n\n&lt;p&gt;Would you like to try again with Uni? &lt;/p&gt;\n\n&lt;p&gt;P.S, trust me; you&amp;#39;re definitely no inconvenience to anyone. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259154", "score_hidden": false, "name": "t1_chevuwq", "created": 1399803553.0, "author_flair_text": null, "created_utc": 1399774753.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chex5j0", "gilded": 0, "author": "fallout06", "parent_id": "t3_259154", "approved_by": null, "body": "Depression often isn't a case of our life circumstances. You could have every good thing in the world going your way and still being depressed. On the other hand, you could have nothing but still be content. As banal as it might sound, it's a chemical imbalance, something you have no control over. Whatever you're going through, you're not alone. I remember as a student doing poorly, unable to see the point of anything, wondering what it might be like to have it all end...\n\nI know that feeling well of never being able to break out of your shell, never being yourself, afraid of the damnedest little things. I've lived with that for 26 years, and the walls only get thicker with each passing year. I made a pact with myself that I would never kill myself, no matter the reason.\n\nWhy? There was no real reason. One was of convenience. I don't want to leave a bloody mess or a sight of horror for whoever has to clean me up. I don't want to bring shame to my parents or family. I don't want to give them a horrible memory they'll have to live with the rest of their lives.\n\nThe other is for myself. Maybe nothing will get better for me, but maybe it will. I'm not going to count it out. That's part of what makes us human. Even when all seems lost, even when there's no point, we fight to the death. That's part of our nobility.\n\nWe're here for you, and please find someone you can talk to about these feelings. I know the therapist was a fail, but maybe another one will be a better fit. I believe in you, buddy.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depression often isn&amp;#39;t a case of our life circumstances. You could have every good thing in the world going your way and still being depressed. On the other hand, you could have nothing but still be content. As banal as it might sound, it&amp;#39;s a chemical imbalance, something you have no control over. Whatever you&amp;#39;re going through, you&amp;#39;re not alone. I remember as a student doing poorly, unable to see the point of anything, wondering what it might be like to have it all end...&lt;/p&gt;\n\n&lt;p&gt;I know that feeling well of never being able to break out of your shell, never being yourself, afraid of the damnedest little things. I&amp;#39;ve lived with that for 26 years, and the walls only get thicker with each passing year. I made a pact with myself that I would never kill myself, no matter the reason.&lt;/p&gt;\n\n&lt;p&gt;Why? There was no real reason. One was of convenience. I don&amp;#39;t want to leave a bloody mess or a sight of horror for whoever has to clean me up. I don&amp;#39;t want to bring shame to my parents or family. I don&amp;#39;t want to give them a horrible memory they&amp;#39;ll have to live with the rest of their lives.&lt;/p&gt;\n\n&lt;p&gt;The other is for myself. Maybe nothing will get better for me, but maybe it will. I&amp;#39;m not going to count it out. That&amp;#39;s part of what makes us human. Even when all seems lost, even when there&amp;#39;s no point, we fight to the death. That&amp;#39;s part of our nobility.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re here for you, and please find someone you can talk to about these feelings. I know the therapist was a fail, but maybe another one will be a better fit. I believe in you, buddy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259154", "score_hidden": false, "name": "t1_chex5j0", "created": 1399807025.0, "author_flair_text": null, "created_utc": 1399778225.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]