[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everything was fine until a few months ago. \nI&amp;#39;d gotten promoted at work, I signed up for school and everything was looking up to be great for a 19 year old guy. Then it all went to shit. My parents are now constantly fighting, my moms packed her bags and is looking for an apartment, and she&amp;#39;s taking my 3 year old brother and 1 year old sister with her. My dad is leaving the country to go back to his home country in the Caribbean. I love them both so much, but this is impossible for me to deal with. I lost my job because our immigrant status got denied when they filed for divorce. Now I can&amp;#39;t go to school and I can&amp;#39;t make money. I have a 15 year old sister who hates everyone in my family, and I don&amp;#39;t know what&amp;#39;ll happen to her. I have no friends left to talk to, and I just don&amp;#39;t think I can fight this, its too much. I&amp;#39;ve thought of just making it look like an accident, maybe crash my car into a bridge on a highway or something. If I&amp;#39;m going fast enough I won&amp;#39;t feel much.... But I don&amp;#39;t want it to end. The lure of making it all stop is too big. Please help me&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Everything was fine until a few months ago. \nI'd gotten promoted at work, I signed up for school and everything was looking up to be great for a 19 year old guy. Then it all went to shit. My parents are now constantly fighting, my moms packed her bags and is looking for an apartment, and she's taking my 3 year old brother and 1 year old sister with her. My dad is leaving the country to go back to his home country in the Caribbean. I love them both so much, but this is impossible for me to deal with. I lost my job because our immigrant status got denied when they filed for divorce. Now I can't go to school and I can't make money. I have a 15 year old sister who hates everyone in my family, and I don't know what'll happen to her. I have no friends left to talk to, and I just don't think I can fight this, its too much. I've thought of just making it look like an accident, maybe crash my car into a bridge on a highway or something. If I'm going fast enough I won't feel much.... But I don't want it to end. The lure of making it all stop is too big. Please help me", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24upyw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "is-it-over-", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24upyw/my_life_just_got_turned_upside_down_inside_out/", "name": "t3_24upyw", "created": 1399400347.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24upyw/my_life_just_got_turned_upside_down_inside_out/", "author_flair_text": null, "title": "My life just got turned upside down, inside out and .... I don't know anymore.", "created_utc": 1399371547.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chawhi5", "gilded": 0, "author": "TryToFlyHigh", "parent_id": "t3_24upyw", "approved_by": null, "body": "Oh man, I have to say your situation sucks. Are you free to stay in whatever country you are residing?\n\nAbout your tuition, I can say: better late than never. It doesn't really matter if that get's delayed, not in the big scheme of things. \n\nI guess your options are limited now, aren't they? What are you going to do, where are you going to move? Making your first steps towards flying solo would seem like a good thing to do, but that will be hard and heavy. It does allow you to build something, something worth living for. Before you have something, you have to watch out as to not fall into the oblivion of soltitude and drugs... Not to add to you problems with the drugs thing, a drink here or a blunt there may ease your feelings.\n\nBut they won't erase them, that's up to you. So don't lose yourself.\n\nIf you want to talk, just hit me up. 21 years old myself so I imagine we should have something in common.\n\nI'mma write you a poem, just because:\n\nIs life void of meaning, the sensible far? \n\nAm I worth nothing, remnants of a star? \n\nWill I do good, or will I turn bad?\n\nThe choices, are all we ever had", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, I have to say your situation sucks. Are you free to stay in whatever country you are residing?&lt;/p&gt;\n\n&lt;p&gt;About your tuition, I can say: better late than never. It doesn&amp;#39;t really matter if that get&amp;#39;s delayed, not in the big scheme of things. &lt;/p&gt;\n\n&lt;p&gt;I guess your options are limited now, aren&amp;#39;t they? What are you going to do, where are you going to move? Making your first steps towards flying solo would seem like a good thing to do, but that will be hard and heavy. It does allow you to build something, something worth living for. Before you have something, you have to watch out as to not fall into the oblivion of soltitude and drugs... Not to add to you problems with the drugs thing, a drink here or a blunt there may ease your feelings.&lt;/p&gt;\n\n&lt;p&gt;But they won&amp;#39;t erase them, that&amp;#39;s up to you. So don&amp;#39;t lose yourself.&lt;/p&gt;\n\n&lt;p&gt;If you want to talk, just hit me up. 21 years old myself so I imagine we should have something in common.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;mma write you a poem, just because:&lt;/p&gt;\n\n&lt;p&gt;Is life void of meaning, the sensible far? &lt;/p&gt;\n\n&lt;p&gt;Am I worth nothing, remnants of a star? &lt;/p&gt;\n\n&lt;p&gt;Will I do good, or will I turn bad?&lt;/p&gt;\n\n&lt;p&gt;The choices, are all we ever had&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24upyw", "score_hidden": false, "name": "t1_chawhi5", "created": 1399411005.0, "author_flair_text": null, "created_utc": 1399382205.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chau5u7", "gilded": 0, "author": "is-it-over-", "parent_id": "t3_24upyw", "approved_by": null, "body": "I'm just so scared... Please help me out someone.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just so scared... Please help me out someone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24upyw", "score_hidden": false, "name": "t1_chau5u7", "created": 1399375167.0, "author_flair_text": null, "created_utc": 1399371567.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]