[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, I&amp;#39;m writing this to finally share my story I never got to say. My life ended about four years ago when my parents, brother, and I moved to Ohio. My family was forced to move in with my uncle (father&amp;#39;s long-term friend, not blood related). We were too poor to keep living where we did, and my parents couldn&amp;#39;t find jobs. My parents didn&amp;#39;t feel comfortable sending me to the local school in this new neighborhood, so they signed me and my brother up for online classes. Over this time my brother would break out of the house and stay gone for days. He would often steal from the family and sell my uncle&amp;#39;s expensive belongings for what we assumed to be drugs and cigarettes. He was always a horrible person. He was a popular kid, and I was not. I would seek solace from his company as I was bullied and didn&amp;#39;t understand how to interact with others. He only ever ignored me or told embarrassing stories of me to his friends. He had also sexually harassed me throughout our childhood. But that soon went away after he moved out a few months after he turned 18. He got his backpack and left on my birthday. (Cliché, right?) Anyway, for about four years and counting I&amp;#39;ve been living in my room with my laptop my only highlight of my life. I get to leave the house about once every three weeks if my father says I can go to the grocery store with him or something. My mother recently quit her job due to her making it out to be more dramatic than usual and now lives in the basement playing video games every day. She doesn&amp;#39;t come out to the other rooms due to her immense dislike for my uncle. We&amp;#39;ve been short on food due to my mother quitting and us losing a great amount of income. \nAnyway, what usually drives me to think about ending my life is when school gets in the way. I hate it. Everything about it I&amp;#39;m so sick of it. It&amp;#39;s caused me nothing but pain. My parents call me names, they accuse me of being a lazy slacker who is selfish and only wants to play on her computer. Of course I do, it&amp;#39;s the only place I have friends and fun. School has made my life so hard and I just want to get it over with. I could care less about what happens and I wish my parents would get that. I don&amp;#39;t want to hear any of that &amp;quot;they only want the best&amp;quot; BS. My mother ridicules me, deprives me of everything that would ever bring me joy, accuses me of my fathers depression, and overall does not care how that effects my emotional state. My father is an amazingly hard worker, but my mother is a crazy bitch. She screams at me and pounds on the walls. She starts to go insane if I ever started crying. She&amp;#39;d start yelling about how I never had it nearly as bad as she did, and she managed to be a straight A student. My father is forced to side with her about everything, and any time I ever brought up suicide my mother would challenge me. She&amp;#39;d tell me that&amp;#39;d we should both just end it and kill ourselves in the garage. That&amp;#39;s why I&amp;#39;ve never gone through with it. It&amp;#39;d end up killing my mother and father too. I always just thought about running away and hoping I&amp;#39;d get mugged or something. My parents have bad relations with both sides of the family. We&amp;#39;re too poor for doctors or psychiatrists. My parents would never take my problems seriously and just tell me to stop being lazy. I&amp;#39;m done with this world. There&amp;#39;s literally nothing for me. I&amp;#39;ve been dead alone for years only having my few online friends to keep me company.  But due to my bad grades I&amp;#39;m not allowed to use my laptop. I&amp;#39;m nothing but a lazy, stupid slacker who makes life hard for everyone else and can&amp;#39;t ever find the motivation to change. There&amp;#39;s no reason for me live, I have no future. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, I'm writing this to finally share my story I never got to say. My life ended about four years ago when my parents, brother, and I moved to Ohio. My family was forced to move in with my uncle (father's long-term friend, not blood related). We were too poor to keep living where we did, and my parents couldn't find jobs. My parents didn't feel comfortable sending me to the local school in this new neighborhood, so they signed me and my brother up for online classes. Over this time my brother would break out of the house and stay gone for days. He would often steal from the family and sell my uncle's expensive belongings for what we assumed to be drugs and cigarettes. He was always a horrible person. He was a popular kid, and I was not. I would seek solace from his company as I was bullied and didn't understand how to interact with others. He only ever ignored me or told embarrassing stories of me to his friends. He had also sexually harassed me throughout our childhood. But that soon went away after he moved out a few months after he turned 18. He got his backpack and left on my birthday. (Cliché, right?) Anyway, for about four years and counting I've been living in my room with my laptop my only highlight of my life. I get to leave the house about once every three weeks if my father says I can go to the grocery store with him or something. My mother recently quit her job due to her making it out to be more dramatic than usual and now lives in the basement playing video games every day. She doesn't come out to the other rooms due to her immense dislike for my uncle. We've been short on food due to my mother quitting and us losing a great amount of income. \nAnyway, what usually drives me to think about ending my life is when school gets in the way. I hate it. Everything about it I'm so sick of it. It's caused me nothing but pain. My parents call me names, they accuse me of being a lazy slacker who is selfish and only wants to play on her computer. Of course I do, it's the only place I have friends and fun. School has made my life so hard and I just want to get it over with. I could care less about what happens and I wish my parents would get that. I don't want to hear any of that \"they only want the best\" BS. My mother ridicules me, deprives me of everything that would ever bring me joy, accuses me of my fathers depression, and overall does not care how that effects my emotional state. My father is an amazingly hard worker, but my mother is a crazy bitch. She screams at me and pounds on the walls. She starts to go insane if I ever started crying. She'd start yelling about how I never had it nearly as bad as she did, and she managed to be a straight A student. My father is forced to side with her about everything, and any time I ever brought up suicide my mother would challenge me. She'd tell me that'd we should both just end it and kill ourselves in the garage. That's why I've never gone through with it. It'd end up killing my mother and father too. I always just thought about running away and hoping I'd get mugged or something. My parents have bad relations with both sides of the family. We're too poor for doctors or psychiatrists. My parents would never take my problems seriously and just tell me to stop being lazy. I'm done with this world. There's literally nothing for me. I've been dead alone for years only having my few online friends to keep me company.  But due to my bad grades I'm not allowed to use my laptop. I'm nothing but a lazy, stupid slacker who makes life hard for everyone else and can't ever find the motivation to change. There's no reason for me live, I have no future. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24563r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Snuffem", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398642699.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24563r/my_life_has_been_over_for_years/", "name": "t3_24563r", "created": 1398671269.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24563r/my_life_has_been_over_for_years/", "author_flair_text": null, "title": "My life has been over for years.", "created_utc": 1398642469.0, "ups": 6, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3p3qy", "gilded": 0, "author": "TheTurretCube", "parent_id": "t3_24563r", "approved_by": null, "body": "I'm sure you have a future, don't listen to what your Mother says, if she's acting like that then don't take any notice of her.\n\nI'm not going to tell you to push through it, because I hate it when people tell me that, but don't doubt yourself so hard", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure you have a future, don&amp;#39;t listen to what your Mother says, if she&amp;#39;s acting like that then don&amp;#39;t take any notice of her.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to tell you to push through it, because I hate it when people tell me that, but don&amp;#39;t doubt yourself so hard&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24563r", "score_hidden": false, "name": "t1_ch3p3qy", "created": 1398646587.0, "author_flair_text": null, "created_utc": 1398642987.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yeie", "gilded": 0, "author": "wort286", "parent_id": "t3_24563r", "approved_by": null, "body": "I would like to have some sort of conversation with you if that's possible. Let me know.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would like to have some sort of conversation with you if that&amp;#39;s possible. Let me know.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24563r", "score_hidden": false, "name": "t1_ch3yeie", "created": 1398669923.0, "author_flair_text": null, "created_utc": 1398666323.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]