[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello Reddit. My name is Mike, and am a 17-year-old from New York. I Have a dog named Reggie, two older sisters, one younger sister, a  girlfriend, and a mother. My mother suffers from type II bipolar disorder, which has never been diagnosed but it&amp;#39;s kind of just been known. She has months of happiness and months of utter destruction. I&amp;#39;m also an energetic person with a super potty-mouth, especially when talking to people on my computer. &lt;/p&gt;\n\n&lt;p&gt;Suffice to say that me and my mother do not get along in the least. My mother is very close minded, especially on her down months. Whenever we get into an argument, she will always mock me, and no matter how much I try to tell her that the only way towards closing an arguement is to find a solution to whatever problem she wants, she just continues to argue. She always tells me that I&amp;#39;m just a chore to her, and it causes me to become very depressed. My mother has the biggest sway on my mood because I respect her, especially in her up months. &lt;/p&gt;\n\n&lt;p&gt;Recently, my mother has begun screaming at me, telling me that I&amp;#39;m useless towards anything done in the house. I never help, and that she can&amp;#39;t wait until my wife divorces me because I curse. She&amp;#39;s a Christian, and I told her I was not. I don&amp;#39;t believe in a god, so in a way, suicide is kind of my safe haven. I don&amp;#39;t have to worry about being judged. It can all just end.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been thinking about suicide often. Her down months have become worse and worse over the years, and she often blames me for controlling her life. My girlfriend and I don&amp;#39;t talk about that much, and I&amp;#39;m not even sure if I love her like I used to anymore, and I think it&amp;#39;s because of my depression. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no one left for me. I&amp;#39;m a hostile, bitter person. My best friend rarely talks to me because I&amp;#39;m so hostile and just a burden. I miss him more than I think I&amp;#39;ll ever miss anyone. I remember the days when we used to talk for hours on end about the stupidest shit. Those days were great, and I miss them.&lt;/p&gt;\n\n&lt;p&gt;One thing I think I left out is the death of my Dad. He died in sept &amp;#39;13 and since my world has been chaos. I wish I could say I missed him more, but we never were close for the last few years of his life, something my Mom also holds against me. My Mom is severely depressed over the loss of my father, and I think it contributes to her anger towards me.&lt;/p&gt;\n\n&lt;p&gt;Shortly, I want to die. I think that there&amp;#39;s a weight that is just too strong. The will to want to live is just not there. I have no friends that I am close with, and my Mother literally makes me want to tear the world apart with fire. I try so hard to ignore it, but after 17 years my Mom knows how to pick me apart at the source.&lt;/p&gt;\n\n&lt;p&gt;I wish now more than ever that there&amp;#39;s an afterlife. I want to go to it badly. I just want to be in a position where my head doesn&amp;#39;t hurt from stifling a cry. I just want to love being. Just being. I want to look around and be proud of where I am. I just want someone to love for me, and be worried about me. I just want to mean the world to someone. I want to be missed and loved in company and I just need help. &lt;/p&gt;\n\n&lt;p&gt;I want my Mom to be happy, and I want her to respect my point of view. I want to be treated like an adult, and not mocked in every argument. I want to be the stupidest person alive and not realize the horrors that I have to &amp;quot;look forward to&amp;quot; when I grow up. I just want to be happy.&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s impossible. 17 years of trying and for her I&amp;#39;m a chore. I&amp;#39;m just a chore. I want to love my girlfriend again and I just need help from someone or something. I want to die more than I want to live and I think if this goes on for another day I just won&amp;#39;t take it anymore. It needs to end, but it&amp;#39;s hopeless. I need some sort of salvation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello Reddit. My name is Mike, and am a 17-year-old from New York. I Have a dog named Reggie, two older sisters, one younger sister, a  girlfriend, and a mother. My mother suffers from type II bipolar disorder, which has never been diagnosed but it's kind of just been known. She has months of happiness and months of utter destruction. I'm also an energetic person with a super potty-mouth, especially when talking to people on my computer. \n\nSuffice to say that me and my mother do not get along in the least. My mother is very close minded, especially on her down months. Whenever we get into an argument, she will always mock me, and no matter how much I try to tell her that the only way towards closing an arguement is to find a solution to whatever problem she wants, she just continues to argue. She always tells me that I'm just a chore to her, and it causes me to become very depressed. My mother has the biggest sway on my mood because I respect her, especially in her up months. \n\nRecently, my mother has begun screaming at me, telling me that I'm useless towards anything done in the house. I never help, and that she can't wait until my wife divorces me because I curse. She's a Christian, and I told her I was not. I don't believe in a god, so in a way, suicide is kind of my safe haven. I don't have to worry about being judged. It can all just end.\n\nI've been thinking about suicide often. Her down months have become worse and worse over the years, and she often blames me for controlling her life. My girlfriend and I don't talk about that much, and I'm not even sure if I love her like I used to anymore, and I think it's because of my depression. \n\nThere's no one left for me. I'm a hostile, bitter person. My best friend rarely talks to me because I'm so hostile and just a burden. I miss him more than I think I'll ever miss anyone. I remember the days when we used to talk for hours on end about the stupidest shit. Those days were great, and I miss them.\n\nOne thing I think I left out is the death of my Dad. He died in sept '13 and since my world has been chaos. I wish I could say I missed him more, but we never were close for the last few years of his life, something my Mom also holds against me. My Mom is severely depressed over the loss of my father, and I think it contributes to her anger towards me.\n\nShortly, I want to die. I think that there's a weight that is just too strong. The will to want to live is just not there. I have no friends that I am close with, and my Mother literally makes me want to tear the world apart with fire. I try so hard to ignore it, but after 17 years my Mom knows how to pick me apart at the source.\n\nI wish now more than ever that there's an afterlife. I want to go to it badly. I just want to be in a position where my head doesn't hurt from stifling a cry. I just want to love being. Just being. I want to look around and be proud of where I am. I just want someone to love for me, and be worried about me. I just want to mean the world to someone. I want to be missed and loved in company and I just need help. \n\nI want my Mom to be happy, and I want her to respect my point of view. I want to be treated like an adult, and not mocked in every argument. I want to be the stupidest person alive and not realize the horrors that I have to \"look forward to\" when I grow up. I just want to be happy.\n\nBut it's impossible. 17 years of trying and for her I'm a chore. I'm just a chore. I want to love my girlfriend again and I just need help from someone or something. I want to die more than I want to live and I think if this goes on for another day I just won't take it anymore. It needs to end, but it's hopeless. I need some sort of salvation.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256f3a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "1122331122", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/256f3a/my_mom_will_be_the_death_of_me/", "name": "t3_256f3a", "created": 1399715669.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/256f3a/my_mom_will_be_the_death_of_me/", "author_flair_text": null, "title": "My Mom will be the death of me", "created_utc": 1399686869.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chea3wl", "gilded": 0, "author": "maxxramman", "parent_id": "t3_256f3a", "approved_by": null, "body": "&gt;My best friend rarely talks to me because I'm so hostile and just a burden. I miss him more than I think I'll ever miss anyone. I remember the days when we used to talk for hours on end about the stupidest shit. Those days were great, and I miss them.\n\nI think the important thing is to recognize that in your short life (not trying to insinuate 17 years isn't a valuable amount of time, I'm 17 too) you have already managed to create a relationship that affects you enough to mention it here. You can and will meet more people who make you a better person, who you want to spend time with and talk to. You will find that \"salvation\" at some point. Doesn't make the present any less hard, but I think those relationships are important and worth not dying for.\n\nAlso, while my home life isn't as dire as yours, I'm not a fan of mine either, and we are both about to be old enough to make our own future. Do you feel like living alone or with a friend would make things better? Because that will be an option for you very shortly.\n\nIf you feel like you want someone to talk to, you can PM me. :D ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My best friend rarely talks to me because I&amp;#39;m so hostile and just a burden. I miss him more than I think I&amp;#39;ll ever miss anyone. I remember the days when we used to talk for hours on end about the stupidest shit. Those days were great, and I miss them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think the important thing is to recognize that in your short life (not trying to insinuate 17 years isn&amp;#39;t a valuable amount of time, I&amp;#39;m 17 too) you have already managed to create a relationship that affects you enough to mention it here. You can and will meet more people who make you a better person, who you want to spend time with and talk to. You will find that &amp;quot;salvation&amp;quot; at some point. Doesn&amp;#39;t make the present any less hard, but I think those relationships are important and worth not dying for.&lt;/p&gt;\n\n&lt;p&gt;Also, while my home life isn&amp;#39;t as dire as yours, I&amp;#39;m not a fan of mine either, and we are both about to be old enough to make our own future. Do you feel like living alone or with a friend would make things better? Because that will be an option for you very shortly.&lt;/p&gt;\n\n&lt;p&gt;If you feel like you want someone to talk to, you can PM me. :D &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256f3a", "score_hidden": false, "name": "t1_chea3wl", "created": 1399730726.0, "author_flair_text": null, "created_utc": 1399701926.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chelxeg", "gilded": 0, "author": "TakemeDayz", "parent_id": "t3_256f3a", "approved_by": null, "body": "Punch your mum in the face and live happily with your life. Fucking hell man fuck what she thinks your old and wise enough to know that ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Punch your mum in the face and live happily with your life. Fucking hell man fuck what she thinks your old and wise enough to know that &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256f3a", "score_hidden": false, "name": "t1_chelxeg", "created": 1399777677.0, "author_flair_text": null, "created_utc": 1399748877.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che5rse", "gilded": 0, "author": "Coreyshaw7589", "parent_id": "t3_256f3a", "approved_by": null, "body": "First off, you're only 17. Your life has barely even begun. Secondly, your Mother has a mental disorder and the things she says should not be taken all that personally. If she is not seeking any mental health counseling then her condition will not improve.\nThe world outside of your home or your city or your state is so big and endless as well as your opportunities. You can leave and go anywhere. Start over. \nI know it is your Mom and you are inclined to love her, but if ANYONE in your life, family or otherwise, is pushing you to suicide, it may be time to cut that person out of your life completely. \nFight hard because it's worth it. Work towards what YOU want out of life. Whether you want to be an artist or a singer or a doctor or whatever, put all of your time and effort into that and make it happen. Create a life for yourself and do what makes YOU happy. YOU are all that matters because it is YOUR life. Don't let anyone tell you what to do and NEVER let anyone take your value away from you.\nI promise that this life is worth living.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, you&amp;#39;re only 17. Your life has barely even begun. Secondly, your Mother has a mental disorder and the things she says should not be taken all that personally. If she is not seeking any mental health counseling then her condition will not improve.\nThe world outside of your home or your city or your state is so big and endless as well as your opportunities. You can leave and go anywhere. Start over. \nI know it is your Mom and you are inclined to love her, but if ANYONE in your life, family or otherwise, is pushing you to suicide, it may be time to cut that person out of your life completely. \nFight hard because it&amp;#39;s worth it. Work towards what YOU want out of life. Whether you want to be an artist or a singer or a doctor or whatever, put all of your time and effort into that and make it happen. Create a life for yourself and do what makes YOU happy. YOU are all that matters because it is YOUR life. Don&amp;#39;t let anyone tell you what to do and NEVER let anyone take your value away from you.\nI promise that this life is worth living.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256f3a", "score_hidden": false, "name": "t1_che5rse", "created": 1399716562.0, "author_flair_text": null, "created_utc": 1399687762.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]