[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Back in 2009, my mom was fired from her job after working there for a decade. It was over some HIPAA privacy issues. A coworker, lets call her Sarah mentioned that Jane had a UT problem. She then non-maliciously looked it up using her professional access. She&amp;#39;s been around these people for a decade, they worked together in a close-proximity, and they are very close emotionally, so something personal like this wouldn&amp;#39;t be an issue among them. However, some trouble-making person, lets call her Mary, told a higher up and because of this technical infraction, she had to be fired. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think she understands that it was a pure technicality, in fact I know she doesn&amp;#39;t understand that. I used to go to her job when I was in elementary and middle school when I had to do surveys and interviews for school. They are a professional sisterhood. So for some reason or another, she has taken the firing personally and still believes it is some character fault of hers or something. No one wanted her gone, except for Mary, not even the boss that fired her.&lt;/p&gt;\n\n&lt;p&gt;I helped her find another job less than a year later where she has been working ever since. Her effervescent personality had survived the firing and she has talked about her days at her new office often over the years. She laughs as she tells us about notable events and personalities at the office. &lt;/p&gt;\n\n&lt;p&gt;It has been that way since 2009, but I&amp;#39;ve always suspected that underneath all the laughter she is still depressed. She has mentioned a few times over the years that she thinks about jumping in front of the train (I live in a major city). And she mentioned it again today while my parents have been having a little quarrel.&lt;/p&gt;\n\n&lt;p&gt;This is what I don&amp;#39;t get. Neither of these events were/are personal, but she takes it personally. She doesn&amp;#39;t work in an administrative capacity, so she can&amp;#39;t feel responsible for the establishment closing. We have been financially worse when I was younger so it can&amp;#39;t be a shocking change. Even when she had no job for a period of seven months, we didn&amp;#39;t have any serious financial burdens. We are better off today since my brother also has a career now. I don&amp;#39;t know of any practical difference since her departure from her first job, and I doubt there will be any practical difference this time around. In regards to the current situation, maybe I&amp;#39;m too young to understand how an establishment&amp;#39;s financial failure can have such an emotional impact unless I myself have emotionally invested a great deal on its success (like if it was my own business). Does a job ending have the same impact regardless of the reasons surrounding its end? That seems silly.&lt;/p&gt;\n\n&lt;p&gt;She doesn&amp;#39;t walk around listlessly either. Occasional moping, but every human does that. My family on the whole is humorous and we share laughs often. My dad is a little abrasive, but there is love between them. We are a pretty emotionally healthy family. I don&amp;#39;t communicate personal things, like my distaste of their religious beliefs, or other things, but how many young adults can?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t doubt that what she feels and has expressed is real to her, but when I think about it, I have no empathy for her reasoning. None of her job issues have been personal, so who cares? And this is why I feel bad. I do not have any sympathy and it scares me. And losing her would confuse me. What should I say when she fleetingly mentions her suicidal thoughts? Should I even try to say anything? My current reaction has been just to stay quiet.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Back in 2009, my mom was fired from her job after working there for a decade. It was over some HIPAA privacy issues. A coworker, lets call her Sarah mentioned that Jane had a UT problem. She then non-maliciously looked it up using her professional access. She's been around these people for a decade, they worked together in a close-proximity, and they are very close emotionally, so something personal like this wouldn't be an issue among them. However, some trouble-making person, lets call her Mary, told a higher up and because of this technical infraction, she had to be fired. \n\nI don't think she understands that it was a pure technicality, in fact I know she doesn't understand that. I used to go to her job when I was in elementary and middle school when I had to do surveys and interviews for school. They are a professional sisterhood. So for some reason or another, she has taken the firing personally and still believes it is some character fault of hers or something. No one wanted her gone, except for Mary, not even the boss that fired her.\n\nI helped her find another job less than a year later where she has been working ever since. Her effervescent personality had survived the firing and she has talked about her days at her new office often over the years. She laughs as she tells us about notable events and personalities at the office. \n\nIt has been that way since 2009, but I've always suspected that underneath all the laughter she is still depressed. She has mentioned a few times over the years that she thinks about jumping in front of the train (I live in a major city). And she mentioned it again today while my parents have been having a little quarrel.\n\nThis is what I don't get. Neither of these events were/are personal, but she takes it personally. She doesn't work in an administrative capacity, so she can't feel responsible for the establishment closing. We have been financially worse when I was younger so it can't be a shocking change. Even when she had no job for a period of seven months, we didn't have any serious financial burdens. We are better off today since my brother also has a career now. I don't know of any practical difference since her departure from her first job, and I doubt there will be any practical difference this time around. In regards to the current situation, maybe I'm too young to understand how an establishment's financial failure can have such an emotional impact unless I myself have emotionally invested a great deal on its success (like if it was my own business). Does a job ending have the same impact regardless of the reasons surrounding its end? That seems silly.\n\nShe doesn't walk around listlessly either. Occasional moping, but every human does that. My family on the whole is humorous and we share laughs often. My dad is a little abrasive, but there is love between them. We are a pretty emotionally healthy family. I don't communicate personal things, like my distaste of their religious beliefs, or other things, but how many young adults can?\n\nI don't doubt that what she feels and has expressed is real to her, but when I think about it, I have no empathy for her reasoning. None of her job issues have been personal, so who cares? And this is why I feel bad. I do not have any sympathy and it scares me. And losing her would confuse me. What should I say when she fleetingly mentions her suicidal thoughts? Should I even try to say anything? My current reaction has been just to stay quiet.\n\nThank you for reading.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248ojj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "slightlyez", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248ojj/my_moms_place_of_work_is_closing_due_to_its/", "name": "t3_248ojj", "created": 1398764923.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248ojj/my_moms_place_of_work_is_closing_due_to_its/", "author_flair_text": null, "title": "My mom's place of work is closing due to its financial failure, but because of the past she thinks she's depressed and fleetingly mentions suicide.", "created_utc": 1398736123.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4q1sv", "gilded": 0, "author": "sofar1776", "parent_id": "t3_248ojj", "approved_by": null, "body": "It might not make sense to us, but emotions defy logic. If she is upset, then she is. It might have ties to some event that we don't know anything about. However, any threat of suicide has to be taken seriously. You not having empathy for the problem is probably that you are having a hard time seeing it. It might be that major changes are hard for her. My best advice would be to talk to Dad when Mom is not listening. Be sure he knows about her suicidal thoughts. Discuss who she could talk to. I am guessing that Mom is in the medical field from the HIPAA mention, do you know anyone who does counseling? Don't just let it slide. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might not make sense to us, but emotions defy logic. If she is upset, then she is. It might have ties to some event that we don&amp;#39;t know anything about. However, any threat of suicide has to be taken seriously. You not having empathy for the problem is probably that you are having a hard time seeing it. It might be that major changes are hard for her. My best advice would be to talk to Dad when Mom is not listening. Be sure he knows about her suicidal thoughts. Discuss who she could talk to. I am guessing that Mom is in the medical field from the HIPAA mention, do you know anyone who does counseling? Don&amp;#39;t just let it slide. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248ojj", "score_hidden": false, "name": "t1_ch4q1sv", "created": 1398768360.0, "author_flair_text": null, "created_utc": 1398739560.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]