[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone. I&amp;#39;m having some pretty nasty thoughts and of course it has something to do with a relationship. I don&amp;#39;t know how often things like this occur on here because this is my first time coming here. I hate my life right now and I can&amp;#39;t figure out what&amp;#39;s wrong with me. All I want is to just feel better. I was with this girl for two and a half years. Before her I was with a girl for four years. The things that happened with girl A influenced some things that happened with girl B. Girl B is now the love of my life and I feel like she always will be. When we started dating I was anything but good to her. I never saw her and I never paid her any attention, it haunts me every single day. My negligence lead to her cheating on me. Though I can&amp;#39;t take full responsibility I have to take some responsibility. Her cheating on me made me incredibly obsessive/possessive. I didn&amp;#39;t like for her to hang out with her friends and I wanted her to be with me 24/7. I know that was wrong and I think I knew it was wrong at the time I just had a hard time controlling it. After three months of being with me everyday and me still not paying much attention to her. she decided to leave and I didn&amp;#39;t hear from her for a whopping ten days. I found out she moved out with this guy whom I wasn&amp;#39;t a huge fan of and his girlfriend. The girlfriend part made me a little bit more comfortable. so she spends the next four days with me and then leaves out of state. When she leaves me I have a really hard time and struggle everyday. But I eventually made it through and she stayed with me the night she came home. That night I checked her phone and which I maybe had done 4 or 5 times our entire relationship, and of course I found where she had been talking to someone who lives in the same city as her family. as well as a good friend of mine I&amp;#39;ve known for many many years. She left the next day and went to her &amp;quot;friends&amp;quot; house. She got mad at me because I confronted the guy and told me she didn&amp;#39;t want to go to the movies with me so that sent off a red flag and I went over to my friends house. I walk in and see her laying in his lap, they had had sex not too long before i showed up. One of the sad things is I was trying to stay with her after and it was her telling me she didn&amp;#39;t want to be with me anymore. She came and stayed with me for about a week and a half as I tried desperately to reconcile things. THe last night she was here she went through my messages on facebook while I was sleeping and saw where I had been messaging a girl about what had happened. I chose the wrong person to talk about it because she didn&amp;#39;t want to talk about it she just wanted to forget and I still needed to talk about it. She left me while I was sleeping and I really haven&amp;#39;t heard from her since. She&amp;#39;s all I&amp;#39;ve ever wanted... Everyone is dropping around me like flies. I lost my best friend of all time, he just couldn&amp;#39;t be friends with me anymore and that hurts me everyday. I lost the first girl who was also one of my best friends and now this girl as well. It kills me on a daily fucking basis and I don&amp;#39;t know what to do about it. I have had suicidal thoughts in the past but now I feel I&amp;#39;m actually going to do it. I am at home in my bed right now so obviously I&amp;#39;m safe. But probably not for long. I plan on shooting myself though I have no handguns I have a .308 rifle and a .50 caliber black powder rifle which is what I plan on using since their will be no doubt after that... no coming back. I&amp;#39;ve never felt so alone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everyone. I'm having some pretty nasty thoughts and of course it has something to do with a relationship. I don't know how often things like this occur on here because this is my first time coming here. I hate my life right now and I can't figure out what's wrong with me. All I want is to just feel better. I was with this girl for two and a half years. Before her I was with a girl for four years. The things that happened with girl A influenced some things that happened with girl B. Girl B is now the love of my life and I feel like she always will be. When we started dating I was anything but good to her. I never saw her and I never paid her any attention, it haunts me every single day. My negligence lead to her cheating on me. Though I can't take full responsibility I have to take some responsibility. Her cheating on me made me incredibly obsessive/possessive. I didn't like for her to hang out with her friends and I wanted her to be with me 24/7. I know that was wrong and I think I knew it was wrong at the time I just had a hard time controlling it. After three months of being with me everyday and me still not paying much attention to her. she decided to leave and I didn't hear from her for a whopping ten days. I found out she moved out with this guy whom I wasn't a huge fan of and his girlfriend. The girlfriend part made me a little bit more comfortable. so she spends the next four days with me and then leaves out of state. When she leaves me I have a really hard time and struggle everyday. But I eventually made it through and she stayed with me the night she came home. That night I checked her phone and which I maybe had done 4 or 5 times our entire relationship, and of course I found where she had been talking to someone who lives in the same city as her family. as well as a good friend of mine I've known for many many years. She left the next day and went to her \"friends\" house. She got mad at me because I confronted the guy and told me she didn't want to go to the movies with me so that sent off a red flag and I went over to my friends house. I walk in and see her laying in his lap, they had had sex not too long before i showed up. One of the sad things is I was trying to stay with her after and it was her telling me she didn't want to be with me anymore. She came and stayed with me for about a week and a half as I tried desperately to reconcile things. THe last night she was here she went through my messages on facebook while I was sleeping and saw where I had been messaging a girl about what had happened. I chose the wrong person to talk about it because she didn't want to talk about it she just wanted to forget and I still needed to talk about it. She left me while I was sleeping and I really haven't heard from her since. She's all I've ever wanted... Everyone is dropping around me like flies. I lost my best friend of all time, he just couldn't be friends with me anymore and that hurts me everyday. I lost the first girl who was also one of my best friends and now this girl as well. It kills me on a daily fucking basis and I don't know what to do about it. I have had suicidal thoughts in the past but now I feel I'm actually going to do it. I am at home in my bed right now so obviously I'm safe. But probably not for long. I plan on shooting myself though I have no handguns I have a .308 rifle and a .50 caliber black powder rifle which is what I plan on using since their will be no doubt after that... no coming back. I've never felt so alone.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ylod", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Ijustwantofeelbetter", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ylod/my_name_says_it_all/", "name": "t3_24ylod", "created": 1399507661.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ylod/my_name_says_it_all/", "author_flair_text": null, "title": "My name says it all", "created_utc": 1399478861.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc03l9", "gilded": 0, "author": "Ijustwantofeelbetter", "parent_id": "t1_chbzfsh", "approved_by": null, "body": "thank you for your kind words. it really is appreciated.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you for your kind words. it really is appreciated.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chc03l9", "created": 1399489426.0, "author_flair_text": null, "created_utc": 1399485826.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc3nlh", "gilded": 0, "author": "Ijustwantofeelbetter", "parent_id": "t1_chc3mql", "approved_by": null, "body": "Do you by any chance know how I can get ahold of such a thing?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you by any chance know how I can get ahold of such a thing?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chc3nlh", "created": 1399496445.0, "author_flair_text": null, "created_utc": 1399492845.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chc3mql", "gilded": 0, "author": "taufish", "parent_id": "t1_chc0l0h", "approved_by": null, "body": "Many communities offer counseling at no cost for acute situations like yours. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many communities offer counseling at no cost for acute situations like yours. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chc3mql", "created": 1399496396.0, "author_flair_text": null, "created_utc": 1399492796.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chc4t50", "gilded": 0, "author": "taufish", "parent_id": "t1_chc0l0h", "approved_by": null, "body": "Start by a search along the lines of \"crisis center [your county/township]. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Start by a search along the lines of &amp;quot;crisis center [your county/township]. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chc4t50", "created": 1399498662.0, "author_flair_text": null, "created_utc": 1399495062.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chc0l0h", "gilded": 0, "author": "Ijustwantofeelbetter", "parent_id": "t1_chbzfsh", "approved_by": null, "body": "I've wanted to speak with a therapist for a while now. I just haven't had the finances for the past three years and that's when these unhealthy thoughts have become most prominent.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve wanted to speak with a therapist for a while now. I just haven&amp;#39;t had the finances for the past three years and that&amp;#39;s when these unhealthy thoughts have become most prominent.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chc0l0h", "created": 1399515583.0, "author_flair_text": null, "created_utc": 1399486783.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chbzfsh", "gilded": 0, "author": "taufish", "parent_id": "t3_24ylod", "approved_by": null, "body": "Hey Ijustwanttofeelbetter,\n\nThat is a difficult story, and it is understandable that you are suffering. \n\nRight now, it sounds like you're buried under anxiety, depression, and an overwhelming guilt. All three feed off each other to the point where suicide seems best. As you say, though,  there is \"no doubt after that... no coming back,\" and the guilt you express in your post tells me that you look at yourself, see faults, and that you want to make yourself a better person. That is both wise and courageous. It is also something you cannot do if you end your life. \n\nIt is difficult to analyze yourself and change yourself when you are caught in overwhelming grief. People at r/suicidewatch can help and want to help. In addition, it is helpful to work with someone face-to-face, and so I would strongly encourage you to seek help from a counselor or therapist. Counselors are often helpful because they are not mired in the situation, enabling them to help you see things about yourself that you may not want to see or may not be able to see.\n\nAgain, admitting to yourself that you have faults shows great courage and integrity. Please use your inherent strength and work on your life instead of ending it. If the guns are a temptation, please go to a crisis center or medical facility to ensure your safety. The next steps can begin once you're safe.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Ijustwanttofeelbetter,&lt;/p&gt;\n\n&lt;p&gt;That is a difficult story, and it is understandable that you are suffering. &lt;/p&gt;\n\n&lt;p&gt;Right now, it sounds like you&amp;#39;re buried under anxiety, depression, and an overwhelming guilt. All three feed off each other to the point where suicide seems best. As you say, though,  there is &amp;quot;no doubt after that... no coming back,&amp;quot; and the guilt you express in your post tells me that you look at yourself, see faults, and that you want to make yourself a better person. That is both wise and courageous. It is also something you cannot do if you end your life. &lt;/p&gt;\n\n&lt;p&gt;It is difficult to analyze yourself and change yourself when you are caught in overwhelming grief. People at r/suicidewatch can help and want to help. In addition, it is helpful to work with someone face-to-face, and so I would strongly encourage you to seek help from a counselor or therapist. Counselors are often helpful because they are not mired in the situation, enabling them to help you see things about yourself that you may not want to see or may not be able to see.&lt;/p&gt;\n\n&lt;p&gt;Again, admitting to yourself that you have faults shows great courage and integrity. Please use your inherent strength and work on your life instead of ending it. If the guns are a temptation, please go to a crisis center or medical facility to ensure your safety. The next steps can begin once you&amp;#39;re safe.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ylod", "score_hidden": false, "name": "t1_chbzfsh", "created": 1399513316.0, "author_flair_text": null, "created_utc": 1399484516.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]