[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was born in Canada in the 90s. Since I was a kid, I&amp;#39;ve dealt with a lot of misfortune. The only reason why I exist is because my mom took pity on a man at a bar and they had sex. When I was born (on a Friday the 13th, what a coincidence!), I even had the umbilical cord wrapped around my neck three times and almost died when I was born. My parents would always fight... I don&amp;#39;t even remember a time they were together, and they&amp;#39;d always battle custody over me and my older sister. In the end, my dad eventually won.&lt;/p&gt;\n\n&lt;p&gt;My dad was extremely neglectful and a total dick. He would always buy pets and eventually kill them because of his neglect. I tried to warn him that smoking in the house wasn&amp;#39;t a good idea, but I was just a child when they died. He didn&amp;#39;t take them to the vet because it&amp;#39;d cost money. I have painful memories of seeing them on their deathbeds. I couldn&amp;#39;t save them. Anyway, right before I moved out, he told me to go fuck off.&lt;/p&gt;\n\n&lt;p&gt;My sister is selfish and materialistic, and doesn&amp;#39;t understand me. I told her I was feeling suicidal, and the first thing she said was &amp;quot;I don&amp;#39;t want to be an accomplice.&amp;quot; That sums up our relationship.&lt;/p&gt;\n\n&lt;p&gt;I used to think my mom was someone to look up to, but I realized last year that wasn&amp;#39;t the case. There was even a period of 6 years where I didn&amp;#39;t see her. She&amp;#39;s fucking crazy too. Believes in aliens, time traveling, crop circles, chakras, government conspiracies, all that shit. She&amp;#39;s going &amp;quot;off the grid&amp;quot; - one of those &amp;quot;new age&amp;quot; types. But I didn&amp;#39;t go because I&amp;#39;m also a realist and can&amp;#39;t alienate myself from society - living in the bushes and being a tree hugger.&lt;/p&gt;\n\n&lt;p&gt;School was like a prison. I didn&amp;#39;t have any true friends and I was bullied. I&amp;#39;ve graduated now. And the friends who I thought believed in me came and gone. I just visited a high school yesterday, and I&amp;#39;ve realized how much I never want to go back. It IS a prison. Just walking past all the &amp;quot;Class of 2013, class of 2012, class of 2011&amp;quot; albums left me with a disturbing, bitter feeling of a cycle that never seems to end.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an atheist. God is a dumb delusion people want to believe in because they&amp;#39;re so afraid of death. I don&amp;#39;t want a girlfriend or kids. Ever. I&amp;#39;m not sexually attracted to women, and don&amp;#39;t want to bring anymore people into this overpopulated hellhole. We&amp;#39;re all organisms, evolved from millions of years of evolution, stuck on a floating rock in space in an inherent meaningless existence.&lt;/p&gt;\n\n&lt;p&gt;The only place I feel safe and comfortable is in my room. Well, it&amp;#39;s not even REALLY my room, I&amp;#39;m renting a basement. I&amp;#39;ll never have my own house! Why does one have to cost HALF A MILLION? I hate realtors. And I&amp;#39;m so inept - I don&amp;#39;t even know how to drive a car because I&amp;#39;m so pathetic and when I was in driver&amp;#39;s ed, I popped a tire and almost killed myself a few times - 2 inches away from hitting a bus, and I drove into the wrong lane a couple times. Ha.&lt;/p&gt;\n\n&lt;p&gt;The only place I&amp;#39;ve ever felt alive is in fantasy. Playing video games, being on the Internet, being involved with art. A lot of my favorite series are horror, like Silent Hill. I&amp;#39;m a huge horror gaming fanatic. I also like Kingdom Hearts, Final Fantasy, Persona, American McGee&amp;#39;s Alice. My favorite anime is Serial Experiments Lain, and I&amp;#39;m a Tim Burton fan.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was a minimum wage gas station cashier for 8 months. It destroyed my view of humanity and society. Now I&amp;#39;m a restaurant dishwasher, again, totally miserable and exhausting. Minimum wage, of course. I wipe sauce and rotten meat from neverending streams of dishes. If you don&amp;#39;t have a job, people and society judge the SHIT out of you. It&amp;#39;s like not having a job is a crime or something.&lt;/p&gt;\n\n&lt;p&gt;I even went on welfare, and it wasn&amp;#39;t enough to cover my rent, let alone food. Hell, my welfare assistant could barely speak English. I hate Canada&amp;#39;s government, bunch of self-centered old pricks. And I hate politicians and the like. The thought of doing minimum wage shit for 5, 10, 20, 30, 40 more years is horrifying! I can&amp;#39;t stand it any longer. I despise money. It&amp;#39;s not even about money, I just want true freedom and happiness. College is a scam anyway. If I had a dream job, it&amp;#39;d be doing concept art and video game production.&lt;/p&gt;\n\n&lt;p&gt;I hate this fucking city, and almost everyone in it. People are shallow and materialistic. The world IS overpopulated, and you&amp;#39;d have to be a complete dumbass and in severe denial to not realize it. This system is corrupt, especially when hyper-capitalism and money controls people&amp;#39;s lives and actions. Fuck bills.&lt;/p&gt;\n\n&lt;p&gt;No one cares about the real problems in the world. I&amp;#39;m vegetarian, and the thought of millions of animals being slaughtered and killed for people&amp;#39;s tastebuds is horrifying and disturbing. Social inequality? What a joke! Everyone ignores the homeless people sitting on the sidewalks in downtown&amp;#39;s streets right outside the shopping mall. It&amp;#39;s extremely hard to find people in this world who feel like actual real human beings.&lt;/p&gt;\n\n&lt;p&gt;When I talk to people about how I feel, they always tell me I have a &amp;quot;chemical balance&amp;quot; in my brain and act as if it&amp;#39;s MY fault I feel this way, and tell me I should drug myself up with anti-depressants. What kind of fucking world do we live in, where we need to drug ourselves up in order to be happy?&lt;/p&gt;\n\n&lt;p&gt;In December 2012, my grandma died in an apartment fire, and left me with a little inheritance. I plan on using it to go on a trip around the world, meeting all the friends that ever mattered to me. I plan on doing this roadtrip in July. I&amp;#39;ve never stepped a foot outside Canada.&lt;/p&gt;\n\n&lt;p&gt;Then I&amp;#39;m probably going to find a way to commit suicide - somehow, I don&amp;#39;t know. Too bad assisted suicide is illegal. Just one more fucking thing in this world I hate.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t feel like I belong in this world or society. I don&amp;#39;t feel Earth is my home. What&amp;#39;s the point of living? We just grow old and die anyway. I don&amp;#39;t believe it&amp;#39;s &amp;quot;young adult angst&amp;quot;, I know I&amp;#39;ll be feeling this way for the rest of my life. The thought of sleeping forever and the void seems very welcoming.&lt;/p&gt;\n\n&lt;p&gt;Why am I posting this here? I don&amp;#39;t even know. I guess I just want to leave a trace of my story behind in this mad world. This world is chaos. I can&amp;#39;t save the animals, and I can&amp;#39;t save any children because adults and society corrupt them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was born in Canada in the 90s. Since I was a kid, I've dealt with a lot of misfortune. The only reason why I exist is because my mom took pity on a man at a bar and they had sex. When I was born (on a Friday the 13th, what a coincidence!), I even had the umbilical cord wrapped around my neck three times and almost died when I was born. My parents would always fight... I don't even remember a time they were together, and they'd always battle custody over me and my older sister. In the end, my dad eventually won.\n\nMy dad was extremely neglectful and a total dick. He would always buy pets and eventually kill them because of his neglect. I tried to warn him that smoking in the house wasn't a good idea, but I was just a child when they died. He didn't take them to the vet because it'd cost money. I have painful memories of seeing them on their deathbeds. I couldn't save them. Anyway, right before I moved out, he told me to go fuck off.\n\nMy sister is selfish and materialistic, and doesn't understand me. I told her I was feeling suicidal, and the first thing she said was \"I don't want to be an accomplice.\" That sums up our relationship.\n\nI used to think my mom was someone to look up to, but I realized last year that wasn't the case. There was even a period of 6 years where I didn't see her. She's fucking crazy too. Believes in aliens, time traveling, crop circles, chakras, government conspiracies, all that shit. She's going \"off the grid\" - one of those \"new age\" types. But I didn't go because I'm also a realist and can't alienate myself from society - living in the bushes and being a tree hugger.\n\nSchool was like a prison. I didn't have any true friends and I was bullied. I've graduated now. And the friends who I thought believed in me came and gone. I just visited a high school yesterday, and I've realized how much I never want to go back. It IS a prison. Just walking past all the \"Class of 2013, class of 2012, class of 2011\" albums left me with a disturbing, bitter feeling of a cycle that never seems to end.\n\nI'm an atheist. God is a dumb delusion people want to believe in because they're so afraid of death. I don't want a girlfriend or kids. Ever. I'm not sexually attracted to women, and don't want to bring anymore people into this overpopulated hellhole. We're all organisms, evolved from millions of years of evolution, stuck on a floating rock in space in an inherent meaningless existence.\n\nThe only place I feel safe and comfortable is in my room. Well, it's not even REALLY my room, I'm renting a basement. I'll never have my own house! Why does one have to cost HALF A MILLION? I hate realtors. And I'm so inept - I don't even know how to drive a car because I'm so pathetic and when I was in driver's ed, I popped a tire and almost killed myself a few times - 2 inches away from hitting a bus, and I drove into the wrong lane a couple times. Ha.\n\nThe only place I've ever felt alive is in fantasy. Playing video games, being on the Internet, being involved with art. A lot of my favorite series are horror, like Silent Hill. I'm a huge horror gaming fanatic. I also like Kingdom Hearts, Final Fantasy, Persona, American McGee's Alice. My favorite anime is Serial Experiments Lain, and I'm a Tim Burton fan.\n\nAnyway, I was a minimum wage gas station cashier for 8 months. It destroyed my view of humanity and society. Now I'm a restaurant dishwasher, again, totally miserable and exhausting. Minimum wage, of course. I wipe sauce and rotten meat from neverending streams of dishes. If you don't have a job, people and society judge the SHIT out of you. It's like not having a job is a crime or something.\n\nI even went on welfare, and it wasn't enough to cover my rent, let alone food. Hell, my welfare assistant could barely speak English. I hate Canada's government, bunch of self-centered old pricks. And I hate politicians and the like. The thought of doing minimum wage shit for 5, 10, 20, 30, 40 more years is horrifying! I can't stand it any longer. I despise money. It's not even about money, I just want true freedom and happiness. College is a scam anyway. If I had a dream job, it'd be doing concept art and video game production.\n\nI hate this fucking city, and almost everyone in it. People are shallow and materialistic. The world IS overpopulated, and you'd have to be a complete dumbass and in severe denial to not realize it. This system is corrupt, especially when hyper-capitalism and money controls people's lives and actions. Fuck bills.\n\nNo one cares about the real problems in the world. I'm vegetarian, and the thought of millions of animals being slaughtered and killed for people's tastebuds is horrifying and disturbing. Social inequality? What a joke! Everyone ignores the homeless people sitting on the sidewalks in downtown's streets right outside the shopping mall. It's extremely hard to find people in this world who feel like actual real human beings.\n\nWhen I talk to people about how I feel, they always tell me I have a \"chemical balance\" in my brain and act as if it's MY fault I feel this way, and tell me I should drug myself up with anti-depressants. What kind of fucking world do we live in, where we need to drug ourselves up in order to be happy?\n\nIn December 2012, my grandma died in an apartment fire, and left me with a little inheritance. I plan on using it to go on a trip around the world, meeting all the friends that ever mattered to me. I plan on doing this roadtrip in July. I've never stepped a foot outside Canada.\n\nThen I'm probably going to find a way to commit suicide - somehow, I don't know. Too bad assisted suicide is illegal. Just one more fucking thing in this world I hate.\n\nI don't feel like I belong in this world or society. I don't feel Earth is my home. What's the point of living? We just grow old and die anyway. I don't believe it's \"young adult angst\", I know I'll be feeling this way for the rest of my life. The thought of sleeping forever and the void seems very welcoming.\n\nWhy am I posting this here? I don't even know. I guess I just want to leave a trace of my story behind in this mad world. This world is chaos. I can't save the animals, and I can't save any children because adults and society corrupt them.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25503d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "AlexKaza", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399663776.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 9, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25503d/my_plan/", "name": "t3_25503d", "created": 1399681496.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25503d/my_plan/", "author_flair_text": null, "title": "My plan.", "created_utc": 1399652696.0, "ups": 18, "num_comments": 13, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdw1lm", "gilded": 0, "author": "ArrogantWhale", "parent_id": "t1_chdv74n", "approved_by": null, "body": "I'm glad I was able to help, either way, the trip sure will be an experience", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad I was able to help, either way, the trip sure will be an experience&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdw1lm", "created": 1399693290.0, "author_flair_text": null, "created_utc": 1399664490.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chdv74n", "gilded": 0, "author": "AlexKaza", "parent_id": "t1_chdv1ws", "approved_by": null, "body": "Thanks, it means a lot. I feel like the weight of the world is on my shoulders, because, like, you said, life and reality are your entire world and once you're gone, it's over. I just want to see if it'll help clear my head, or re-enforce the negative feelings I already have. And I made a promise to my friends that I'd see them.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, it means a lot. I feel like the weight of the world is on my shoulders, because, like, you said, life and reality are your entire world and once you&amp;#39;re gone, it&amp;#39;s over. I just want to see if it&amp;#39;ll help clear my head, or re-enforce the negative feelings I already have. And I made a promise to my friends that I&amp;#39;d see them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdv74n", "created": 1399691547.0, "author_flair_text": null, "created_utc": 1399662747.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chdv1ws", "gilded": 0, "author": "ArrogantWhale", "parent_id": "t1_chdusbp", "approved_by": null, "body": "I don't know what it really was that got it all started, it may have been hormones and it might have been something else. I love where I am now, I constantly am trying to grow my intellect and understanding of the world, I feel invincible even. Also, you don't have to fight for humanity you just have to strive to be the best person you can see and I can tell you do because of how much you care. You choose to be a vegetarian so animals won't have to suffer, that's a huge life choice and you made it because you thought it was important. I think you should take that road trip, go visit the Grand Canyon, go see Yellowstone, go climb a mountain. But don't just see them, get to know them understand them think about how beautiful they are. Make some awesome memories that you would be proud to look back on and say \"wow I really did that\" but don't use the road trip to kill yourself. Use it to become, in a way, reborn.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what it really was that got it all started, it may have been hormones and it might have been something else. I love where I am now, I constantly am trying to grow my intellect and understanding of the world, I feel invincible even. Also, you don&amp;#39;t have to fight for humanity you just have to strive to be the best person you can see and I can tell you do because of how much you care. You choose to be a vegetarian so animals won&amp;#39;t have to suffer, that&amp;#39;s a huge life choice and you made it because you thought it was important. I think you should take that road trip, go visit the Grand Canyon, go see Yellowstone, go climb a mountain. But don&amp;#39;t just see them, get to know them understand them think about how beautiful they are. Make some awesome memories that you would be proud to look back on and say &amp;quot;wow I really did that&amp;quot; but don&amp;#39;t use the road trip to kill yourself. Use it to become, in a way, reborn.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdv1ws", "created": 1399691248.0, "author_flair_text": null, "created_utc": 1399662448.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chdusbp", "gilded": 0, "author": "AlexKaza", "parent_id": "t1_chdtvkd", "approved_by": null, "body": "Umm... thanks.\n\nSo what made you really depressed in the first place? And do you like where you are now? I just don't believe humanity, in its current state, is worth fighting for.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Umm... thanks.&lt;/p&gt;\n\n&lt;p&gt;So what made you really depressed in the first place? And do you like where you are now? I just don&amp;#39;t believe humanity, in its current state, is worth fighting for.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdusbp", "created": 1399690701.0, "author_flair_text": null, "created_utc": 1399661901.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chdtvkd", "gilded": 0, "author": "ArrogantWhale", "parent_id": "t3_25503d", "approved_by": null, "body": "I saw that you said you were an Atheist, I am as well and if I've learned anything from being one it's that live is the most important thing there is no matter how hard it gets. Before I made the switch to Atheism i was a catholic, I grew up in a catholic family so that's just the way things were, anyway I had an incredibly crushing bout of depression at a very crucial time in my life (summer before freshman year in high school) I was a complete wreck and I had convinced myself that suicide was the answer, I had always been told there was a \"heaven\" a \"better place\" after death and that was so, so incredibly appealing. I wanted that so bad. So there I was, home alone and a knife in hand planning to end it all (my \"plan\" was pretty dumb and I'd rather not go into it) , I didn't write a note because I didn't feel like I could put what was going on in my mind on paper. All I could think was, my parents weren't there for me, my friends weren't there for me, and finally **finally** I would find some happiness. But then I paused and I thought. Every kid has believed in Santa Claus, why don't they question the existence of the jolly man until later? Because they want presents, hell yeah who doesn't, Santa would only ever come to your house if you believed in him. I wished up to it when I thought about how crazy that story sounds, none of the things he does should be physically possible, and that's because he doesn't actually exist. At this moment of life and death for myself I applied the same logic to God. It was like my eyes opened the first time, I saw how there was no heaven, no after *this*. And just like that *snap* I was free, I wasn't sad anymore and life didn't feel so heavy. I put the knife back and I went to sit out side and watch the birds sing and the other animals do their thing and I just, I guess the only word for it is pondered. I thought about how if there was no heaven and this was it then I sure as hell wasn't gonna be the reason I died. I realized at that time just how dangerous the thought of something better than life is. Because in truth as bad as life is and as rough as it gets that's all there is and that's why it's so great.\n\nI apologize for boring you with my story but I thought it was important and I hope that now that I have opened myself up to you that you may open yourself up to me, and we can figure all this out.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw that you said you were an Atheist, I am as well and if I&amp;#39;ve learned anything from being one it&amp;#39;s that live is the most important thing there is no matter how hard it gets. Before I made the switch to Atheism i was a catholic, I grew up in a catholic family so that&amp;#39;s just the way things were, anyway I had an incredibly crushing bout of depression at a very crucial time in my life (summer before freshman year in high school) I was a complete wreck and I had convinced myself that suicide was the answer, I had always been told there was a &amp;quot;heaven&amp;quot; a &amp;quot;better place&amp;quot; after death and that was so, so incredibly appealing. I wanted that so bad. So there I was, home alone and a knife in hand planning to end it all (my &amp;quot;plan&amp;quot; was pretty dumb and I&amp;#39;d rather not go into it) , I didn&amp;#39;t write a note because I didn&amp;#39;t feel like I could put what was going on in my mind on paper. All I could think was, my parents weren&amp;#39;t there for me, my friends weren&amp;#39;t there for me, and finally &lt;strong&gt;finally&lt;/strong&gt; I would find some happiness. But then I paused and I thought. Every kid has believed in Santa Claus, why don&amp;#39;t they question the existence of the jolly man until later? Because they want presents, hell yeah who doesn&amp;#39;t, Santa would only ever come to your house if you believed in him. I wished up to it when I thought about how crazy that story sounds, none of the things he does should be physically possible, and that&amp;#39;s because he doesn&amp;#39;t actually exist. At this moment of life and death for myself I applied the same logic to God. It was like my eyes opened the first time, I saw how there was no heaven, no after &lt;em&gt;this&lt;/em&gt;. And just like that &lt;em&gt;snap&lt;/em&gt; I was free, I wasn&amp;#39;t sad anymore and life didn&amp;#39;t feel so heavy. I put the knife back and I went to sit out side and watch the birds sing and the other animals do their thing and I just, I guess the only word for it is pondered. I thought about how if there was no heaven and this was it then I sure as hell wasn&amp;#39;t gonna be the reason I died. I realized at that time just how dangerous the thought of something better than life is. Because in truth as bad as life is and as rough as it gets that&amp;#39;s all there is and that&amp;#39;s why it&amp;#39;s so great.&lt;/p&gt;\n\n&lt;p&gt;I apologize for boring you with my story but I thought it was important and I hope that now that I have opened myself up to you that you may open yourself up to me, and we can figure all this out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdtvkd", "created": 1399688806.0, "author_flair_text": null, "created_utc": 1399660006.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdz0v7", "gilded": 0, "author": "sardonic_clam", "parent_id": "t3_25503d", "approved_by": null, "body": "Hi I agree with most of what you are saying, the world is a kind of chaos if your not wealthy and cant make any permanent change. You're still a young guy, do you think you could study or work yourself up to a job you enjoyed? There are a few employers/jobs with a social conscience.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi I agree with most of what you are saying, the world is a kind of chaos if your not wealthy and cant make any permanent change. You&amp;#39;re still a young guy, do you think you could study or work yourself up to a job you enjoyed? There are a few employers/jobs with a social conscience.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdz0v7", "created": 1399699805.0, "author_flair_text": null, "created_utc": 1399671005.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che533q", "gilded": 0, "author": "DoinDande", "parent_id": "t3_25503d", "approved_by": null, "body": "I think you should definitely follow through on that road trip idea. I totally agree that there is a lot of greed and ugly in the world. However I think that you'll find a lot more good than bad out there if you take the chance to explore. Not sure what your money situation is, but there are people who make it on these trips with just a backpack of supplies to their names.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should definitely follow through on that road trip idea. I totally agree that there is a lot of greed and ugly in the world. However I think that you&amp;#39;ll find a lot more good than bad out there if you take the chance to explore. Not sure what your money situation is, but there are people who make it on these trips with just a backpack of supplies to their names.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_che533q", "created": 1399714757.0, "author_flair_text": null, "created_utc": 1399685957.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdxr6u", "gilded": 0, "author": "AlexKaza", "parent_id": "t1_chdxpoo", "approved_by": null, "body": "Don't let the door hit you on the way out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t let the door hit you on the way out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdxr6u", "created": 1399696939.0, "author_flair_text": null, "created_utc": 1399668139.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdxpoo", "gilded": 0, "author": "[deleted]", "parent_id": "t1_chduuz1", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdxpoo", "created": 1399696844.0, "author_flair_text": null, "created_utc": 1399668044.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chduuz1", "gilded": 0, "author": "AlexKaza", "parent_id": "t1_chdthen", "approved_by": null, "body": "I don't care about any of that anyway, it's of no relevance to me, nor is it any of my business. You totally missed the point of my post - TLDR, my mom is out of my life for good.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t care about any of that anyway, it&amp;#39;s of no relevance to me, nor is it any of my business. You totally missed the point of my post - TLDR, my mom is out of my life for good.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chduuz1", "created": 1399690854.0, "author_flair_text": null, "created_utc": 1399662054.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "chdthen", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25503d", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 8, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25503d", "score_hidden": false, "name": "t1_chdthen", "created": 1399687995.0, "author_flair_text": null, "created_utc": 1399659195.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]