[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m only 16 and my hairline is forming a V. I pretended not to care but I told my boyfriend and he said that he&amp;#39;d love me no matter what. It feels like he&amp;#39;s the only one that could do that. I fear losing him really much. We are just teenagers, how long is it going to last? He has a full head of hair forming a nice П. Maybe I like him because I want to BE him because of his hairline and personality of being so lovable. On top of it all I can&amp;#39;t bring myself to say I love him but he says it all the time and I think he&amp;#39;s avoiding me the past 2 days because of that.&lt;/p&gt;\n\n&lt;p&gt;Yesterday I cried because of my hair and now I&amp;#39;m contemplating suicide. School hasn&amp;#39;t been going well, my relationship with my parents has deteriorated because they are extremely homophobic. I can&amp;#39;t imagine myself being a functional part of society. Is there any point to live?&lt;/p&gt;\n\n&lt;p&gt;To note, I&amp;#39;ve been visiting a psychologist but it hasn&amp;#39;t been helping me a lot.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm only 16 and my hairline is forming a V. I pretended not to care but I told my boyfriend and he said that he'd love me no matter what. It feels like he's the only one that could do that. I fear losing him really much. We are just teenagers, how long is it going to last? He has a full head of hair forming a nice П. Maybe I like him because I want to BE him because of his hairline and personality of being so lovable. On top of it all I can't bring myself to say I love him but he says it all the time and I think he's avoiding me the past 2 days because of that.\n\nYesterday I cried because of my hair and now I'm contemplating suicide. School hasn't been going well, my relationship with my parents has deteriorated because they are extremely homophobic. I can't imagine myself being a functional part of society. Is there any point to live?\n\nTo note, I've been visiting a psychologist but it hasn't been helping me a lot.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "253z6v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "asklke", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/253z6v/my_receding_hairline_is_killing_me/", "name": "t3_253z6v", "created": 1399646011.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/253z6v/my_receding_hairline_is_killing_me/", "author_flair_text": null, "title": "My receding hairline is killing me", "created_utc": 1399617211.0, "ups": 5, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdgp2t", "gilded": 0, "author": "splinteredruler", "parent_id": "t3_253z6v", "approved_by": null, "body": "Great to hear you're speaking to a psychologist. Have you had some difficulties building a rapport? Do you feel as though it might be better for you to see a different specialist if this one is not helping you? It might help to list what you want to get out of psychology and possible reasons you feel as though you have not met this.\n\nHow long will your relationship with your boyfriend last? That's very hard to tell. Throughout life we will form many different relationships - both platonic and romantic - and hopefully gain some good things from this. What reasons do you think you're holding back from saying you love your boyfriend? Have you spoken to him about what you're feeling?\n\nIt might be worth speaking to your teachers about your difficulties in school. Is it based around academia? Perhaps you could find tuition or schedule some extra time with your teachers?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great to hear you&amp;#39;re speaking to a psychologist. Have you had some difficulties building a rapport? Do you feel as though it might be better for you to see a different specialist if this one is not helping you? It might help to list what you want to get out of psychology and possible reasons you feel as though you have not met this.&lt;/p&gt;\n\n&lt;p&gt;How long will your relationship with your boyfriend last? That&amp;#39;s very hard to tell. Throughout life we will form many different relationships - both platonic and romantic - and hopefully gain some good things from this. What reasons do you think you&amp;#39;re holding back from saying you love your boyfriend? Have you spoken to him about what you&amp;#39;re feeling?&lt;/p&gt;\n\n&lt;p&gt;It might be worth speaking to your teachers about your difficulties in school. Is it based around academia? Perhaps you could find tuition or schedule some extra time with your teachers?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdgp2t", "created": 1399647124.0, "author_flair_text": null, "created_utc": 1399618324.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdj65y", "gilded": 0, "author": "scumbagputin", "parent_id": "t3_253z6v", "approved_by": null, "body": "Hey yo. I'm going bald too. \n\nAnd my insecurity got the better of me, too. It got the better of me to the point where i started investigating how i might reverse the effects. It turns out it is very much possible, through dermatological pharmaceuticals, and other drugs. They cost me money, but they keep my hair on my head, and my mood slightly more elevated. Your appearance really does affect your self esteem. Hit me up if you wana know a bit more.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey yo. I&amp;#39;m going bald too. &lt;/p&gt;\n\n&lt;p&gt;And my insecurity got the better of me, too. It got the better of me to the point where i started investigating how i might reverse the effects. It turns out it is very much possible, through dermatological pharmaceuticals, and other drugs. They cost me money, but they keep my hair on my head, and my mood slightly more elevated. Your appearance really does affect your self esteem. Hit me up if you wana know a bit more.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdj65y", "created": 1399661373.0, "author_flair_text": null, "created_utc": 1399632573.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdra96", "gilded": 0, "author": "AlexKaza", "parent_id": "t3_253z6v", "approved_by": null, "body": "Why not get a wig, if worse comes to worst?\n\nhttp://www.newattitudewigs.com/mens.html\n\nSome wigs are very sexy and look totally legit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not get a wig, if worse comes to worst?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.newattitudewigs.com/mens.html\"&gt;http://www.newattitudewigs.com/mens.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some wigs are very sexy and look totally legit.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdra96", "created": 1399683428.0, "author_flair_text": null, "created_utc": 1399654628.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdguv1", "gilded": 0, "author": "asklke", "parent_id": "t1_chdgls2", "approved_by": null, "body": "That just raises the question \"Why me?\". I've seen people my age shave their heads while they have a full head of hair. Why do I have to be bald while people who want to be bald have a full head of hair?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That just raises the question &amp;quot;Why me?&amp;quot;. I&amp;#39;ve seen people my age shave their heads while they have a full head of hair. Why do I have to be bald while people who want to be bald have a full head of hair?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdguv1", "created": 1399647850.0, "author_flair_text": null, "created_utc": 1399619050.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chdgls2", "gilded": 0, "author": "nickotiger", "parent_id": "t3_253z6v", "approved_by": null, "body": "My hair also started falling off when I was about 16. I knew one day I would go bald, as my dad's hair fell off but man did I not expect it to happen so soon. I have been fortunate enough that it has stopped falling off these past few years but I still have pretty wide gaps between each individual hair. Losing your hair seems really bad, but when you think about it, it doesn't really matter. Try to ask yourself, what is hair? Is it something important? No. Are there many people who don't have hair? Yes. Have some of those people lost their hair when they were young? Absolutely. Will it happen to people I know? Statistically speaking, yes, it will happen to most people you know eventually. You are not hair, your hair is not part of who you are. Hair is in the exterior, but who you are is inside of you. Hair or no hair, that won't change. Don't let it change you!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My hair also started falling off when I was about 16. I knew one day I would go bald, as my dad&amp;#39;s hair fell off but man did I not expect it to happen so soon. I have been fortunate enough that it has stopped falling off these past few years but I still have pretty wide gaps between each individual hair. Losing your hair seems really bad, but when you think about it, it doesn&amp;#39;t really matter. Try to ask yourself, what is hair? Is it something important? No. Are there many people who don&amp;#39;t have hair? Yes. Have some of those people lost their hair when they were young? Absolutely. Will it happen to people I know? Statistically speaking, yes, it will happen to most people you know eventually. You are not hair, your hair is not part of who you are. Hair is in the exterior, but who you are is inside of you. Hair or no hair, that won&amp;#39;t change. Don&amp;#39;t let it change you!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdgls2", "created": 1399646708.0, "author_flair_text": null, "created_utc": 1399617908.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdljms", "gilded": 0, "author": "m-fawksy", "parent_id": "t3_253z6v", "approved_by": null, "body": "You sound a lot like a good friend of mine. He started losing his hair in his mid-teens and was extremely insecure about it. That, combined with some bad relationships and other stuff, sent him into deep depression he thought he'd never get out of. He thought about killing himself when he was 16, too. Now, though, he's 22 and went back to university, started a political career on the side and is in a long-term relationship with a guy he's deeply in love with. He's happier than he's ever been, and the thought that he could've killed himself when he was so young and missed out on all of that makes me very sad. Please don't do it. If you're thinking of killing yourself, you have nothing to lose, right? So why not just hold out a few more years and see what happens? You'll change a lot in the coming years, by the time you're 20 you might not even care about your hairline. Don't leave now and miss out on what could be the best part of your life.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound a lot like a good friend of mine. He started losing his hair in his mid-teens and was extremely insecure about it. That, combined with some bad relationships and other stuff, sent him into deep depression he thought he&amp;#39;d never get out of. He thought about killing himself when he was 16, too. Now, though, he&amp;#39;s 22 and went back to university, started a political career on the side and is in a long-term relationship with a guy he&amp;#39;s deeply in love with. He&amp;#39;s happier than he&amp;#39;s ever been, and the thought that he could&amp;#39;ve killed himself when he was so young and missed out on all of that makes me very sad. Please don&amp;#39;t do it. If you&amp;#39;re thinking of killing yourself, you have nothing to lose, right? So why not just hold out a few more years and see what happens? You&amp;#39;ll change a lot in the coming years, by the time you&amp;#39;re 20 you might not even care about your hairline. Don&amp;#39;t leave now and miss out on what could be the best part of your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253z6v", "score_hidden": false, "name": "t1_chdljms", "created": 1399670681.0, "author_flair_text": null, "created_utc": 1399641881.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]