[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night my sister went missing and was found after taking a bottle of prescription sleeping pills. She was found in time and was committed for the next five days. I am flying home to be the one to pick her up from the hospital. I do not know who else to ask for help. I have never suffered depression, but I do not deny the power that this can have. I need help with how to help my sister. How do I support my suicidal sister? How do I talk to my juvenile sister, who has been kept in the dark about this situation? How can I support my older sister when she is coming out of this? I am so lost about how to approach this. Any help would be welcome. Thank you all so much&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last night my sister went missing and was found after taking a bottle of prescription sleeping pills. She was found in time and was committed for the next five days. I am flying home to be the one to pick her up from the hospital. I do not know who else to ask for help. I have never suffered depression, but I do not deny the power that this can have. I need help with how to help my sister. How do I support my suicidal sister? How do I talk to my juvenile sister, who has been kept in the dark about this situation? How can I support my older sister when she is coming out of this? I am so lost about how to approach this. Any help would be welcome. Thank you all so much", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256vv5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thepinkalbumn", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/256vv5/my_sister_attempted_suicide_i_need_help/", "name": "t3_256vv5", "created": 1399730984.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/256vv5/my_sister_attempted_suicide_i_need_help/", "author_flair_text": null, "title": "My sister attempted Suicide, I need help", "created_utc": 1399702184.0, "ups": 7, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chebc74", "gilded": 0, "author": "syslinkdown", "parent_id": "t1_cheb15i", "approved_by": null, "body": "To add to this, if she can't trust _everyone_ at once and let _everyone_ in at once, that's okay. If she can trust you (or whoever she's most comfortable with) and confide in them that's fine. You can't always jump into that cold pool all at once. Maybe everyone knows, but that's not the same as facing and talking to all of them about it right away. Take it slow, and realize that the priority is helping her and being with her, not getting answers. Talking about it is really important. Helping your sister get to the place where she can do that may be hard.\n\nPlease remember to think of yourself, too. You're a damn fine sibling for doing this, and just remember that you need to take care of yourself as well through this. You can't help her if you don't take care of yourself. **Thank you** for doing this for your sister. It means more to her than you realize, I promise.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to this, if she can&amp;#39;t trust &lt;em&gt;everyone&lt;/em&gt; at once and let &lt;em&gt;everyone&lt;/em&gt; in at once, that&amp;#39;s okay. If she can trust you (or whoever she&amp;#39;s most comfortable with) and confide in them that&amp;#39;s fine. You can&amp;#39;t always jump into that cold pool all at once. Maybe everyone knows, but that&amp;#39;s not the same as facing and talking to all of them about it right away. Take it slow, and realize that the priority is helping her and being with her, not getting answers. Talking about it is really important. Helping your sister get to the place where she can do that may be hard.&lt;/p&gt;\n\n&lt;p&gt;Please remember to think of yourself, too. You&amp;#39;re a damn fine sibling for doing this, and just remember that you need to take care of yourself as well through this. You can&amp;#39;t help her if you don&amp;#39;t take care of yourself. &lt;strong&gt;Thank you&lt;/strong&gt; for doing this for your sister. It means more to her than you realize, I promise.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256vv5", "score_hidden": false, "name": "t1_chebc74", "created": 1399736632.0, "author_flair_text": null, "created_utc": 1399707832.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "cheb15i", "gilded": 0, "author": "ninosmr", "parent_id": "t3_256vv5", "approved_by": null, "body": "Explain to your younger sister the situation very clearly. Tell her that her sister is not feeling well at all, and that you both need to help and support her until she feels better. And then do that. Talk to your older sister and really talk to her, make her tell you what the problem is. Sometimes, people don't want to say and try to take it by themselves, but that's not the way it should be. Make her know that she can trust you and your younger sister and your parents too, and do everything you can to love and support her until she breaks out of her depression. \n\nAlso, just as a note, when I say \"make her\" I mean always be gentle, never outright force her to do anything, this will just make her less comfortable. Just ease her into talking to you about her problem, and the more comfortable she is, the more you can help her out. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Explain to your younger sister the situation very clearly. Tell her that her sister is not feeling well at all, and that you both need to help and support her until she feels better. And then do that. Talk to your older sister and really talk to her, make her tell you what the problem is. Sometimes, people don&amp;#39;t want to say and try to take it by themselves, but that&amp;#39;s not the way it should be. Make her know that she can trust you and your younger sister and your parents too, and do everything you can to love and support her until she breaks out of her depression. &lt;/p&gt;\n\n&lt;p&gt;Also, just as a note, when I say &amp;quot;make her&amp;quot; I mean always be gentle, never outright force her to do anything, this will just make her less comfortable. Just ease her into talking to you about her problem, and the more comfortable she is, the more you can help her out. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256vv5", "score_hidden": false, "name": "t1_cheb15i", "created": 1399734943.0, "author_flair_text": null, "created_utc": 1399706143.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheb9ny", "gilded": 0, "author": "Lucarian", "parent_id": "t3_256vv5", "approved_by": null, "body": "Just be there for your sister. Talk to her and let her know you care about her. Hopefully she would feel comfortable enough talking to you to perhaps open up a bit on what she had the most difficulties with (for example, I have a massive issue going to School, usually I spend all day in bed depressed) and provide gentle encouragement and let her know that you are proud when she manages to overcome it and that she has a support system.\n\nMy information may not be too relevant as depression is very different for different people, but I find this works best for me and some other people I know. You can't make her talk to you or force her to get better, but you can let her know she has all of your love and support. [These hyperbole and a half comic strips I believe are very informative](http://hyperboleandahalf.blogspot.com.au/2011/10/adventures-in-depression.html) [of what depression might feel like to someone who doesn't have it.](http://hyperboleandahalf.blogspot.com.au/2013/05/depression-part-two.html) Also, the most ridiculous part about depression is you know most of the things shouldn't be upsetting you or making you feel that way, and that generally makes it worse.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just be there for your sister. Talk to her and let her know you care about her. Hopefully she would feel comfortable enough talking to you to perhaps open up a bit on what she had the most difficulties with (for example, I have a massive issue going to School, usually I spend all day in bed depressed) and provide gentle encouragement and let her know that you are proud when she manages to overcome it and that she has a support system.&lt;/p&gt;\n\n&lt;p&gt;My information may not be too relevant as depression is very different for different people, but I find this works best for me and some other people I know. You can&amp;#39;t make her talk to you or force her to get better, but you can let her know she has all of your love and support. &lt;a href=\"http://hyperboleandahalf.blogspot.com.au/2011/10/adventures-in-depression.html\"&gt;These hyperbole and a half comic strips I believe are very informative&lt;/a&gt; &lt;a href=\"http://hyperboleandahalf.blogspot.com.au/2013/05/depression-part-two.html\"&gt;of what depression might feel like to someone who doesn&amp;#39;t have it.&lt;/a&gt; Also, the most ridiculous part about depression is you know most of the things shouldn&amp;#39;t be upsetting you or making you feel that way, and that generally makes it worse.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256vv5", "score_hidden": false, "name": "t1_cheb9ny", "created": 1399736243.0, "author_flair_text": null, "created_utc": 1399707443.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "checdj6", "gilded": 0, "author": "ClassifiedServices", "parent_id": "t3_256vv5", "approved_by": null, "body": "As someone who suffers from depression can I please offer my perspective. \nYou will want to talk to her about the incident that drove her to attempt. Out of your love for her and the understandable fear of losing her you'll want to talk about \"what made her do it\" and \"why?\". \nMy suggestion is to try and be the rock, don't force the issue wait for your sister to table the subject and talk with you about it. Your younger sister shouldn't be involved until your older sister is comfortable with her knowing. Everyone is entitled to privacy.\nWishing you well. \n\n", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who suffers from depression can I please offer my perspective. \nYou will want to talk to her about the incident that drove her to attempt. Out of your love for her and the understandable fear of losing her you&amp;#39;ll want to talk about &amp;quot;what made her do it&amp;quot; and &amp;quot;why?&amp;quot;. \nMy suggestion is to try and be the rock, don&amp;#39;t force the issue wait for your sister to table the subject and talk with you about it. Your younger sister shouldn&amp;#39;t be involved until your older sister is comfortable with her knowing. Everyone is entitled to privacy.\nWishing you well. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256vv5", "score_hidden": false, "name": "t1_checdj6", "created": 1399743297.0, "author_flair_text": null, "created_utc": 1399714497.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheb2zh", "gilded": 0, "author": "soup_d_up", "parent_id": "t3_256vv5", "approved_by": null, "body": "I had a close friend commit suicide two years ago. It was hard to come to terms with what she did. I was upset at her. I felt that her actions were selfish for a while. Mostly because I couldn't understand what she was going though. What helped me come to terms with realizing first and foremost that depression and feelings of suicide are at their base caused by chemical imbalances in the brain. Realizing that it's a physical problem and not just an 'emotional problem' removes any judgement all feelings one can have. There are several ways to treat chemical imbalances. Either through medication or natural ways. The only thing I would have done differently would be to be there for her. I would listen to her, without judgement. Don't believe that you can fix her, or solve her problem. Just be there. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a close friend commit suicide two years ago. It was hard to come to terms with what she did. I was upset at her. I felt that her actions were selfish for a while. Mostly because I couldn&amp;#39;t understand what she was going though. What helped me come to terms with realizing first and foremost that depression and feelings of suicide are at their base caused by chemical imbalances in the brain. Realizing that it&amp;#39;s a physical problem and not just an &amp;#39;emotional problem&amp;#39; removes any judgement all feelings one can have. There are several ways to treat chemical imbalances. Either through medication or natural ways. The only thing I would have done differently would be to be there for her. I would listen to her, without judgement. Don&amp;#39;t believe that you can fix her, or solve her problem. Just be there. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256vv5", "score_hidden": false, "name": "t1_cheb2zh", "created": 1399735206.0, "author_flair_text": null, "created_utc": 1399706406.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]