[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Around this time last year, my sister admitted to me that our mom tried to OD on pills but she (mom) had promised she wouldn&amp;#39;t do it again.&lt;/p&gt;\n\n&lt;p&gt;Now my sister has just called me to say that mom has overdosed again, but our dad isn&amp;#39;t around to help my sister--he&amp;#39;s in Costa Rica for the next week and we can&amp;#39;t get ahold of him. I&amp;#39;m in another state for school so I can&amp;#39;t come and help.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just looking on what I should tell my sister to do, because it is killing me that I don&amp;#39;t know what to do--I&amp;#39;ve never dealt with anything like that and my sister doesn&amp;#39;t have a drivers license so she can&amp;#39;t go very far for help. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Around this time last year, my sister admitted to me that our mom tried to OD on pills but she (mom) had promised she wouldn't do it again.\n\nNow my sister has just called me to say that mom has overdosed again, but our dad isn't around to help my sister--he's in Costa Rica for the next week and we can't get ahold of him. I'm in another state for school so I can't come and help.\n\nI'm just looking on what I should tell my sister to do, because it is killing me that I don't know what to do--I've never dealt with anything like that and my sister doesn't have a drivers license so she can't go very far for help. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2406wl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "needhelpthrowaway223", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2406wl/my_sister_just_called_me_to_say_that_she_found/", "name": "t3_2406wl", "created": 1398509923.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2406wl/my_sister_just_called_me_to_say_that_she_found/", "author_flair_text": null, "title": "My sister just called me to say that she found out my mom attempted to OD, has 'suicide' search results on her computer. I'm in another part of the country, what can I do?", "created_utc": 1398481123.0, "ups": 1, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2cioe", "gilded": 0, "author": "needhelpthrowaway223", "parent_id": "t1_ch2c2dx", "approved_by": null, "body": "Thanks for your ideas. Since my sister didn't call 911 earlier, my mom lied and told the police she was fine and is now pissed at my sister. Of course, this just has to be prom night for my sister and thank god she was home, but it means she can't get a hold of her friend. I told her to call her friend tomorrow to have some physical support. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your ideas. Since my sister didn&amp;#39;t call 911 earlier, my mom lied and told the police she was fine and is now pissed at my sister. Of course, this just has to be prom night for my sister and thank god she was home, but it means she can&amp;#39;t get a hold of her friend. I told her to call her friend tomorrow to have some physical support. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2406wl", "score_hidden": false, "name": "t1_ch2cioe", "created": 1398489476.0, "author_flair_text": null, "created_utc": 1398485876.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2c2dx", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch2by2u", "approved_by": null, "body": "I agree with /u/RustyGloryHole.  If you aren't already, be in frequent contact with your sister.  Your mother is going to get the help she needs through hospital resources, but I have a feeling that your sister is really going to need you to be strong for her.  Encourage her to talk to you about her feelings, when she's ready.  Finding a relative in the position she found your mother is a traumatic thing, as I'm sure you know, and she's going to need your love and support as well as your mother, even if it's over the phone.  Also, does your sister have any close friends or relatives that she could call to provide transportation and support for her?  I'd encourage you to encourage her to contact them, even if it's one one of her school friends with a driver's license.  She doesn't have to tell the friend or relative exactly what happened at this point--she can always just tell people that her mother is 'really sick' and in the hospital if she's embarrassed, as, let's face it, teenagers tend to be about anything, least of all her mother's attempted suicide.  Best of luck to you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with &lt;a href=\"/u/RustyGloryHole\"&gt;/u/RustyGloryHole&lt;/a&gt;.  If you aren&amp;#39;t already, be in frequent contact with your sister.  Your mother is going to get the help she needs through hospital resources, but I have a feeling that your sister is really going to need you to be strong for her.  Encourage her to talk to you about her feelings, when she&amp;#39;s ready.  Finding a relative in the position she found your mother is a traumatic thing, as I&amp;#39;m sure you know, and she&amp;#39;s going to need your love and support as well as your mother, even if it&amp;#39;s over the phone.  Also, does your sister have any close friends or relatives that she could call to provide transportation and support for her?  I&amp;#39;d encourage you to encourage her to contact them, even if it&amp;#39;s one one of her school friends with a driver&amp;#39;s license.  She doesn&amp;#39;t have to tell the friend or relative exactly what happened at this point--she can always just tell people that her mother is &amp;#39;really sick&amp;#39; and in the hospital if she&amp;#39;s embarrassed, as, let&amp;#39;s face it, teenagers tend to be about anything, least of all her mother&amp;#39;s attempted suicide.  Best of luck to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2406wl", "score_hidden": false, "name": "t1_ch2c2dx", "created": 1398488221.0, "author_flair_text": null, "created_utc": 1398484621.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2c6p6", "gilded": 0, "author": "RustyGloryHole", "parent_id": "t1_ch2by2u", "approved_by": null, "body": "I would be very careful and not risk your education, but if its for the best you may need to do it. Like I said before, try to get your point across to her that she means alot and you love her. If your very close to your mom try getting to the source of why she feels this way", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would be very careful and not risk your education, but if its for the best you may need to do it. Like I said before, try to get your point across to her that she means alot and you love her. If your very close to your mom try getting to the source of why she feels this way&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2406wl", "score_hidden": false, "name": "t1_ch2c6p6", "created": 1398488542.0, "author_flair_text": null, "created_utc": 1398484942.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2by2u", "gilded": 0, "author": "needhelpthrowaway223", "parent_id": "t1_ch2bfxe", "approved_by": null, "body": "Thank you for your advice. The main problem is that my sister is all alone with her for the week unless we can get in contact with my father (who's not even in the US, he comes back the 2nd). I told her to call 911 and she told me that they've arrived, I don't know anything else yet.\n\nIf it comes down to it, I'll make the trip there. I feel selfish saying this but my senior finals (university) are this week and I might jeopardize my graduation but I will go if either/both of them needs me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your advice. The main problem is that my sister is all alone with her for the week unless we can get in contact with my father (who&amp;#39;s not even in the US, he comes back the 2nd). I told her to call 911 and she told me that they&amp;#39;ve arrived, I don&amp;#39;t know anything else yet.&lt;/p&gt;\n\n&lt;p&gt;If it comes down to it, I&amp;#39;ll make the trip there. I feel selfish saying this but my senior finals (university) are this week and I might jeopardize my graduation but I will go if either/both of them needs me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2406wl", "score_hidden": false, "name": "t1_ch2by2u", "created": 1398513097.0, "author_flair_text": null, "created_utc": 1398484297.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2bfxe", "gilded": 0, "author": "RustyGloryHole", "parent_id": "t3_2406wl", "approved_by": null, "body": "Im no expert but I would suggest your sister stays by your mom's side for a while and try to understand why she feels this way. And if you must, and it comes down to it, I would take a trip down there. Like I said, Im no expert and I dont know your certain situation but if it was my mom, I would try my best to make her feel better. The best thing you could do is show her how much you love her.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im no expert but I would suggest your sister stays by your mom&amp;#39;s side for a while and try to understand why she feels this way. And if you must, and it comes down to it, I would take a trip down there. Like I said, Im no expert and I dont know your certain situation but if it was my mom, I would try my best to make her feel better. The best thing you could do is show her how much you love her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2406wl", "score_hidden": false, "name": "t1_ch2bfxe", "created": 1398486558.0, "author_flair_text": null, "created_utc": 1398482958.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]