[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to write a few background paragraphs, it might get quite lengthy so you can skip it and read the last one for a more concise look at what I&amp;#39;m going through right now.&lt;/p&gt;\n\n&lt;p&gt;I am 19 years old. Starting at the beginning, my social problems started right out of elementary school. I lost my closest friend who was one of the few people I actually hung out with outside of school hours when we went to different middle schools. We just didn&amp;#39;t keep contact (this was before we had the easy facebook or cell phone access). Getting into middle school, I was fine for the most part during school hours, I had a specific group of people I talked with and hung out with in school, but after school I was a nobody. Literally zero interaction with anyone I knew. I don&amp;#39;t know why. &lt;/p&gt;\n\n&lt;p&gt;Eventually I just felt so alone I would start skipping school to spend more time on the computer playing games with online friends. I had some very close friends I talked to all the time (were talking 12+ hours sometimes). I missed a total of like 40 days of school in 8th grade, because I just couldn&amp;#39;t find it in me to go. Not to sound arrogant, but I was pretty smart, so even missing about 25% of the school year I still managed straight A&amp;#39;s and B&amp;#39;s in the highest level classes the school offered (and skipped a year at third grade). It&amp;#39;s hard for me to explain how I got my social anxiety or how it works, but basically I don&amp;#39;t ever feel comfortable around people I don&amp;#39;t know, especially if it&amp;#39;s more than one person. I get really self conscious about every aspect of my appearance, my breath, my clothing, BO, everything, even if when I&amp;#39;m alone I notice nothing wrong with them.&lt;/p&gt;\n\n&lt;p&gt;Moving into high school, everything got even worse. I knew hardly anyone and those I did know weren&amp;#39;t hanging out with me. I never talked in class, I got even more self conscious about everything, I skipped school to be on my computer. When I was in school, I was so nervous I wouldn&amp;#39;t go into the cafeteria for lunch and I would just not eat, instead going to the library to use the computers. I got into computer science, which I still do today. In 10th grade a few months in, I switched to an online high school. Online high school? Sounds like that fits me perfectly. It did. I got straight A&amp;#39;s, even though they hated me for waiting until the last week to do two months of work. I breezed through a year and a half of school with this, until I decided to do Running Start (basically a college thing here in Washington State to get high school completion as well as college credits). Long story short about that, I completely failed or withdrew or did poorly in about 80% of my classes. I didn&amp;#39;t have the motivation to take the bus route (which was an hour and a half of bus for a twenty minute drive, I didn&amp;#39;t get my license until I turned 18), and I did mediocre in the online college classes I could find. This has come back to haunt me. I just got my letter telling me I was declined from the University I wanted to go to, where I felt like I could finally getting motivated to turn my life around. I spend 12+ hours a day on the computer. I&amp;#39;m not ugly or overweight, I have some skills. I just don&amp;#39;t know what to do!&lt;/p&gt;\n\n&lt;p&gt;I often feel like the future is something I am just not fit to deal with. I live day by day, little-to-no social interaction in the real world. I have some friends online that I talk to and interact with quite a bit, but that doesn&amp;#39;t help me when it comes to social anxiety when I need to do real things like get a job, find a significant other, or put effort into school. Am I suicidal? I honestly don&amp;#39;t know. I feel like I would love to just disappear forever, but I don&amp;#39;t think it&amp;#39;s something I&amp;#39;d do to myself. Maybe this isn&amp;#39;t the right place to put this. I just want someone to hear my story, maybe people can relate, maybe everything will be okay.&lt;/p&gt;\n\n&lt;p&gt;I know I probably jumped around a lot or left out important details, it&amp;#39;s hard to fit ~10 years of a life into a few paragraphs. Well, it&amp;#39;s actually surprisingly easy for my life, haha. If you have any questions feel free to post.&lt;/p&gt;\n\n&lt;p&gt;Some other random information:&lt;/p&gt;\n\n&lt;p&gt;I have never had a girlfriend&lt;/p&gt;\n\n&lt;p&gt;I do not drink or do any drugs&lt;/p&gt;\n\n&lt;p&gt;I live at home with my family and animals which I love&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm going to write a few background paragraphs, it might get quite lengthy so you can skip it and read the last one for a more concise look at what I'm going through right now.\n\nI am 19 years old. Starting at the beginning, my social problems started right out of elementary school. I lost my closest friend who was one of the few people I actually hung out with outside of school hours when we went to different middle schools. We just didn't keep contact (this was before we had the easy facebook or cell phone access). Getting into middle school, I was fine for the most part during school hours, I had a specific group of people I talked with and hung out with in school, but after school I was a nobody. Literally zero interaction with anyone I knew. I don't know why. \n\nEventually I just felt so alone I would start skipping school to spend more time on the computer playing games with online friends. I had some very close friends I talked to all the time (were talking 12+ hours sometimes). I missed a total of like 40 days of school in 8th grade, because I just couldn't find it in me to go. Not to sound arrogant, but I was pretty smart, so even missing about 25% of the school year I still managed straight A's and B's in the highest level classes the school offered (and skipped a year at third grade). It's hard for me to explain how I got my social anxiety or how it works, but basically I don't ever feel comfortable around people I don't know, especially if it's more than one person. I get really self conscious about every aspect of my appearance, my breath, my clothing, BO, everything, even if when I'm alone I notice nothing wrong with them.\n\nMoving into high school, everything got even worse. I knew hardly anyone and those I did know weren't hanging out with me. I never talked in class, I got even more self conscious about everything, I skipped school to be on my computer. When I was in school, I was so nervous I wouldn't go into the cafeteria for lunch and I would just not eat, instead going to the library to use the computers. I got into computer science, which I still do today. In 10th grade a few months in, I switched to an online high school. Online high school? Sounds like that fits me perfectly. It did. I got straight A's, even though they hated me for waiting until the last week to do two months of work. I breezed through a year and a half of school with this, until I decided to do Running Start (basically a college thing here in Washington State to get high school completion as well as college credits). Long story short about that, I completely failed or withdrew or did poorly in about 80% of my classes. I didn't have the motivation to take the bus route (which was an hour and a half of bus for a twenty minute drive, I didn't get my license until I turned 18), and I did mediocre in the online college classes I could find. This has come back to haunt me. I just got my letter telling me I was declined from the University I wanted to go to, where I felt like I could finally getting motivated to turn my life around. I spend 12+ hours a day on the computer. I'm not ugly or overweight, I have some skills. I just don't know what to do!\n\nI often feel like the future is something I am just not fit to deal with. I live day by day, little-to-no social interaction in the real world. I have some friends online that I talk to and interact with quite a bit, but that doesn't help me when it comes to social anxiety when I need to do real things like get a job, find a significant other, or put effort into school. Am I suicidal? I honestly don't know. I feel like I would love to just disappear forever, but I don't think it's something I'd do to myself. Maybe this isn't the right place to put this. I just want someone to hear my story, maybe people can relate, maybe everything will be okay.\n\nI know I probably jumped around a lot or left out important details, it's hard to fit ~10 years of a life into a few paragraphs. Well, it's actually surprisingly easy for my life, haha. If you have any questions feel free to post.\n\nSome other random information:\n\nI have never had a girlfriend\n\nI do not drink or do any drugs\n\nI live at home with my family and animals which I love\n ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24qynu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "swthrow12345", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24qynu/my_story/", "name": "t3_24qynu", "created": 1399290998.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24qynu/my_story/", "author_flair_text": null, "title": "My story", "created_utc": 1399262198.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha9t86", "gilded": 0, "author": "marinated_pork", "parent_id": "t3_24qynu", "approved_by": null, "body": "Hi. I read your entire story.\n\nLet me ask you something:\n\nWhat kind of person do you want to be? If you could be anything, at the very core of your being, what would it be?\n\nI would love to talk more about your situation, so feel free to PM me if you'd like and we can chat.\n\nThanks for reading.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I read your entire story.&lt;/p&gt;\n\n&lt;p&gt;Let me ask you something:&lt;/p&gt;\n\n&lt;p&gt;What kind of person do you want to be? If you could be anything, at the very core of your being, what would it be?&lt;/p&gt;\n\n&lt;p&gt;I would love to talk more about your situation, so feel free to PM me if you&amp;#39;d like and we can chat.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24qynu", "score_hidden": false, "name": "t1_cha9t86", "created": 1399345437.0, "author_flair_text": null, "created_utc": 1399316637.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]