[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gonna prematurely assume that this is only gonna be for people in it for the long haul. I&amp;#39;ll try to throw in. TL;DR at the end.&lt;/p&gt;\n\n&lt;p&gt;I think a lot.. And it fucks me up. I read a lot of Stephen King, and it puts a lot of terrible ideas in my head. He wrote about a man who hung himself in his closet, and I stared at mine for a good ten minutes. Just...thinking.&lt;/p&gt;\n\n&lt;p&gt;I should state that I haven&amp;#39;t seem a therapist since I was in the second grade(I&amp;#39;m in ninth grade now) so most of this is not professional. I do believe that I have retained the Self Loathing and the Inferiority Complex that I was told I had back then. And let me tell you: it sucks. They feed off of each other. I don&amp;#39;t think I&amp;#39;m good enough, so I hate myself. Then I feel pathetic for hating myself, because I have virtually nothing to feel bad about, so I hate myself even more.\nI don&amp;#39;t think I&amp;#39;m bipolar, because from my understanding of it, you go through cycles that last weeks and sometimes months. I guess I&amp;#39;m just a moody teenager, because one minute I&amp;#39;ll be okay, and the next minute I feel on the verge of having a mental breakdown in the middle of third period.\nI&amp;#39;m worried I&amp;#39;m going to end up a schizophrenic, as my uncle is, and my mom loves to tell me I&amp;#39;m just like him in every way. It&amp;#39;s pretty scary. I feel like one of the times when I&amp;#39;m arguing with myself about whether or not I&amp;#39;m good enough, a third voice will pipe up; one I&amp;#39;m not in control of. &lt;/p&gt;\n\n&lt;p&gt;And then there&amp;#39;s the external stuff. I swear, I cannot hold onto a friend. I have one friend that I&amp;#39;ve known for more than three years. The rest I pick up and drop quicker than you can say &amp;quot;overreacting.&amp;quot;\nBecause that&amp;#39;s what it boils down to. I haven&amp;#39;t talked to who was probably my best friend since December 6th because I got pissed off at him and told him to fuck off and he kept not fucking off. I got so mad that the next day he came up to me, I said &amp;quot;don&amp;#39;t you fucking talk to me&amp;quot; and we haven&amp;#39;t spoken since. Sometimes I don&amp;#39;t regret it, and other times, such as now, I do. I remember I was dating this girl, and this other kid would always hit on her in P.E. whenever I wasn&amp;#39;t around for more than like ten seconds. Then one time when we were running laps my friend stuck out his foot and tripped the kid. Just because he sometimes hit on my girlfriend. The kid wasn&amp;#39;t even a threat to the relationship. He just did it because he had my back. But I&amp;#39;m too stubborn to apologize. I wouldn&amp;#39;t even know how to start. There was a time when he probably would have accepted my apology, but that time has probably passed. I assume he&amp;#39;s got new friends.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t keep other friends because I feel used by &lt;em&gt;everybody&lt;/em&gt; and their goddam grandmothers, so I lash out at people that don&amp;#39;t deserve it. I can&amp;#39;t maintain a relationship because I don&amp;#39;t believe anyone cares about me no matter what they do to prove it. &lt;/p&gt;\n\n&lt;p&gt;I blow things way out of proportion. Both directions. I was talking to this girl in some stupid elective, and I kept making her laugh, and she goes, &amp;quot;oh my gosh I love you&amp;quot; in a totally platonic way, and I understood that then and I understand it now. But I meant the world to me. More than likely, it meant nothing to her. Then weeks later, after her having said it a couple more times, it meant literally nothing to me, and it got to the point where I&amp;#39;d get a little pissed off inside because I felt she was lying to me. Still platonic by the way, so even it wasn&amp;#39;t true, it shouldn&amp;#39;t have mattered to me. But it did. Because if I&amp;#39;ve learned anything, it&amp;#39;s that if I had one wish, it would be to feel cared about by my peers every once and awhile. Because on the rare occasion that I do feel like that, it feels so amazing.&lt;/p&gt;\n\n&lt;p&gt;I love how people seem to think telling me that I look so depressed is going to help. I said something about like &amp;quot;don&amp;#39;t you ever just want to be alone?&amp;quot; today, and the girl I said it to replied with &amp;quot;god, that&amp;#39;s so sad.&amp;quot; Yeah. Thanks.\nBut it&amp;#39;s not like I don&amp;#39;t think my life is sad. The only thing I look forward to in my day is being able to go home and watch twenty minutes of my favorite YouTube/Podcast thing. How sad is that? I think it&amp;#39;s pretty sad.&lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;m done. Thanks for anyone who read the whole thing, if any if you angles are out there.&lt;br/&gt;\nTL;DR:\nMental health problems I currently have:suck\nMental problems I&amp;#39;m likely to get:scary.\nI suck at friends. I suck at girlfriends. \nI overreact. I blow things out of proportion. I want my peers to care about me. Done.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm gonna prematurely assume that this is only gonna be for people in it for the long haul. I'll try to throw in. TL;DR at the end.\n\nI think a lot.. And it fucks me up. I read a lot of Stephen King, and it puts a lot of terrible ideas in my head. He wrote about a man who hung himself in his closet, and I stared at mine for a good ten minutes. Just...thinking.\n\nI should state that I haven't seem a therapist since I was in the second grade(I'm in ninth grade now) so most of this is not professional. I do believe that I have retained the Self Loathing and the Inferiority Complex that I was told I had back then. And let me tell you: it sucks. They feed off of each other. I don't think I'm good enough, so I hate myself. Then I feel pathetic for hating myself, because I have virtually nothing to feel bad about, so I hate myself even more.\nI don't think I'm bipolar, because from my understanding of it, you go through cycles that last weeks and sometimes months. I guess I'm just a moody teenager, because one minute I'll be okay, and the next minute I feel on the verge of having a mental breakdown in the middle of third period.\nI'm worried I'm going to end up a schizophrenic, as my uncle is, and my mom loves to tell me I'm just like him in every way. It's pretty scary. I feel like one of the times when I'm arguing with myself about whether or not I'm good enough, a third voice will pipe up; one I'm not in control of. \n\nAnd then there's the external stuff. I swear, I cannot hold onto a friend. I have one friend that I've known for more than three years. The rest I pick up and drop quicker than you can say \"overreacting.\"\nBecause that's what it boils down to. I haven't talked to who was probably my best friend since December 6th because I got pissed off at him and told him to fuck off and he kept not fucking off. I got so mad that the next day he came up to me, I said \"don't you fucking talk to me\" and we haven't spoken since. Sometimes I don't regret it, and other times, such as now, I do. I remember I was dating this girl, and this other kid would always hit on her in P.E. whenever I wasn't around for more than like ten seconds. Then one time when we were running laps my friend stuck out his foot and tripped the kid. Just because he sometimes hit on my girlfriend. The kid wasn't even a threat to the relationship. He just did it because he had my back. But I'm too stubborn to apologize. I wouldn't even know how to start. There was a time when he probably would have accepted my apology, but that time has probably passed. I assume he's got new friends.\n\nI can't keep other friends because I feel used by *everybody* and their goddam grandmothers, so I lash out at people that don't deserve it. I can't maintain a relationship because I don't believe anyone cares about me no matter what they do to prove it. \n\nI blow things way out of proportion. Both directions. I was talking to this girl in some stupid elective, and I kept making her laugh, and she goes, \"oh my gosh I love you\" in a totally platonic way, and I understood that then and I understand it now. But I meant the world to me. More than likely, it meant nothing to her. Then weeks later, after her having said it a couple more times, it meant literally nothing to me, and it got to the point where I'd get a little pissed off inside because I felt she was lying to me. Still platonic by the way, so even it wasn't true, it shouldn't have mattered to me. But it did. Because if I've learned anything, it's that if I had one wish, it would be to feel cared about by my peers every once and awhile. Because on the rare occasion that I do feel like that, it feels so amazing.\n\nI love how people seem to think telling me that I look so depressed is going to help. I said something about like \"don't you ever just want to be alone?\" today, and the girl I said it to replied with \"god, that's so sad.\" Yeah. Thanks.\nBut it's not like I don't think my life is sad. The only thing I look forward to in my day is being able to go home and watch twenty minutes of my favorite YouTube/Podcast thing. How sad is that? I think it's pretty sad.\n\nI guess I'm done. Thanks for anyone who read the whole thing, if any if you angles are out there.  \nTL;DR:\nMental health problems I currently have:suck\nMental problems I'm likely to get:scary.\nI suck at friends. I suck at girlfriends. \nI overreact. I blow things out of proportion. I want my peers to care about me. Done.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23u4j2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwawayattempt19", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23u4j2/my_traitorous_brain/", "name": "t3_23u4j2", "created": 1398345431.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23u4j2/my_traitorous_brain/", "author_flair_text": null, "title": "My Traitorous Brain", "created_utc": 1398316631.0, "ups": 5, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0mbqb", "gilded": 0, "author": "bobioso", "parent_id": "t1_ch0m6i5", "approved_by": null, "body": "Reading does help like priestofdisorder stated. Its relaxing and you can kind of go into another world. Just because you are not popular at school does not mean you cannot find friends. Its hard, and aggravating and nerve wrecking but you can do it. You just have to take it one step at a time. Start with a hey then try and find a common interest. It may not work out with the first person you try with, but you will find one that it does. I promise you there are others just like you, possibly even at your school that feel the same way. You are not alone. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading does help like priestofdisorder stated. Its relaxing and you can kind of go into another world. Just because you are not popular at school does not mean you cannot find friends. Its hard, and aggravating and nerve wrecking but you can do it. You just have to take it one step at a time. Start with a hey then try and find a common interest. It may not work out with the first person you try with, but you will find one that it does. I promise you there are others just like you, possibly even at your school that feel the same way. You are not alone. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0mbqb", "created": 1398321796.0, "author_flair_text": null, "created_utc": 1398318196.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0m6i5", "gilded": 0, "author": "Throwawayattempt19", "parent_id": "t1_ch0m43a", "approved_by": null, "body": "They're not really my friends..I'm not popular, but I'm nowhere close to having been ostracized. I kinda feel like \"out of sight; out of mind\" describes me pretty well. No one gives me a second thought when I'm not right in front of me. I don't get invited to stuff, I can't start stuff because no one wants to spend their free time with me. I just said friend because acquaintance is longer and harder to spell on a blurry little keyboard. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re not really my friends..I&amp;#39;m not popular, but I&amp;#39;m nowhere close to having been ostracized. I kinda feel like &amp;quot;out of sight; out of mind&amp;quot; describes me pretty well. No one gives me a second thought when I&amp;#39;m not right in front of me. I don&amp;#39;t get invited to stuff, I can&amp;#39;t start stuff because no one wants to spend their free time with me. I just said friend because acquaintance is longer and harder to spell on a blurry little keyboard. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0m6i5", "created": 1398321287.0, "author_flair_text": null, "created_utc": 1398317687.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0m43a", "gilded": 0, "author": "priestofdisorder", "parent_id": "t3_23u4j2", "approved_by": null, "body": "Overreacting is a way people cope when growing up, you are not alone if you say you have friends to talk to, read books, watch movies and develop your own perception, since you like to read its common to feel sad, i read somewhere that smart people tend to feel sad easier because they are realists, don't worry, you are doing just fine, talk about it when you feel hopeless.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Overreacting is a way people cope when growing up, you are not alone if you say you have friends to talk to, read books, watch movies and develop your own perception, since you like to read its common to feel sad, i read somewhere that smart people tend to feel sad easier because they are realists, don&amp;#39;t worry, you are doing just fine, talk about it when you feel hopeless.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0m43a", "created": 1398321059.0, "author_flair_text": null, "created_utc": 1398317459.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0mryl", "gilded": 0, "author": "bobioso", "parent_id": "t1_ch0mmhg", "approved_by": null, "body": "If you like writing then keep at it! i Understand completely what you mean about not caring what other people think but caring whether or not they notice you and also what they think about you. Even though you try not to give a crap what others think, your going to at times, its human nature. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you like writing then keep at it! i Understand completely what you mean about not caring what other people think but caring whether or not they notice you and also what they think about you. Even though you try not to give a crap what others think, your going to at times, its human nature. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0mryl", "created": 1398323494.0, "author_flair_text": null, "created_utc": 1398319894.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0mmhg", "gilded": 0, "author": "Throwawayattempt19", "parent_id": "t1_ch0m4m9", "approved_by": null, "body": "Thank you so much for the replies. Being a teenager sucks. I'm sure being an adult isn't a whole lot better, but I think the people that say to not be too excited to grow up weren't exactly..like us. I can't imagine a scenario where I'd like to come back to a time period in which I am so utterly not in control of my emotions.\n\nI'm alright at talking to new people. I've hit a point where I just don't give a fuck if people think negatively about me. I know that contradicts what I said earlier, but I'm not sure how to explain it in a way that makes sense. I'm not super great at putting my thoughts into words. It's why I like writing. Because I have more time to process my thoughts.\nBut with someone I'm unfamiliar with, I'm practically dead inside when talking to them. So if they aren't interested in being my friend, it doesn't matter. But if they are, I start to get attached. And *then* I need them to care about me.\n\nBut again, thank you. You have been very helpful and I'm so so grateful.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the replies. Being a teenager sucks. I&amp;#39;m sure being an adult isn&amp;#39;t a whole lot better, but I think the people that say to not be too excited to grow up weren&amp;#39;t exactly..like us. I can&amp;#39;t imagine a scenario where I&amp;#39;d like to come back to a time period in which I am so utterly not in control of my emotions.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m alright at talking to new people. I&amp;#39;ve hit a point where I just don&amp;#39;t give a fuck if people think negatively about me. I know that contradicts what I said earlier, but I&amp;#39;m not sure how to explain it in a way that makes sense. I&amp;#39;m not super great at putting my thoughts into words. It&amp;#39;s why I like writing. Because I have more time to process my thoughts.\nBut with someone I&amp;#39;m unfamiliar with, I&amp;#39;m practically dead inside when talking to them. So if they aren&amp;#39;t interested in being my friend, it doesn&amp;#39;t matter. But if they are, I start to get attached. And &lt;em&gt;then&lt;/em&gt; I need them to care about me.&lt;/p&gt;\n\n&lt;p&gt;But again, thank you. You have been very helpful and I&amp;#39;m so so grateful.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0mmhg", "created": 1398322901.0, "author_flair_text": null, "created_utc": 1398319301.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0m4m9", "gilded": 0, "author": "bobioso", "parent_id": "t3_23u4j2", "approved_by": null, "body": "Holding on to friends is hard, especially when you are mentally and emotionally going through alot. My best (and only) friend is my spouse. I do not go out of my way to make friends and when people talk to me I smile, say a few words and bolt. I am not sociable. I live in a house full of people and 90 percent of my day is spent in a room...alone...because I literally have an internal fear of talking to people and making friends. I have not made a new friend in almost six years. It is hard and aggravating, and being lonely with only one other person is hard. You will go through depressions and wonder why people don't like you and over think every single interaction you make. But people do care about you, and if it is any help I will be your friend. Sometimes talking to someone you don't have to see helps you make friends in school and stuff. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holding on to friends is hard, especially when you are mentally and emotionally going through alot. My best (and only) friend is my spouse. I do not go out of my way to make friends and when people talk to me I smile, say a few words and bolt. I am not sociable. I live in a house full of people and 90 percent of my day is spent in a room...alone...because I literally have an internal fear of talking to people and making friends. I have not made a new friend in almost six years. It is hard and aggravating, and being lonely with only one other person is hard. You will go through depressions and wonder why people don&amp;#39;t like you and over think every single interaction you make. But people do care about you, and if it is any help I will be your friend. Sometimes talking to someone you don&amp;#39;t have to see helps you make friends in school and stuff. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23u4j2", "score_hidden": false, "name": "t1_ch0m4m9", "created": 1398321106.0, "author_flair_text": null, "created_utc": 1398317506.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]