[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, it&amp;#39;s taken me close to three hours of staring at a blank text box to finally start typing. I hope what follows is somewhat understandable and that someone can relate enough to read through, I would bother someone else, but Reddit is probably the closest thing I have to a friend (not trying to guilt trip anyone here, it just might sound a little angsty). &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really know where to start. I&amp;#39;m currently typing from a dorm in the UK. I&amp;#39;m a 19 year old student in my first year of university. It&amp;#39;s currently 20:19. I have 4 essays due by 22:00 on wednesday, I have not started any of them yet.&lt;/p&gt;\n\n&lt;p&gt;Now this wouldn&amp;#39;t be a problem for most. Sure it&amp;#39;s a tricky situation, but two days of solid work should fix it. But the truth is, I know that&amp;#39;s not going to happen. I&amp;#39;ve been in this situation before, and I don&amp;#39;t see this time being different. Truth is I&amp;#39;ve never really learned how to do this stuff.&lt;/p&gt;\n\n&lt;p&gt;I had the kind of upbringing you might expect from the people in this situation, I grew up passing everything without having to try, being told I was clever but lazy, this combined with anxiety and a general lack of ambition led to me not really doing much. Not only did I finish most classes with a blank page in front of me, but I never developed any interests, never socialised, I haven&amp;#39;t really had anything you could call a friend since primary school. I could probably count the amount of times I handed in a piece of homework in high school on one hand, the most important things I would not do until I was literally forced to. This of course led to a lot of detentions, trouble with my parents, and a generally miserable time. I spent the majority of my nights having the same talk about needing to take initiative and start making an effort. Most nights I would swear to myself that that would be when it all changed. Of course that never happened. The catch-22 in that situation was that making a change in your life requires hard work and dedication, which I didn&amp;#39;t have because of that very situation.&lt;/p&gt;\n\n&lt;p&gt;This of course led to a huge amount of self loathing, which further sapped my motivation, and when it came to the point where I no longer had anyone forcing me to do things, I simply stopped doing them. I finished AS-levels with terrible grades and just barely got through to the second year of college. This was when I vowed that it would be the turning point in my life and I would sort it out. I proceeded to do exactly that for about three months, at which point I sank back into the old routine of not doing anything and hating myself for it. I ended up getting just as bad grades in the second year and going to a terrible university, where I went through the same cycle of being motivated for a few months and then ruining it all, not showing up to half my classes because I couldn&amp;#39;t bring myself to get out of bed and face the world.&lt;/p&gt;\n\n&lt;p&gt;The problem is I don&amp;#39;t know where to go with my life from here. I&amp;#39;ve gone through a lot of regret throughout my education, the knowledge that it would be so easy if I just did something, the guilt of knowing my parents trying to help me, the constant punishments and repercussions; I went through years of prison-like conditions in an attempt to bore myself into doing work, if that doesn&amp;#39;t snap me out of it, I don&amp;#39;t think anything will.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to continue living like this, but I can&amp;#39;t see a way out. So far the only thing keeping me from doing the deed so far has been the hope that one day I might look back at this and wonder why I found everything so hard, but it&amp;#39;s seeming less likely by the day. Time is running short, and if I don&amp;#39;t find some kind of solution soon, my life will be too damaged to fix. I&amp;#39;ve never really considered suicide before this, but it&amp;#39;s getting tempting, and that is a thought that scares me.&lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m really sorry for the wall of text, if you&amp;#39;re still reading, thank you. I&amp;#39;m not expecting an easy way out, but I hope getting this off my chest will help a bit. The irony of this is that it comes to just over 4,000 words, which could easily have been 2 essays, not sure what to think about that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Well, it's taken me close to three hours of staring at a blank text box to finally start typing. I hope what follows is somewhat understandable and that someone can relate enough to read through, I would bother someone else, but Reddit is probably the closest thing I have to a friend (not trying to guilt trip anyone here, it just might sound a little angsty). \n\nI don't really know where to start. I'm currently typing from a dorm in the UK. I'm a 19 year old student in my first year of university. It's currently 20:19. I have 4 essays due by 22:00 on wednesday, I have not started any of them yet.\n\nNow this wouldn't be a problem for most. Sure it's a tricky situation, but two days of solid work should fix it. But the truth is, I know that's not going to happen. I've been in this situation before, and I don't see this time being different. Truth is I've never really learned how to do this stuff.\n\nI had the kind of upbringing you might expect from the people in this situation, I grew up passing everything without having to try, being told I was clever but lazy, this combined with anxiety and a general lack of ambition led to me not really doing much. Not only did I finish most classes with a blank page in front of me, but I never developed any interests, never socialised, I haven't really had anything you could call a friend since primary school. I could probably count the amount of times I handed in a piece of homework in high school on one hand, the most important things I would not do until I was literally forced to. This of course led to a lot of detentions, trouble with my parents, and a generally miserable time. I spent the majority of my nights having the same talk about needing to take initiative and start making an effort. Most nights I would swear to myself that that would be when it all changed. Of course that never happened. The catch-22 in that situation was that making a change in your life requires hard work and dedication, which I didn't have because of that very situation.\n\nThis of course led to a huge amount of self loathing, which further sapped my motivation, and when it came to the point where I no longer had anyone forcing me to do things, I simply stopped doing them. I finished AS-levels with terrible grades and just barely got through to the second year of college. This was when I vowed that it would be the turning point in my life and I would sort it out. I proceeded to do exactly that for about three months, at which point I sank back into the old routine of not doing anything and hating myself for it. I ended up getting just as bad grades in the second year and going to a terrible university, where I went through the same cycle of being motivated for a few months and then ruining it all, not showing up to half my classes because I couldn't bring myself to get out of bed and face the world.\n\nThe problem is I don't know where to go with my life from here. I've gone through a lot of regret throughout my education, the knowledge that it would be so easy if I just did something, the guilt of knowing my parents trying to help me, the constant punishments and repercussions; I went through years of prison-like conditions in an attempt to bore myself into doing work, if that doesn't snap me out of it, I don't think anything will.\n\nI don't want to continue living like this, but I can't see a way out. So far the only thing keeping me from doing the deed so far has been the hope that one day I might look back at this and wonder why I found everything so hard, but it's seeming less likely by the day. Time is running short, and if I don't find some kind of solution soon, my life will be too damaged to fix. I've never really considered suicide before this, but it's getting tempting, and that is a thought that scares me.\n\nAgain, I'm really sorry for the wall of text, if you're still reading, thank you. I'm not expecting an easy way out, but I hope getting this off my chest will help a bit. The irony of this is that it comes to just over 4,000 words, which could easily have been 2 essays, not sure what to think about that.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25dzu3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwaway273958", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399926673.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25dzu3/my_whole_life_has_been_a_catch22_of/", "name": "t3_25dzu3", "created": 1399955060.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25dzu3/my_whole_life_has_been_a_catch22_of/", "author_flair_text": null, "title": "My whole life has been a catch-22 of procrastination and anxiety, I don't see a way out", "created_utc": 1399926260.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg8xnz", "gilded": 0, "author": "throwawaypornjobs", "parent_id": "t3_25dzu3", "approved_by": null, "body": "I can relate to you completely, I'm at high school at the moment in the UK doing my GCSE's, I wanted to kill myself last night but held off, I am so glad that I did! Exams are a hard time, I'm sure you know but once they are over that's it for your whole life! If you want to PM me, feel free to but I'm here for you if you want someone to talk to :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate to you completely, I&amp;#39;m at high school at the moment in the UK doing my GCSE&amp;#39;s, I wanted to kill myself last night but held off, I am so glad that I did! Exams are a hard time, I&amp;#39;m sure you know but once they are over that&amp;#39;s it for your whole life! If you want to PM me, feel free to but I&amp;#39;m here for you if you want someone to talk to :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dzu3", "score_hidden": false, "name": "t1_chg8xnz", "created": 1399956376.0, "author_flair_text": null, "created_utc": 1399927576.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgfshj", "gilded": 0, "author": "crazylighter", "parent_id": "t3_25dzu3", "approved_by": null, "body": "Have you considered going back to the doctor and telling them about the things you've just told us? Some of the stuff you posted suggest some other factors may be at play.\n\nOtherwise, I'll suggest some ways to help you through- break the projects down into simple baby steps, put on some relaxing music, go for walks as breaks to calm down, and use outlines to get the projects done. Instead of staring into space, research what you need to, then have the main points written out, evidence to back up those assertions and then fill in the rest as you go. It's an easier way to write essays.\n\nGo to /r/ADHD - we are the masters of procrastination and anxiety, most of us struggle with motivation, late assignments, failing projects, and struggling to pull through. You might find some good tips to help you finish your work in time.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered going back to the doctor and telling them about the things you&amp;#39;ve just told us? Some of the stuff you posted suggest some other factors may be at play.&lt;/p&gt;\n\n&lt;p&gt;Otherwise, I&amp;#39;ll suggest some ways to help you through- break the projects down into simple baby steps, put on some relaxing music, go for walks as breaks to calm down, and use outlines to get the projects done. Instead of staring into space, research what you need to, then have the main points written out, evidence to back up those assertions and then fill in the rest as you go. It&amp;#39;s an easier way to write essays.&lt;/p&gt;\n\n&lt;p&gt;Go to &lt;a href=\"/r/ADHD\"&gt;/r/ADHD&lt;/a&gt; - we are the masters of procrastination and anxiety, most of us struggle with motivation, late assignments, failing projects, and struggling to pull through. You might find some good tips to help you finish your work in time.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25dzu3", "score_hidden": false, "name": "t1_chgfshj", "created": 1399971235.0, "author_flair_text": null, "created_utc": 1399942435.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]