[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have an extremely suicidal friend with parents who honestly don&amp;#39;t seem to give a shit. I also recently found out that this friend (we&amp;#39;ll call her C) is not a virgin, which causes her great distress, being that she&amp;#39;s only 14, and it seemed from the fact that she didn&amp;#39;t want to talk about it that it wasn&amp;#39;t a consensual thing. C has planned her suicide before, and has pretty much abandoned the few friends she had that decided to tell anyone when she planned her attempts. Currently, I don&amp;#39;t know that she has any plans, but she&amp;#39;s extremely mentally unstable at this point in time and has frequent mental breakdowns because of her anxiety. This is preventing her from doing any schoolwork, and her grades are definitely dropping noticeably. And all the while, her parents are doing nothing. I believe she was on depression medication for a while, and maybe she still is, but it doesn&amp;#39;t seem to be working. As far as I can tell, nothing is helping her free herself from depression.&lt;/p&gt;\n\n&lt;p&gt;Next is my sister, who we will call A. A is frequently trying to help and/or do things for her friends. I am not entirely against this, however it&amp;#39;s becoming more than just a generous kind of, &amp;quot;Here, let me help you,&amp;quot; and more of a, &amp;quot;I feel guilty when I can&amp;#39;t do things for you,&amp;quot; type of thing. Tonight she got to the point of sobbing and exclaiming that &amp;quot;if C dies, it will break me.&amp;quot; I don&amp;#39;t know how to help A, especially because it seems like she&amp;#39;s trying to take on the burdens of everyone. Many of her (and my) friends are depressed to the point of being suicidal, and it&amp;#39;s really getting to her. She even feels bad when she can&amp;#39;t join another of her friends for something she does every single Monday, Wednesday, and Friday of every single week. And she doesn&amp;#39;t even want to go, she just feels too guilty to say no. Now I&amp;#39;m beginning to have to take it upon myself to just tell the friend we can&amp;#39;t go, and convince A that &lt;em&gt;it&amp;#39;s ok to say no sometimes&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;So. How the heck do I help these two? I&amp;#39;m at a complete and utter loss here. Having been a little bit depressed myself at certain points, I can sort of understand what some of my friends are going through, but I still can&amp;#39;t fully grasp how awful it is for them. Any advice?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt; I too, and 14. I am a trans boy (mentally identifying as male, physically female), and am pansexual and autistic. I am not a &amp;quot;normal&amp;quot; person and I don&amp;#39;t entirely handle the hard stuff very well. My people skills are lacking and it seems I&amp;#39;ll be needing them a lot for now. How can I improve these in order to help the people in need?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have an extremely suicidal friend with parents who honestly don't seem to give a shit. I also recently found out that this friend (we'll call her C) is not a virgin, which causes her great distress, being that she's only 14, and it seemed from the fact that she didn't want to talk about it that it wasn't a consensual thing. C has planned her suicide before, and has pretty much abandoned the few friends she had that decided to tell anyone when she planned her attempts. Currently, I don't know that she has any plans, but she's extremely mentally unstable at this point in time and has frequent mental breakdowns because of her anxiety. This is preventing her from doing any schoolwork, and her grades are definitely dropping noticeably. And all the while, her parents are doing nothing. I believe she was on depression medication for a while, and maybe she still is, but it doesn't seem to be working. As far as I can tell, nothing is helping her free herself from depression.\n\nNext is my sister, who we will call A. A is frequently trying to help and/or do things for her friends. I am not entirely against this, however it's becoming more than just a generous kind of, \"Here, let me help you,\" and more of a, \"I feel guilty when I can't do things for you,\" type of thing. Tonight she got to the point of sobbing and exclaiming that \"if C dies, it will break me.\" I don't know how to help A, especially because it seems like she's trying to take on the burdens of everyone. Many of her (and my) friends are depressed to the point of being suicidal, and it's really getting to her. She even feels bad when she can't join another of her friends for something she does every single Monday, Wednesday, and Friday of every single week. And she doesn't even want to go, she just feels too guilty to say no. Now I'm beginning to have to take it upon myself to just tell the friend we can't go, and convince A that *it's ok to say no sometimes*.\n\nSo. How the heck do I help these two? I'm at a complete and utter loss here. Having been a little bit depressed myself at certain points, I can sort of understand what some of my friends are going through, but I still can't fully grasp how awful it is for them. Any advice?\n\n**Note:** I too, and 14. I am a trans boy (mentally identifying as male, physically female), and am pansexual and autistic. I am not a \"normal\" person and I don't entirely handle the hard stuff very well. My people skills are lacking and it seems I'll be needing them a lot for now. How can I improve these in order to help the people in need?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250ouo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BiPride", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250ouo/needing_advice_for_my_sister_and_my_friend/", "name": "t3_250ouo", "created": 1399555041.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250ouo/needing_advice_for_my_sister_and_my_friend/", "author_flair_text": null, "title": "Needing advice for my sister and my friend", "created_utc": 1399526241.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgv84z", "gilded": 0, "author": "BiPride", "parent_id": "t1_chgnhhd", "approved_by": null, "body": "My counselor, who also happens to be C's counselor. She takes everything a little too seriously, and her way to solve problems seems to be to repeat herself about why it's a problem and see if it goes away.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My counselor, who also happens to be C&amp;#39;s counselor. She takes everything a little too seriously, and her way to solve problems seems to be to repeat herself about why it&amp;#39;s a problem and see if it goes away.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chgv84z", "created": 1400022433.0, "author_flair_text": null, "created_utc": 1399993633.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chgnhhd", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_chdlt58", "approved_by": null, "body": "Who was the one that went on the rant?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who was the one that went on the rant?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chgnhhd", "created": 1399990586.0, "author_flair_text": null, "created_utc": 1399961786.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdlt58", "gilded": 0, "author": "BiPride", "parent_id": "t1_chdg1lw", "approved_by": null, "body": "Yes, all school counselors. It's a public school.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, all school counselors. It&amp;#39;s a public school.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chdlt58", "created": 1399671378.0, "author_flair_text": null, "created_utc": 1399642578.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdg1lw", "gilded": 0, "author": "newtonsapple", "parent_id": "t1_chcpg2u", "approved_by": null, "body": "Were they all school counselors?  Is it a public school or a religious one?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Were they all school counselors?  Is it a public school or a religious one?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chdg1lw", "created": 1399644380.0, "author_flair_text": null, "created_utc": 1399615580.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcpg2u", "gilded": 0, "author": "BiPride", "parent_id": "t1_chclnls", "approved_by": null, "body": "Yes. However, nothing they say seems to help. A has gone there maybe 3 or a 4 times to get help with C, but all the counselors have done is remind C how bad things like cutting and being suicidal are, and that she should stop. I kind of understand why C hates counselors after visiting their office just once. It pretty much turned into a rant about gender and sexuality when I went there (because that's the topic I brought up), but I don't really find rants helpful, and I highly doubt a depressed person would either.\n\nSo in short, yes, but otherwise, I don't view that as being a very good idea, since the last 4 times anyone has gone it hasn't helped anyone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. However, nothing they say seems to help. A has gone there maybe 3 or a 4 times to get help with C, but all the counselors have done is remind C how bad things like cutting and being suicidal are, and that she should stop. I kind of understand why C hates counselors after visiting their office just once. It pretty much turned into a rant about gender and sexuality when I went there (because that&amp;#39;s the topic I brought up), but I don&amp;#39;t really find rants helpful, and I highly doubt a depressed person would either.&lt;/p&gt;\n\n&lt;p&gt;So in short, yes, but otherwise, I don&amp;#39;t view that as being a very good idea, since the last 4 times anyone has gone it hasn&amp;#39;t helped anyone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chcpg2u", "created": 1399586867.0, "author_flair_text": null, "created_utc": 1399558067.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chclnls", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_250ouo", "approved_by": null, "body": "Does your school have a counselor you could go to?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does your school have a counselor you could go to?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ouo", "score_hidden": false, "name": "t1_chclnls", "created": 1399571596.0, "author_flair_text": null, "created_utc": 1399542796.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]