[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys, I guess I&amp;#39;ll just start off with how I got to this point. My mom was a drug addict since I was around 5 and that definitely had a giant impact on me growing up. I&amp;#39;ve always considered suicide since I was around 11 due to being poor and my mom&amp;#39;s drug addiction. I&amp;#39;ve attempted suicide 11 times to date but it either fails or I bitch out at the last second. The urges toned down during high school which was the highlight of my life. It turned out that I was amazing at football. I turned that talent into a new view on life and was even able to get my mom out of my life. I felt absolutely awesome. My junior and senior year I was an all state defensive end. I absolutely loved my life. Fast forward to the end of high school. I sign to play football at a d1 university. I somehow pull the starting spot from the previous years starter. First game of the season I broke my back on the first play of the first quarter. My dream was gone. I can walk fine, and I can even get some decent exercise if I really try enough but sports is not longer an option. But I got so depressed that I dropped out of school and moved back home. My dad and step mom wouldnt let me move back in with them because we made a deal that I was going to do well at college regardless. and i guess in their minds I couldve stayed since I still had my scholarship so it was my fault. I ended up moving in with my best friends parents. His dad, lets call him steve for now, was a massive pot head. I ended up sitting on his couch for almost a year smoking weed and watching comedy central. Didnt get a job, didnt do a thing. It honestly wasnt that bad. I enjoyed it a bit. Well, I end up getting some sort of motivation to do something with my life. Around that time my grandma in another state offers to help me find a job up there and start over more or less. I took the chance. I knew it was going to be iffy but it was better than nothing. Literally the first day in town I go get my hair cut and the lady cutting my hair mentions that the local sheriffs office is hiring. So after I got my hair cut I walked over to the SO and applied. The receptionist told me to wait in the hall as she gave the application to the sheriff. I didnt think I had a good chance at getting the job but it was worth a try. The sheriff ends up coming out to the hall and we have a good long talk/interview and he hires me on the spot and tells me that when I&amp;#39;m of age he wants me to be a deputy for him. (forgot to mention that I got hired as a jailer) This sounded AWESOME to me. I had a pretty decent salary and had a clear career path in front of me.i worked there for 3 months and then I get called into his office before he left work(i worked the night shift) and tells me that hes going to have to lay me off until july. I freaked out. I didnt do anything to deserve getting laid off. He told me it was because there was some mismanaging of funds and that since I was the new guy I was the first to get laid off(there were others). That destroyed me. I worked the rest of the month and looked for another job in the meantime. There is nothing in this town hiring. Its so small and theres fucking nothing available. I don&amp;#39;t qualify for unemployment because I&amp;#39;m 19 and havent worked enough hours to qualify. The sheriff and undersheriff hadnt ever had someone as young as me working for them so they didnt know I wouldnt qualify. It honestly wouldve been fine if I qualified. But I dont which blows. My last day working was march 28th and I&amp;#39;ve been barely getting by on that last check. I&amp;#39;m now completely broke and have absolutely nothing. My friend was able to send me some money for my rent next month but I wont have water or electricity or food. I havent eaten for a week. The only thing I can think of is killing myself. Im obsessed with the idea. Its such an easy way out. The ONLY thing keeping me from doing it is my puppy. Hes a 5 month old saint bernard/collie mix with blue eyes and hes the fucking light of my life. I cant imagine leaving him in a house with a dead owner. I cry every time I think about it. I used the last of my check to buy him so food but I have no idea how long its going to last him(im trying to use as little as I can without starving him). I know this could be interpreted as me asking for money or something but it isnt. I dont expect anyone to help a random person on the internet. I just needed to get it out and talk to someone because its really hard. Life is so hard and I dont want to do this anymore. I dont see any light at the end of the tunnel. My next check is at the end of july(i start in july and we get paid monthly). I dont own a car so I cant get work anywhere outside of town. I dont know what to do and I just need to figure it out but i dont know how to. Ive never been this stressed in my life. My dad and stepmom just tell me how big of a failure I am and how I cant ever do anything right(college, this job). I just dont know what I can do... Thanks in advance to everyone that actually makes it through this shitty sob story. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys, I guess I'll just start off with how I got to this point. My mom was a drug addict since I was around 5 and that definitely had a giant impact on me growing up. I've always considered suicide since I was around 11 due to being poor and my mom's drug addiction. I've attempted suicide 11 times to date but it either fails or I bitch out at the last second. The urges toned down during high school which was the highlight of my life. It turned out that I was amazing at football. I turned that talent into a new view on life and was even able to get my mom out of my life. I felt absolutely awesome. My junior and senior year I was an all state defensive end. I absolutely loved my life. Fast forward to the end of high school. I sign to play football at a d1 university. I somehow pull the starting spot from the previous years starter. First game of the season I broke my back on the first play of the first quarter. My dream was gone. I can walk fine, and I can even get some decent exercise if I really try enough but sports is not longer an option. But I got so depressed that I dropped out of school and moved back home. My dad and step mom wouldnt let me move back in with them because we made a deal that I was going to do well at college regardless. and i guess in their minds I couldve stayed since I still had my scholarship so it was my fault. I ended up moving in with my best friends parents. His dad, lets call him steve for now, was a massive pot head. I ended up sitting on his couch for almost a year smoking weed and watching comedy central. Didnt get a job, didnt do a thing. It honestly wasnt that bad. I enjoyed it a bit. Well, I end up getting some sort of motivation to do something with my life. Around that time my grandma in another state offers to help me find a job up there and start over more or less. I took the chance. I knew it was going to be iffy but it was better than nothing. Literally the first day in town I go get my hair cut and the lady cutting my hair mentions that the local sheriffs office is hiring. So after I got my hair cut I walked over to the SO and applied. The receptionist told me to wait in the hall as she gave the application to the sheriff. I didnt think I had a good chance at getting the job but it was worth a try. The sheriff ends up coming out to the hall and we have a good long talk/interview and he hires me on the spot and tells me that when I'm of age he wants me to be a deputy for him. (forgot to mention that I got hired as a jailer) This sounded AWESOME to me. I had a pretty decent salary and had a clear career path in front of me.i worked there for 3 months and then I get called into his office before he left work(i worked the night shift) and tells me that hes going to have to lay me off until july. I freaked out. I didnt do anything to deserve getting laid off. He told me it was because there was some mismanaging of funds and that since I was the new guy I was the first to get laid off(there were others). That destroyed me. I worked the rest of the month and looked for another job in the meantime. There is nothing in this town hiring. Its so small and theres fucking nothing available. I don't qualify for unemployment because I'm 19 and havent worked enough hours to qualify. The sheriff and undersheriff hadnt ever had someone as young as me working for them so they didnt know I wouldnt qualify. It honestly wouldve been fine if I qualified. But I dont which blows. My last day working was march 28th and I've been barely getting by on that last check. I'm now completely broke and have absolutely nothing. My friend was able to send me some money for my rent next month but I wont have water or electricity or food. I havent eaten for a week. The only thing I can think of is killing myself. Im obsessed with the idea. Its such an easy way out. The ONLY thing keeping me from doing it is my puppy. Hes a 5 month old saint bernard/collie mix with blue eyes and hes the fucking light of my life. I cant imagine leaving him in a house with a dead owner. I cry every time I think about it. I used the last of my check to buy him so food but I have no idea how long its going to last him(im trying to use as little as I can without starving him). I know this could be interpreted as me asking for money or something but it isnt. I dont expect anyone to help a random person on the internet. I just needed to get it out and talk to someone because its really hard. Life is so hard and I dont want to do this anymore. I dont see any light at the end of the tunnel. My next check is at the end of july(i start in july and we get paid monthly). I dont own a car so I cant get work anywhere outside of town. I dont know what to do and I just need to figure it out but i dont know how to. Ive never been this stressed in my life. My dad and stepmom just tell me how big of a failure I am and how I cant ever do anything right(college, this job). I just dont know what I can do... Thanks in advance to everyone that actually makes it through this shitty sob story. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240r0w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "MUCHRANGO", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240r0w/need_help_maybe_just_someone_to_talk_to/", "name": "t3_240r0w", "created": 1398532553.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240r0w/need_help_maybe_just_someone_to_talk_to/", "author_flair_text": null, "title": "Need help. Maybe just someone to talk to.", "created_utc": 1398503753.0, "ups": 2, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch2hu71", "children": ["ch2i1iq"], "name": "t1_ch2i1iq", "id": "ch2i1iq"}}], "after": null, "before": null}}, "saved": false, "id": "ch2hu71", "gilded": 0, "author": "MUCHRANGO", "parent_id": "t1_ch2hqrt", "approved_by": null, "body": "Haha that's a pretty big part of it. I'm not that great at anything in particular. Sports was my thing. And I can't even be a coach without a degree, which I can't get for now.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha that&amp;#39;s a pretty big part of it. I&amp;#39;m not that great at anything in particular. Sports was my thing. And I can&amp;#39;t even be a coach without a degree, which I can&amp;#39;t get for now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hu71", "created": 1398515106.0, "author_flair_text": null, "created_utc": 1398511506.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hqrt", "gilded": 0, "author": "ThatSmilingDude", "parent_id": "t1_ch2hp95", "approved_by": null, "body": "What things are you good at? You can maybe do something you're good at and get paid. For example, I work as a Personal Trainer, don't really love it but it helps to get the bills payed. It's not easy to get a job, so don't get discouraged.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What things are you good at? You can maybe do something you&amp;#39;re good at and get paid. For example, I work as a Personal Trainer, don&amp;#39;t really love it but it helps to get the bills payed. It&amp;#39;s not easy to get a job, so don&amp;#39;t get discouraged.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hqrt", "created": 1398514464.0, "author_flair_text": null, "created_utc": 1398510864.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hp95", "gilded": 0, "author": "MUCHRANGO", "parent_id": "t1_ch2hnna", "approved_by": null, "body": "Well, at the moment I don't live near any community colleges. There really isn't anything \"public\" really. Regardless of being \"public\" in name there's still pretty expensive tuition to go. There's a couple colleges within 50 miles of me but I don't own a car at the moment so I can't really even consider it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, at the moment I don&amp;#39;t live near any community colleges. There really isn&amp;#39;t anything &amp;quot;public&amp;quot; really. Regardless of being &amp;quot;public&amp;quot; in name there&amp;#39;s still pretty expensive tuition to go. There&amp;#39;s a couple colleges within 50 miles of me but I don&amp;#39;t own a car at the moment so I can&amp;#39;t really even consider it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hp95", "created": 1398514171.0, "author_flair_text": null, "created_utc": 1398510571.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hnna", "gilded": 0, "author": "ThatSmilingDude", "parent_id": "t1_ch2hldl", "approved_by": null, "body": "I don't really understand US colleges, aren't there public or community ones? If you enjoy tackling and have a good cardio then you're pretty much set. Ball handling skills and such can be trained haha. I have the same problem with american football lol, would love to try it some time, all I can do is watch it. Hell I even think I would be a good SS or even CB.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really understand US colleges, aren&amp;#39;t there public or community ones? If you enjoy tackling and have a good cardio then you&amp;#39;re pretty much set. Ball handling skills and such can be trained haha. I have the same problem with american football lol, would love to try it some time, all I can do is watch it. Hell I even think I would be a good SS or even CB.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hnna", "created": 1398513855.0, "author_flair_text": null, "created_utc": 1398510255.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}, "saved": false, "id": "ch2hldl", "gilded": 0, "author": "MUCHRANGO", "parent_id": "t1_ch2hjwo", "approved_by": null, "body": "Well, it's a bit complicated. Biggest issue is that I can't get a loan now. My credit sucks haha. So until I fix that there's no college for me. But it's something I want to do. Wish rugby was popular in the US. I wouldve loved to try it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, it&amp;#39;s a bit complicated. Biggest issue is that I can&amp;#39;t get a loan now. My credit sucks haha. So until I fix that there&amp;#39;s no college for me. But it&amp;#39;s something I want to do. Wish rugby was popular in the US. I wouldve loved to try it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hldl", "created": 1398513437.0, "author_flair_text": null, "created_utc": 1398509837.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hjwo", "gilded": 0, "author": "ThatSmilingDude", "parent_id": "t1_ch2hi13", "approved_by": null, "body": "Rugby, ever since i'm 4 haha. Yeah, she's the best, also, she hated (I think still hates) this sport lol. Why don't you pursuit a college degree? I think that a degree is the only thing nobody can take away from you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rugby, ever since i&amp;#39;m 4 haha. Yeah, she&amp;#39;s the best, also, she hated (I think still hates) this sport lol. Why don&amp;#39;t you pursuit a college degree? I think that a degree is the only thing nobody can take away from you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hjwo", "created": 1398513145.0, "author_flair_text": null, "created_utc": 1398509545.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}, "saved": false, "id": "ch2hi13", "gilded": 0, "author": "MUCHRANGO", "parent_id": "t1_ch2hgog", "approved_by": null, "body": "Damn man that sucks. What sports did you play? btw you granny sounds like an awesome person.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn man that sucks. What sports did you play? btw you granny sounds like an awesome person.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hi13", "created": 1398512784.0, "author_flair_text": null, "created_utc": 1398509184.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hgog", "gilded": 0, "author": "ThatSmilingDude", "parent_id": "t1_ch2hdao", "approved_by": null, "body": "Sorry for any mistakes I might make, English is not my mother tongue. My dad left my mother when I was 1, she always had some sort of madurative problem so she had to give me away to my grandmother, basically she raised me alone because my grandfather left her as well, she is a cronic depressive and has tried to suicide so many times I can't even remember. I'm the only person she has left in this world. I am good at sports as well, but the sport I love is not really something you can live off here in my country (Argentina), also i've been injured for almost half a year now, so I have to study and work at a shitty job. I don't really have much to live for, other than my granny, but I still do it for myself, because I know there's always light at the end of the tunnel and I know, eventually, i'll get better. It might be just the good attitude I always had towards life. Sooo if you ever fell like talking about anything just hit me up. I'm here.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for any mistakes I might make, English is not my mother tongue. My dad left my mother when I was 1, she always had some sort of madurative problem so she had to give me away to my grandmother, basically she raised me alone because my grandfather left her as well, she is a cronic depressive and has tried to suicide so many times I can&amp;#39;t even remember. I&amp;#39;m the only person she has left in this world. I am good at sports as well, but the sport I love is not really something you can live off here in my country (Argentina), also i&amp;#39;ve been injured for almost half a year now, so I have to study and work at a shitty job. I don&amp;#39;t really have much to live for, other than my granny, but I still do it for myself, because I know there&amp;#39;s always light at the end of the tunnel and I know, eventually, i&amp;#39;ll get better. It might be just the good attitude I always had towards life. Sooo if you ever fell like talking about anything just hit me up. I&amp;#39;m here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hgog", "created": 1398512525.0, "author_flair_text": null, "created_utc": 1398508925.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2hdao", "gilded": 0, "author": "MUCHRANGO", "parent_id": "t1_ch2h0di", "approved_by": null, "body": "Care to give a little tldr of your story?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Care to give a little tldr of your story?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2hdao", "created": 1398511846.0, "author_flair_text": null, "created_utc": 1398508246.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2h0di", "gilded": 0, "author": "ThatSmilingDude", "parent_id": "t3_240r0w", "approved_by": null, "body": "Sup dude? I'm here if you wanna talk, I kinda had the same story. Trust me when I tell you, there's always another way.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sup dude? I&amp;#39;m here if you wanna talk, I kinda had the same story. Trust me when I tell you, there&amp;#39;s always another way.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240r0w", "score_hidden": false, "name": "t1_ch2h0di", "created": 1398509193.0, "author_flair_text": null, "created_utc": 1398505593.0, "distinguished": null, "num_reports": null, "ups": 0}}], "after": null, "before": null}}]