[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t handle being a mom anymore.  Don&amp;#39;t know how to deal with a screaming, crying newborn who never seems to be happy or satisfied.  I feel like this is never going to get any better.  I seriously think about killing myself because I don&amp;#39;t know how to handle this.  I cry for hours every day while my baby cries too.  I just want everything to be better.&lt;/p&gt;\n\n&lt;p&gt;Update: Thank you for your comments everyone.  I made an appointment with my OBGYN tomorrow to talk to her about what I am going through.  Yes, I do have people around me, including a husband, family, and friends, but what I am feeling goes beyond what any of them can do for me.  Again, thank you all for taking the time to comment, I appreciate it:&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't handle being a mom anymore.  Don't know how to deal with a screaming, crying newborn who never seems to be happy or satisfied.  I feel like this is never going to get any better.  I seriously think about killing myself because I don't know how to handle this.  I cry for hours every day while my baby cries too.  I just want everything to be better.\n\nUpdate: Thank you for your comments everyone.  I made an appointment with my OBGYN tomorrow to talk to her about what I am going through.  Yes, I do have people around me, including a husband, family, and friends, but what I am feeling goes beyond what any of them can do for me.  Again, thank you all for taking the time to comment, I appreciate it:", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252kim", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Nohopeleft_", "media": null, "score": 17, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399618797.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252kim/new_mom_i_feel_like_killing_myself/", "name": "t3_252kim", "created": 1399609756.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252kim/new_mom_i_feel_like_killing_myself/", "author_flair_text": null, "title": "New mom. I feel like killing myself.", "created_utc": 1399580956.0, "ups": 19, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdb26u", "gilded": 0, "author": "undercurrents", "parent_id": "t1_chd4u5u", "approved_by": null, "body": "I don't think OP is in any state to go through this list, and she should take your advice and go straight to a doctor, because as you said, post-partum depression is very real, very serious, and very treatable, but I just wanted to include a link to resources for post-partum depression if anyone else who stumbles on this post needs them: http://hh.reddit.com/r/TwoXChromosomes/comments/q929h/resources_for_moms_those_who_are_going_to_be_moms/", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think OP is in any state to go through this list, and she should take your advice and go straight to a doctor, because as you said, post-partum depression is very real, very serious, and very treatable, but I just wanted to include a link to resources for post-partum depression if anyone else who stumbles on this post needs them: &lt;a href=\"http://hh.reddit.com/r/TwoXChromosomes/comments/q929h/resources_for_moms_those_who_are_going_to_be_moms/\"&gt;http://hh.reddit.com/r/TwoXChromosomes/comments/q929h/resources_for_moms_those_who_are_going_to_be_moms/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chdb26u", "created": 1399631175.0, "author_flair_text": null, "created_utc": 1399602375.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd5ilv", "gilded": 0, "author": "meowburgermeow", "parent_id": "t1_chd546w", "approved_by": null, "body": "Part of it is just the exhaustion, emotions, and getting used to something new. Everyone goes through that. But for some, it's a legit chemical imbalance that you can't just think yourself out of.  I knew to talk to my doctor when I got over the hard period and my daughter was starting to sleep, breastfeeding was easier, and I had a schedule established and was getting more sleep myself, and the depression was still there and it was distinctly physical, like getting hit by a truckload of sad.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Part of it is just the exhaustion, emotions, and getting used to something new. Everyone goes through that. But for some, it&amp;#39;s a legit chemical imbalance that you can&amp;#39;t just think yourself out of.  I knew to talk to my doctor when I got over the hard period and my daughter was starting to sleep, breastfeeding was easier, and I had a schedule established and was getting more sleep myself, and the depression was still there and it was distinctly physical, like getting hit by a truckload of sad.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chd5ilv", "created": 1399620012.0, "author_flair_text": null, "created_utc": 1399591212.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdof93", "gilded": 0, "author": "LocutusOfBorges", "parent_id": "t1_chdaz53", "approved_by": null, "body": "&gt; You are essentially saying that it's sad that someone requires medication when they should just naturally be wonderful after \"something as natural as childbirth.\"\n\nI'm not. That wasn't the intention at all, and I'm sorry if it was taken that way. \n\nI've had some crippling experiences with depression in the past. The comment was meant to be sympathetic- it's *awful* that an illness like depression can be triggered by childbirth, and people in that position deserve nothing but sympathy and understanding. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You are essentially saying that it&amp;#39;s sad that someone requires medication when they should just naturally be wonderful after &amp;quot;something as natural as childbirth.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not. That wasn&amp;#39;t the intention at all, and I&amp;#39;m sorry if it was taken that way. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had some crippling experiences with depression in the past. The comment was meant to be sympathetic- it&amp;#39;s &lt;em&gt;awful&lt;/em&gt; that an illness like depression can be triggered by childbirth, and people in that position deserve nothing but sympathy and understanding. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chdof93", "created": 1399677507.0, "author_flair_text": null, "created_utc": 1399648707.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chdaz53", "gilded": 0, "author": "undercurrents", "parent_id": "t1_chd546w", "approved_by": null, "body": "this is actually a really insulting, judgmental, ignorant comment. You are essentially saying that it's sad that someone requires medication when they should just naturally be wonderful after \"something as natural as childbirth.\"  Comments like yours, even if this wasn't your intention, are what keep new mothers *and fathers* with postpartum depression from seeking help because everyone around them is telling them how parenthood should just be natural and blissful, so they feel like failures rather than recognizing it for the very real medical condition it is. Plus, if you don't think severe depression is possible \"natural\" consequence of \"natural\" childbirth, I'm not sure you understand what is \"naturally\" occurring in a woman's body, brain, and hormones. ", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is actually a really insulting, judgmental, ignorant comment. You are essentially saying that it&amp;#39;s sad that someone requires medication when they should just naturally be wonderful after &amp;quot;something as natural as childbirth.&amp;quot;  Comments like yours, even if this wasn&amp;#39;t your intention, are what keep new mothers &lt;em&gt;and fathers&lt;/em&gt; with postpartum depression from seeking help because everyone around them is telling them how parenthood should just be natural and blissful, so they feel like failures rather than recognizing it for the very real medical condition it is. Plus, if you don&amp;#39;t think severe depression is possible &amp;quot;natural&amp;quot; consequence of &amp;quot;natural&amp;quot; childbirth, I&amp;#39;m not sure you understand what is &amp;quot;naturally&amp;quot; occurring in a woman&amp;#39;s body, brain, and hormones. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chdaz53", "created": 1399631008.0, "author_flair_text": null, "created_utc": 1399602208.0, "distinguished": null, "num_reports": null, "ups": 8}}], "after": null, "before": null}}, "saved": false, "id": "chd546w", "gilded": 0, "author": "LocutusOfBorges", "parent_id": "t1_chd4u5u", "approved_by": null, "body": "It's so sad that something as natural as childbirth can bring on depression to the point of needing medication. Christ. \n\nGlad to hear things are looking up. Nobody should have to go through depression forever. ", "edited": false, "author_flair_css_class": null, "downs": 8, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s so sad that something as natural as childbirth can bring on depression to the point of needing medication. Christ. &lt;/p&gt;\n\n&lt;p&gt;Glad to hear things are looking up. Nobody should have to go through depression forever. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chd546w", "created": 1399619094.0, "author_flair_text": null, "created_utc": 1399590294.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "saved": false, "id": "chd4u5u", "gilded": 0, "author": "meowburgermeow", "parent_id": "t3_252kim", "approved_by": null, "body": "Postpartum depression is real. I had it, I got on Zoloft and it helped a lot. My daughter is 4 months now and life is so much more beautiful. Please talk to a doctor. I'm telling you it CAN get better, easy as that.\n\nEdit: it DOES get better.\nEdit: 4 months ", "edited": 1399591413.0, "author_flair_css_class": null, "downs": 5, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Postpartum depression is real. I had it, I got on Zoloft and it helped a lot. My daughter is 4 months now and life is so much more beautiful. Please talk to a doctor. I&amp;#39;m telling you it CAN get better, easy as that.&lt;/p&gt;\n\n&lt;p&gt;Edit: it DOES get better.\nEdit: 4 months &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chd4u5u", "created": 1399618462.0, "author_flair_text": null, "created_utc": 1399589662.0, "distinguished": null, "num_reports": null, "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd2kmj", "gilded": 0, "author": "thr0waw4y45", "parent_id": "t3_252kim", "approved_by": null, "body": "I'm sorry to hear that. Do you have people that can support you? A partner, your family or friends? Local new parent groups? Being a new parent is a huge challenge, so it's ok to feel overwhelmed. But please reach out to any and all support you can get, and don't forget to give yourself some space in the day.\n\nPlease also realise it will definitely get better (I have two young sons). The first months of a newborn's life are the hardest on the parents because your baby really only has one way to communicate with you, and your natural instincts mean you always react very strongly to their distress. However one day your baby will stop crying and will start smiling at the sight of you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear that. Do you have people that can support you? A partner, your family or friends? Local new parent groups? Being a new parent is a huge challenge, so it&amp;#39;s ok to feel overwhelmed. But please reach out to any and all support you can get, and don&amp;#39;t forget to give yourself some space in the day.&lt;/p&gt;\n\n&lt;p&gt;Please also realise it will definitely get better (I have two young sons). The first months of a newborn&amp;#39;s life are the hardest on the parents because your baby really only has one way to communicate with you, and your natural instincts mean you always react very strongly to their distress. However one day your baby will stop crying and will start smiling at the sight of you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chd2kmj", "created": 1399613505.0, "author_flair_text": null, "created_utc": 1399584705.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheb332", "gilded": 0, "author": "undercurrents", "parent_id": "t3_252kim", "approved_by": null, "body": "Congrats on your update, OP. And yes, you can be surrounded by people who love and care for you yet with depression you still feel completely alone. They can be there to support you, but you need actual medical intervention to help you get better just as you would with any other medical condition (need family and friend support while you go through medical treatment). Make sure to give your husband resources on postpartum depression so he can attempt to grasp how out of control, and not like your normal self that you are feeling- and that it isn't your fault for feeling this way. I know with a new baby this seems impossible, but really try to get into therapy with someone who specializes in postpartum depression. Also, have therapy sessions that include your husband as well because you need his full support and as much understanding as possible. Of course, it seems like an impossible request for you to take time for yourself to go to therapy, but you have to see this as crucial not only to your own life, but to your child's as well. This is as crucial as seeking any other life saving medical treatment.\n\nIn the resource link I posted in another comment, it talks about the toll a parent's depression takes on the emotional development of a baby. So getting you better needs to be your number one priority. And you didn't do anything wrong to be in this state, nor are you failing as a mother. Postpartum depression, or depression in general, has nothing to do with weakness of character whatsoever. \n\nDepending on how close you are and how much you trust your support network, open up to them about your postpartum depression and hopefully some of them will come through for you in offering to take the baby off your hands for a few hours each day, or especially to take care of him/her while you go to therapy and appointments with the psychiatrist. This is where you see the idea of \"it takes a village\" go into effect. If you need to turn to other people right now to help you care for your baby while you care for yourself, there's no guilt in that. Just because having children is \"natural\", that doesn't somehow equate to it being simple, seamless, and effortless. \n\nHere's an excerpt from Brooke Shield's book, Down Came The Rain\n\n&gt;At first I thought what I was feeling was just exhaustion, but with it came an overriding sense of panic that I had never felt before. Rowan kept crying, and I began to dread the moment when Chris would bring her back to me. I started to experience a sick sensation in my stomach; it was as if a vise were tightening around my chest. Instead of the nervous anxiety that often accompanies panic, a feeling of devastation overcame me. I hardly moved. Sitting on my bed, I let out a deep, slow, guttural wail. I wasn’t simply emotional or weepy, like I had been told I might be. This was something quite different. In the past, if I got depressed or if I felt sad or down, I knew I could counteract it with exercise, a good night’s sleep, or a nice dinner with a friend. If PMS made me introspective or melancholy, or if the pressures of life made me gloomy, I knew these feelings wouldn’t last forever. But this was sadness of a shockingly different magnitude. It felt as if it would never go away....\n\n&gt;\"I was incapable of holding or looking at or kissing or smelling my perfect tiny little baby. I'd hide in the shower in a fetal position—and put the hot water on and hope it would melt me away... He [her husband] came up to me one day and said, 'Why don't you sing to her? Why don't you smile at her?'\"...\"I was beginning to seriously plan ways I could disappear quietly but permanently,\"...\n\n&gt;...I watched as Chris finished the diapering, and felt like a beached whale. I was failing at things that, according to popular belief, were supposed to be the most natural in a woman’s life. I had never been uncomfortable around babies, and they always responded positively to me. In fact, it sometimes surprised people when their babies opened their arms to me so quickly. Everybody always said that I would make a great mom one day. I tried to rationalize that I was physically impaired and should give myself a break, but I didn’t have any desire to power through and care for this baby. I got hit with a wave of self-defeat and self-loathing and had an urge to smash my head against the wall repeatedly. Chris told me to get off my feet and back into bed. Once there, my crying recommenced, and I started strongly believing that I couldn’t be a mother. I was already proving to be incompetent, and we hadn’t been home a day! What had I done? Why didn’t I want to be near my baby?...\n\n&gt;...I started to sob once more. I sat up with my huge legs stretched out in front of me and, slowly rocking back and forth with my face up toward the ceiling, my arms limp at my sides, I sobbed. I couldn’t stop. What was I going to do? Was I ever going to stop feeling like this? Misery enveloped me.\n\n&gt;I really needed to rest, but we seemed to be in an unrelenting routine of sporadic sleep, baby care, and lots of tears. The baby would wake up every hour and a half, and I would struggle to get her latched on. By the time she was on and had eaten a meal (if she stayed awake long enough to finish one), it was time to start all over again. Just as I would begin to fall into an exhausted sleep, Rowan’s little bark, like Chinese water torture, would wake me up. This schedule continued incessantly and, thinking that it would be like this forever, I began to feel delirious. I was practically inconsolable. I couldn’t stand any of it.\n\n&gt;...I had never felt emotion like this, and I strongly believed that even if I could articulate what I was experiencing, nobody would understand, not even my husband. And if he did understand, he certainly wouldn’t be able to help. Chris kept doing all he could to keep the baby contented while continuing to try to talk to me. I knew he must be tired, too, but we couldn’t seem to get on a schedule that allowed one of us to sleep while the other tended to the infant. Plus, I was afraid to let Chris sleep, because I was scared to be alone. Even though we were in the same apartment, if he was sleeping and I was awake, I thought I might try to escape or wouldn’t be able to stop myself from swallowing a bottle of pills. I even thought that I’d welcome being kidnapped. These were strange, irrational fears that still felt real to me...\n\n&gt;...After only a couple of days of being home, my crying had increased and no longer occurred only in between feedings but during them as well. At times I even had trouble holding Rowan because of my choking sobs. Why was I crying more than my baby? Here I was, finally the mother of a beautiful baby girl I had worked so hard to have, and I felt like my life was over. Where was the bliss? Where was the happiness that I had expected to feel by becoming a mother? She was my baby; the baby I had wanted for so long. Why didn’t I feel remotely comforted by having or holding her?...\n\n&gt;...It occurred to me that my life was no longer my own and that I was a prisoner to a small, squeaking creature. I did not like it one bit. I felt stuck. I did not want the responsibility this situation demanded. I started feeling like I had made a terrible mistake in having this child. I would look at how little and vulnerable she was and didn’t feel at all capable of tending to her needs. Her helplessness terrified me. Rather than wanting to care for her, I wanted to forget her and run away.\n\n&gt;...I had thought that it would all get better once we got home, but it was unbelievably worse. I felt no connection to my daughter and wanted to die because of it. She grew inside my body, for God’s sake, and I didn’t even feel related to her. I had always thought I would immediately feel closer to my child than I did to anybody else in my life. I’d thought we would be undeniably bonded from the moment I laid eyes on her. What was wrong with me? What a horrible mother I was! Her cry didn’t annoy me or grate on my nerves, but it also didn’t register with me, either. I felt numb to it. I practically had to strain to hear her voice, which seemed so far away, even though she was in the adjoining room and the door was open. I could almost justify not hearing it.\n\n&gt;My profound detachment made me suffer unbearably, and I believed I had nowhere to turn. I remember looking out of the bedroom window and envisioning myself jumping. I concluded that it wouldn’t be too effective, because we weren’t high enough. This upset me even more. The frightening part was that my thoughts were extremely rational. They made clear sense to me. It felt like an appealing option to erase myself from this life. What would stop me from acting on any of these thoughts? I needed and wanted a way out. My mind was full of visions of escape, and these constantly overshadowed thoughts about my miraculous baby girl.\n\n&gt;During what was becoming one of the darkest points in my life, I sat holding my newborn and could not avoid the image of her flying through the air and hitting the wall in front of me. I had no desire to hurt my baby and didn’t see myself as the one throwing her, thank God, but the wall morphed into a video game, and in it her little body smacked the surface and slid down onto the floor. I was horrified, and although I knew deep in my soul that I would not harm her, the image all but destroyed me...\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats on your update, OP. And yes, you can be surrounded by people who love and care for you yet with depression you still feel completely alone. They can be there to support you, but you need actual medical intervention to help you get better just as you would with any other medical condition (need family and friend support while you go through medical treatment). Make sure to give your husband resources on postpartum depression so he can attempt to grasp how out of control, and not like your normal self that you are feeling- and that it isn&amp;#39;t your fault for feeling this way. I know with a new baby this seems impossible, but really try to get into therapy with someone who specializes in postpartum depression. Also, have therapy sessions that include your husband as well because you need his full support and as much understanding as possible. Of course, it seems like an impossible request for you to take time for yourself to go to therapy, but you have to see this as crucial not only to your own life, but to your child&amp;#39;s as well. This is as crucial as seeking any other life saving medical treatment.&lt;/p&gt;\n\n&lt;p&gt;In the resource link I posted in another comment, it talks about the toll a parent&amp;#39;s depression takes on the emotional development of a baby. So getting you better needs to be your number one priority. And you didn&amp;#39;t do anything wrong to be in this state, nor are you failing as a mother. Postpartum depression, or depression in general, has nothing to do with weakness of character whatsoever. &lt;/p&gt;\n\n&lt;p&gt;Depending on how close you are and how much you trust your support network, open up to them about your postpartum depression and hopefully some of them will come through for you in offering to take the baby off your hands for a few hours each day, or especially to take care of him/her while you go to therapy and appointments with the psychiatrist. This is where you see the idea of &amp;quot;it takes a village&amp;quot; go into effect. If you need to turn to other people right now to help you care for your baby while you care for yourself, there&amp;#39;s no guilt in that. Just because having children is &amp;quot;natural&amp;quot;, that doesn&amp;#39;t somehow equate to it being simple, seamless, and effortless. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s an excerpt from Brooke Shield&amp;#39;s book, Down Came The Rain&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At first I thought what I was feeling was just exhaustion, but with it came an overriding sense of panic that I had never felt before. Rowan kept crying, and I began to dread the moment when Chris would bring her back to me. I started to experience a sick sensation in my stomach; it was as if a vise were tightening around my chest. Instead of the nervous anxiety that often accompanies panic, a feeling of devastation overcame me. I hardly moved. Sitting on my bed, I let out a deep, slow, guttural wail. I wasn’t simply emotional or weepy, like I had been told I might be. This was something quite different. In the past, if I got depressed or if I felt sad or down, I knew I could counteract it with exercise, a good night’s sleep, or a nice dinner with a friend. If PMS made me introspective or melancholy, or if the pressures of life made me gloomy, I knew these feelings wouldn’t last forever. But this was sadness of a shockingly different magnitude. It felt as if it would never go away....&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was incapable of holding or looking at or kissing or smelling my perfect tiny little baby. I&amp;#39;d hide in the shower in a fetal position—and put the hot water on and hope it would melt me away... He [her husband] came up to me one day and said, &amp;#39;Why don&amp;#39;t you sing to her? Why don&amp;#39;t you smile at her?&amp;#39;&amp;quot;...&amp;quot;I was beginning to seriously plan ways I could disappear quietly but permanently,&amp;quot;...&lt;/p&gt;\n\n&lt;p&gt;...I watched as Chris finished the diapering, and felt like a beached whale. I was failing at things that, according to popular belief, were supposed to be the most natural in a woman’s life. I had never been uncomfortable around babies, and they always responded positively to me. In fact, it sometimes surprised people when their babies opened their arms to me so quickly. Everybody always said that I would make a great mom one day. I tried to rationalize that I was physically impaired and should give myself a break, but I didn’t have any desire to power through and care for this baby. I got hit with a wave of self-defeat and self-loathing and had an urge to smash my head against the wall repeatedly. Chris told me to get off my feet and back into bed. Once there, my crying recommenced, and I started strongly believing that I couldn’t be a mother. I was already proving to be incompetent, and we hadn’t been home a day! What had I done? Why didn’t I want to be near my baby?...&lt;/p&gt;\n\n&lt;p&gt;...I started to sob once more. I sat up with my huge legs stretched out in front of me and, slowly rocking back and forth with my face up toward the ceiling, my arms limp at my sides, I sobbed. I couldn’t stop. What was I going to do? Was I ever going to stop feeling like this? Misery enveloped me.&lt;/p&gt;\n\n&lt;p&gt;I really needed to rest, but we seemed to be in an unrelenting routine of sporadic sleep, baby care, and lots of tears. The baby would wake up every hour and a half, and I would struggle to get her latched on. By the time she was on and had eaten a meal (if she stayed awake long enough to finish one), it was time to start all over again. Just as I would begin to fall into an exhausted sleep, Rowan’s little bark, like Chinese water torture, would wake me up. This schedule continued incessantly and, thinking that it would be like this forever, I began to feel delirious. I was practically inconsolable. I couldn’t stand any of it.&lt;/p&gt;\n\n&lt;p&gt;...I had never felt emotion like this, and I strongly believed that even if I could articulate what I was experiencing, nobody would understand, not even my husband. And if he did understand, he certainly wouldn’t be able to help. Chris kept doing all he could to keep the baby contented while continuing to try to talk to me. I knew he must be tired, too, but we couldn’t seem to get on a schedule that allowed one of us to sleep while the other tended to the infant. Plus, I was afraid to let Chris sleep, because I was scared to be alone. Even though we were in the same apartment, if he was sleeping and I was awake, I thought I might try to escape or wouldn’t be able to stop myself from swallowing a bottle of pills. I even thought that I’d welcome being kidnapped. These were strange, irrational fears that still felt real to me...&lt;/p&gt;\n\n&lt;p&gt;...After only a couple of days of being home, my crying had increased and no longer occurred only in between feedings but during them as well. At times I even had trouble holding Rowan because of my choking sobs. Why was I crying more than my baby? Here I was, finally the mother of a beautiful baby girl I had worked so hard to have, and I felt like my life was over. Where was the bliss? Where was the happiness that I had expected to feel by becoming a mother? She was my baby; the baby I had wanted for so long. Why didn’t I feel remotely comforted by having or holding her?...&lt;/p&gt;\n\n&lt;p&gt;...It occurred to me that my life was no longer my own and that I was a prisoner to a small, squeaking creature. I did not like it one bit. I felt stuck. I did not want the responsibility this situation demanded. I started feeling like I had made a terrible mistake in having this child. I would look at how little and vulnerable she was and didn’t feel at all capable of tending to her needs. Her helplessness terrified me. Rather than wanting to care for her, I wanted to forget her and run away.&lt;/p&gt;\n\n&lt;p&gt;...I had thought that it would all get better once we got home, but it was unbelievably worse. I felt no connection to my daughter and wanted to die because of it. She grew inside my body, for God’s sake, and I didn’t even feel related to her. I had always thought I would immediately feel closer to my child than I did to anybody else in my life. I’d thought we would be undeniably bonded from the moment I laid eyes on her. What was wrong with me? What a horrible mother I was! Her cry didn’t annoy me or grate on my nerves, but it also didn’t register with me, either. I felt numb to it. I practically had to strain to hear her voice, which seemed so far away, even though she was in the adjoining room and the door was open. I could almost justify not hearing it.&lt;/p&gt;\n\n&lt;p&gt;My profound detachment made me suffer unbearably, and I believed I had nowhere to turn. I remember looking out of the bedroom window and envisioning myself jumping. I concluded that it wouldn’t be too effective, because we weren’t high enough. This upset me even more. The frightening part was that my thoughts were extremely rational. They made clear sense to me. It felt like an appealing option to erase myself from this life. What would stop me from acting on any of these thoughts? I needed and wanted a way out. My mind was full of visions of escape, and these constantly overshadowed thoughts about my miraculous baby girl.&lt;/p&gt;\n\n&lt;p&gt;During what was becoming one of the darkest points in my life, I sat holding my newborn and could not avoid the image of her flying through the air and hitting the wall in front of me. I had no desire to hurt my baby and didn’t see myself as the one throwing her, thank God, but the wall morphed into a video game, and in it her little body smacked the surface and slid down onto the floor. I was horrified, and although I knew deep in my soul that I would not harm her, the image all but destroyed me...&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_cheb332", "created": 1399735220.0, "author_flair_text": null, "created_utc": 1399706420.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdbpqy", "gilded": 0, "author": "opentoinput", "parent_id": "t3_252kim", "approved_by": null, "body": "Please read this\n\nhttp://www.babycenter.com/0_harvey-karps-happiest-baby-method-for-baby-sleep-and-soothin_10373838.bc\nHave to do every step correctly and it works\n\nThis isn't the guy who invented it.\n\nI saw the original guy take three hysterical babies and make them happy in one minute each.  The moms were dumbfounded.  And demanded to know how to do in on stage.  The audience full of women, gasped.\n\nIf you can find the video, it is worth watching.\n\n", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please read this&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.babycenter.com/0_harvey-karps-happiest-baby-method-for-baby-sleep-and-soothin_10373838.bc\"&gt;http://www.babycenter.com/0_harvey-karps-happiest-baby-method-for-baby-sleep-and-soothin_10373838.bc&lt;/a&gt;\nHave to do every step correctly and it works&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t the guy who invented it.&lt;/p&gt;\n\n&lt;p&gt;I saw the original guy take three hysterical babies and make them happy in one minute each.  The moms were dumbfounded.  And demanded to know how to do in on stage.  The audience full of women, gasped.&lt;/p&gt;\n\n&lt;p&gt;If you can find the video, it is worth watching.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252kim", "score_hidden": false, "name": "t1_chdbpqy", "created": 1399632652.0, "author_flair_text": null, "created_utc": 1399603852.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]