[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend broke up with me over a card reading saying someone was going to cheat in our relationship this month. Less than 12 hours later she had sex with a co-worker. Tonight I had plans to hang out with her just the two of us because we had planned on getting back together at the end of the month when her paranoia over the stupid reading was gone. I didn&amp;#39;t want to be dating her anymore but I need to stay on her good side because I have a Assault (DV) charge against me dealing with her, it was a bogus situation and she was going to testify for me in court. The ass hole she slept with was there tonight. I tried to get her to promise me she wouldn&amp;#39;t sleep with him again while we were on this cheating prevention breakup. She couldn&amp;#39;t promise it. Refused to. I asked why, she said because she enjoyed having sex with him more than she ever did with me in the 4 years of dating. I snapped, snapped like I never knew I could. I marched back to the room he was in and beat the crap out of him, broke my hand in at least two places. He just laid there and took it, never once swung back, was lying on the ground with his arms wrapped around my legs while I beat the back of his head. I snapped out of it, gathered all my stuff and went to leave. I let out 4 years of frustration of a shitty girlfriend, who cheated on me, lied to me, made me feel terrible, didn&amp;#39;t support me, didn&amp;#39;t appreciate what I did for her, didn&amp;#39;t appreciate the thousands of dollars I spent to make her life better, I let it all out on this kid because I was pissed she slept with him. As I was leaving I saw him on the ground in the bathroom crying, I was so full of adrenaline I was proud of what I&amp;#39;d done. My ex followed me out as I got to the car and told me she couldn&amp;#39;t believe I&amp;#39;d done something so low and childish. I told her she was a slut and I hated her and I left. I&amp;#39;m coming down of the adrenaline now. I have a friend over there and he told me that this kid didn&amp;#39;t call the cops, didn&amp;#39;t want to. He&amp;#39;s 5 years younger than me and 2 years younger then the ex, he didn&amp;#39;t stand a chance, I came out of nowhere, I don&amp;#39;t know why I did it, I feel awful now. I can&amp;#39;t believe I&amp;#39;m capable of such a thing. I&amp;#39;ve always had temper issues but its always been limited to yelling. I&amp;#39;ve never once had a strong desire to beat the crap out of someone and yet it happened so quick it scares me I was capable of such an awful thing. I love my ex still, I can&amp;#39;t believe I ended it like this. I love her and I want her life to be better and now I know I just made her a nice path to fuck it up with this guy. I&amp;#39;ve called my sister, called several friends, told me roommates to get home from out driving to talk with me. I went from feeling proud and thinking I did the right thing to feeling awful, ashamed, broken. I called the suicide hotline because I was starting to have serious bad thoughts, I own a motorcycle it wouldn&amp;#39;t be hard to get myself killed on that. I stood there next to the bike with the keys in my hand for who knows how long before making the call. I knew I needed to get help but the clinic is full. I have no one to talk to now, everyone I had has gone to bed and left me. Now on top of feeling ashamed and bad about what I did I also feel abandoned that I have no one here to help. I&amp;#39;m trying to keep my mind occupied with other things but I can&amp;#39;t do it. I can&amp;#39;t believe what I turned into tonight and I don&amp;#39;t want to live with this. I was having problems before tonight but now I&amp;#39;m sitting here with a broken hand from hitting this guy constantly reminding me of what an animal I truly am.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My girlfriend broke up with me over a card reading saying someone was going to cheat in our relationship this month. Less than 12 hours later she had sex with a co-worker. Tonight I had plans to hang out with her just the two of us because we had planned on getting back together at the end of the month when her paranoia over the stupid reading was gone. I didn't want to be dating her anymore but I need to stay on her good side because I have a Assault (DV) charge against me dealing with her, it was a bogus situation and she was going to testify for me in court. The ass hole she slept with was there tonight. I tried to get her to promise me she wouldn't sleep with him again while we were on this cheating prevention breakup. She couldn't promise it. Refused to. I asked why, she said because she enjoyed having sex with him more than she ever did with me in the 4 years of dating. I snapped, snapped like I never knew I could. I marched back to the room he was in and beat the crap out of him, broke my hand in at least two places. He just laid there and took it, never once swung back, was lying on the ground with his arms wrapped around my legs while I beat the back of his head. I snapped out of it, gathered all my stuff and went to leave. I let out 4 years of frustration of a shitty girlfriend, who cheated on me, lied to me, made me feel terrible, didn't support me, didn't appreciate what I did for her, didn't appreciate the thousands of dollars I spent to make her life better, I let it all out on this kid because I was pissed she slept with him. As I was leaving I saw him on the ground in the bathroom crying, I was so full of adrenaline I was proud of what I'd done. My ex followed me out as I got to the car and told me she couldn't believe I'd done something so low and childish. I told her she was a slut and I hated her and I left. I'm coming down of the adrenaline now. I have a friend over there and he told me that this kid didn't call the cops, didn't want to. He's 5 years younger than me and 2 years younger then the ex, he didn't stand a chance, I came out of nowhere, I don't know why I did it, I feel awful now. I can't believe I'm capable of such a thing. I've always had temper issues but its always been limited to yelling. I've never once had a strong desire to beat the crap out of someone and yet it happened so quick it scares me I was capable of such an awful thing. I love my ex still, I can't believe I ended it like this. I love her and I want her life to be better and now I know I just made her a nice path to fuck it up with this guy. I've called my sister, called several friends, told me roommates to get home from out driving to talk with me. I went from feeling proud and thinking I did the right thing to feeling awful, ashamed, broken. I called the suicide hotline because I was starting to have serious bad thoughts, I own a motorcycle it wouldn't be hard to get myself killed on that. I stood there next to the bike with the keys in my hand for who knows how long before making the call. I knew I needed to get help but the clinic is full. I have no one to talk to now, everyone I had has gone to bed and left me. Now on top of feeling ashamed and bad about what I did I also feel abandoned that I have no one here to help. I'm trying to keep my mind occupied with other things but I can't do it. I can't believe what I turned into tonight and I don't want to live with this. I was having problems before tonight but now I'm sitting here with a broken hand from hitting this guy constantly reminding me of what an animal I truly am.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24rfu9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Kodoku989", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24rfu9/night_went_to_hell_suicide_clinic_is_full_i_dont/", "name": "t3_24rfu9", "created": 1399309330.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24rfu9/night_went_to_hell_suicide_clinic_is_full_i_dont/", "author_flair_text": null, "title": "Night went to hell. Suicide clinic is full. I don't know what to do.", "created_utc": 1399280530.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9y68z", "gilded": 0, "author": "boobmuncher", "parent_id": "t3_24rfu9", "approved_by": null, "body": "You're not an animal. If you truly were, you wouldn't be feeling bad about what happened. Even the best of us crack sometimes, and in your case, it seems like all the fucked up shit your girlfriend (btw she doesn't sound like a very good person, you deserve and can do better) did to you just EXPLODED after being kept in. \n\nEverybody is capable of doing something like that, OP. You are, and I am, and your mother and friends and my father and friends all are. President Obama is capable of it. It's just that some people haven't found the right tools to handle it properly, and that's not a bad thing, just something to work on! \n\nLike I said before, the very fact that you feel bad about what happened shows you are not an animal. You are human. And it looks like you are a good human too :-)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not an animal. If you truly were, you wouldn&amp;#39;t be feeling bad about what happened. Even the best of us crack sometimes, and in your case, it seems like all the fucked up shit your girlfriend (btw she doesn&amp;#39;t sound like a very good person, you deserve and can do better) did to you just EXPLODED after being kept in. &lt;/p&gt;\n\n&lt;p&gt;Everybody is capable of doing something like that, OP. You are, and I am, and your mother and friends and my father and friends all are. President Obama is capable of it. It&amp;#39;s just that some people haven&amp;#39;t found the right tools to handle it properly, and that&amp;#39;s not a bad thing, just something to work on! &lt;/p&gt;\n\n&lt;p&gt;Like I said before, the very fact that you feel bad about what happened shows you are not an animal. You are human. And it looks like you are a good human too :-)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rfu9", "score_hidden": false, "name": "t1_ch9y68z", "created": 1399314111.0, "author_flair_text": null, "created_utc": 1399285311.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9xqt1", "gilded": 0, "author": "electric-six", "parent_id": "t3_24rfu9", "approved_by": null, "body": "I know exactly how you feel. One moment things are okay, and the next all hell has broken loose. \n\nbeen three weeks since my life went to pot. Struggling like hell while the ex doesn't give a crap. You just have to believe it will get better. Nights are always the worst, you are alone with nothing but memories, anger and regret. While your heart breaks and pines for the other person.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly how you feel. One moment things are okay, and the next all hell has broken loose. &lt;/p&gt;\n\n&lt;p&gt;been three weeks since my life went to pot. Struggling like hell while the ex doesn&amp;#39;t give a crap. You just have to believe it will get better. Nights are always the worst, you are alone with nothing but memories, anger and regret. While your heart breaks and pines for the other person.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24rfu9", "score_hidden": false, "name": "t1_ch9xqt1", "created": 1399311263.0, "author_flair_text": null, "created_utc": 1399282463.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]