[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel like a story teller at a free reading, who gets consistently boo&amp;#39;d off stage. As though even the people who came to me on their own and are choosing to stay near my by their own accord are lashing out to get rid of me. I&amp;#39;ve never been welcome anywhere, and now I don&amp;#39;t even have my family to turn to. My dad seems like he is slipping into Alzheimer&amp;#39;s 15 years younger than his mom did and he is the parent to which I am most similar. My mom can &amp;#39;care&amp;#39; about what I have to say for about 5 minutes before she has to find someone else to talk to or change the subject entirely. My friends don&amp;#39;t want me to come with them anywhere fun anymore because I &amp;#39;weird out&amp;#39; people in public. The worst bit is the last part is pretty true from what I&amp;#39;ve seen even before the abandonment started. \nI can tell a joke to a crowd similar to the one my friend told the same joke to earlier, and get thrown out of the room. I can sing and do character impressions that just annoy people, even those who like that kind of thing. Every tool I have to use in social intercourse is, for some reason, met with the opposite effect it was intended to have. Everything I earned for myself in the few years since I left high school seems to be falling apart and I&amp;#39;m just sliding back into the hole again, where everyone shits on me and no one wants me to come out, because well, I&amp;#39;m covered in all their shit.\n&amp;quot;Just don&amp;#39;t let it bother you.&amp;quot;\n&amp;quot;Well how about you try ignoring something like a broken bone sticking out of your arm.&amp;quot;\nIf I could will this feeling away I would be able to live a happy life, but here I am, proof that I cannot.\nI seriously don&amp;#39;t know what I can do to improve my outlook. All I&amp;#39;ve ever wanted to do is tell stories, something that I&amp;#39;ve been doing for years, that people tell me I have talent for, but never receive recognition for, except from my college teachers. \nI&amp;#39;m a story teller with an audience collectively booing me off stage for even being there. There is nothing else in this world I even want to do, so if this is it, why should I stay. \nI &lt;em&gt;need&lt;/em&gt; to be able to answer this question, otherwise, I&amp;#39;m wasting time and effort trying to please the one person that matters, who constantly assures me my struggles are in vain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sometimes I feel like a story teller at a free reading, who gets consistently boo'd off stage. As though even the people who came to me on their own and are choosing to stay near my by their own accord are lashing out to get rid of me. I've never been welcome anywhere, and now I don't even have my family to turn to. My dad seems like he is slipping into Alzheimer's 15 years younger than his mom did and he is the parent to which I am most similar. My mom can 'care' about what I have to say for about 5 minutes before she has to find someone else to talk to or change the subject entirely. My friends don't want me to come with them anywhere fun anymore because I 'weird out' people in public. The worst bit is the last part is pretty true from what I've seen even before the abandonment started. \nI can tell a joke to a crowd similar to the one my friend told the same joke to earlier, and get thrown out of the room. I can sing and do character impressions that just annoy people, even those who like that kind of thing. Every tool I have to use in social intercourse is, for some reason, met with the opposite effect it was intended to have. Everything I earned for myself in the few years since I left high school seems to be falling apart and I'm just sliding back into the hole again, where everyone shits on me and no one wants me to come out, because well, I'm covered in all their shit.\n\"Just don't let it bother you.\"\n\"Well how about you try ignoring something like a broken bone sticking out of your arm.\"\nIf I could will this feeling away I would be able to live a happy life, but here I am, proof that I cannot.\nI seriously don't know what I can do to improve my outlook. All I've ever wanted to do is tell stories, something that I've been doing for years, that people tell me I have talent for, but never receive recognition for, except from my college teachers. \nI'm a story teller with an audience collectively booing me off stage for even being there. There is nothing else in this world I even want to do, so if this is it, why should I stay. \nI *need* to be able to answer this question, otherwise, I'm wasting time and effort trying to please the one person that matters, who constantly assures me my struggles are in vain.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c05i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "fukkit2014", "media": null, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c05i/no_audience_to_whom_to_tell_the_tale/", "name": "t3_24c05i", "created": 1398852322.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c05i/no_audience_to_whom_to_tell_the_tale/", "author_flair_text": null, "title": "No audience to whom to tell the tale", "created_utc": 1398823522.0, "ups": 11, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6iv3q", "gilded": 0, "author": "sofar1776", "parent_id": "t1_ch5o3hi", "approved_by": null, "body": "Try Northern Vermont. I have been there and seen all kinds of unusual people. Frankly, I don't care what brand of shirt someone wears, or even how unusual the hair is. Unless it is actually on fire. Then I would at least ask if they knew that. But I digress, sorry about that. People can be very intolerant, whether intentional or not. Doesn't matter. The point is to be comfortable enough in yourself to realize that it doesn't matter. There are people out there who can and will accept you as is. No alterations required. Yes, its hard to find them. Yes, it will take time. You have made a start at it. But I see you said it is a cowboy town. I have known a couple of them, and they like it their way. O well, they will have to adapt. Be who you are, you will wind up doing it anyway. Best wishes. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try Northern Vermont. I have been there and seen all kinds of unusual people. Frankly, I don&amp;#39;t care what brand of shirt someone wears, or even how unusual the hair is. Unless it is actually on fire. Then I would at least ask if they knew that. But I digress, sorry about that. People can be very intolerant, whether intentional or not. Doesn&amp;#39;t matter. The point is to be comfortable enough in yourself to realize that it doesn&amp;#39;t matter. There are people out there who can and will accept you as is. No alterations required. Yes, its hard to find them. Yes, it will take time. You have made a start at it. But I see you said it is a cowboy town. I have known a couple of them, and they like it their way. O well, they will have to adapt. Be who you are, you will wind up doing it anyway. Best wishes. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch6iv3q", "created": 1398913161.0, "author_flair_text": null, "created_utc": 1398909561.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5o3hi", "gilded": 0, "author": "fukkit2014", "parent_id": "t1_ch5mxp5", "approved_by": null, "body": "Well to be honest, I weird out other story tellers too. I do dress weird and have an odd hairstyle, and I admit to having a strange personality as well, but I'm just being myself and expressing who that is. I have no intention to 'shove it in people's faces' though. I just want to be able to walk into a room and not have everyone immediately tense up making me realize they will not take seriously anything I have to say. Most of all though, I want to be able to do this without sacrificing who I am. I act as well, but I like to do that as a break. If I have to act my way through the rest of my life then what's the point? replace me with one of the other humans being born every second and no one will notice. It feels like the world is rejecting me like a splinter, that its my very essence that isn't wanted, not my curly hair or non brand name clothes that I buy from the thrift shop cause it's all I can afford. I want somewhere that I can be embraced for who and what I am and I've traveled Canada looking for that place without any luck.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well to be honest, I weird out other story tellers too. I do dress weird and have an odd hairstyle, and I admit to having a strange personality as well, but I&amp;#39;m just being myself and expressing who that is. I have no intention to &amp;#39;shove it in people&amp;#39;s faces&amp;#39; though. I just want to be able to walk into a room and not have everyone immediately tense up making me realize they will not take seriously anything I have to say. Most of all though, I want to be able to do this without sacrificing who I am. I act as well, but I like to do that as a break. If I have to act my way through the rest of my life then what&amp;#39;s the point? replace me with one of the other humans being born every second and no one will notice. It feels like the world is rejecting me like a splinter, that its my very essence that isn&amp;#39;t wanted, not my curly hair or non brand name clothes that I buy from the thrift shop cause it&amp;#39;s all I can afford. I want somewhere that I can be embraced for who and what I am and I&amp;#39;ve traveled Canada looking for that place without any luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch5o3hi", "created": 1398856482.0, "author_flair_text": null, "created_utc": 1398827682.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5mxp5", "gilded": 0, "author": "sofar1776", "parent_id": "t3_24c05i", "approved_by": null, "body": "Would it be possible for you to see other storytellers and learn more about your chosen craft from them? I know there are people who do that professionally, and there must be resources for others looking to join in. I can't do a good impression for anything, and it is fun to see people who can. No idea why or how you weird out people. There are a few ways to do that. Dress, attitude, hairstyle, etc. I can't say don't let it bother you, because it already does. I would suggest you try to figure out why it happens. Maybe you could find an impartial person to help you. Please don't give up without trying everything you can think of and a few other things that might not make much sense. THanks. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would it be possible for you to see other storytellers and learn more about your chosen craft from them? I know there are people who do that professionally, and there must be resources for others looking to join in. I can&amp;#39;t do a good impression for anything, and it is fun to see people who can. No idea why or how you weird out people. There are a few ways to do that. Dress, attitude, hairstyle, etc. I can&amp;#39;t say don&amp;#39;t let it bother you, because it already does. I would suggest you try to figure out why it happens. Maybe you could find an impartial person to help you. Please don&amp;#39;t give up without trying everything you can think of and a few other things that might not make much sense. THanks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch5mxp5", "created": 1398854040.0, "author_flair_text": null, "created_utc": 1398825240.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che2wuj", "gilded": 0, "author": "fukkit2014", "parent_id": "t3_24c05i", "approved_by": null, "body": "for those who are concerned, still here", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;for those who are concerned, still here&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_che2wuj", "created": 1399709230.0, "author_flair_text": null, "created_utc": 1399680430.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7l46a", "gilded": 0, "author": "DavidAamez", "parent_id": "t1_ch7kwug", "approved_by": null, "body": "lol with khaki shorts and wild turkey in hand", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol with khaki shorts and wild turkey in hand&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch7l46a", "created": 1399019961.0, "author_flair_text": null, "created_utc": 1399016361.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7kwug", "gilded": 0, "author": "fukkit2014", "parent_id": "t1_ch6exmz", "approved_by": null, "body": "I've been a fan of Tool and Thompson for a while too, dunhills and chivas am I right?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been a fan of Tool and Thompson for a while too, dunhills and chivas am I right?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch7kwug", "created": 1399018907.0, "author_flair_text": null, "created_utc": 1399015307.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch6exmz", "gilded": 0, "author": "DavidAamez", "parent_id": "t1_ch61c18", "approved_by": null, "body": "ive always been the weirdo. loved bands like tool when my friends were listening to eminem. Have you ever read any Hunter S. Thompson? Look him up, an incredible person. I have a shirt with his pic on it and one of his quotes; \"When the going gets weird, the weird turn pro\"", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ive always been the weirdo. loved bands like tool when my friends were listening to eminem. Have you ever read any Hunter S. Thompson? Look him up, an incredible person. I have a shirt with his pic on it and one of his quotes; &amp;quot;When the going gets weird, the weird turn pro&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch6exmz", "created": 1398929587.0, "author_flair_text": null, "created_utc": 1398900787.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch61c18", "gilded": 0, "author": "fukkit2014", "parent_id": "t1_ch5t5uk", "approved_by": null, "body": "I didn't mean to let on that I go around in elaborate strange outfits or anything, I just live in a cowboy town and I can't stand cowboy culture. I am planning a move that's coming up pretty soon which should help in that regard, but really, this whole province has been grating me down for years for not wearing boots and a hat, so its kind of a raw nerve. My hair's just long, I put effort into making it presentable but that's just not accepted by people here. \nAs for the story telling, I am an animator and am currently working on a graphic novel. I understand problems inherent to medium and all that, what I meant by that was really, everyone around seems interested in everyone's life but mine, like my existence is so foreign to the people around me they get scared or uncomfortable. I hate being a source of discomfort.\nI appreciate that you aren't just telling me to stop being weird though, that's been the first bit of advice from most people who've offered up until now. My weirdness is such a huge part of who I am that without it, I wouldn't really be me any more.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t mean to let on that I go around in elaborate strange outfits or anything, I just live in a cowboy town and I can&amp;#39;t stand cowboy culture. I am planning a move that&amp;#39;s coming up pretty soon which should help in that regard, but really, this whole province has been grating me down for years for not wearing boots and a hat, so its kind of a raw nerve. My hair&amp;#39;s just long, I put effort into making it presentable but that&amp;#39;s just not accepted by people here. \nAs for the story telling, I am an animator and am currently working on a graphic novel. I understand problems inherent to medium and all that, what I meant by that was really, everyone around seems interested in everyone&amp;#39;s life but mine, like my existence is so foreign to the people around me they get scared or uncomfortable. I hate being a source of discomfort.\nI appreciate that you aren&amp;#39;t just telling me to stop being weird though, that&amp;#39;s been the first bit of advice from most people who&amp;#39;ve offered up until now. My weirdness is such a huge part of who I am that without it, I wouldn&amp;#39;t really be me any more.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch61c18", "created": 1398901648.0, "author_flair_text": null, "created_utc": 1398872848.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5t5uk", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24c05i", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c05i", "score_hidden": false, "name": "t1_ch5t5uk", "created": 1398871504.0, "author_flair_text": null, "created_utc": 1398842704.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]