[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t do this any longer. They said that once I gained weight I wouldn&amp;#39;t have these suicidal thoughts in my head anymore. They&amp;#39;re still here and they&amp;#39;re worse than ever. I&amp;#39;m ready to end it all. There&amp;#39;s no reason left for me being alive. I&amp;#39;m done.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't do this any longer. They said that once I gained weight I wouldn't have these suicidal thoughts in my head anymore. They're still here and they're worse than ever. I'm ready to end it all. There's no reason left for me being alive. I'm done.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "259afv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "kellietara", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/259afv/no_more_holding_on/", "name": "t3_259afv", "created": 1399809181.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/259afv/no_more_holding_on/", "author_flair_text": null, "title": "No more holding on", "created_utc": 1399780381.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chez12f", "gilded": 0, "author": "[deleted]", "parent_id": "t1_cheygon", "approved_by": null, "body": "Oh, I completely understand the posting while crying. I've done it so many times I can't begin to count. There's this weird amalgamation of wanting help, not wanting help, not wanting people to tell you what to do, and at the same time wanting people to tell you what to do. That sort of thing is just impossible to express without people calling you crazy. I don't think you're crazy. I just want to know more about you... and I may be crazy myself.\n\nI understand anorexia to a point, and am currently dealing with the same sorts of problems that lead to it. Way back in high school I had a neighbor who was an amazing, beautiful, caring girl. Her older brother tortured me relentlessly in high school. She ended up dying of anorexia-related diseases, and to this day I can only remember her as the cheerleader who managed to beat me at tic-tac-toe, even though I was a self-described intellectual. This beautiful, admirable person destroyed herself because she thought she had to represent what other people demanded of her. She didn't. She was already beautiful, but nobody -- including myself -- was able to convince her of that. Hell, we didn't even know at the time.\n\nNot sure what I'm trying to say here, but I empathize with you. I've known beautiful people like you who have disappeared from my life, and sympathize with the circumstances that have led you here. Life is fucked up. Brains are fucked up. All we can do at some points is put our heads on each others' shoulders and cry.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I completely understand the posting while crying. I&amp;#39;ve done it so many times I can&amp;#39;t begin to count. There&amp;#39;s this weird amalgamation of wanting help, not wanting help, not wanting people to tell you what to do, and at the same time wanting people to tell you what to do. That sort of thing is just impossible to express without people calling you crazy. I don&amp;#39;t think you&amp;#39;re crazy. I just want to know more about you... and I may be crazy myself.&lt;/p&gt;\n\n&lt;p&gt;I understand anorexia to a point, and am currently dealing with the same sorts of problems that lead to it. Way back in high school I had a neighbor who was an amazing, beautiful, caring girl. Her older brother tortured me relentlessly in high school. She ended up dying of anorexia-related diseases, and to this day I can only remember her as the cheerleader who managed to beat me at tic-tac-toe, even though I was a self-described intellectual. This beautiful, admirable person destroyed herself because she thought she had to represent what other people demanded of her. She didn&amp;#39;t. She was already beautiful, but nobody -- including myself -- was able to convince her of that. Hell, we didn&amp;#39;t even know at the time.&lt;/p&gt;\n\n&lt;p&gt;Not sure what I&amp;#39;m trying to say here, but I empathize with you. I&amp;#39;ve known beautiful people like you who have disappeared from my life, and sympathize with the circumstances that have led you here. Life is fucked up. Brains are fucked up. All we can do at some points is put our heads on each others&amp;#39; shoulders and cry.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259afv", "score_hidden": false, "name": "t1_chez12f", "created": 1399812433.0, "author_flair_text": null, "created_utc": 1399783633.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cheygon", "gilded": 0, "author": "kellietara", "parent_id": "t1_cheydfe", "approved_by": null, "body": "You're right. It is anorexia. I've had 2 hospital admissions in the past 6 months for it and I'm out now and just hating everything. These suicidal thoughts just won't leave me alone. I'm bawling my eyes out as I type this. I just don't know what to do. I don't want to be alive anymore.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. It is anorexia. I&amp;#39;ve had 2 hospital admissions in the past 6 months for it and I&amp;#39;m out now and just hating everything. These suicidal thoughts just won&amp;#39;t leave me alone. I&amp;#39;m bawling my eyes out as I type this. I just don&amp;#39;t know what to do. I don&amp;#39;t want to be alive anymore.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259afv", "score_hidden": false, "name": "t1_cheygon", "created": 1399810718.0, "author_flair_text": null, "created_utc": 1399781918.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cheydfe", "gilded": 0, "author": "[deleted]", "parent_id": "t3_259afv", "approved_by": null, "body": "I'm not judging you for these thoughts, since I'm having them myself, but I'd like to hear about your struggle with what I can only assume is anorexia. If I'm wrong on that reading, yeah I'm an assclown, but otherwise I'd like to understand how you're thinking, since my own body tells me to eat until I'm disgusted with myself.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not judging you for these thoughts, since I&amp;#39;m having them myself, but I&amp;#39;d like to hear about your struggle with what I can only assume is anorexia. If I&amp;#39;m wrong on that reading, yeah I&amp;#39;m an assclown, but otherwise I&amp;#39;d like to understand how you&amp;#39;re thinking, since my own body tells me to eat until I&amp;#39;m disgusted with myself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_259afv", "score_hidden": false, "name": "t1_cheydfe", "created": 1399810446.0, "author_flair_text": null, "created_utc": 1399781646.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]