[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I cant find work, my family want me gone and only give me grief, they made fun of the fact I got turned down for a job.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pathetic, my so called &amp;quot;friends&amp;quot; don&amp;#39;t even talk to me, rarely do they contact me, they ignore phone calls and texts but when they do contact me they need or want my help or want to complain about something I&amp;#39;ve done now.&lt;/p&gt;\n\n&lt;p&gt;My ex is crazy, she dumped me so she could get with a girl I was close to but when she got turned down she wanted me back and now is trying to piss off my current partner and break us up, I honestly think my new SO is keeping me around to piss my ex off.&lt;/p&gt;\n\n&lt;p&gt;I wake up every morning wishing I had died in my sleep.&lt;/p&gt;\n\n&lt;p&gt;If I died then people would be happy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I cant find work, my family want me gone and only give me grief, they made fun of the fact I got turned down for a job.\n\nI'm pathetic, my so called \"friends\" don't even talk to me, rarely do they contact me, they ignore phone calls and texts but when they do contact me they need or want my help or want to complain about something I've done now.\n\nMy ex is crazy, she dumped me so she could get with a girl I was close to but when she got turned down she wanted me back and now is trying to piss off my current partner and break us up, I honestly think my new SO is keeping me around to piss my ex off.\n\nI wake up every morning wishing I had died in my sleep.\n\nIf I died then people would be happy.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25e7fk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "123igottagopee", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25e7fk/no_one_would_miss_me/", "name": "t3_25e7fk", "created": 1399959361.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25e7fk/no_one_would_miss_me/", "author_flair_text": null, "title": "No one would miss me", "created_utc": 1399930561.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgbi1f", "gilded": 0, "author": "goingtosurvive", "parent_id": "t3_25e7fk", "approved_by": null, "body": "You are not a mind reader. You can't know what other people would or wouldn't think / feel if you died. If you are depressed or otherwise mentally ill, PART OF THE ILLNESS is a perceptual distortion where you perceive other people's thoughts and feelings as more negative than they really are.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not a mind reader. You can&amp;#39;t know what other people would or wouldn&amp;#39;t think / feel if you died. If you are depressed or otherwise mentally ill, PART OF THE ILLNESS is a perceptual distortion where you perceive other people&amp;#39;s thoughts and feelings as more negative than they really are.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e7fk", "score_hidden": false, "name": "t1_chgbi1f", "created": 1399961688.0, "author_flair_text": null, "created_utc": 1399932888.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgj6u2", "gilded": 0, "author": "ILLITERATE_HOBO", "parent_id": "t3_25e7fk", "approved_by": null, "body": "Would it be impossible to talk to your current SO about that or would that be awkward?  If you want to talk please PM me I would love to be able to help, but if not I think you and I both gutturally realize that death wouldn't be the correct response.  It sounds great in the moment, but a shite life is better than none.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would it be impossible to talk to your current SO about that or would that be awkward?  If you want to talk please PM me I would love to be able to help, but if not I think you and I both gutturally realize that death wouldn&amp;#39;t be the correct response.  It sounds great in the moment, but a shite life is better than none.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e7fk", "score_hidden": false, "name": "t1_chgj6u2", "created": 1399978527.0, "author_flair_text": null, "created_utc": 1399949727.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgol7u", "gilded": 0, "author": "ignorethename", "parent_id": "t3_25e7fk", "approved_by": null, "body": "No one would miss many orphan kids either. Does that make their lives any less worthwhile? No.\n\nIt does not matter that no one misses you today. Thats okay, cause tomorrow is another day.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one would miss many orphan kids either. Does that make their lives any less worthwhile? No.&lt;/p&gt;\n\n&lt;p&gt;It does not matter that no one misses you today. Thats okay, cause tomorrow is another day.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e7fk", "score_hidden": false, "name": "t1_chgol7u", "created": 1399995498.0, "author_flair_text": null, "created_utc": 1399966698.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chge29x", "gilded": 0, "author": "Tri4rius", "parent_id": "t3_25e7fk", "approved_by": null, "body": "First, tell your family they can either play by your rules and be decent, or fuck off. Plain simple.\n\nScrew your \"friends\", that's number two (puns intended). You can meet a bunch of people on facebook that have similar interests. If you're living somewhere with relatively good population numbers, you needn't worry. \"It's my way or the highway\". THIS should be your attitude. \n\nIf they ignore you, delete their numbers and never talk to them again, if you're sure that they're doing that on purpose. You don't need to feel worse, so if they're making you feel worse, screw them. Sounds weird, but that's the case. Either they play by your rules, or they get dumped.\n\nAbout your SO, be honest and ask, if not DEMAND, the same from her. This is basic stuff if you want your relationship to stand. If she can't stick to these decent points, she's not worth it. \n\nIgnore your ex, no need to waste your time. If she does anything to get in your way with other people, let those around you judge for themselves, that will let you know if they're worth it as well.\n\nFrom now on, wake up, wash your face, eat lightly, exercise and start looking for jobs. It might seem pointless, but it doesn't matter. \n\nPeople will NEVER be happy: They'd complain about you EVEN if you'd be dead. They're SO worthless! You want to know what you SHOULD feel about them? Contempt and disgust. Invest in yourself, read a non-fiction book, keep looking for jobs and don't look back: There's a lot of scum on this earth and they will look down on you no matter what you do, so don't do anything to please THEM. Act to please yourself. \n\nYou might have HUNDREDS of people hating you someday. Do you know what WILL keep you alive certainly? The idea that YOU like who you are, that YOU know what your value is, that YOU won't be crushed by a bunch of weaklings like them.\n\nI sound quite harsh, but don't take this the wrong way, this is a motivational post. If bridges are breaking due to neglect of others, burn them. Build your life in order that in 2-5 years you'll have a reason to think \"I'm glad I didn't take these scumbags completely seriously\". Treat them like savage kids. Peace, brother!", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, tell your family they can either play by your rules and be decent, or fuck off. Plain simple.&lt;/p&gt;\n\n&lt;p&gt;Screw your &amp;quot;friends&amp;quot;, that&amp;#39;s number two (puns intended). You can meet a bunch of people on facebook that have similar interests. If you&amp;#39;re living somewhere with relatively good population numbers, you needn&amp;#39;t worry. &amp;quot;It&amp;#39;s my way or the highway&amp;quot;. THIS should be your attitude. &lt;/p&gt;\n\n&lt;p&gt;If they ignore you, delete their numbers and never talk to them again, if you&amp;#39;re sure that they&amp;#39;re doing that on purpose. You don&amp;#39;t need to feel worse, so if they&amp;#39;re making you feel worse, screw them. Sounds weird, but that&amp;#39;s the case. Either they play by your rules, or they get dumped.&lt;/p&gt;\n\n&lt;p&gt;About your SO, be honest and ask, if not DEMAND, the same from her. This is basic stuff if you want your relationship to stand. If she can&amp;#39;t stick to these decent points, she&amp;#39;s not worth it. &lt;/p&gt;\n\n&lt;p&gt;Ignore your ex, no need to waste your time. If she does anything to get in your way with other people, let those around you judge for themselves, that will let you know if they&amp;#39;re worth it as well.&lt;/p&gt;\n\n&lt;p&gt;From now on, wake up, wash your face, eat lightly, exercise and start looking for jobs. It might seem pointless, but it doesn&amp;#39;t matter. &lt;/p&gt;\n\n&lt;p&gt;People will NEVER be happy: They&amp;#39;d complain about you EVEN if you&amp;#39;d be dead. They&amp;#39;re SO worthless! You want to know what you SHOULD feel about them? Contempt and disgust. Invest in yourself, read a non-fiction book, keep looking for jobs and don&amp;#39;t look back: There&amp;#39;s a lot of scum on this earth and they will look down on you no matter what you do, so don&amp;#39;t do anything to please THEM. Act to please yourself. &lt;/p&gt;\n\n&lt;p&gt;You might have HUNDREDS of people hating you someday. Do you know what WILL keep you alive certainly? The idea that YOU like who you are, that YOU know what your value is, that YOU won&amp;#39;t be crushed by a bunch of weaklings like them.&lt;/p&gt;\n\n&lt;p&gt;I sound quite harsh, but don&amp;#39;t take this the wrong way, this is a motivational post. If bridges are breaking due to neglect of others, burn them. Build your life in order that in 2-5 years you&amp;#39;ll have a reason to think &amp;quot;I&amp;#39;m glad I didn&amp;#39;t take these scumbags completely seriously&amp;quot;. Treat them like savage kids. Peace, brother!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25e7fk", "score_hidden": false, "name": "t1_chge29x", "created": 1399967409.0, "author_flair_text": null, "created_utc": 1399938609.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]