[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Opening up, as this is my first post to &lt;a href=\"/r/suicidewatch\"&gt;/r/suicidewatch&lt;/a&gt;, I&amp;#39;d like to thank you for your time in reading this, as it feels as though no one gives me they&amp;#39;re time to talk to me about this.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve grown up in an average American household, married parents, younger sister, and a few pets. I live in a nice town, and i go to a nice highschool, but these aren&amp;#39;t my problems. &lt;/p&gt;\n\n&lt;p&gt;All of this started when my ex girlfriend faked a pregnancy. As a 16yo, who just got his license, with no job, this emotionally and mentally destroyed me. And once I finally found a girl that I thought I could trust, she left me for an older guy that lived miles away. My friends don&amp;#39;t care about how I feel. I try to talk to them about me not wanting this life anymore and all I ever get is &amp;quot;you&amp;#39;ll be okay.&amp;quot; It feels like I&amp;#39;m just a shell of what I&amp;#39;m supposed to be. I feel as though I&amp;#39;m a constant let down to those around me, and everything I do is just not good enough for anyone. &lt;/p&gt;\n\n&lt;p&gt;My whole life I expected something great of myself, and I always tried my best to hold myself to a higher standard than most other kids who go out and party all the time. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m what&amp;#39;s described in school now-a-days as the &amp;quot;3am friend.&amp;quot; The one who is there no matter what, and no one is around when I need the same. Even my father, who seems to be the only one to ever ask me how I&amp;#39;m doing, ignores my cries for help. The stress of everyday life is growing too much. The constant feeling of being alone is becoming an incredible burden to carry. And in the first time of my life, death seems much more appealing than life itself. I know I&amp;#39;m young, and I know that I &amp;quot;have so much to live for,&amp;quot; but really, I don&amp;#39;t. Over the past year, my grades have deteriorated, my life at home has fell completely apart, and my social has crumbled to dust. Nothing pleases me anymore, not even what used to bring me so much joy. Not football, not wrestling, not math, not science, not my &amp;quot;friends&amp;quot;, nothing. I need someone, and there&amp;#39;s no one willing to help me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Opening up, as this is my first post to /r/suicidewatch, I'd like to thank you for your time in reading this, as it feels as though no one gives me they're time to talk to me about this.\n\nI've grown up in an average American household, married parents, younger sister, and a few pets. I live in a nice town, and i go to a nice highschool, but these aren't my problems. \n\nAll of this started when my ex girlfriend faked a pregnancy. As a 16yo, who just got his license, with no job, this emotionally and mentally destroyed me. And once I finally found a girl that I thought I could trust, she left me for an older guy that lived miles away. My friends don't care about how I feel. I try to talk to them about me not wanting this life anymore and all I ever get is \"you'll be okay.\" It feels like I'm just a shell of what I'm supposed to be. I feel as though I'm a constant let down to those around me, and everything I do is just not good enough for anyone. \n\nMy whole life I expected something great of myself, and I always tried my best to hold myself to a higher standard than most other kids who go out and party all the time. \n\nI'm what's described in school now-a-days as the \"3am friend.\" The one who is there no matter what, and no one is around when I need the same. Even my father, who seems to be the only one to ever ask me how I'm doing, ignores my cries for help. The stress of everyday life is growing too much. The constant feeling of being alone is becoming an incredible burden to carry. And in the first time of my life, death seems much more appealing than life itself. I know I'm young, and I know that I \"have so much to live for,\" but really, I don't. Over the past year, my grades have deteriorated, my life at home has fell completely apart, and my social has crumbled to dust. Nothing pleases me anymore, not even what used to bring me so much joy. Not football, not wrestling, not math, not science, not my \"friends\", nothing. I need someone, and there's no one willing to help me. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248vph", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TheWabbajack_", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248vph/no_one_seems_to_care/", "name": "t3_248vph", "created": 1398769390.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248vph/no_one_seems_to_care/", "author_flair_text": null, "title": "No one seems to care.", "created_utc": 1398740590.0, "ups": 5, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4rxhq", "gilded": 0, "author": "TheWabbajack_", "parent_id": "t1_ch4rr3s", "approved_by": null, "body": "Thank you, i *really* appreciate that. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, i &lt;em&gt;really&lt;/em&gt; appreciate that. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248vph", "score_hidden": false, "name": "t1_ch4rxhq", "created": 1398772371.0, "author_flair_text": null, "created_utc": 1398743571.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4rr3s", "gilded": 0, "author": "map_backwards", "parent_id": "t1_ch4ri2d", "approved_by": null, "body": "You're definitely welcome. If you ever need to vent I'm randomly on my reddit app throughout the day. Reading messages is no burden to me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re definitely welcome. If you ever need to vent I&amp;#39;m randomly on my reddit app throughout the day. Reading messages is no burden to me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248vph", "score_hidden": false, "name": "t1_ch4rr3s", "created": 1398771961.0, "author_flair_text": null, "created_utc": 1398743161.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch4ri2d", "gilded": 0, "author": "TheWabbajack_", "parent_id": "t1_ch4r9ci", "approved_by": null, "body": "Hey man thank you for that, i appreciate all kinds of hugs. And i really do hope that wine is treating you well. \n\nAnd that's what my main goal is for right now, just to hold it all down until that person does come along. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man thank you for that, i appreciate all kinds of hugs. And i really do hope that wine is treating you well. &lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s what my main goal is for right now, just to hold it all down until that person does come along. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248vph", "score_hidden": false, "name": "t1_ch4ri2d", "created": 1398771387.0, "author_flair_text": null, "created_utc": 1398742587.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4r9ci", "gilded": 0, "author": "map_backwards", "parent_id": "t3_248vph", "approved_by": null, "body": "I'm sorry things seem shitty for you now. I wish I had nuggets of wisdom to pass along, but I'm just drinking wine and browsing my frontpage. \n\nCan I offer you internet hugs? I used to feel like I needed to put my friends' feelings, etc. before mine. I thought if I didn't I was a selfish, bad friend. That totally sucked and I lost myself for a bit. As cliche as it was, music was my solace during this time. I don't know if this means anything to you, but you deserve to be known as more than the \"3am friend.\" I think that's how you put it.\n\nWhatever your situation, I'd like to think there is someone near you who truly cares and that you'll find him/her soon. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry things seem shitty for you now. I wish I had nuggets of wisdom to pass along, but I&amp;#39;m just drinking wine and browsing my frontpage. &lt;/p&gt;\n\n&lt;p&gt;Can I offer you internet hugs? I used to feel like I needed to put my friends&amp;#39; feelings, etc. before mine. I thought if I didn&amp;#39;t I was a selfish, bad friend. That totally sucked and I lost myself for a bit. As cliche as it was, music was my solace during this time. I don&amp;#39;t know if this means anything to you, but you deserve to be known as more than the &amp;quot;3am friend.&amp;quot; I think that&amp;#39;s how you put it.&lt;/p&gt;\n\n&lt;p&gt;Whatever your situation, I&amp;#39;d like to think there is someone near you who truly cares and that you&amp;#39;ll find him/her soon. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248vph", "score_hidden": false, "name": "t1_ch4r9ci", "created": 1398770852.0, "author_flair_text": null, "created_utc": 1398742052.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9yq0p", "gilded": 0, "author": "dKaboom", "parent_id": "t3_248vph", "approved_by": null, "body": "Hey man, I'm sorry to hear you haven't been doing well. You seem like a pretty cool and interesting guy, it's a shame circumstances are putting you down from that. You've been hurt dearly by past relationships, no one deserves the stress you've been put to at 16. Although, people find it in their way to hurt others, just a passing of the pain they themselves are feeling. Sometimes, even those closer to us that are not picking up our cries for help are having a hard time accepting that someone dear to them is suffering and they don't know what to do about it or they think they cannot do anything. It's a flawed mechanism to cope, but people aren't perfect and many have their own demons stopping them from being more or just reaching out to someone else, significantly. I hope you can find it in yourself to forgive their misgivings, as you are so much more than what others reflect of you. Or rather, what you believe others think of yourself.\n\nYou're not a constant let down, believe me, this is something that we think of ourselves more than what others think of us. The people that care for you may be sad that you're not getting good grades like you used to, that you're not having much fun in general, that you're looking gloomy all the time (if that's it, at all), but that's only because they'd like to see you do well. To be at your best. To succeed and to be happy. Because they love you, in some way.\n\nThink of this: if you had a son, a sibling or a friend who was in the same state as yourself, would you resent them or feel like they're letting you down? Let's say you don't even feel that close and don't know what to say. I don't think you'd feel they're a disappointment, do you?\n\nAnd it's just as well, because there are no failures in life, since there are no absolutely measurable successes. Is someone better than others because they have better grades? If that's a goal they set out for themselves, they might be happier to have accomplished it, but maybe the other has a good relationship and better-grades guy wanted that more. Maybe there's another guy who doesn't have a good relationship, or good grades, maybe he's feeling great for getting a personal record beaten on his daily run, pushing his boundaries. Then, there's that dude who's got none of that and he's kicking ass at a volunteering gig to help people out. Or that dude who finally managed to get that John Myung solo covered without breaking his wrist, sweat dripping from his brow as he's goofily wondering \"Why oh why can't I post a success kid meme on /r/bass?\". Then, there's the dude who plugged his pen into the USB slot in a single swift move, getting a hero's worship among us, probably swimming in a sea of pussy right about now. None of these people are better than the others (well, maybe USB guy, but who can realistically compete with that? :P). If they're happy now, they'll eventually feel sadness in their lives and even if they're generally sad, that's okay because that's a part of who we are and a part of life that makes the innevitable good times more beautiful. So if success - personal success being the more important factor, imo, rather than socially-advertised success - is painfully relative, then we can't say anyone is actually failing more than admitting EVERYONE is failing at some or other aspect of life.\n\nIt's OKAY to feel down and sometimes you WILL be alone, but we'd all like you to stick around - except if you're double-parked with your hazards on, then we'd like you to get the hell out. There's that person in your life or who has yet to meet you that will miss the wonder(s) you've done in his or her life at some point, if you're not around to make their life better. The friends - that albeit don't seem to reciprocate - that have you as a 3 am friend, are better people to have someone like you around and there to help. Even if you can't help them sometimes, the world's a better place with you in it, if you're around to try :)\n\nAnd I think you're due to getting some of that good intent your way, so I'd like you to consider seeking professional counselling or therapy, if you haven't already. And before that, I hope you tell your father you need to have a talk with him - years of being told this when you're about to get scolded really have a knack for getting people's attention -, to just sit down for a while and talk about something important, which is your well-being. Not just throwing out clues, or waiting for the right time to pick up the talk, but really establishing that line of communication explicitly and from your initiative and pouring everything down into a conversation, not holding anything back. It can be your father or anyone you want to talk to that matters to you.\n\nWhat do you think of all this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I&amp;#39;m sorry to hear you haven&amp;#39;t been doing well. You seem like a pretty cool and interesting guy, it&amp;#39;s a shame circumstances are putting you down from that. You&amp;#39;ve been hurt dearly by past relationships, no one deserves the stress you&amp;#39;ve been put to at 16. Although, people find it in their way to hurt others, just a passing of the pain they themselves are feeling. Sometimes, even those closer to us that are not picking up our cries for help are having a hard time accepting that someone dear to them is suffering and they don&amp;#39;t know what to do about it or they think they cannot do anything. It&amp;#39;s a flawed mechanism to cope, but people aren&amp;#39;t perfect and many have their own demons stopping them from being more or just reaching out to someone else, significantly. I hope you can find it in yourself to forgive their misgivings, as you are so much more than what others reflect of you. Or rather, what you believe others think of yourself.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not a constant let down, believe me, this is something that we think of ourselves more than what others think of us. The people that care for you may be sad that you&amp;#39;re not getting good grades like you used to, that you&amp;#39;re not having much fun in general, that you&amp;#39;re looking gloomy all the time (if that&amp;#39;s it, at all), but that&amp;#39;s only because they&amp;#39;d like to see you do well. To be at your best. To succeed and to be happy. Because they love you, in some way.&lt;/p&gt;\n\n&lt;p&gt;Think of this: if you had a son, a sibling or a friend who was in the same state as yourself, would you resent them or feel like they&amp;#39;re letting you down? Let&amp;#39;s say you don&amp;#39;t even feel that close and don&amp;#39;t know what to say. I don&amp;#39;t think you&amp;#39;d feel they&amp;#39;re a disappointment, do you?&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s just as well, because there are no failures in life, since there are no absolutely measurable successes. Is someone better than others because they have better grades? If that&amp;#39;s a goal they set out for themselves, they might be happier to have accomplished it, but maybe the other has a good relationship and better-grades guy wanted that more. Maybe there&amp;#39;s another guy who doesn&amp;#39;t have a good relationship, or good grades, maybe he&amp;#39;s feeling great for getting a personal record beaten on his daily run, pushing his boundaries. Then, there&amp;#39;s that dude who&amp;#39;s got none of that and he&amp;#39;s kicking ass at a volunteering gig to help people out. Or that dude who finally managed to get that John Myung solo covered without breaking his wrist, sweat dripping from his brow as he&amp;#39;s goofily wondering &amp;quot;Why oh why can&amp;#39;t I post a success kid meme on &lt;a href=\"/r/bass\"&gt;/r/bass&lt;/a&gt;?&amp;quot;. Then, there&amp;#39;s the dude who plugged his pen into the USB slot in a single swift move, getting a hero&amp;#39;s worship among us, probably swimming in a sea of pussy right about now. None of these people are better than the others (well, maybe USB guy, but who can realistically compete with that? :P). If they&amp;#39;re happy now, they&amp;#39;ll eventually feel sadness in their lives and even if they&amp;#39;re generally sad, that&amp;#39;s okay because that&amp;#39;s a part of who we are and a part of life that makes the innevitable good times more beautiful. So if success - personal success being the more important factor, imo, rather than socially-advertised success - is painfully relative, then we can&amp;#39;t say anyone is actually failing more than admitting EVERYONE is failing at some or other aspect of life.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s OKAY to feel down and sometimes you WILL be alone, but we&amp;#39;d all like you to stick around - except if you&amp;#39;re double-parked with your hazards on, then we&amp;#39;d like you to get the hell out. There&amp;#39;s that person in your life or who has yet to meet you that will miss the wonder(s) you&amp;#39;ve done in his or her life at some point, if you&amp;#39;re not around to make their life better. The friends - that albeit don&amp;#39;t seem to reciprocate - that have you as a 3 am friend, are better people to have someone like you around and there to help. Even if you can&amp;#39;t help them sometimes, the world&amp;#39;s a better place with you in it, if you&amp;#39;re around to try :)&lt;/p&gt;\n\n&lt;p&gt;And I think you&amp;#39;re due to getting some of that good intent your way, so I&amp;#39;d like you to consider seeking professional counselling or therapy, if you haven&amp;#39;t already. And before that, I hope you tell your father you need to have a talk with him - years of being told this when you&amp;#39;re about to get scolded really have a knack for getting people&amp;#39;s attention -, to just sit down for a while and talk about something important, which is your well-being. Not just throwing out clues, or waiting for the right time to pick up the talk, but really establishing that line of communication explicitly and from your initiative and pouring everything down into a conversation, not holding anything back. It can be your father or anyone you want to talk to that matters to you.&lt;/p&gt;\n\n&lt;p&gt;What do you think of all this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248vph", "score_hidden": false, "name": "t1_ch9yq0p", "created": 1399317346.0, "author_flair_text": null, "created_utc": 1399288546.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]