[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone,&lt;/p&gt;\n\n&lt;p&gt;I posted here maybe 5 months ago, I don&amp;#39;t remember the account I used or the thread title, but the gist of it was that, for the first time in my life, I&amp;#39;m wasn&amp;#39;t depressed and actually felt felt free and confident but still really wanted to kill myself despite this. Well that passed, and i stopped thinking about killing myself for months, and i must stress that for probably about 6 or 7 years suicide was a daily thought up until then. I even shocked myself, because the only times I ever thought about killing myself were in a &amp;quot;oh wow I haven&amp;#39;t thought about killing myself recently!&amp;quot;  context, I had no desire to end my life. I started on path to doing something I wanted in my life and was looking towards the future. I sort of worked through this by myself and became my own positive force.&lt;/p&gt;\n\n&lt;p&gt;But i guess around three weeks ago, all of a sudden, I&amp;#39;ve been really up for killing myself again.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been writing and re-writing a few paragraphs here for about half an hour but i don&amp;#39;t really know what to say and i really have no idea how to articulate it and i have no fucking clue what to say and i&amp;#39;m mostly disappointed at myself that i&amp;#39;ve come back to this state again. this is probably the most honest i&amp;#39;ve ever been regarding my emotions tbh, normally i would try and logic my way out of it or reasonably state my case for it or try and express my feelings clearly but right now i just have no idea and it&amp;#39;s really frustrating\n. i know i want to say i&amp;#39;m sick of everyone in my life, but everything else is just a blur.&lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t know what to say&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone,\n\nI posted here maybe 5 months ago, I don't remember the account I used or the thread title, but the gist of it was that, for the first time in my life, I'm wasn't depressed and actually felt felt free and confident but still really wanted to kill myself despite this. Well that passed, and i stopped thinking about killing myself for months, and i must stress that for probably about 6 or 7 years suicide was a daily thought up until then. I even shocked myself, because the only times I ever thought about killing myself were in a \"oh wow I haven't thought about killing myself recently!\"  context, I had no desire to end my life. I started on path to doing something I wanted in my life and was looking towards the future. I sort of worked through this by myself and became my own positive force.\n\nBut i guess around three weeks ago, all of a sudden, I've been really up for killing myself again.\n\nI've been writing and re-writing a few paragraphs here for about half an hour but i don't really know what to say and i really have no idea how to articulate it and i have no fucking clue what to say and i'm mostly disappointed at myself that i've come back to this state again. this is probably the most honest i've ever been regarding my emotions tbh, normally i would try and logic my way out of it or reasonably state my case for it or try and express my feelings clearly but right now i just have no idea and it's really frustrating\n. i know i want to say i'm sick of everyone in my life, but everything else is just a blur.\n\ni don't know what to say", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24tabl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nytoloriginal25", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24tabl/not_sure_anymore/", "name": "t3_24tabl", "created": 1399357232.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24tabl/not_sure_anymore/", "author_flair_text": null, "title": "Not Sure Anymore", "created_utc": 1399328432.0, "ups": 1, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chahnpo", "gilded": 0, "author": "nytoloriginal25", "parent_id": "t1_chahc9x", "approved_by": null, "body": "wow man... that actually does. i don't know if i'm just looking for things to justify how i'm feeling right now but i definitely identify with everyone of those points apart from drug and alcohol abuse and forced speech. i'll definitely have to read more before i jump to any conclusions but thanks for bringing this to my attention. i also recently have to come to understand i may have some sort of obsessive anxiety disorder that i should probably talk about with a healthcare professional, this is also something i should keep in mind and i'll try and book an appointment tomorrow. thanks man. ", "edited": 1399332684.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wow man... that actually does. i don&amp;#39;t know if i&amp;#39;m just looking for things to justify how i&amp;#39;m feeling right now but i definitely identify with everyone of those points apart from drug and alcohol abuse and forced speech. i&amp;#39;ll definitely have to read more before i jump to any conclusions but thanks for bringing this to my attention. i also recently have to come to understand i may have some sort of obsessive anxiety disorder that i should probably talk about with a healthcare professional, this is also something i should keep in mind and i&amp;#39;ll try and book an appointment tomorrow. thanks man. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chahnpo", "created": 1399361286.0, "author_flair_text": null, "created_utc": 1399332486.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chahc9x", "gilded": 0, "author": "TangentialThreat", "parent_id": "t1_chah2rh", "approved_by": null, "body": "I'm not a doctor but the mood swings can be complicated. Whatever is happening with your brain chemistry is clearly not completely under your control.\n\n[Sound like you?](http://www.health.com/health/m/gallery/0,,20436786,00.html)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a doctor but the mood swings can be complicated. Whatever is happening with your brain chemistry is clearly not completely under your control.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.health.com/health/m/gallery/0,,20436786,00.html\"&gt;Sound like you?&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chahc9x", "created": 1399360596.0, "author_flair_text": null, "created_utc": 1399331796.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chah2rh", "gilded": 0, "author": "nytoloriginal25", "parent_id": "t1_chagra9", "approved_by": null, "body": "hey man thanks for replying.\nthe thing is, it was years upon years in the same mood, then i managed to break through and make some progress, and then a switch shortly after - i'd say that was one uncontrolled shift over the course of years... i don't know anything about bipolar disorder, could such a thing be an indication? or something else? i've had some time to think since i posted and cleared up a a bit... i had two courses of CBT a few years ago to no benefit, but i'm thinking i should talk to a professional one last time", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey man thanks for replying.\nthe thing is, it was years upon years in the same mood, then i managed to break through and make some progress, and then a switch shortly after - i&amp;#39;d say that was one uncontrolled shift over the course of years... i don&amp;#39;t know anything about bipolar disorder, could such a thing be an indication? or something else? i&amp;#39;ve had some time to think since i posted and cleared up a a bit... i had two courses of CBT a few years ago to no benefit, but i&amp;#39;m thinking i should talk to a professional one last time&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chah2rh", "created": 1399360012.0, "author_flair_text": null, "created_utc": 1399331212.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chagra9", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_24tabl", "approved_by": null, "body": "Could it be bipolar? That often causes uncontrolled mood swings with a period of a couple of months. This happens to a lot of people, and it would be a good idea to bring up your mysterious shifting mood with a healthcare professional.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could it be bipolar? That often causes uncontrolled mood swings with a period of a couple of months. This happens to a lot of people, and it would be a good idea to bring up your mysterious shifting mood with a healthcare professional.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chagra9", "created": 1399359305.0, "author_flair_text": null, "created_utc": 1399330505.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chai1vi", "gilded": 0, "author": "nytoloriginal25", "parent_id": "t1_chahpjd", "approved_by": null, "body": "i guess you're right. i'm just anxious i'll be that person and come crashing down again like now. \n\nthanks man, i appreciate the words. i don't think i'm going to harm myself in the immediate future and i'd love to take a walk but it's not really safe where i live at this time, would be too on guard to think clearly. i think i might just sit outside for a bit instead. thanks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i guess you&amp;#39;re right. i&amp;#39;m just anxious i&amp;#39;ll be that person and come crashing down again like now. &lt;/p&gt;\n\n&lt;p&gt;thanks man, i appreciate the words. i don&amp;#39;t think i&amp;#39;m going to harm myself in the immediate future and i&amp;#39;d love to take a walk but it&amp;#39;s not really safe where i live at this time, would be too on guard to think clearly. i think i might just sit outside for a bit instead. thanks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chai1vi", "created": 1399362141.0, "author_flair_text": null, "created_utc": 1399333341.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chahpjd", "gilded": 0, "author": "Pirispanen", "parent_id": "t1_chahc5u", "approved_by": null, "body": "In that case I'm delusional, and so are millions of other people, who think about the meaningfulness of life, and don't even consider ending it by own hand. You said you know it made your life more pleasant. What makes those positive experiences meaningless? Its 2.30 am here now so I won't be able to answer in a while, but I'm glad knowing you aren't harming yourself in the immediate future. Take the walk.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In that case I&amp;#39;m delusional, and so are millions of other people, who think about the meaningfulness of life, and don&amp;#39;t even consider ending it by own hand. You said you know it made your life more pleasant. What makes those positive experiences meaningless? Its 2.30 am here now so I won&amp;#39;t be able to answer in a while, but I&amp;#39;m glad knowing you aren&amp;#39;t harming yourself in the immediate future. Take the walk.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chahpjd", "created": 1399361396.0, "author_flair_text": null, "created_utc": 1399332596.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chahc5u", "gilded": 0, "author": "nytoloriginal25", "parent_id": "t1_chagz1m", "approved_by": null, "body": "thanks for the advice, i'm thinking about planning a long walk tomorrow, see if it helps.\n\nabout your second point, this is exactly how i was thinking during those few months i described in the op, i was actively looking forward to life and trying new experiences and becoming a new person, but now i'm thinking i was probably deluded and idiotic for thinking any of those things were worth the effort. i can't even think why i was feeling that way ever, i know it made my life more pleasant but as it stands right now with how i am feeling, i just don't understand how i ever came round to that way of thinking even for a short while.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks for the advice, i&amp;#39;m thinking about planning a long walk tomorrow, see if it helps.&lt;/p&gt;\n\n&lt;p&gt;about your second point, this is exactly how i was thinking during those few months i described in the op, i was actively looking forward to life and trying new experiences and becoming a new person, but now i&amp;#39;m thinking i was probably deluded and idiotic for thinking any of those things were worth the effort. i can&amp;#39;t even think why i was feeling that way ever, i know it made my life more pleasant but as it stands right now with how i am feeling, i just don&amp;#39;t understand how i ever came round to that way of thinking even for a short while.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chahc5u", "created": 1399360589.0, "author_flair_text": null, "created_utc": 1399331789.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chagz1m", "gilded": 0, "author": "Pirispanen", "parent_id": "t3_24tabl", "approved_by": null, "body": "Take a walk outside. Go late at night and just walk when its quiet. Walking alone in the darkness beneath stars is the best way to think feelings through. If you don't know what you feel, try this.\n\nThere must be so many things in life you haven't yet experienced. So much information to be learned. So many things you haven't yet learned or tried. This is your only chance in all that. This fact is the most motivational to me. The pure idea of how lucky I am to be here to experience everything around me. I'm sure there are countless of meaningful experiences in your future as well. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a walk outside. Go late at night and just walk when its quiet. Walking alone in the darkness beneath stars is the best way to think feelings through. If you don&amp;#39;t know what you feel, try this.&lt;/p&gt;\n\n&lt;p&gt;There must be so many things in life you haven&amp;#39;t yet experienced. So much information to be learned. So many things you haven&amp;#39;t yet learned or tried. This is your only chance in all that. This fact is the most motivational to me. The pure idea of how lucky I am to be here to experience everything around me. I&amp;#39;m sure there are countless of meaningful experiences in your future as well. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tabl", "score_hidden": false, "name": "t1_chagz1m", "created": 1399359782.0, "author_flair_text": null, "created_utc": 1399330982.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]