[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess I&amp;#39;ve formed my own definition of depression or mental illness while trudging through information available on the internet and the opinions of other people. Armed with this, I&amp;#39;ve made the self-diagnosis that I am not depressed. Self-diagnosing is inaccurate/dangerous, but it&amp;#39;s pretty reasonable here, I think, because I can tell that I don&amp;#39;t identify well with the feelings of other depressed people.&lt;/p&gt;\n\n&lt;p&gt;Despite that, I would still say I can be sad, unmotivated, and suicidal. That last one, it&amp;#39;s pretty weird. There&amp;#39;s definitely some emotion behind it, but also some morbid curiosity. I don&amp;#39;t think my future is very bright, or even if it is, that it is one that I want. My current situation is okay, just not emotionally fulfilling. I think that suicide would be the more &amp;quot;pleasurable&amp;quot; option in the end, that really it would satisfy me the most. It feels like the right thing to do.&lt;/p&gt;\n\n&lt;p&gt;I have some ideas I&amp;#39;m convinced of. First, I really shouldn&amp;#39;t focus on whatever happens afterwards, without me. For example, committing suicide to get revenge on someone or make someone feel bad is a mistake, because you do not want to die, you just wanted that outcome, which is possible without suicide. Similarly with something like being a burden or fixing some money problem. I&amp;#39;ve thought about my own motivations, but I&amp;#39;m still convinced I just kinda don&amp;#39;t want to be here anymore, so suicide is what I want. Second, suicide deserves a wholehearted commitment. Going through with it only half convinced is probably a mistake. I feel fully convinced. Even if I might regret it later, I believe if I commit at a moment with my best, seemingly rational judgement, I would forgive myself.&lt;/p&gt;\n\n&lt;p&gt;Maybe I don&amp;#39;t have simply a defective philosophy and I do actually have a serious mental illness. Or maybe bad philosophies are mental illnesses.&lt;/p&gt;\n\n&lt;p&gt;Maybe I just need some uncompromisingly harsh advice to &amp;quot;Man up&amp;quot; or &amp;quot;Just get over it&amp;quot;, because that is simply what will snap a person like me to normal. &lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m right. Maybe it will be some work of fate that I commit suicide, maybe it is just the natural course for some unnatural stupidity I have.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I guess I've formed my own definition of depression or mental illness while trudging through information available on the internet and the opinions of other people. Armed with this, I've made the self-diagnosis that I am not depressed. Self-diagnosing is inaccurate/dangerous, but it's pretty reasonable here, I think, because I can tell that I don't identify well with the feelings of other depressed people.\n\nDespite that, I would still say I can be sad, unmotivated, and suicidal. That last one, it's pretty weird. There's definitely some emotion behind it, but also some morbid curiosity. I don't think my future is very bright, or even if it is, that it is one that I want. My current situation is okay, just not emotionally fulfilling. I think that suicide would be the more \"pleasurable\" option in the end, that really it would satisfy me the most. It feels like the right thing to do.\n\nI have some ideas I'm convinced of. First, I really shouldn't focus on whatever happens afterwards, without me. For example, committing suicide to get revenge on someone or make someone feel bad is a mistake, because you do not want to die, you just wanted that outcome, which is possible without suicide. Similarly with something like being a burden or fixing some money problem. I've thought about my own motivations, but I'm still convinced I just kinda don't want to be here anymore, so suicide is what I want. Second, suicide deserves a wholehearted commitment. Going through with it only half convinced is probably a mistake. I feel fully convinced. Even if I might regret it later, I believe if I commit at a moment with my best, seemingly rational judgement, I would forgive myself.\n\nMaybe I don't have simply a defective philosophy and I do actually have a serious mental illness. Or maybe bad philosophies are mental illnesses.\n\nMaybe I just need some uncompromisingly harsh advice to \"Man up\" or \"Just get over it\", because that is simply what will snap a person like me to normal. \n\nMaybe I'm right. Maybe it will be some work of fate that I commit suicide, maybe it is just the natural course for some unnatural stupidity I have.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245u3b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "-foda", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245u3b/not_depressed_but_suicidal/", "name": "t3_245u3b", "created": 1398687919.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245u3b/not_depressed_but_suicidal/", "author_flair_text": null, "title": "Not depressed, but suicidal", "created_utc": 1398659119.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3x2np", "gilded": 0, "author": "-foda", "parent_id": "t1_ch3wioo", "approved_by": null, "body": "I haven't talked to anyone IRL. I think I've looked so dull so long, people have accepted it. I've never raised any commotion over it.\n\nThe most stressful things to me are school and my social life. I'm still in high school. I think one of the only urges I have within me is the desire to go to a \"good college.\" I would say it has been successfully implanted within me by my parents and well cultivated by my environment, but has never accepted by *me*. I don't have anything against it, and I'm still trying for it. I do very well academically, but extracurricular activities are nearly absent, so I am very worried, even if they are mostly irrelevant. I don't really want to talk about this, it's sort of a poisonous, unreasonable thought that I acknowledge but can't fix.\n\nI believe I have a pretty good understanding of my social life. It's a failure, but that doesn't hurt at all. I admit I am quiet, reserved, oblivious, and unresponsive, and that almost all of my actions do not benefit my social life, and that my image is uninviting. I can tell that, and I can feel I can change that, but I don't have motivation to. I'd be okay like this. The stressful part is that once having fixed a little bit before, I didn't want to continue. I had really imaginative fantasies before about social things, but it's not that impressive or attractive.\n\nI think I just don't want to live my life when things go bad, but I also don't want to live my life if things go well. I just don't want to live it.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t talked to anyone IRL. I think I&amp;#39;ve looked so dull so long, people have accepted it. I&amp;#39;ve never raised any commotion over it.&lt;/p&gt;\n\n&lt;p&gt;The most stressful things to me are school and my social life. I&amp;#39;m still in high school. I think one of the only urges I have within me is the desire to go to a &amp;quot;good college.&amp;quot; I would say it has been successfully implanted within me by my parents and well cultivated by my environment, but has never accepted by &lt;em&gt;me&lt;/em&gt;. I don&amp;#39;t have anything against it, and I&amp;#39;m still trying for it. I do very well academically, but extracurricular activities are nearly absent, so I am very worried, even if they are mostly irrelevant. I don&amp;#39;t really want to talk about this, it&amp;#39;s sort of a poisonous, unreasonable thought that I acknowledge but can&amp;#39;t fix.&lt;/p&gt;\n\n&lt;p&gt;I believe I have a pretty good understanding of my social life. It&amp;#39;s a failure, but that doesn&amp;#39;t hurt at all. I admit I am quiet, reserved, oblivious, and unresponsive, and that almost all of my actions do not benefit my social life, and that my image is uninviting. I can tell that, and I can feel I can change that, but I don&amp;#39;t have motivation to. I&amp;#39;d be okay like this. The stressful part is that once having fixed a little bit before, I didn&amp;#39;t want to continue. I had really imaginative fantasies before about social things, but it&amp;#39;s not that impressive or attractive.&lt;/p&gt;\n\n&lt;p&gt;I think I just don&amp;#39;t want to live my life when things go bad, but I also don&amp;#39;t want to live my life if things go well. I just don&amp;#39;t want to live it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245u3b", "score_hidden": false, "name": "t1_ch3x2np", "created": 1398665323.0, "author_flair_text": null, "created_utc": 1398661723.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3wioo", "gilded": 0, "author": "EpicXY", "parent_id": "t3_245u3b", "approved_by": null, "body": "You sound like a very good person. You know that you need to think things through before action, not going by instinct. \n\nCould you please explain further of your reason why you want to commit suicide? And have you talked with a hotline/doctor about this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like a very good person. You know that you need to think things through before action, not going by instinct. &lt;/p&gt;\n\n&lt;p&gt;Could you please explain further of your reason why you want to commit suicide? And have you talked with a hotline/doctor about this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245u3b", "score_hidden": false, "name": "t1_ch3wioo", "created": 1398663829.0, "author_flair_text": null, "created_utc": 1398660229.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3wnjz", "gilded": 0, "author": "QuiteStupid", "parent_id": "t3_245u3b", "approved_by": null, "body": "maybe, maybe, maybe, maybe.  there's a lot of maybes in life.  i know i may wake up.  i know i may enjoy tomorrow.  i know i may not.  i know that i'm in a rational state of mind.  looking into the future, i may have the career, family, and everything i want.  i won't be an astronaut despite space seeming amazing to me, i won't be able to travel the world with my father's inheritance and be some rich playboy.  but it doesn't necessarily mean i won't enjoy life.\n\ni used to play a game called super smash bros melee all the time.  i tried really hard to main the character marth, because for one, he looked like a fucking badass.  for two, once again, he's a badass.  i sucked dick at marth.  i hated marth, but i only wanted to play him because of the aesthetic i had in my mind of this badass swordsman.  i ended up maining zelda after i randomed her and really enjoyed her play style a lot more.\n\npoint being, your life may not head where you want it to head.  you could want to be some male model with a thousand sexcapades and star crossed lovers who think about him before they sleep, or some famous scientist who discovers the cure to every single cancer possible, but even if these famous roles aren't your futures, it doesn't mean they won't be just as fulfilling as what you have in mind.\n\nlife is full of twists and turns.  i've had days where i've been sad, laid on the couch all day, binge watched netflix, and thought about being a human pendulum.  but when i wake up happy, completely okay with what's going on in my life, i think; shit, why was i even thinking about that.  that happiness can be robbed from me, chances are it will be.  but when it's back, it's back, and i will enjoy the living fuck out of it and not let a single bleak day rob me of that happiness permanently.  neither should you, friend.  everyone has bouts of depression.  it's about shaking it off and just letting shit fall into place.  just give it a chance, trek through all the crap.  you can do it, and if you need help, shoot me a pm.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;maybe, maybe, maybe, maybe.  there&amp;#39;s a lot of maybes in life.  i know i may wake up.  i know i may enjoy tomorrow.  i know i may not.  i know that i&amp;#39;m in a rational state of mind.  looking into the future, i may have the career, family, and everything i want.  i won&amp;#39;t be an astronaut despite space seeming amazing to me, i won&amp;#39;t be able to travel the world with my father&amp;#39;s inheritance and be some rich playboy.  but it doesn&amp;#39;t necessarily mean i won&amp;#39;t enjoy life.&lt;/p&gt;\n\n&lt;p&gt;i used to play a game called super smash bros melee all the time.  i tried really hard to main the character marth, because for one, he looked like a fucking badass.  for two, once again, he&amp;#39;s a badass.  i sucked dick at marth.  i hated marth, but i only wanted to play him because of the aesthetic i had in my mind of this badass swordsman.  i ended up maining zelda after i randomed her and really enjoyed her play style a lot more.&lt;/p&gt;\n\n&lt;p&gt;point being, your life may not head where you want it to head.  you could want to be some male model with a thousand sexcapades and star crossed lovers who think about him before they sleep, or some famous scientist who discovers the cure to every single cancer possible, but even if these famous roles aren&amp;#39;t your futures, it doesn&amp;#39;t mean they won&amp;#39;t be just as fulfilling as what you have in mind.&lt;/p&gt;\n\n&lt;p&gt;life is full of twists and turns.  i&amp;#39;ve had days where i&amp;#39;ve been sad, laid on the couch all day, binge watched netflix, and thought about being a human pendulum.  but when i wake up happy, completely okay with what&amp;#39;s going on in my life, i think; shit, why was i even thinking about that.  that happiness can be robbed from me, chances are it will be.  but when it&amp;#39;s back, it&amp;#39;s back, and i will enjoy the living fuck out of it and not let a single bleak day rob me of that happiness permanently.  neither should you, friend.  everyone has bouts of depression.  it&amp;#39;s about shaking it off and just letting shit fall into place.  just give it a chance, trek through all the crap.  you can do it, and if you need help, shoot me a pm.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245u3b", "score_hidden": false, "name": "t1_ch3wnjz", "created": 1398664200.0, "author_flair_text": null, "created_utc": 1398660600.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]