[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m turning 45 this year, my son is going to be 21, my daughter will be 19 (and her girlfriend of 3 years who is also like a daughter will be 19 as well).  I have admitted that all I do lately is struggle, with depression, with suicidal thoughts nagging me every day.  &lt;/p&gt;\n\n&lt;p&gt;This also happens to be the 10 year anniversary of when their dad ended our marriage.  We were together for 15 years and he peaced out.  Since then I&amp;#39;ve had one serious relationship (back in 2008) and now that guy is my bosses boyfriend (long story).  Its bad enough that my job is crazy difficult with 60-80 thankless hours a week, but I get to see my boss come to work all glowy because she had &amp;quot;a great night&amp;quot;.  To deal with the stress, I&amp;#39;ve gained and lost and gained weight based on how nuts I feel and mostly I&amp;#39;m just convinced I&amp;#39;ll die alone. So what creeps into my head constantly is why not just die now and get it over with.&lt;/p&gt;\n\n&lt;p&gt;I used to cut myself but I know if I start again it&amp;#39;ll be the end of me. I won&amp;#39;t be able to stop.  This sounds so lame, even to me.  I just wish there were some way out.  &lt;/p&gt;\n\n&lt;p&gt;My worry now is the &amp;quot;hey, why don&amp;#39;t I just end this now&amp;quot; thoughts are getting worse. There are a bunch of other things I could write but it&amp;#39;s just too much to blab all over the place. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m putting this out there because I have to admit it to someone.  Even if there are no responses, I&amp;#39;m fine with it.  I just have to say the words to someone other than my kids - who worry about their &amp;quot;best mom in the whole world who has sacrificed everything for them, including a personal life&amp;quot; taking a header because all I can see is a loooong road of lonely while I stand by and watch everyone else be happy.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s getting to where I&amp;#39;m scared.  Not so much that I&amp;#39;ll consciously do anything because of what it would do to my kids - but that I&amp;#39;m going to drown in this awful feeling of numb despair until I wind up hospitalized.  &lt;/p&gt;\n\n&lt;p&gt;The only way I can make myself laugh is by repeating that line from that old Marlon Brando movie On The Waterfront (haven&amp;#39;t seen it, just remember the line) &amp;quot;I coulda had class. I coulda been a contender. I coulda been somebody&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I really could have. Thanks for reading if you did, otherwise:&lt;/p&gt;\n\n&lt;p&gt;TL:dr 45 yr old woman who thinks she&amp;#39;s a dried up old lady fesses up that all is not well under her skin&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm turning 45 this year, my son is going to be 21, my daughter will be 19 (and her girlfriend of 3 years who is also like a daughter will be 19 as well).  I have admitted that all I do lately is struggle, with depression, with suicidal thoughts nagging me every day.  \n\nThis also happens to be the 10 year anniversary of when their dad ended our marriage.  We were together for 15 years and he peaced out.  Since then I've had one serious relationship (back in 2008) and now that guy is my bosses boyfriend (long story).  Its bad enough that my job is crazy difficult with 60-80 thankless hours a week, but I get to see my boss come to work all glowy because she had \"a great night\".  To deal with the stress, I've gained and lost and gained weight based on how nuts I feel and mostly I'm just convinced I'll die alone. So what creeps into my head constantly is why not just die now and get it over with.\n\nI used to cut myself but I know if I start again it'll be the end of me. I won't be able to stop.  This sounds so lame, even to me.  I just wish there were some way out.  \n\nMy worry now is the \"hey, why don't I just end this now\" thoughts are getting worse. There are a bunch of other things I could write but it's just too much to blab all over the place. \n\nI'm putting this out there because I have to admit it to someone.  Even if there are no responses, I'm fine with it.  I just have to say the words to someone other than my kids - who worry about their \"best mom in the whole world who has sacrificed everything for them, including a personal life\" taking a header because all I can see is a loooong road of lonely while I stand by and watch everyone else be happy.\n\nIt's getting to where I'm scared.  Not so much that I'll consciously do anything because of what it would do to my kids - but that I'm going to drown in this awful feeling of numb despair until I wind up hospitalized.  \n\nThe only way I can make myself laugh is by repeating that line from that old Marlon Brando movie On The Waterfront (haven't seen it, just remember the line) \"I coulda had class. I coulda been a contender. I coulda been somebody\"\n\nI really could have. Thanks for reading if you did, otherwise:\n\nTL:dr 45 yr old woman who thinks she's a dried up old lady fesses up that all is not well under her skin", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23tvqs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lurburr", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23tvqs/not_using_a_throwaway_because_ive_already/", "name": "t3_23tvqs", "created": 1398338695.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23tvqs/not_using_a_throwaway_because_ive_already/", "author_flair_text": null, "title": "Not using a throwaway because I've already admitted how bad I'm struggling to my now grown children.", "created_utc": 1398309895.0, "ups": 4, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0majt", "gilded": 0, "author": "lurburr", "parent_id": "t1_ch0lial", "approved_by": null, "body": "you're very sweet, you remind me of my son. The best compliment I can give you is to show you a picture of us.  They're my best work and the reason I'll keep fighting - even though I have no mojo left it seems.\n\nhttp://i.imgur.com/W3KBPcQ.jpg\nps - this was from Christmas 2011, a muuuuch happier time because they both still lived with me!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re very sweet, you remind me of my son. The best compliment I can give you is to show you a picture of us.  They&amp;#39;re my best work and the reason I&amp;#39;ll keep fighting - even though I have no mojo left it seems.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://i.imgur.com/W3KBPcQ.jpg\"&gt;http://i.imgur.com/W3KBPcQ.jpg&lt;/a&gt;\nps - this was from Christmas 2011, a muuuuch happier time because they both still lived with me!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch0majt", "created": 1398346879.0, "author_flair_text": null, "created_utc": 1398318079.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0lial", "gilded": 0, "author": "KingWhoBoreTheSword", "parent_id": "t1_ch0l7jy", "approved_by": null, "body": "It's all about confidence, that's what people really pick up on! I know things will get better for you, and these feelings will go, and honestly come back. But when they do just know they will pass and life doesn't end when you hit a certain point. Your strong, be safe :D \n\nAgain vent more! If you ever need anyone to talk to I'm here", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about confidence, that&amp;#39;s what people really pick up on! I know things will get better for you, and these feelings will go, and honestly come back. But when they do just know they will pass and life doesn&amp;#39;t end when you hit a certain point. Your strong, be safe :D &lt;/p&gt;\n\n&lt;p&gt;Again vent more! If you ever need anyone to talk to I&amp;#39;m here&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch0lial", "created": 1398344320.0, "author_flair_text": null, "created_utc": 1398315520.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0l7jy", "gilded": 0, "author": "lurburr", "parent_id": "t1_ch0kgjz", "approved_by": null, "body": "thank you thank you thank you for being so kind. I appreciate it so much. As for being dried up, it's the only reason I put makeup on every day, haha... trying to not look like how I feel.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you thank you thank you for being so kind. I appreciate it so much. As for being dried up, it&amp;#39;s the only reason I put makeup on every day, haha... trying to not look like how I feel.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch0l7jy", "created": 1398343503.0, "author_flair_text": null, "created_utc": 1398314703.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0kgjz", "gilded": 0, "author": "KingWhoBoreTheSword", "parent_id": "t3_23tvqs", "approved_by": null, "body": "To your kids you were and are a somebody. It's hard to keep going day in a day out trying to be positive and being there for other people, all the while your entire life feels like some sort of wheel that keeps spinning all the way back to being miserable. The shit with your boss is just fucked up and yeah she's a bitch and your ex is seems like a dbag. It's okay to feel like shit sometimes and feel overwhelmed we all do but try not to feel like everything is final. Your a mom who raised two children and managed to still be strong enough not to give up during their upbringing which is incredible. It's never to late to find the person you'll spend the rest of your life with, your 45? So What!? That's not dried up that's still fresh! :D\n\nTry to let this stuff out more and just don't give up, but you should try not to live just for other people. Love yourself. You can message me anytime if you ever need to vent :D", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To your kids you were and are a somebody. It&amp;#39;s hard to keep going day in a day out trying to be positive and being there for other people, all the while your entire life feels like some sort of wheel that keeps spinning all the way back to being miserable. The shit with your boss is just fucked up and yeah she&amp;#39;s a bitch and your ex is seems like a dbag. It&amp;#39;s okay to feel like shit sometimes and feel overwhelmed we all do but try not to feel like everything is final. Your a mom who raised two children and managed to still be strong enough not to give up during their upbringing which is incredible. It&amp;#39;s never to late to find the person you&amp;#39;ll spend the rest of your life with, your 45? So What!? That&amp;#39;s not dried up that&amp;#39;s still fresh! :D&lt;/p&gt;\n\n&lt;p&gt;Try to let this stuff out more and just don&amp;#39;t give up, but you should try not to live just for other people. Love yourself. You can message me anytime if you ever need to vent :D&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch0kgjz", "created": 1398341594.0, "author_flair_text": null, "created_utc": 1398312794.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch150x2", "gilded": 0, "author": "lurburr", "parent_id": "t1_ch10ucq", "approved_by": null, "body": "oh crap. I forgot YOU know my user name. I love you too my sweet forever friend, very much.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh crap. I forgot YOU know my user name. I love you too my sweet forever friend, very much.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch150x2", "created": 1398376208.0, "author_flair_text": null, "created_utc": 1398372608.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch10ucq", "gilded": 0, "author": "LookWhatDannyMade", "parent_id": "t3_23tvqs", "approved_by": null, "body": "I love you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch10ucq", "created": 1398393414.0, "author_flair_text": null, "created_utc": 1398364614.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5fc3y", "gilded": 0, "author": "lurburr", "parent_id": "t1_ch1ab4m", "approved_by": null, "body": "sorry, just saw this now.  You're very sweet for saying that.  I have a young face but my body is trashed from years of surgeries and surgeries and more surgeries, plus all the weight. When I had kids everywhere and what I considered \"a purpose\" because I was the only mom most of them had - it didn't bother me at all because I was so happily focused on them. \n\nNow that they've all grown up and moved on with their lives, I feel like I have nothing to fall back on - so my brain sees that as \"you have no use\".  I know my kids will always need me, but it's the daily battle to feel like I\"m worth more than an old mop seems to be wiping me out.\n\nThank you so much for your kind reply.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sorry, just saw this now.  You&amp;#39;re very sweet for saying that.  I have a young face but my body is trashed from years of surgeries and surgeries and more surgeries, plus all the weight. When I had kids everywhere and what I considered &amp;quot;a purpose&amp;quot; because I was the only mom most of them had - it didn&amp;#39;t bother me at all because I was so happily focused on them. &lt;/p&gt;\n\n&lt;p&gt;Now that they&amp;#39;ve all grown up and moved on with their lives, I feel like I have nothing to fall back on - so my brain sees that as &amp;quot;you have no use&amp;quot;.  I know my kids will always need me, but it&amp;#39;s the daily battle to feel like I&amp;quot;m worth more than an old mop seems to be wiping me out.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for your kind reply.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch5fc3y", "created": 1398838132.0, "author_flair_text": null, "created_utc": 1398809332.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1ab4m", "gilded": 0, "author": "PinkCupcakeMonster", "parent_id": "t3_23tvqs", "approved_by": null, "body": "Why would you feel dried up? You look younger than my mom (36yrs). You're beautiful. I'm not just saying this to make you feel better or because I pity you. You are beautiful. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would you feel dried up? You look younger than my mom (36yrs). You&amp;#39;re beautiful. I&amp;#39;m not just saying this to make you feel better or because I pity you. You are beautiful. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch1ab4m", "created": 1398412812.0, "author_flair_text": null, "created_utc": 1398384012.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5nsd8", "gilded": 0, "author": "PinkCupcakeMonster", "parent_id": "t3_23tvqs", "approved_by": null, "body": "Don't look at yourself that way. The scars you bear from your surgeries are battle scars! :D and a little pudge never hurt anybody. You certainly aren't fat so I'm assuming you have a little tummy fat. But flat stomachs don't exactly exist anyway. I'm 120 pounds and I have a tummy pudge. I used to hate it but now I think it's cute.\n\nI went through a situation kind of like yours (emotionally- the event was actually very different). I nearly lost my life and now I find happiness in the littlest things.\n\nI guess what I'm trying to say is- focus on the positive and fall in love with as many things as you can. And enjoy all the little things.\n\nI promise good will come your way eventually. You are a beautiful woman no matter how much you lie to your reflection. \n\n&lt;3 sending good vibes your way!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t look at yourself that way. The scars you bear from your surgeries are battle scars! :D and a little pudge never hurt anybody. You certainly aren&amp;#39;t fat so I&amp;#39;m assuming you have a little tummy fat. But flat stomachs don&amp;#39;t exactly exist anyway. I&amp;#39;m 120 pounds and I have a tummy pudge. I used to hate it but now I think it&amp;#39;s cute.&lt;/p&gt;\n\n&lt;p&gt;I went through a situation kind of like yours (emotionally- the event was actually very different). I nearly lost my life and now I find happiness in the littlest things.&lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m trying to say is- focus on the positive and fall in love with as many things as you can. And enjoy all the little things.&lt;/p&gt;\n\n&lt;p&gt;I promise good will come your way eventually. You are a beautiful woman no matter how much you lie to your reflection. &lt;/p&gt;\n\n&lt;p&gt;&amp;lt;3 sending good vibes your way!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23tvqs", "score_hidden": false, "name": "t1_ch5nsd8", "created": 1398830605.0, "author_flair_text": null, "created_utc": 1398827005.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]