[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not so sure what I&amp;#39;m really doing here. I currently feel empty so I don&amp;#39;t feel like I&amp;#39;m crying out for help. But I guess I&amp;#39;d say I&amp;#39;m at the point of just wanting someone to talk to before I go. I basically eat suicidal thoughts for breakfast, lunch, day dreams, and as I&amp;#39;m lying down for bed I wish how much that I&amp;#39;d not wake up and how great that&amp;#39;d be. I&amp;#39;ve started carrying around a bottle of pills I know will definitely kill me if taken more than 10. Which isn&amp;#39;t the only way I&amp;#39;ve thought of going. I&amp;#39;ve plotted out many ways such as taking a fake gun and getting shot up by police. Buying a gun and going out into the wilderness and ending it. The thoughts are never ending. But yeah.. Not really sure what I&amp;#39;m trying to accomplish here. Hopefully something.. I donno..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not so sure what I'm really doing here. I currently feel empty so I don't feel like I'm crying out for help. But I guess I'd say I'm at the point of just wanting someone to talk to before I go. I basically eat suicidal thoughts for breakfast, lunch, day dreams, and as I'm lying down for bed I wish how much that I'd not wake up and how great that'd be. I've started carrying around a bottle of pills I know will definitely kill me if taken more than 10. Which isn't the only way I've thought of going. I've plotted out many ways such as taking a fake gun and getting shot up by police. Buying a gun and going out into the wilderness and ending it. The thoughts are never ending. But yeah.. Not really sure what I'm trying to accomplish here. Hopefully something.. I donno..", "likes": null, "secure_media": null, "link_flair_text": null, "id": "254vsr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "blairebunny", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/254vsr/not_so_sure/", "name": "t3_254vsr", "created": 1399678735.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/254vsr/not_so_sure/", "author_flair_text": null, "title": "Not so sure", "created_utc": 1399649935.0, "ups": 4, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdq9u1", "gilded": 0, "author": "HP_Housecat", "parent_id": "t1_chdq3ll", "approved_by": null, "body": "It's pretty reasonable to want comfort. You don't need to talk about your specific problems to find some. It might be helpful to you in the future to start talking about those problems with someone but for now be assured that it's okay to feel how you do.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s pretty reasonable to want comfort. You don&amp;#39;t need to talk about your specific problems to find some. It might be helpful to you in the future to start talking about those problems with someone but for now be assured that it&amp;#39;s okay to feel how you do.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254vsr", "score_hidden": false, "name": "t1_chdq9u1", "created": 1399681335.0, "author_flair_text": null, "created_utc": 1399652535.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdqjc7", "gilded": 0, "author": "MonkeyWithAGun225", "parent_id": "t1_chdq3ll", "approved_by": null, "body": "I understand, I didn't want to either. Still don't, and for now I'd like to keep it that way, if you're suicidal, you have nothing to lose. Go on that trip you've always wanted, help people in need of assistance, do something you never thought you would do before, create something no matter how shitty, ask yourself in any situation what would make the best story, tell said stories, become the best at something, weither it be spitting distance or the high score in donkey kong, start a business, go to a bar and ask the prettiest person there out, if they reject you, try again or go to a different bar and try again, fire enough shots and one of them is sure to land. If you can't do any of these things and you don't have dreams of being a hotshot CEO or moviestar, start small, Short steps, deep breaths. Make a list full of everything you deem impossible and work on them one at a time, then check them off. Once you notice the list getting more and more checked you might think differently. If you're too younge for some of these things to be possible, wait it out! You're not allowed to die yet.\n\nAlso, try to reply to my comments instead of a new post in the thread, I won't be able to know If you've responded or not.", "edited": 1399653278.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand, I didn&amp;#39;t want to either. Still don&amp;#39;t, and for now I&amp;#39;d like to keep it that way, if you&amp;#39;re suicidal, you have nothing to lose. Go on that trip you&amp;#39;ve always wanted, help people in need of assistance, do something you never thought you would do before, create something no matter how shitty, ask yourself in any situation what would make the best story, tell said stories, become the best at something, weither it be spitting distance or the high score in donkey kong, start a business, go to a bar and ask the prettiest person there out, if they reject you, try again or go to a different bar and try again, fire enough shots and one of them is sure to land. If you can&amp;#39;t do any of these things and you don&amp;#39;t have dreams of being a hotshot CEO or moviestar, start small, Short steps, deep breaths. Make a list full of everything you deem impossible and work on them one at a time, then check them off. Once you notice the list getting more and more checked you might think differently. If you&amp;#39;re too younge for some of these things to be possible, wait it out! You&amp;#39;re not allowed to die yet.&lt;/p&gt;\n\n&lt;p&gt;Also, try to reply to my comments instead of a new post in the thread, I won&amp;#39;t be able to know If you&amp;#39;ve responded or not.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254vsr", "score_hidden": false, "name": "t1_chdqjc7", "created": 1399681895.0, "author_flair_text": null, "created_utc": 1399653095.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdq3ll", "gilded": 0, "author": "blairebunny", "parent_id": "t3_254vsr", "approved_by": null, "body": "I try to play online games to distract me from my thoughts but I become disinterested and my problems are not things I'd like to talk about. Very rarely do I actually dream. It's either dark nothingness or nightmares. The only dream I've had in a long while was the other day. I was standing in front of a mirror looking the way I feel inside with an unknown boyfriend holding me from behind.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I try to play online games to distract me from my thoughts but I become disinterested and my problems are not things I&amp;#39;d like to talk about. Very rarely do I actually dream. It&amp;#39;s either dark nothingness or nightmares. The only dream I&amp;#39;ve had in a long while was the other day. I was standing in front of a mirror looking the way I feel inside with an unknown boyfriend holding me from behind.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254vsr", "score_hidden": false, "name": "t1_chdq3ll", "created": 1399680969.0, "author_flair_text": null, "created_utc": 1399652169.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheaunr", "gilded": 0, "author": "blairebunny", "parent_id": "t3_254vsr", "approved_by": null, "body": "Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254vsr", "score_hidden": false, "name": "t1_cheaunr", "created": 1399734025.0, "author_flair_text": null, "created_utc": 1399705225.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdphqv", "gilded": 0, "author": "MonkeyWithAGun225", "parent_id": "t3_254vsr", "approved_by": null, "body": "I'm not going to tell you its going to get better, that life will find a way, or that all you need in life are specific things that will make you happy. What I will tell you is either to seek proffesional help, or to tough through it. I only say the other option because sometimes therapy or medication won't help, it hasn't for me and I don't think it will until modern medicine makes a happy pill. Suicide isn't the answer until you're absolutely sure you've experienced every single thing that you can. Life doesn't get easier, people just become more hardened. The point of life is to make a meaning, because life is meaningless originally. Do you have any dreams? Do you wish to become something? Do it. Already accomplished your dreams and don't know what to do? To that I say, dream bigger! Think of all the people cheering you on, all the people you'll make cry because you are gone, no matter how many people. Live alone with no friends? Make some! Its easy to do if you're in the right environment, and If you find people with the same interests. And if you're socially awkward, take the steps to become less socially awkward, read self help books, subscribe to social skills, anything! As long as you don't premuturely end yourself because of what's going on in your life. Tell me what's going on friend, as someone who has been in the same situation I can help more then someone who has studied in the subject has, and I'll listen for free.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to tell you its going to get better, that life will find a way, or that all you need in life are specific things that will make you happy. What I will tell you is either to seek proffesional help, or to tough through it. I only say the other option because sometimes therapy or medication won&amp;#39;t help, it hasn&amp;#39;t for me and I don&amp;#39;t think it will until modern medicine makes a happy pill. Suicide isn&amp;#39;t the answer until you&amp;#39;re absolutely sure you&amp;#39;ve experienced every single thing that you can. Life doesn&amp;#39;t get easier, people just become more hardened. The point of life is to make a meaning, because life is meaningless originally. Do you have any dreams? Do you wish to become something? Do it. Already accomplished your dreams and don&amp;#39;t know what to do? To that I say, dream bigger! Think of all the people cheering you on, all the people you&amp;#39;ll make cry because you are gone, no matter how many people. Live alone with no friends? Make some! Its easy to do if you&amp;#39;re in the right environment, and If you find people with the same interests. And if you&amp;#39;re socially awkward, take the steps to become less socially awkward, read self help books, subscribe to social skills, anything! As long as you don&amp;#39;t premuturely end yourself because of what&amp;#39;s going on in your life. Tell me what&amp;#39;s going on friend, as someone who has been in the same situation I can help more then someone who has studied in the subject has, and I&amp;#39;ll listen for free.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254vsr", "score_hidden": false, "name": "t1_chdphqv", "created": 1399679706.0, "author_flair_text": null, "created_utc": 1399650906.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]