[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am so at the end of my rope right now I&amp;#39;m not sure what to do with myself. I&amp;#39;m about to explode because I have no idea where to turn. I feel immense anxiety at home around own family. Now I&amp;#39;m on campus where I feel immense anxiety, and had a triggering moment earlier today. I don&amp;#39;t want to run into anyone I know, but I&amp;#39;m bound to do it anyway, and I know everyone here hates me. If I go anywhere else there&amp;#39;ll be people, and I&amp;#39;ll feel anxious. I&amp;#39;ve felt ridiculously depressed and anxious (both GAD and social) for the past 5 months, and suicidal, too.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to feel comfortable around any other human being. I don&amp;#39;t have a single person who knows what I&amp;#39;ve been going through, and everybody&amp;#39;s been avoiding me and isolating me because they don&amp;#39;t know why I&amp;#39;m acting so weird, which I don&amp;#39;t blame them for. I don&amp;#39;t have a single friend or person to talk to, and even my family&amp;#39;s fed up with me and treating me like shit. I&amp;#39;ve lost all the friends I used to have, and don&amp;#39;t know how to talk to people anymore. I feel utterly worthless to begin with, and totally unwanted to boot.&lt;/p&gt;\n\n&lt;p&gt;I have so much schoolwork to focus on right now with it being the end of the semester but I feel like I&amp;#39;m about to have a breakdown right this second. How am I supposed to focus on schoolwork and feel suicidal at the same time? On top of all this I have an oral presentation to give tomorrow and I&amp;#39;m not sure how to go through with that without panicking and feeling 500x more suicidal afterwards. That&amp;#39;s what happened with the last oral presentation anyway. Should I just skip class tomorrow?&lt;/p&gt;\n\n&lt;p&gt;I hate everything about my life right now, and I hate schoolwork. I&amp;#39;m not even sure if it&amp;#39;s worth surviving right now, but I&amp;#39;m not sure what else to do. Thanks for reading if you did.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am so at the end of my rope right now I'm not sure what to do with myself. I'm about to explode because I have no idea where to turn. I feel immense anxiety at home around own family. Now I'm on campus where I feel immense anxiety, and had a triggering moment earlier today. I don't want to run into anyone I know, but I'm bound to do it anyway, and I know everyone here hates me. If I go anywhere else there'll be people, and I'll feel anxious. I've felt ridiculously depressed and anxious (both GAD and social) for the past 5 months, and suicidal, too.\n\nI don't know how to feel comfortable around any other human being. I don't have a single person who knows what I've been going through, and everybody's been avoiding me and isolating me because they don't know why I'm acting so weird, which I don't blame them for. I don't have a single friend or person to talk to, and even my family's fed up with me and treating me like shit. I've lost all the friends I used to have, and don't know how to talk to people anymore. I feel utterly worthless to begin with, and totally unwanted to boot.\n\nI have so much schoolwork to focus on right now with it being the end of the semester but I feel like I'm about to have a breakdown right this second. How am I supposed to focus on schoolwork and feel suicidal at the same time? On top of all this I have an oral presentation to give tomorrow and I'm not sure how to go through with that without panicking and feeling 500x more suicidal afterwards. That's what happened with the last oral presentation anyway. Should I just skip class tomorrow?\n\nI hate everything about my life right now, and I hate schoolwork. I'm not even sure if it's worth surviving right now, but I'm not sure what else to do. Thanks for reading if you did.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24s51j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "swthrowaway120", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24s51j/not_sure_where_to_turn/", "name": "t3_24s51j", "created": 1399332766.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24s51j/not_sure_where_to_turn/", "author_flair_text": null, "title": "Not sure where to turn", "created_utc": 1399303966.0, "ups": 10, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha5fy4", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_cha4y8z", "approved_by": null, "body": "Hey,\n\nThanks for your reply. I really appreciate it.\n\nI had a question specifically about the oral presentation. I already talked to my professor about it last class and she wants me doing it no matter what. I told her my problems, that I have a voice disorder that doesn't allow me to talk properly and gets even worse when I'm nervous, and she didn't seem very keen on letting me present to her privately in office hours. The presentation is tomorrow and I'll have no opportunity to talk to her before class. Is there anything I can do as a last resort? She's not responsive by email either.\n\nI'm really not in the mental state to be worrying about something like this. I really just want to skip class tomorrow, but then I'd be even more anxious about everyone and my professor noticing me skipping class the day of a presentation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey,&lt;/p&gt;\n\n&lt;p&gt;Thanks for your reply. I really appreciate it.&lt;/p&gt;\n\n&lt;p&gt;I had a question specifically about the oral presentation. I already talked to my professor about it last class and she wants me doing it no matter what. I told her my problems, that I have a voice disorder that doesn&amp;#39;t allow me to talk properly and gets even worse when I&amp;#39;m nervous, and she didn&amp;#39;t seem very keen on letting me present to her privately in office hours. The presentation is tomorrow and I&amp;#39;ll have no opportunity to talk to her before class. Is there anything I can do as a last resort? She&amp;#39;s not responsive by email either.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really not in the mental state to be worrying about something like this. I really just want to skip class tomorrow, but then I&amp;#39;d be even more anxious about everyone and my professor noticing me skipping class the day of a presentation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha5fy4", "created": 1399336588.0, "author_flair_text": null, "created_utc": 1399307788.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cha4y8z", "gilded": 0, "author": "Horus_Ascended", "parent_id": "t3_24s51j", "approved_by": null, "body": "Hey, \nFirst off I understand how it feels. My last two years of high school and first year of college felt pretty much the same and I had to come here once or twice myslef. So from experience this is a safe place to turn. For your presentation try talking to the teacher and explaining the situation. Offer to turn in the oral presentation as a written paper insteaif  (unless it's an oral intensive class)\n\nAs for the social anxiety have you tried joining any clubs or orginizations? That's what ultimately helped me get over my fear of social interactions. It's a lot easier to deal with people when you have some pre established common ground. If your not comfortable you never have to move off that common ground and if you get uncomfortable you can always fall back on it.\n\nUltimately these are all things that can and will work themselves out with time. Finals don't last forever, thank god. And if you ever need somewhere to vent to people who more then likely have been where you are this isn't a bad place to turn.\n\nHang in there and remember there are 27,305 people on the Internet here without judgment if you need us.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, \nFirst off I understand how it feels. My last two years of high school and first year of college felt pretty much the same and I had to come here once or twice myslef. So from experience this is a safe place to turn. For your presentation try talking to the teacher and explaining the situation. Offer to turn in the oral presentation as a written paper insteaif  (unless it&amp;#39;s an oral intensive class)&lt;/p&gt;\n\n&lt;p&gt;As for the social anxiety have you tried joining any clubs or orginizations? That&amp;#39;s what ultimately helped me get over my fear of social interactions. It&amp;#39;s a lot easier to deal with people when you have some pre established common ground. If your not comfortable you never have to move off that common ground and if you get uncomfortable you can always fall back on it.&lt;/p&gt;\n\n&lt;p&gt;Ultimately these are all things that can and will work themselves out with time. Finals don&amp;#39;t last forever, thank god. And if you ever need somewhere to vent to people who more then likely have been where you are this isn&amp;#39;t a bad place to turn.&lt;/p&gt;\n\n&lt;p&gt;Hang in there and remember there are 27,305 people on the Internet here without judgment if you need us.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha4y8z", "created": 1399335575.0, "author_flair_text": null, "created_utc": 1399306775.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cha5qh4", "gilded": 0, "author": "tangonaf", "parent_id": "t1_cha5htg", "approved_by": null, "body": "I think it's really important to say your suicidal.\n\nIt won't be only in your head anymore it will be out in the open, I think you will feel more relieved then. \n\nAnd don't worry about the oral presentation too much. Work on it as hard as you can now. \n\nWrite down everything you want to say even if you panic you can just read from the paper. That's what I do, also repeat the presentation a couple times, then you get more familiar with the slides etc.\n\nAnd there is a big propability you don't even have to do the presentation. \n\nJust go to the counselor and tell her all about your issues, don't be shy and self conscious about what you are telling her. She is there to help you.\n\nFeel free to pm me anytime.", "edited": 1399318941.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s really important to say your suicidal.&lt;/p&gt;\n\n&lt;p&gt;It won&amp;#39;t be only in your head anymore it will be out in the open, I think you will feel more relieved then. &lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t worry about the oral presentation too much. Work on it as hard as you can now. &lt;/p&gt;\n\n&lt;p&gt;Write down everything you want to say even if you panic you can just read from the paper. That&amp;#39;s what I do, also repeat the presentation a couple times, then you get more familiar with the slides etc.&lt;/p&gt;\n\n&lt;p&gt;And there is a big propability you don&amp;#39;t even have to do the presentation. &lt;/p&gt;\n\n&lt;p&gt;Just go to the counselor and tell her all about your issues, don&amp;#39;t be shy and self conscious about what you are telling her. She is there to help you.&lt;/p&gt;\n\n&lt;p&gt;Feel free to pm me anytime.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha5qh4", "created": 1399337189.0, "author_flair_text": null, "created_utc": 1399308389.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha5htg", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_cha51q4", "approved_by": null, "body": "I'm already talking to a therapist at my college. She's the only person I'm talking to right now, that knows anything about what I'm currently going through. She understands how bad things are for me anxiety wise, but I'm afraid to tell her I'm suicidal because it feels weird to say. Also, I don't want her telling my parents or anyone else about it.\n\nNot sure how I'll get a second chance for an oral presentation. I have an appointment with my therapist later today. Do you think there's some way she could help me out? I don't know what exactly to tell her. I don't want to mention that I'm suicidal, but I feel like she wouldn't take me seriously enough otherwise.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m already talking to a therapist at my college. She&amp;#39;s the only person I&amp;#39;m talking to right now, that knows anything about what I&amp;#39;m currently going through. She understands how bad things are for me anxiety wise, but I&amp;#39;m afraid to tell her I&amp;#39;m suicidal because it feels weird to say. Also, I don&amp;#39;t want her telling my parents or anyone else about it.&lt;/p&gt;\n\n&lt;p&gt;Not sure how I&amp;#39;ll get a second chance for an oral presentation. I have an appointment with my therapist later today. Do you think there&amp;#39;s some way she could help me out? I don&amp;#39;t know what exactly to tell her. I don&amp;#39;t want to mention that I&amp;#39;m suicidal, but I feel like she wouldn&amp;#39;t take me seriously enough otherwise.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha5htg", "created": 1399336693.0, "author_flair_text": null, "created_utc": 1399307893.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha51q4", "gilded": 0, "author": "tangonaf", "parent_id": "t3_24s51j", "approved_by": null, "body": "Go to a school counselor tomorrow morning. Tell them about your problems. Your school counselor will be able to help you a lot, referal to psychologist etc.\n\nYou probably will get a second chance for the oral presentation then, so you don't have to worry about your grade.\n\nBut it's really important to tell someone about your problems, people care about you and they will really want to help you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to a school counselor tomorrow morning. Tell them about your problems. Your school counselor will be able to help you a lot, referal to psychologist etc.&lt;/p&gt;\n\n&lt;p&gt;You probably will get a second chance for the oral presentation then, so you don&amp;#39;t have to worry about your grade.&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s really important to tell someone about your problems, people care about you and they will really want to help you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha51q4", "created": 1399335776.0, "author_flair_text": null, "created_utc": 1399306976.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chaa42d", "gilded": 0, "author": "kittenkaboodlee", "parent_id": "t1_cha8oqn", "approved_by": null, "body": "I think you should take the opportunity to give the presentation to her privately. It might be difficult but it will be better than doing it in front of the class. She woudn't have offered you the option of doing it privately if she didn't want to so I think you should do it! Also, I doubt that other people notice your voice disorder as much as you think :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should take the opportunity to give the presentation to her privately. It might be difficult but it will be better than doing it in front of the class. She woudn&amp;#39;t have offered you the option of doing it privately if she didn&amp;#39;t want to so I think you should do it! Also, I doubt that other people notice your voice disorder as much as you think :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_chaa42d", "created": 1399346051.0, "author_flair_text": null, "created_utc": 1399317251.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha8oqn", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_cha8fe8", "approved_by": null, "body": "I already talked to her about it and she didn't seem very understanding. \n\nShe did give me the option to present to her privately, but I don't know if she was totally OK with the idea of that -- she looked kind of wary, like she didn't even believe my issue was real. I have a problem with the oral presentation because I have a voice disorder that makes my voice sound weird/hard to understand, especially when I'm nervous. I don't like people to hear my voice to begin with, but when I'm nervous (which I will be during an oral presentation), it'll be even worse. This is what went wrong last time. \n\nIf I didn't have a voice disorder and this was just normal nerves, that'd be a different story, but this is what I have to deal with.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I already talked to her about it and she didn&amp;#39;t seem very understanding. &lt;/p&gt;\n\n&lt;p&gt;She did give me the option to present to her privately, but I don&amp;#39;t know if she was totally OK with the idea of that -- she looked kind of wary, like she didn&amp;#39;t even believe my issue was real. I have a problem with the oral presentation because I have a voice disorder that makes my voice sound weird/hard to understand, especially when I&amp;#39;m nervous. I don&amp;#39;t like people to hear my voice to begin with, but when I&amp;#39;m nervous (which I will be during an oral presentation), it&amp;#39;ll be even worse. This is what went wrong last time. &lt;/p&gt;\n\n&lt;p&gt;If I didn&amp;#39;t have a voice disorder and this was just normal nerves, that&amp;#39;d be a different story, but this is what I have to deal with.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha8oqn", "created": 1399343176.0, "author_flair_text": null, "created_utc": 1399314376.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha8fe8", "gilded": 0, "author": "kittenkaboodlee", "parent_id": "t1_cha7ohb", "approved_by": null, "body": "You're welcome! I think you should talk to your teacher and explain how you feel about the oral presentation and what happened last time. Also, why are you afraid of the oral presentation? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re welcome! I think you should talk to your teacher and explain how you feel about the oral presentation and what happened last time. Also, why are you afraid of the oral presentation? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha8fe8", "created": 1399342654.0, "author_flair_text": null, "created_utc": 1399313854.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha7ohb", "gilded": 0, "author": "swthrowaway120", "parent_id": "t1_cha6yw8", "approved_by": null, "body": "Hi! Thanks for your reply. It really helps to hear someone say that. \n\nI'm wondering if you can give me advice on how to get out of this oral presentation, because I know that going through with it will make me feel even worse than I already do. I had an oral presentation in the same class a few weeks ago and had an absolute breakdown (that no one knew about) for 4 straight days after that. My issues with the oral presentation are the very issues that make me feel suicidal to begin with, so this really won't work out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! Thanks for your reply. It really helps to hear someone say that. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m wondering if you can give me advice on how to get out of this oral presentation, because I know that going through with it will make me feel even worse than I already do. I had an oral presentation in the same class a few weeks ago and had an absolute breakdown (that no one knew about) for 4 straight days after that. My issues with the oral presentation are the very issues that make me feel suicidal to begin with, so this really won&amp;#39;t work out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha7ohb", "created": 1399341144.0, "author_flair_text": null, "created_utc": 1399312344.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cha6yw8", "gilded": 0, "author": "kittenkaboodlee", "parent_id": "t3_24s51j", "approved_by": null, "body": ":( sounds rough. I'm sorry you're feeling this way. What can I do?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:( sounds rough. I&amp;#39;m sorry you&amp;#39;re feeling this way. What can I do?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24s51j", "score_hidden": false, "name": "t1_cha6yw8", "created": 1399314504.0, "author_flair_text": null, "created_utc": 1399310904.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]