[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I made an ama a day or so ago about how I&amp;#39;m just starting high school and have never held a job. In answering some questions, I was basically told I&amp;#39;m no good because I&amp;#39;m overweight, a virgin and my dad supports me. I&amp;#39;ve been job hunting like mad, and I keep house and cook for my dad in exchange for room and board. I plan on paying him as soon as I can. I&amp;#39;m just so tired of people calling me a child. Would it be better if I was some skinny bimbo who fucks every guy she sees and works at a lousy job? I just wanted to talk in my ama and maybe meet people. My own cousins insulted me enough. Sorry, I&amp;#39;m just so frustrated. I can&amp;#39;t sleep and keep thinking about cutting.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thank you for the advice and kind words. I apologise for using the wrong subreddit. I am working on not giving in to others stupidity and just focusing on me and what I can do to for myself instead of the rest of the world.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I made an ama a day or so ago about how I'm just starting high school and have never held a job. In answering some questions, I was basically told I'm no good because I'm overweight, a virgin and my dad supports me. I've been job hunting like mad, and I keep house and cook for my dad in exchange for room and board. I plan on paying him as soon as I can. I'm just so tired of people calling me a child. Would it be better if I was some skinny bimbo who fucks every guy she sees and works at a lousy job? I just wanted to talk in my ama and maybe meet people. My own cousins insulted me enough. Sorry, I'm just so frustrated. I can't sleep and keep thinking about cutting.\n\nEDIT: Thank you for the advice and kind words. I apologise for using the wrong subreddit. I am working on not giving in to others stupidity and just focusing on me and what I can do to for myself instead of the rest of the world.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243fq4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Winter-Stardust", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398658750.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243fq4/not_exactly_suicidal_just_tired_and_very_angry/", "name": "t3_243fq4", "created": 1398620020.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243fq4/not_exactly_suicidal_just_tired_and_very_angry/", "author_flair_text": null, "title": "Not exactly suicidal, just tired and very angry. Thinking about cutting....", "created_utc": 1398591220.0, "ups": 7, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38j18", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_243fq4", "approved_by": null, "body": "Yo, we live in a crazy crazy world that's been dramatically altered by the internet.\n\nThe expectations to fulfill, like holding a job and being all of these things (like so quickly, and being a determinant of your worth) - are outdated expectations - from a world where we didn't have tremendous access to information and all kinds of horrible and intimidating stuff that has happened as a result of it.\n\nThe world has changed, and as a result, our expectations of ourselves should change I think.\n\nTruly great people, and I'm not saying that they are inherently good etc, but people who were very great artists and the like - had experiences growing up that helped them become what they were - and now, we have the opportunity to have those kinds of lives - if not for incredibly crippling shame, social anxiety, toxins in everything, and the horrific \"opportunities\" to make money.\n\nWhat I want to say is this: Slow down, and take exactly as much time as *you* need to get to where you want to be. You have every right to take your time, and odds are, very few of the people you know have had enough time to really grow up the way we've needed to.\n\nI dropped out of college (having had zero guidance pretty much my entire life) and I am currently on my way to pursue a trade career. But what dropping out helped me do was focus on art and music and figuring out how to *live* how to eat right and actually find exercise I wanted to do, the kinds of music I wanted to listen to, and the art that lay inside of me.\n\nYou are not a screw-up, you are not a loser, you are not something to be ashamed of. I know what it is like to feel all of those things, and I have found that research and being kind and slow with my own learning process has been exactly what I needed.\n\nAnd emotional expression. I needed to express everything I felt, over and over again, and learning how to really express myself has been monumental for me.\n\nMusic (and writing) probably helped me do that the most.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yo, we live in a crazy crazy world that&amp;#39;s been dramatically altered by the internet.&lt;/p&gt;\n\n&lt;p&gt;The expectations to fulfill, like holding a job and being all of these things (like so quickly, and being a determinant of your worth) - are outdated expectations - from a world where we didn&amp;#39;t have tremendous access to information and all kinds of horrible and intimidating stuff that has happened as a result of it.&lt;/p&gt;\n\n&lt;p&gt;The world has changed, and as a result, our expectations of ourselves should change I think.&lt;/p&gt;\n\n&lt;p&gt;Truly great people, and I&amp;#39;m not saying that they are inherently good etc, but people who were very great artists and the like - had experiences growing up that helped them become what they were - and now, we have the opportunity to have those kinds of lives - if not for incredibly crippling shame, social anxiety, toxins in everything, and the horrific &amp;quot;opportunities&amp;quot; to make money.&lt;/p&gt;\n\n&lt;p&gt;What I want to say is this: Slow down, and take exactly as much time as &lt;em&gt;you&lt;/em&gt; need to get to where you want to be. You have every right to take your time, and odds are, very few of the people you know have had enough time to really grow up the way we&amp;#39;ve needed to.&lt;/p&gt;\n\n&lt;p&gt;I dropped out of college (having had zero guidance pretty much my entire life) and I am currently on my way to pursue a trade career. But what dropping out helped me do was focus on art and music and figuring out how to &lt;em&gt;live&lt;/em&gt; how to eat right and actually find exercise I wanted to do, the kinds of music I wanted to listen to, and the art that lay inside of me.&lt;/p&gt;\n\n&lt;p&gt;You are not a screw-up, you are not a loser, you are not something to be ashamed of. I know what it is like to feel all of those things, and I have found that research and being kind and slow with my own learning process has been exactly what I needed.&lt;/p&gt;\n\n&lt;p&gt;And emotional expression. I needed to express everything I felt, over and over again, and learning how to really express myself has been monumental for me.&lt;/p&gt;\n\n&lt;p&gt;Music (and writing) probably helped me do that the most.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch38j18", "created": 1398603471.0, "author_flair_text": null, "created_utc": 1398599871.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch37xji", "gilded": 0, "author": "[deleted]", "parent_id": "t3_243fq4", "approved_by": null, "body": "I don't think you're 'no good' :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you&amp;#39;re &amp;#39;no good&amp;#39; :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch37xji", "created": 1398599638.0, "author_flair_text": null, "created_utc": 1398596038.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38lac", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_243fq4", "approved_by": null, "body": "In clarification - we live in an age where what we look like is almost *everything*. \n\nAnd I don't think that's an exaggeration. It determines *so freaking much*. How pretty much everyone will treat us.\n\nHealth is pretty much #1 now. \n\nAnd that leaves the rest of us feeling incredibly shameful :(.\n\nWorking on that, I think, has been just about the most important thing for me, I'm not saying to do harmful things, in fact, the opposite, I've found that eating right and doing exercise that I actually wanted to do (not punishing myself, but enjoying myself, like skateboarding, rock climbing, biking, short distance running/walking) has been *so* important for me.\n\nBut giving ourselves enough *real* rest and relaxation, learning how to actually cope and relieve stress that makes its way into our eyes and neck and all of that, learning how to actually give ourselves a break - has been so so so important for me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In clarification - we live in an age where what we look like is almost &lt;em&gt;everything&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;And I don&amp;#39;t think that&amp;#39;s an exaggeration. It determines &lt;em&gt;so freaking much&lt;/em&gt;. How pretty much everyone will treat us.&lt;/p&gt;\n\n&lt;p&gt;Health is pretty much #1 now. &lt;/p&gt;\n\n&lt;p&gt;And that leaves the rest of us feeling incredibly shameful :(.&lt;/p&gt;\n\n&lt;p&gt;Working on that, I think, has been just about the most important thing for me, I&amp;#39;m not saying to do harmful things, in fact, the opposite, I&amp;#39;ve found that eating right and doing exercise that I actually wanted to do (not punishing myself, but enjoying myself, like skateboarding, rock climbing, biking, short distance running/walking) has been &lt;em&gt;so&lt;/em&gt; important for me.&lt;/p&gt;\n\n&lt;p&gt;But giving ourselves enough &lt;em&gt;real&lt;/em&gt; rest and relaxation, learning how to actually cope and relieve stress that makes its way into our eyes and neck and all of that, learning how to actually give ourselves a break - has been so so so important for me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch38lac", "created": 1398603819.0, "author_flair_text": null, "created_utc": 1398600219.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch41048", "gilded": 0, "author": "daewen_hithuial", "parent_id": "t1_ch3ecyt", "approved_by": null, "body": "Awesome! I tried a couple of times to do cross-stitching as my mother and grandmother both do it, but I'm too messy and impatient, I'm a bit envious. I love reading, writing and video games too, though.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome! I tried a couple of times to do cross-stitching as my mother and grandmother both do it, but I&amp;#39;m too messy and impatient, I&amp;#39;m a bit envious. I love reading, writing and video games too, though.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch41048", "created": 1398684748.0, "author_flair_text": null, "created_utc": 1398681148.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3ecyt", "gilded": 0, "author": "Winter-Stardust", "parent_id": "t1_ch39bc1", "approved_by": null, "body": "Thank you for your honest and kind reply. My hobbies are reading, writing fanfiction, cross-stitching and video games.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your honest and kind reply. My hobbies are reading, writing fanfiction, cross-stitching and video games.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch3ecyt", "created": 1398622115.0, "author_flair_text": null, "created_utc": 1398618515.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch39bc1", "gilded": 0, "author": "daewen_hithuial", "parent_id": "t3_243fq4", "approved_by": null, "body": "Did you know that in China you are not allowed to have a part time job while studying? At least in the region my friend is from. If I can recall correctly, this is true also during university.\n\nI'm 25 (almost 26 actually) and I never had a proper job. I did some things, but on not-being-paid basis. After finishing high school I went to an academy of fine arts, then after three whole years I realised that it wasn't my thing (not that school at least, it's freaking awful) and I moved to another country to study in a completely different field. And all of this, always supported by my parents. Someone could say I'm behind in life, as I never worked and I will get a degree right before my 27th birthday. I'm overweight, too. If a stranger knew only this of me, they would probably think that I'm a failure. But they don't know who am I. I study for hours everyday, I try to eat healthy and I took up running, I started learning an instrument and I try, in general, to be a better person compared to what I've been yesterday.\n\nRandom people on internet don't know you, and if they are not willing to give you the benefit of the doubt, they are not worth listening. Same goes with people you meet in person. Until you get awfully close with them, they are in no position to judge. Actually, no, no one should be in position to judge, ever. But they are still going to do it, so you try to ignore them. I know it's hard -hell, I battle everyday with the part of me who worries over what other people think. This might help: /r/howtonotgiveafuck/.\n\nDo you have any hobbies?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you know that in China you are not allowed to have a part time job while studying? At least in the region my friend is from. If I can recall correctly, this is true also during university.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 25 (almost 26 actually) and I never had a proper job. I did some things, but on not-being-paid basis. After finishing high school I went to an academy of fine arts, then after three whole years I realised that it wasn&amp;#39;t my thing (not that school at least, it&amp;#39;s freaking awful) and I moved to another country to study in a completely different field. And all of this, always supported by my parents. Someone could say I&amp;#39;m behind in life, as I never worked and I will get a degree right before my 27th birthday. I&amp;#39;m overweight, too. If a stranger knew only this of me, they would probably think that I&amp;#39;m a failure. But they don&amp;#39;t know who am I. I study for hours everyday, I try to eat healthy and I took up running, I started learning an instrument and I try, in general, to be a better person compared to what I&amp;#39;ve been yesterday.&lt;/p&gt;\n\n&lt;p&gt;Random people on internet don&amp;#39;t know you, and if they are not willing to give you the benefit of the doubt, they are not worth listening. Same goes with people you meet in person. Until you get awfully close with them, they are in no position to judge. Actually, no, no one should be in position to judge, ever. But they are still going to do it, so you try to ignore them. I know it&amp;#39;s hard -hell, I battle everyday with the part of me who worries over what other people think. This might help: &lt;a href=\"/r/howtonotgiveafuck/\"&gt;/r/howtonotgiveafuck/&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Do you have any hobbies?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243fq4", "score_hidden": false, "name": "t1_ch39bc1", "created": 1398632636.0, "author_flair_text": null, "created_utc": 1398603836.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]