[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have had low self esteem, anxiety and maybe depression since I was a kid who was horribly bullied. I coped fairly well through school and university because I had great friends around me and structure. I&amp;#39;ve never dealt well with change or lack of structure. I graduated summer 2012 and had an entry level job lined up. I had one 5 year relationship that ended 18 months ago after a lot of traumatic things happened but we are still close friends and live together. A year ago next Wednesday I met the most amazing man I&amp;#39;ve ever met. We had 5 dates in 10 days and fell madly in love. He was just coming out of a long term relationship where his ex suffered with crippling depression that had almost destroyed him. He is polyamorous. Logically, academically and morally I like the idea of polyamory so was happy to enter this relationship and explore polyamory myself. Over the course of our relationship my depression/anxiety got steadily worse, until September I felt suicidal. I got help, went on Setraline and had 8 sessions of private counselling. By Christmas I felt happy and well again. I was, however, bored of my entry level job and was applying for higher positions. In March I got offered a new job and started on the 31st. Since then my anxiety has become crippling again. I asked for help and got my dose of Setraline raised. I hate the new job. My housemate got a new girlfriend and doesn&amp;#39;t want to live with me anymore come our tenancy expiring in June. Yesterday I tried to kill myself and he found me and got help. Today my boyfriend was with me when I was assessed and the doctor bought up the idea that polyamory means my life is constantly changing depending on my boyfriend&amp;#39;s very active love life. As I don&amp;#39;t deal well with change and have got worse since we&amp;#39;ve been together and have been having nightmares about being abandoned she&amp;#39;s probably right. We talked about it and despite being very in love both realise we probably need to break up. I&amp;#39;ve been off work all week, he took me to my parents today so he could go stay with friends and think. So I&amp;#39;ve probably lost my job, my boyfriend and my best friend/somewhere to live.  I have nothing left to live for. I have no goals, no ambitions, I don&amp;#39;t know what I want to do, I have no other really close friends as they all moved away after uni. I don&amp;#39;t want to go on. I feel like the second I&amp;#39;m left alone I&amp;#39;m going to try again to kill myself as I don&amp;#39;t have the strength to go through a break up, losing my job, all of that. I have the option to be admitted but is not going to solve anything. Currently nurse visiting me every day or calling. How do I find a reason to live?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have had low self esteem, anxiety and maybe depression since I was a kid who was horribly bullied. I coped fairly well through school and university because I had great friends around me and structure. I've never dealt well with change or lack of structure. I graduated summer 2012 and had an entry level job lined up. I had one 5 year relationship that ended 18 months ago after a lot of traumatic things happened but we are still close friends and live together. A year ago next Wednesday I met the most amazing man I've ever met. We had 5 dates in 10 days and fell madly in love. He was just coming out of a long term relationship where his ex suffered with crippling depression that had almost destroyed him. He is polyamorous. Logically, academically and morally I like the idea of polyamory so was happy to enter this relationship and explore polyamory myself. Over the course of our relationship my depression/anxiety got steadily worse, until September I felt suicidal. I got help, went on Setraline and had 8 sessions of private counselling. By Christmas I felt happy and well again. I was, however, bored of my entry level job and was applying for higher positions. In March I got offered a new job and started on the 31st. Since then my anxiety has become crippling again. I asked for help and got my dose of Setraline raised. I hate the new job. My housemate got a new girlfriend and doesn't want to live with me anymore come our tenancy expiring in June. Yesterday I tried to kill myself and he found me and got help. Today my boyfriend was with me when I was assessed and the doctor bought up the idea that polyamory means my life is constantly changing depending on my boyfriend's very active love life. As I don't deal well with change and have got worse since we've been together and have been having nightmares about being abandoned she's probably right. We talked about it and despite being very in love both realise we probably need to break up. I've been off work all week, he took me to my parents today so he could go stay with friends and think. So I've probably lost my job, my boyfriend and my best friend/somewhere to live.  I have nothing left to live for. I have no goals, no ambitions, I don't know what I want to do, I have no other really close friends as they all moved away after uni. I don't want to go on. I feel like the second I'm left alone I'm going to try again to kill myself as I don't have the strength to go through a break up, losing my job, all of that. I have the option to be admitted but is not going to solve anything. Currently nurse visiting me every day or calling. How do I find a reason to live?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23ym89", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BodieJaker", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23ym89/nothing_left_to_live_for/", "name": "t3_23ym89", "created": 1398471506.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23ym89/nothing_left_to_live_for/", "author_flair_text": null, "title": "Nothing left to live for", "created_utc": 1398442706.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1wit1", "gilded": 0, "author": "BodieJaker", "parent_id": "t1_ch1un7p", "approved_by": null, "body": "Thank you. But to do anything there has to be something I want to do. And I just have no motivation or will to do anything at all lately. Except sleep and be cuddled. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. But to do anything there has to be something I want to do. And I just have no motivation or will to do anything at all lately. Except sleep and be cuddled. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ym89", "score_hidden": false, "name": "t1_ch1wit1", "created": 1398452139.0, "author_flair_text": null, "created_utc": 1398448539.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1un7p", "gilded": 0, "author": "remington259", "parent_id": "t3_23ym89", "approved_by": null, "body": "There is *always* a reason to live. \n\nThe first think you need to understand is that your happiness and mental health come before ANYTHING else in life. So many people forget this while going through the journey that is life.\n\nI realize the whole world feels like it's crashing down around you. I've been there several times and it's incredibly rough. It does get better though if given time. Being human, we need to give ourselves time to heal when we suffer emotional blows. Not too long ago, I was let down terribly \n\nI can't speak on polyamorous relationships but I definitely can see how they could put a strain on things. Being someone who has trouble finding love, I know I'd want my significant other to only have eyes for me. Perhaps you need that more than you think you do.\n\nWe get one life (as far as we know). You should make the best of it even if that means uprooting your current way of life and trying something new. **There is never any harm in going down a different path** as long as it isn't one that leads to self-destructive tenancies be they physical or mental/emotional. \n\nSometimes, I feel trapped in my own life...but I know I'll find my way. You need to find your own way...and if that means getting the help you need and taking time away from the life society demands you live, so be it. As I said before, your happiness and mental health are more important. \n\nDon't be afraid to try new things. Meet new people. Share new experiences with them. Travel if you can or even just take up a new hobby. Personally, I find photography to be a great help. Always striving to be a bit better. Always trying to get that perfect shot. Anything really as long as it gets your mind away from the rest of life's pressures even if it's just for a few hours every day or couple of days.\n\nThere is always a reason to live my friend. Always. Life has too many paths to just stop walking.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is &lt;em&gt;always&lt;/em&gt; a reason to live. &lt;/p&gt;\n\n&lt;p&gt;The first think you need to understand is that your happiness and mental health come before ANYTHING else in life. So many people forget this while going through the journey that is life.&lt;/p&gt;\n\n&lt;p&gt;I realize the whole world feels like it&amp;#39;s crashing down around you. I&amp;#39;ve been there several times and it&amp;#39;s incredibly rough. It does get better though if given time. Being human, we need to give ourselves time to heal when we suffer emotional blows. Not too long ago, I was let down terribly &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t speak on polyamorous relationships but I definitely can see how they could put a strain on things. Being someone who has trouble finding love, I know I&amp;#39;d want my significant other to only have eyes for me. Perhaps you need that more than you think you do.&lt;/p&gt;\n\n&lt;p&gt;We get one life (as far as we know). You should make the best of it even if that means uprooting your current way of life and trying something new. &lt;strong&gt;There is never any harm in going down a different path&lt;/strong&gt; as long as it isn&amp;#39;t one that leads to self-destructive tenancies be they physical or mental/emotional. &lt;/p&gt;\n\n&lt;p&gt;Sometimes, I feel trapped in my own life...but I know I&amp;#39;ll find my way. You need to find your own way...and if that means getting the help you need and taking time away from the life society demands you live, so be it. As I said before, your happiness and mental health are more important. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to try new things. Meet new people. Share new experiences with them. Travel if you can or even just take up a new hobby. Personally, I find photography to be a great help. Always striving to be a bit better. Always trying to get that perfect shot. Anything really as long as it gets your mind away from the rest of life&amp;#39;s pressures even if it&amp;#39;s just for a few hours every day or couple of days.&lt;/p&gt;\n\n&lt;p&gt;There is always a reason to live my friend. Always. Life has too many paths to just stop walking.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ym89", "score_hidden": false, "name": "t1_ch1un7p", "created": 1398473689.0, "author_flair_text": null, "created_utc": 1398444889.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1wmjm", "gilded": 0, "author": "BodieJaker", "parent_id": "t1_ch1v63e", "approved_by": null, "body": "Where do I have to go to acquire this ice cream?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do I have to go to acquire this ice cream?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ym89", "score_hidden": false, "name": "t1_ch1wmjm", "created": 1398452343.0, "author_flair_text": null, "created_utc": 1398448743.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1v63e", "gilded": 0, "author": "YellowKazooie", "parent_id": "t3_23ym89", "approved_by": null, "body": "oh, come one, dude. Let's have an ice cream together. I'll pay", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh, come one, dude. Let&amp;#39;s have an ice cream together. I&amp;#39;ll pay&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23ym89", "score_hidden": false, "name": "t1_ch1v63e", "created": 1398449509.0, "author_flair_text": null, "created_utc": 1398445909.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]