[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t expect anyone to read or respond, but I&amp;#39;m so terribly alone and have no one else to talk to.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost everything here in my 20&amp;#39;s. My parasitic mother is dead of an overdose, my estranged father died right as we were reconnecting. I was raised by my grandparents and spent most of my childhood confused and scared of my grandfather, who died as I was entering college years ago. All is left is my grandmother, who never protected me as a child, and whom I am caretaking for part time now. &lt;/p&gt;\n\n&lt;p&gt;I only went to college because I was the 1st in my family to be able to do so, hated it. Moved on to grad school because it seemed like the thing to do, hate it. Now, because of my inability to control my mind and preoccupation with taking care of my grandmother, I will not be finishing my thesis on time and my university is telling me &amp;#39;they have to meet graduation quotas&amp;#39; and I can go fuck myself in my mountain of loan debt.&lt;/p&gt;\n\n&lt;p&gt;So here i am, 29, alone and profoundly miserable. There is no point to any of this, I&amp;#39;ve thought about &amp;#39;not being here&amp;#39; since 5th grade.... this isn&amp;#39;t going to change. I have had horrible things happen to me and made equally horrible decisions in the aftermath. &lt;/p&gt;\n\n&lt;p&gt;The only thing stopping me is the thought that my dog would be without a loving home and my grandmother would be devastated. And even that doesn&amp;#39;t help when I&amp;#39;m looking out over my balcony wondering if anything better comes next&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't expect anyone to read or respond, but I'm so terribly alone and have no one else to talk to.\n\nI've lost everything here in my 20's. My parasitic mother is dead of an overdose, my estranged father died right as we were reconnecting. I was raised by my grandparents and spent most of my childhood confused and scared of my grandfather, who died as I was entering college years ago. All is left is my grandmother, who never protected me as a child, and whom I am caretaking for part time now. \n\nI only went to college because I was the 1st in my family to be able to do so, hated it. Moved on to grad school because it seemed like the thing to do, hate it. Now, because of my inability to control my mind and preoccupation with taking care of my grandmother, I will not be finishing my thesis on time and my university is telling me 'they have to meet graduation quotas' and I can go fuck myself in my mountain of loan debt.\n\nSo here i am, 29, alone and profoundly miserable. There is no point to any of this, I've thought about 'not being here' since 5th grade.... this isn't going to change. I have had horrible things happen to me and made equally horrible decisions in the aftermath. \n\nThe only thing stopping me is the thought that my dog would be without a loving home and my grandmother would be devastated. And even that doesn't help when I'm looking out over my balcony wondering if anything better comes next", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24t6yb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "athrowawaylife0", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24t6yb/nothing_left/", "name": "t3_24t6yb", "created": 1399355184.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24t6yb/nothing_left/", "author_flair_text": null, "title": "Nothing left", "created_utc": 1399326384.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chagy49", "gilded": 0, "author": "tamsom", "parent_id": "t3_24t6yb", "approved_by": null, "body": "Reach out. I can't say anything that will magically make it all better, I know, but sometimes company can at least be a small comfort in this often bleak world.", "edited": 1399331326.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reach out. I can&amp;#39;t say anything that will magically make it all better, I know, but sometimes company can at least be a small comfort in this often bleak world.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24t6yb", "score_hidden": false, "name": "t1_chagy49", "created": 1399359725.0, "author_flair_text": null, "created_utc": 1399330925.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chah197", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t3_24t6yb", "approved_by": null, "body": "Hello there athrowawaylife0, my name's Josh (Or Friendly_Drunk, either works really), It's nice to talk to you :-)\n\nI'm so sorry to hear about all of these things. It sounds like you've had a tough time of life so far, and I am truly sorry for  that. Though it's nice to hear that you had the opportunity to reconnect with your dad, even if it was just for a little bit. Would you like to tell me some more about him? Or how you saw your mother as parasitic?\n\nYou sound like a incredibly caring person, especially that even though you feel that you're in this very dark place right now, the things on your mind aren't selfish, but of your dog and Grandma. They're both extremely lucky to have you in their lives :-)\n\nIt seems to me you have a really interesting story to tell: why you were being raised by your grandparents instead of your parents, what actually happened between you and your grandfather, your feelings regarding your mind and your experiences with college and grad school. I would love to listen to it if you're willing to share? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello there athrowawaylife0, my name&amp;#39;s Josh (Or Friendly_Drunk, either works really), It&amp;#39;s nice to talk to you :-)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so sorry to hear about all of these things. It sounds like you&amp;#39;ve had a tough time of life so far, and I am truly sorry for  that. Though it&amp;#39;s nice to hear that you had the opportunity to reconnect with your dad, even if it was just for a little bit. Would you like to tell me some more about him? Or how you saw your mother as parasitic?&lt;/p&gt;\n\n&lt;p&gt;You sound like a incredibly caring person, especially that even though you feel that you&amp;#39;re in this very dark place right now, the things on your mind aren&amp;#39;t selfish, but of your dog and Grandma. They&amp;#39;re both extremely lucky to have you in their lives :-)&lt;/p&gt;\n\n&lt;p&gt;It seems to me you have a really interesting story to tell: why you were being raised by your grandparents instead of your parents, what actually happened between you and your grandfather, your feelings regarding your mind and your experiences with college and grad school. I would love to listen to it if you&amp;#39;re willing to share? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24t6yb", "score_hidden": false, "name": "t1_chah197", "created": 1399334716.0, "author_flair_text": null, "created_utc": 1399331116.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]