[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My apartment was messy yesterday, and it was making me feel like shit, so I cleaned it. And I noticed that I didn&amp;#39;t necessarily feel good afterwards, just not shitty like before. I&amp;#39;m putting a lot of effort into trying to not feel depressed but I can barely make a dent into happiness. I&amp;#39;m just neutral after a day of working at being happy. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried therapy, tried meds. Now I work out and eat healthy, take vitamins. Do yoga, meditate. I read more, go out more with friends. And I still hate everything and I&amp;#39;m never actually happy. I&amp;#39;m anxious and stressed all day. And after all of this effort, sometimes I feel neutral. Not happy, not depressed, but mediocre. And it&amp;#39;s awful. I hate it. It feels like I&amp;#39;m pushing a rock up an endless mountain that will never reach happiness but it&amp;#39;s better than being at the bottom. I just feel at this point like it isn&amp;#39;t worth it. &lt;/p&gt;\n\n&lt;p&gt;The worst part is being scared all the time. I&amp;#39;m scared of feeling this way forever. And I can&amp;#39;t really see a solution other than suicide. The alternative is trying for the rest of my life to feel something I won&amp;#39;t feel. I just don&amp;#39;t want to actively participate in life anymore. It&amp;#39;s a disappointment. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My apartment was messy yesterday, and it was making me feel like shit, so I cleaned it. And I noticed that I didn't necessarily feel good afterwards, just not shitty like before. I'm putting a lot of effort into trying to not feel depressed but I can barely make a dent into happiness. I'm just neutral after a day of working at being happy. \n\nI've tried therapy, tried meds. Now I work out and eat healthy, take vitamins. Do yoga, meditate. I read more, go out more with friends. And I still hate everything and I'm never actually happy. I'm anxious and stressed all day. And after all of this effort, sometimes I feel neutral. Not happy, not depressed, but mediocre. And it's awful. I hate it. It feels like I'm pushing a rock up an endless mountain that will never reach happiness but it's better than being at the bottom. I just feel at this point like it isn't worth it. \n\nThe worst part is being scared all the time. I'm scared of feeling this way forever. And I can't really see a solution other than suicide. The alternative is trying for the rest of my life to feel something I won't feel. I just don't want to actively participate in life anymore. It's a disappointment. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "254zpg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "neutralgirl", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/254zpg/nothing_makes_me_happy_i_only_ever_feel_neutral/", "name": "t3_254zpg", "created": 1399681241.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/254zpg/nothing_makes_me_happy_i_only_ever_feel_neutral/", "author_flair_text": null, "title": "Nothing makes me happy, I only ever feel neutral or depressed.", "created_utc": 1399652441.0, "ups": 9, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdv1cd", "gilded": 0, "author": "May9ThrowAway", "parent_id": "t3_254zpg", "approved_by": null, "body": "I'm in a similar boat, and it's fucking tiring, repetitive, and depressing. It's total anhedonia (inability to experience pleasure). I've tried everything you listed as well: medication, yoga, exercise, good diet, etc. The kicker - the real kicker - is my sneaking suspicion that I'm not just perpetually \"depressed\" but I'm coming to a profoundly true realization of an existential nature: that life really isn't all bells and whistles. It's mostly a big pile of unfortunate shit. And when it's not that, it's just maintenance living. That is: sleeping, eating, washing, commuting, pooping, and on, and on, and on. 8 billion people living lives of completely fucking redundancy, subsisting on elaborate cultural myths that preserve some bizarre biological need to keep fucking and making more patterns of redundancy. What's it all for? The sitcoms at night. The traffic jams. The parents who love you despite all the mistakes. The bittersweet memories of love lost but not forgotten. The brief moments of bliss at meal time when dessert comes... etc. So yes, there are tiny glimpses of normalcy but to what end? I feel like I've done EVERYTHING THAT CAN BE DONE. My soul is older than a centenarian. I've seen other countries, taught people, sky-dived, bungie jumped, made love, took risks, smoked all the drugs, read tons of books, lived in the country, lived in the cities, seen all the sunrises and sunsets. It's like a bad movie on repeat. Now what? Oh yea, we die. There is no way out of this game. But you'll see there is an endless caste of characters trying to manipulate you into loving this weird game that all ends the same anyway. We all die. Whether you enjoy 80 years or DESPISE 80 years. Guess what? Yep. Same ending. Tell me when you find a magic bullet for happiness. I'm not encouraging suicide, don't get me wrong. To me, suicide seems just as pointless as living. So what to do? It's a surreal paradox. Hilarious, even, if it weren't so maddening. Hope this honesty helped.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in a similar boat, and it&amp;#39;s fucking tiring, repetitive, and depressing. It&amp;#39;s total anhedonia (inability to experience pleasure). I&amp;#39;ve tried everything you listed as well: medication, yoga, exercise, good diet, etc. The kicker - the real kicker - is my sneaking suspicion that I&amp;#39;m not just perpetually &amp;quot;depressed&amp;quot; but I&amp;#39;m coming to a profoundly true realization of an existential nature: that life really isn&amp;#39;t all bells and whistles. It&amp;#39;s mostly a big pile of unfortunate shit. And when it&amp;#39;s not that, it&amp;#39;s just maintenance living. That is: sleeping, eating, washing, commuting, pooping, and on, and on, and on. 8 billion people living lives of completely fucking redundancy, subsisting on elaborate cultural myths that preserve some bizarre biological need to keep fucking and making more patterns of redundancy. What&amp;#39;s it all for? The sitcoms at night. The traffic jams. The parents who love you despite all the mistakes. The bittersweet memories of love lost but not forgotten. The brief moments of bliss at meal time when dessert comes... etc. So yes, there are tiny glimpses of normalcy but to what end? I feel like I&amp;#39;ve done EVERYTHING THAT CAN BE DONE. My soul is older than a centenarian. I&amp;#39;ve seen other countries, taught people, sky-dived, bungie jumped, made love, took risks, smoked all the drugs, read tons of books, lived in the country, lived in the cities, seen all the sunrises and sunsets. It&amp;#39;s like a bad movie on repeat. Now what? Oh yea, we die. There is no way out of this game. But you&amp;#39;ll see there is an endless caste of characters trying to manipulate you into loving this weird game that all ends the same anyway. We all die. Whether you enjoy 80 years or DESPISE 80 years. Guess what? Yep. Same ending. Tell me when you find a magic bullet for happiness. I&amp;#39;m not encouraging suicide, don&amp;#39;t get me wrong. To me, suicide seems just as pointless as living. So what to do? It&amp;#39;s a surreal paradox. Hilarious, even, if it weren&amp;#39;t so maddening. Hope this honesty helped.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254zpg", "score_hidden": false, "name": "t1_chdv1cd", "created": 1399691217.0, "author_flair_text": null, "created_utc": 1399662417.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdqprc", "gilded": 0, "author": "HP_Housecat", "parent_id": "t3_254zpg", "approved_by": null, "body": "Honestly, I would and have had the same reaction to similar feelings in my own life. There are some differences, of course, and I can't say that all of those feelings are the same. Seeing no alternative to suicide when I'm in the depths of those feelings is absolutely how I react.\n\nI truly have no idea about how you can reach happiness and I'm sorry for that. I don't know if it's possible for you to participate in life less or if that is a healthy thing to do. I know that in my life, the shrinking of my world has had costs and benefits, some large on both accounts.\n\nIt is hard to say whether there is something out there for you. (I do tend to believe there is usually something we haven't thought of.) You've tried a lot of things, lots of things we're told we should try.\n\nI'm struggling to say what I mean to say. I think it's okay that you don't want to participate in life. Suicide is alluring because it appears to solve all problems. However, I do think there are alternatives with similar results, even if I can't point to exactly what they are for you. For me, part of it was a smaller life and a smaller involvement with the world (which had pluses and minuses). I can't tell you that it will make you happy or that anything can. I personally see happiness as an event that is possible but not a as a state of being. It's okay to be scared. Please keep reaching out to people.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I would and have had the same reaction to similar feelings in my own life. There are some differences, of course, and I can&amp;#39;t say that all of those feelings are the same. Seeing no alternative to suicide when I&amp;#39;m in the depths of those feelings is absolutely how I react.&lt;/p&gt;\n\n&lt;p&gt;I truly have no idea about how you can reach happiness and I&amp;#39;m sorry for that. I don&amp;#39;t know if it&amp;#39;s possible for you to participate in life less or if that is a healthy thing to do. I know that in my life, the shrinking of my world has had costs and benefits, some large on both accounts.&lt;/p&gt;\n\n&lt;p&gt;It is hard to say whether there is something out there for you. (I do tend to believe there is usually something we haven&amp;#39;t thought of.) You&amp;#39;ve tried a lot of things, lots of things we&amp;#39;re told we should try.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m struggling to say what I mean to say. I think it&amp;#39;s okay that you don&amp;#39;t want to participate in life. Suicide is alluring because it appears to solve all problems. However, I do think there are alternatives with similar results, even if I can&amp;#39;t point to exactly what they are for you. For me, part of it was a smaller life and a smaller involvement with the world (which had pluses and minuses). I can&amp;#39;t tell you that it will make you happy or that anything can. I personally see happiness as an event that is possible but not a as a state of being. It&amp;#39;s okay to be scared. Please keep reaching out to people.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254zpg", "score_hidden": false, "name": "t1_chdqprc", "created": 1399682274.0, "author_flair_text": null, "created_utc": 1399653474.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdyukl", "gilded": 0, "author": "lilsunnybee", "parent_id": "t3_254zpg", "approved_by": null, "body": "Sounds like you have some [anhedonia](http://en.wikipedia.org/wiki/Anhedonia), along with depression.  \n\nI don't know how you feel about medications but an antidepressant could really help. IANAD but specifically [an SNRI or NDRI](http://en.wikipedia.org/wiki/Types_of_antidepressants#Serotonin-norepinephrine_reuptake_inhibitors_.28SNRIs.29) could potentially really help, though see what your primary doctor or psychiatrist recommends first too.\n\nIt can take up to a month to see if the drug is doing anything positive for you, and if its not by that point you can just quit and try something else. If you felt your sense of humor picking up and started looking forward to more things that would be a positive indicator, while feeling like a zombie or even flatter would not (definitely wrong drug!)\n\nIt's just something to try that could really help, at least before catching the bus. But if there are other diet, health, exercise changes you'd like to make first you can do that too. Just don't give up too soon!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you have some &lt;a href=\"http://en.wikipedia.org/wiki/Anhedonia\"&gt;anhedonia&lt;/a&gt;, along with depression.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how you feel about medications but an antidepressant could really help. IANAD but specifically &lt;a href=\"http://en.wikipedia.org/wiki/Types_of_antidepressants#Serotonin-norepinephrine_reuptake_inhibitors_.28SNRIs.29\"&gt;an SNRI or NDRI&lt;/a&gt; could potentially really help, though see what your primary doctor or psychiatrist recommends first too.&lt;/p&gt;\n\n&lt;p&gt;It can take up to a month to see if the drug is doing anything positive for you, and if its not by that point you can just quit and try something else. If you felt your sense of humor picking up and started looking forward to more things that would be a positive indicator, while feeling like a zombie or even flatter would not (definitely wrong drug!)&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just something to try that could really help, at least before catching the bus. But if there are other diet, health, exercise changes you&amp;#39;d like to make first you can do that too. Just don&amp;#39;t give up too soon!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254zpg", "score_hidden": false, "name": "t1_chdyukl", "created": 1399699397.0, "author_flair_text": null, "created_utc": 1399670597.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdz9vs", "gilded": 0, "author": "sardonic_clam", "parent_id": "t3_254zpg", "approved_by": null, "body": "Hi are you on any medication that could be causing this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi are you on any medication that could be causing this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254zpg", "score_hidden": false, "name": "t1_chdz9vs", "created": 1399700390.0, "author_flair_text": null, "created_utc": 1399671590.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdtq31", "gilded": 0, "author": "meaurits", "parent_id": "t3_254zpg", "approved_by": null, "body": "I had a similar experience about four years ago. I was a teenager nearing adulthood and started noticing a dark veil over newer memories. Looking back at the fun I had years ago, my current fun and happiness seemed bleak and disappointing. Alot inside me was changing then, I lost some friends, made some new ones, my brother left and so on. I felt insecure about who I was. I became uncomfortable looking in the mirror accepting it was me.\nThen, when my brother visited us again, I talked with him about it and about how it was with him. He himself has alot of experience with drugs and told me of a moment when he was sitting some friends (he was sober while the friends were tripping; he was there to make sure they didn't do anything stupid) and he talked with them. Ofcourse they were hallucinating and alot of what they daid did not make sense but they did tell him to accept life the way it happens and accept the changes to the normal. The way he told me; even if you are down, your over all feeling will be natural, mediocre. Its the principle of mountains and valleys; when you are down, the moment thereafter is always higher. So I started noticing that my happiness did indeed not seem as glossy as the memories of my childhood happiness but overall I could accept that this meant happiness. Thats what I called it from that moment. When I was not depressed, I was happy. When I was slightly depressed, I was natural and when I was really down, it was going to clear up. Then my memories started to clear up also; my natural happiness became genuine happiness.\nI don't know it I'm still just mediocre/neutral but changed my perspective or I'm really out of an emotional valley but either way it's as real as I live it; I'm happy.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a similar experience about four years ago. I was a teenager nearing adulthood and started noticing a dark veil over newer memories. Looking back at the fun I had years ago, my current fun and happiness seemed bleak and disappointing. Alot inside me was changing then, I lost some friends, made some new ones, my brother left and so on. I felt insecure about who I was. I became uncomfortable looking in the mirror accepting it was me.\nThen, when my brother visited us again, I talked with him about it and about how it was with him. He himself has alot of experience with drugs and told me of a moment when he was sitting some friends (he was sober while the friends were tripping; he was there to make sure they didn&amp;#39;t do anything stupid) and he talked with them. Ofcourse they were hallucinating and alot of what they daid did not make sense but they did tell him to accept life the way it happens and accept the changes to the normal. The way he told me; even if you are down, your over all feeling will be natural, mediocre. Its the principle of mountains and valleys; when you are down, the moment thereafter is always higher. So I started noticing that my happiness did indeed not seem as glossy as the memories of my childhood happiness but overall I could accept that this meant happiness. Thats what I called it from that moment. When I was not depressed, I was happy. When I was slightly depressed, I was natural and when I was really down, it was going to clear up. Then my memories started to clear up also; my natural happiness became genuine happiness.\nI don&amp;#39;t know it I&amp;#39;m still just mediocre/neutral but changed my perspective or I&amp;#39;m really out of an emotional valley but either way it&amp;#39;s as real as I live it; I&amp;#39;m happy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_254zpg", "score_hidden": false, "name": "t1_chdtq31", "created": 1399688491.0, "author_flair_text": null, "created_utc": 1399659691.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]