[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a hobby.  I have a life, a place to live, a decent job.  Why is it that I can&amp;#39;t feel happiness?  I am the guy everyone I know thinks is the goof.  I joke around a lot.  Inside I am screaming &amp;quot;please help me&amp;quot;.  I like things in my life enough to live, sometimes.  Everything is so exhausting.  I wish I could just sleep all day every day.  Sadly, that isn&amp;#39;t something I can do.  I am incredibly anxiety ridden most of the day.  I have a co worker that wants to sell a shotgun.  I&amp;#39;ve been working a lot of overtime lately because it&amp;#39;s mandatory.  I think I&amp;#39;m about to buy the shotgun.  It&amp;#39;s a step in the direction of what my imagination is showing me.  I always think the way I&amp;#39;m going to do it is by putting the shotgun under my chin and pulling the trigger.  I think when I go to work Monday I&amp;#39;m going to have him get the shotgun on our break and I&amp;#39;m going to buy it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so frustrating.  I don&amp;#39;t want to feel this way.  After I type it I get angry I typed it.  I want to live.  But if I could just... sleep.  &lt;/p&gt;\n\n&lt;p&gt;No.  Why is it that I feel this way? Nothing in my life is bad.  I just don&amp;#39;t want to live it.  Can someone tell me what is wrong?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a hobby.  I have a life, a place to live, a decent job.  Why is it that I can't feel happiness?  I am the guy everyone I know thinks is the goof.  I joke around a lot.  Inside I am screaming \"please help me\".  I like things in my life enough to live, sometimes.  Everything is so exhausting.  I wish I could just sleep all day every day.  Sadly, that isn't something I can do.  I am incredibly anxiety ridden most of the day.  I have a co worker that wants to sell a shotgun.  I've been working a lot of overtime lately because it's mandatory.  I think I'm about to buy the shotgun.  It's a step in the direction of what my imagination is showing me.  I always think the way I'm going to do it is by putting the shotgun under my chin and pulling the trigger.  I think when I go to work Monday I'm going to have him get the shotgun on our break and I'm going to buy it.\n\nIt's so frustrating.  I don't want to feel this way.  After I type it I get angry I typed it.  I want to live.  But if I could just... sleep.  \n\nNo.  Why is it that I feel this way? Nothing in my life is bad.  I just don't want to live it.  Can someone tell me what is wrong?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256xof", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iamhappinessopposite", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/256xof/nothing_is_wrong_why_do_i_want_to_die/", "name": "t3_256xof", "created": 1399733136.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/256xof/nothing_is_wrong_why_do_i_want_to_die/", "author_flair_text": null, "title": "Nothing is wrong. Why do I want to die?", "created_utc": 1399704336.0, "ups": 8, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chebbi8", "gilded": 0, "author": "Goodship_Lollipop", "parent_id": "t3_256xof", "approved_by": null, "body": "I would first recommend getting a complete checkup, test thyroid, vitamin d, the usual \"blood panel\", testosterone level, and whatever else the dr. can think of that's related to your low energy, lack of joy, etc you mentioned. There's a good chance there's a medical reason at the root of your difficulty. Hold off on the shotgun purchase for a while. Do some investigating first. sounds like you've majorly got the burnout at work.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would first recommend getting a complete checkup, test thyroid, vitamin d, the usual &amp;quot;blood panel&amp;quot;, testosterone level, and whatever else the dr. can think of that&amp;#39;s related to your low energy, lack of joy, etc you mentioned. There&amp;#39;s a good chance there&amp;#39;s a medical reason at the root of your difficulty. Hold off on the shotgun purchase for a while. Do some investigating first. sounds like you&amp;#39;ve majorly got the burnout at work.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_chebbi8", "created": 1399736525.0, "author_flair_text": null, "created_utc": 1399707725.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chego61", "gilded": 0, "author": "reaching-out", "parent_id": "t3_256xof", "approved_by": null, "body": "You want to live, despite a preoccupation with suicide, which is a good basis to address these problems. \n\nIf you have clinical levels of anxiety or depression it does not matter how fabulous or efficient your everyday life is...it's an illness. Some people believe this is to do with brain chemistry, others believe it is to do with maladaptive cognitions. Whatever. Either way, if you fundamentally have an 'illness' you need to address that and use that as your basis for recovery and discovering how to enjoy your life. \n\nYou're driven to suicidal ideation because whatever thoughts or feelings going on internally do not make sense to you and are overwhelming. This is definitely something you could work on in a therapeutic setting. Have you ever sought professional help? You may even consider medication as an option. \n\nI sense you feel a lot of guilt and shame because you believe you should be 'happy' and 'satisfied' with what you have. Mental illnesses don't work like that, so ditch the shame and seek some help. As somebody who says they want to live you owe it to yourself. Seeking treatment could be that tiny piece of the puzzle that is preventing you from living your life to your full potential. \n\nP.S I obviously can't say if you do or don't have a condition, just with your descriptions of symptoms like anxiety, anhedonia, exhaustion, suicidal ideation and extreme guilt it's definitely worth investigating. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want to live, despite a preoccupation with suicide, which is a good basis to address these problems. &lt;/p&gt;\n\n&lt;p&gt;If you have clinical levels of anxiety or depression it does not matter how fabulous or efficient your everyday life is...it&amp;#39;s an illness. Some people believe this is to do with brain chemistry, others believe it is to do with maladaptive cognitions. Whatever. Either way, if you fundamentally have an &amp;#39;illness&amp;#39; you need to address that and use that as your basis for recovery and discovering how to enjoy your life. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re driven to suicidal ideation because whatever thoughts or feelings going on internally do not make sense to you and are overwhelming. This is definitely something you could work on in a therapeutic setting. Have you ever sought professional help? You may even consider medication as an option. &lt;/p&gt;\n\n&lt;p&gt;I sense you feel a lot of guilt and shame because you believe you should be &amp;#39;happy&amp;#39; and &amp;#39;satisfied&amp;#39; with what you have. Mental illnesses don&amp;#39;t work like that, so ditch the shame and seek some help. As somebody who says they want to live you owe it to yourself. Seeking treatment could be that tiny piece of the puzzle that is preventing you from living your life to your full potential. &lt;/p&gt;\n\n&lt;p&gt;P.S I obviously can&amp;#39;t say if you do or don&amp;#39;t have a condition, just with your descriptions of symptoms like anxiety, anhedonia, exhaustion, suicidal ideation and extreme guilt it&amp;#39;s definitely worth investigating. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_chego61", "created": 1399763547.0, "author_flair_text": null, "created_utc": 1399734747.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheeh7y", "gilded": 0, "author": "donzko", "parent_id": "t3_256xof", "approved_by": null, "body": "travel man, as cheap as you can for as long as you can. \ntravel alone, but follow your instincts and cherish the company you meet on your way.\nyou need to get some new input, you seem stuck in a circle that isnt helping you to further develop.\nim much like you, and I think you are probably an intelectual person with opinions on things. \nbut you need change, and dramatic is good. just keep some logic.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;travel man, as cheap as you can for as long as you can. \ntravel alone, but follow your instincts and cherish the company you meet on your way.\nyou need to get some new input, you seem stuck in a circle that isnt helping you to further develop.\nim much like you, and I think you are probably an intelectual person with opinions on things. \nbut you need change, and dramatic is good. just keep some logic.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_cheeh7y", "created": 1399755967.0, "author_flair_text": null, "created_utc": 1399727167.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chejj5o", "gilded": 0, "author": "ADeafBlindMute", "parent_id": "t3_256xof", "approved_by": null, "body": "I feel the EXACT same way. Want to talk? It helps pacify those feelings.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the EXACT same way. Want to talk? It helps pacify those feelings.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_chejj5o", "created": 1399771348.0, "author_flair_text": null, "created_utc": 1399742548.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chek8oc", "gilded": 0, "author": "Sir_Silly", "parent_id": "t3_256xof", "approved_by": null, "body": "Wow, it's like i could have written this. If you're up for a chat, PM me. Need to talk to someone who feels the same way :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, it&amp;#39;s like i could have written this. If you&amp;#39;re up for a chat, PM me. Need to talk to someone who feels the same way :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_chek8oc", "created": 1399773206.0, "author_flair_text": null, "created_utc": 1399744406.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chenon9", "gilded": 0, "author": "Black_Kitty", "parent_id": "t3_256xof", "approved_by": null, "body": "I know exactly how you feel. It's my day off and it's about 1330 hrs and I've done nothing. Absolutely nothing.  I think my husband worries about me because before he left for work he asked if I had any plans today. I don't even feel like getting out of bed let alone making plans. EVERYTHING is exhausting. I wish I could sleep forever. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly how you feel. It&amp;#39;s my day off and it&amp;#39;s about 1330 hrs and I&amp;#39;ve done nothing. Absolutely nothing.  I think my husband worries about me because before he left for work he asked if I had any plans today. I don&amp;#39;t even feel like getting out of bed let alone making plans. EVERYTHING is exhausting. I wish I could sleep forever. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_chenon9", "created": 1399782249.0, "author_flair_text": null, "created_utc": 1399753449.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "cheaxtl", "gilded": 0, "author": "ninosmr", "parent_id": "t3_256xof", "approved_by": null, "body": "Probably because you're working hard, or something isn't going the way you want it to go. It could be a small thing, a tiny little subconscious thing, but something is there that is stopping you from enjoying life. My advice? Take off a couple of days, explain your situation to your boss. In these days or week, do nothing but rest, maybe watch movies or play games if you're into that kind of stuff. I have a list of several games I can recommend based on any preference you have, as well as some TV shows and movies. Work can be monotonous and boring, it is important to take breaks every now and again. Take a few days off, and see if that doesn't help. If it doesn't, please post again or message me and we'll figure something out, I promise. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably because you&amp;#39;re working hard, or something isn&amp;#39;t going the way you want it to go. It could be a small thing, a tiny little subconscious thing, but something is there that is stopping you from enjoying life. My advice? Take off a couple of days, explain your situation to your boss. In these days or week, do nothing but rest, maybe watch movies or play games if you&amp;#39;re into that kind of stuff. I have a list of several games I can recommend based on any preference you have, as well as some TV shows and movies. Work can be monotonous and boring, it is important to take breaks every now and again. Take a few days off, and see if that doesn&amp;#39;t help. If it doesn&amp;#39;t, please post again or message me and we&amp;#39;ll figure something out, I promise. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256xof", "score_hidden": false, "name": "t1_cheaxtl", "created": 1399734471.0, "author_flair_text": null, "created_utc": 1399705671.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]