[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My life is a mess. I have only one friend, and even then we&amp;#39;re drifting apart. He&amp;#39;s totally devoted to sleeping and Boy Scouts and he&amp;#39;d rather go to a Scout thing than to my birthday. I&amp;#39;m really horrible at social interactions, and the only reason I got to know this guy was because we were in Cubs together and he was the only kid who didn&amp;#39;t ignore me.&lt;/p&gt;\n\n&lt;p&gt;My dad is always at work and rarely has any time for me, and my mother is extremely hard on me. She yells, she screams, she can&amp;#39;t take criticism, and whenever I talk back to defend myself, she breaks down crying and I can&amp;#39;t help but feel sorry for her as that&amp;#39;s just my nature. When my dad is home, he always sides with my mom on literally every issue. Even my fucking cat hates me.&lt;/p&gt;\n\n&lt;p&gt;School is an absolute nightmare. The students won&amp;#39;t shut up, the teachers are ineffectual at best and encouraging the bad behaviour at their worst, and the comparing the principal&amp;#39;s and guidance counselors&amp;#39; intelligence to a box of rocks would be insulting to said rocks. I won the provincial Reach For the Top competition recently, and that was probably the happiest I&amp;#39;ve been in about five years. However, nobody gave a fuck. There were no announcements over the school P.A., no tweets from school Twitter account, nothing. However, any time any sports team does anything, there are announcements and tweets and everything.&lt;/p&gt;\n\n&lt;p&gt;In my spare time, there are only two things I do: Reddit and Xbox. I don&amp;#39;t get any real enjoyment out of either of them. My main hobby used to be conlanging (creating languages) but I don&amp;#39;t even find that fun anymore. Nothing is fun. Nothing seems worthwhile. I feel like I would be better off dead than in this awful situation. I just need something or someone to give me a valid, logical reason why I shouldn&amp;#39;t just kill myself. All the help I&amp;#39;ve received so far has basically summed up to &amp;quot;YOLO&amp;quot; and that doesn&amp;#39;t help much.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My life is a mess. I have only one friend, and even then we're drifting apart. He's totally devoted to sleeping and Boy Scouts and he'd rather go to a Scout thing than to my birthday. I'm really horrible at social interactions, and the only reason I got to know this guy was because we were in Cubs together and he was the only kid who didn't ignore me.\n\nMy dad is always at work and rarely has any time for me, and my mother is extremely hard on me. She yells, she screams, she can't take criticism, and whenever I talk back to defend myself, she breaks down crying and I can't help but feel sorry for her as that's just my nature. When my dad is home, he always sides with my mom on literally every issue. Even my fucking cat hates me.\n\nSchool is an absolute nightmare. The students won't shut up, the teachers are ineffectual at best and encouraging the bad behaviour at their worst, and the comparing the principal's and guidance counselors' intelligence to a box of rocks would be insulting to said rocks. I won the provincial Reach For the Top competition recently, and that was probably the happiest I've been in about five years. However, nobody gave a fuck. There were no announcements over the school P.A., no tweets from school Twitter account, nothing. However, any time any sports team does anything, there are announcements and tweets and everything.\n\nIn my spare time, there are only two things I do: Reddit and Xbox. I don't get any real enjoyment out of either of them. My main hobby used to be conlanging (creating languages) but I don't even find that fun anymore. Nothing is fun. Nothing seems worthwhile. I feel like I would be better off dead than in this awful situation. I just need something or someone to give me a valid, logical reason why I shouldn't just kill myself. All the help I've received so far has basically summed up to \"YOLO\" and that doesn't help much.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24e7my", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ForgingIron", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24e7my/nothing_is_fun_or_entertaining_anymore/", "name": "t3_24e7my", "created": 1398916337.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24e7my/nothing_is_fun_or_entertaining_anymore/", "author_flair_text": null, "title": "Nothing is fun or entertaining anymore.", "created_utc": 1398887537.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6ag6q", "gilded": 0, "author": "ForgingIron", "parent_id": "t1_ch695sh", "approved_by": null, "body": "&gt;It gets better\n\nNever heard that one before... Besides, I used to think this when I was getting bullied back in fucking Grade 1. Did it get better? No. That phrase means absolutely nothing to me now. Sorry.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It gets better&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Never heard that one before... Besides, I used to think this when I was getting bullied back in fucking Grade 1. Did it get better? No. That phrase means absolutely nothing to me now. Sorry.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7my", "score_hidden": false, "name": "t1_ch6ag6q", "created": 1398919960.0, "author_flair_text": null, "created_utc": 1398891160.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch695sh", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24e7my", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24e7my", "score_hidden": false, "name": "t1_ch695sh", "created": 1398917474.0, "author_flair_text": null, "created_utc": 1398888674.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]