[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys. You know, nothing in life comes easy. Especially for some of us. I&amp;#39;ve been a weak person for as long as I can remember. Both mentally and physically. There&amp;#39;s a lot of self loathing going on. \nI&amp;#39;ve been working as a mechanic for 3 years. I recently got a job as a project coordinator at a turnkey engineering company. I&amp;#39;ve been working there for a month now. Nothing is going as planned. And I&amp;#39;ve got no one to turn to. I haven&amp;#39;t been happy in a while.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m given a chance to get another job. It&amp;#39;s less stressful and the pay is less. I tried talking to my father. But he thinks I should tough it out. It&amp;#39;s for my future he says. What future would I have if I work from morning to night all week. And carry this burden with me every living moment. I&amp;#39;m trying to tell him that this job is killing me. But he refuses to listen. I&amp;#39;m a disappointment. A weakling.&lt;/p&gt;\n\n&lt;p&gt;Sometimes I feel like just ending it all. \nI believe people will move on. And I&amp;#39;ll be nothing more than just some folklore. A boy who lived around stress. Finally killed himself. \nI might not even be news at all. \nAnyways. If I take the other job, I&amp;#39;ll have to move out. And have to manage my bills and everything with lower pay. It seems like I have no choice. I don&amp;#39;t know how much longer I can stand this. I just want some suspension. From all of this. A release. &lt;/p&gt;\n\n&lt;p&gt;Will I manage? I have no idea. Will I kill myself? Sooner or later. I&amp;#39;ve read if stories of people just killing themselves all of a sudden. I mean, there&amp;#39;s no actual time, or date set. They don&amp;#39;t arrange for it. It&amp;#39;s probably when the weight of the world has become too much to bear. And the realisation that the best solution is to end it all. &lt;/p&gt;\n\n&lt;p&gt;Yes this is about a job. But it&amp;#39;s more than that. I&amp;#39;m questioning everything; my character, my willpower, my future. \nI got caught up in the rat race. I wanted the title. The money. Now that I&amp;#39;m in it. Doesn&amp;#39;t seem worth much at all. It&amp;#39;s just deadlines. And stress. And physically requires me to work, stand in the sun. Think about projects all the time. I&amp;#39;m not cut out for this. Or maybe I&amp;#39;m just being a pussy. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the rant.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys. You know, nothing in life comes easy. Especially for some of us. I've been a weak person for as long as I can remember. Both mentally and physically. There's a lot of self loathing going on. \nI've been working as a mechanic for 3 years. I recently got a job as a project coordinator at a turnkey engineering company. I've been working there for a month now. Nothing is going as planned. And I've got no one to turn to. I haven't been happy in a while.\n\nI'm given a chance to get another job. It's less stressful and the pay is less. I tried talking to my father. But he thinks I should tough it out. It's for my future he says. What future would I have if I work from morning to night all week. And carry this burden with me every living moment. I'm trying to tell him that this job is killing me. But he refuses to listen. I'm a disappointment. A weakling.\n\nSometimes I feel like just ending it all. \nI believe people will move on. And I'll be nothing more than just some folklore. A boy who lived around stress. Finally killed himself. \nI might not even be news at all. \nAnyways. If I take the other job, I'll have to move out. And have to manage my bills and everything with lower pay. It seems like I have no choice. I don't know how much longer I can stand this. I just want some suspension. From all of this. A release. \n\nWill I manage? I have no idea. Will I kill myself? Sooner or later. I've read if stories of people just killing themselves all of a sudden. I mean, there's no actual time, or date set. They don't arrange for it. It's probably when the weight of the world has become too much to bear. And the realisation that the best solution is to end it all. \n\nYes this is about a job. But it's more than that. I'm questioning everything; my character, my willpower, my future. \nI got caught up in the rat race. I wanted the title. The money. Now that I'm in it. Doesn't seem worth much at all. It's just deadlines. And stress. And physically requires me to work, stand in the sun. Think about projects all the time. I'm not cut out for this. Or maybe I'm just being a pussy. \n\nSorry for the rant.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243c0f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "madsterhamster", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243c0f/nowhere_to_go/", "name": "t3_243c0f", "created": 1398614335.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243c0f/nowhere_to_go/", "author_flair_text": null, "title": "Nowhere to go", "created_utc": 1398585535.0, "ups": 4, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3fsj9", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t1_ch3e2mx", "approved_by": null, "body": "I guess you have some difficult choices to make. I'm really glad you are trying! I'm pretty damn proud of you and I don't even know you. Fighting suicidal thoughts is always hard. Just remember there will always be people to keep you afloat :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess you have some difficult choices to make. I&amp;#39;m really glad you are trying! I&amp;#39;m pretty damn proud of you and I don&amp;#39;t even know you. Fighting suicidal thoughts is always hard. Just remember there will always be people to keep you afloat :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch3fsj9", "created": 1398625444.0, "author_flair_text": null, "created_utc": 1398621844.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3e2mx", "gilded": 0, "author": "madsterhamster", "parent_id": "t1_ch388c3", "approved_by": null, "body": "i've just talked to a friend. He said if i ever decide to leave my current job he has one lined up for me. Although, that job is incredibly financially straining. It has lower pay and i have to find accomodation. i've decided to give my current job a couple of months before i decide. Yes it is taxing physically and mentally. and despite the fact that my parents deny that motion. i'll honor my promise to give it three months. if it doesnt work out. i'm going to find another way. life is hard. so hard. i'm sorry you are depressed. its funny how life is so much a one way road. it's always that life throws you into the ocean. and you have to learn how to swim. or you'll die. but god damnit, when you have people who are thrown in the ocean as well, you'll somehow manage, or not, still learn a couple of new tricks. thank you guys. i'll keep the suicide thoughts at bay. for now. it's an ongoing fight. and i've still got some fight in me. i'll give you some, the same way you've given me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;ve just talked to a friend. He said if i ever decide to leave my current job he has one lined up for me. Although, that job is incredibly financially straining. It has lower pay and i have to find accomodation. i&amp;#39;ve decided to give my current job a couple of months before i decide. Yes it is taxing physically and mentally. and despite the fact that my parents deny that motion. i&amp;#39;ll honor my promise to give it three months. if it doesnt work out. i&amp;#39;m going to find another way. life is hard. so hard. i&amp;#39;m sorry you are depressed. its funny how life is so much a one way road. it&amp;#39;s always that life throws you into the ocean. and you have to learn how to swim. or you&amp;#39;ll die. but god damnit, when you have people who are thrown in the ocean as well, you&amp;#39;ll somehow manage, or not, still learn a couple of new tricks. thank you guys. i&amp;#39;ll keep the suicide thoughts at bay. for now. it&amp;#39;s an ongoing fight. and i&amp;#39;ve still got some fight in me. i&amp;#39;ll give you some, the same way you&amp;#39;ve given me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch3e2mx", "created": 1398621435.0, "author_flair_text": null, "created_utc": 1398617835.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch388c3", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t1_ch381l2", "approved_by": null, "body": "Have you tried taking anti-depressants? It took my a long time to figure out what job I would enjoy doing. Now I know I would like to do something in IT, I just haven't had the motivation do try to get there. Depression really sucks. I can't even play games any more, I have hundreds and there are dozens I haven't even touched.\n\nCould you try getting a job that doesn't take so much out of you?\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried taking anti-depressants? It took my a long time to figure out what job I would enjoy doing. Now I know I would like to do something in IT, I just haven&amp;#39;t had the motivation do try to get there. Depression really sucks. I can&amp;#39;t even play games any more, I have hundreds and there are dozens I haven&amp;#39;t even touched.&lt;/p&gt;\n\n&lt;p&gt;Could you try getting a job that doesn&amp;#39;t take so much out of you?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch388c3", "created": 1398601681.0, "author_flair_text": null, "created_utc": 1398598081.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch381l2", "gilded": 0, "author": "madsterhamster", "parent_id": "t1_ch37z3v", "approved_by": null, "body": "It's weird how much this job takes out of me. I don't have much time to do the things I used to enjoy. I rarely play guitar, rarely paint. Whatever hours I do have I spend on thinking about how it's gonna end, and I have to work. At the same time I'm eager to get some work done because there's so much weight on it. A job I would love seems to be a very tough question. At this point there's not much I enjoy. Depression makes you no longer enjoy the things you used to enjoy. When I play video games, work comes to mind, I'd get anxiety. And just stop ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s weird how much this job takes out of me. I don&amp;#39;t have much time to do the things I used to enjoy. I rarely play guitar, rarely paint. Whatever hours I do have I spend on thinking about how it&amp;#39;s gonna end, and I have to work. At the same time I&amp;#39;m eager to get some work done because there&amp;#39;s so much weight on it. A job I would love seems to be a very tough question. At this point there&amp;#39;s not much I enjoy. Depression makes you no longer enjoy the things you used to enjoy. When I play video games, work comes to mind, I&amp;#39;d get anxiety. And just stop &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch381l2", "created": 1398600416.0, "author_flair_text": null, "created_utc": 1398596816.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch37z3v", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t3_243c0f", "approved_by": null, "body": "I think you should tell your father how you feel, maybe try showing him this. If it's easier for you, tell him in writing. That's how I told my mum about my depression and it fixed a lot of problems.\n\nI don't really know what to tell you in regards to a job, since I don't even have a job at the moment. I think you should just try to get a job doing what you enjoy. But I know that would be pretty difficult. What do you enjoy doing?\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should tell your father how you feel, maybe try showing him this. If it&amp;#39;s easier for you, tell him in writing. That&amp;#39;s how I told my mum about my depression and it fixed a lot of problems.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really know what to tell you in regards to a job, since I don&amp;#39;t even have a job at the moment. I think you should just try to get a job doing what you enjoy. But I know that would be pretty difficult. What do you enjoy doing?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch37z3v", "created": 1398599931.0, "author_flair_text": null, "created_utc": 1398596331.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38577", "gilded": 0, "author": "[deleted]", "parent_id": "t3_243c0f", "approved_by": null, "body": "You're not a weak person. I don't know you, but from what I just read I think you've stuck through a lot of things which has required strength from you. I just think you need to think to appreciate your good qualities more, like your obvious patience. \nI don't want you to end it all. And I honestly mean that, I don't. You may not believe it, but I really don't want that to happen. I don't think anyone would want you to do that, even if you believe it yourself. Again, give yourself a break :)\nI don't know what you're going through, but it does seem a lot to handle for one person. I'm glad you came here to talk it out. Maybe you do need a release, but not that kind of release. Death isn't a release, it's an abrupt end and thats not what you need.\nYou're not a pussy. If you don't like your character, I'm sure other people do. If you really don't like yourself, work on liking yourself. Think of all the times you've made someone happy and you've made someone laugh. Don't think of how you've annoyed people or made them angry. It will be easier to do that, it's easier for anyone to think negatively about themselves, but don't. \nDon't be sorry. I need to talk to people sometimes, too. So thankyou for that. ", "edited": 1398597846.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not a weak person. I don&amp;#39;t know you, but from what I just read I think you&amp;#39;ve stuck through a lot of things which has required strength from you. I just think you need to think to appreciate your good qualities more, like your obvious patience. \nI don&amp;#39;t want you to end it all. And I honestly mean that, I don&amp;#39;t. You may not believe it, but I really don&amp;#39;t want that to happen. I don&amp;#39;t think anyone would want you to do that, even if you believe it yourself. Again, give yourself a break :)\nI don&amp;#39;t know what you&amp;#39;re going through, but it does seem a lot to handle for one person. I&amp;#39;m glad you came here to talk it out. Maybe you do need a release, but not that kind of release. Death isn&amp;#39;t a release, it&amp;#39;s an abrupt end and thats not what you need.\nYou&amp;#39;re not a pussy. If you don&amp;#39;t like your character, I&amp;#39;m sure other people do. If you really don&amp;#39;t like yourself, work on liking yourself. Think of all the times you&amp;#39;ve made someone happy and you&amp;#39;ve made someone laugh. Don&amp;#39;t think of how you&amp;#39;ve annoyed people or made them angry. It will be easier to do that, it&amp;#39;s easier for anyone to think negatively about themselves, but don&amp;#39;t. \nDon&amp;#39;t be sorry. I need to talk to people sometimes, too. So thankyou for that. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243c0f", "score_hidden": false, "name": "t1_ch38577", "created": 1398601108.0, "author_flair_text": null, "created_utc": 1398597508.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]