[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to do. I feel empty, I feel numb, I feel unmotivated and utterly depressed. I&amp;#39;ve been depressed for ages, but I can deal with that.&lt;/p&gt;\n\n&lt;p&gt;My girlfriend of 6 years broke up with me yesterday, however. She was the only thing that made everything worthwhile. She was the only thing that made me want to be a better person. In the end, it turns out I meant barely a thing to her, and she&amp;#39;s in love with somebody else. I was just a consolation prize when he rejected her.&lt;/p&gt;\n\n&lt;p&gt;I posted about this in 3 different subreddits in the past hour (or 2?), just looking for advice, or anything to help me. I realised now that no words can help me, though. I have nobody to turn to, no friends who care enough to listen.&lt;/p&gt;\n\n&lt;p&gt;My apartment isn&amp;#39;t on the ground floor. I don&amp;#39;t want to die, but when you lose your reason to live there&amp;#39;s not much else to do. I&amp;#39;m panicked. I am quite literally &lt;em&gt;sick&lt;/em&gt; to my stomach. I have no appetite. I honestly thought that people exaggerate these feelings, but now I know what true emptiness feels like. The depression I&amp;#39;ve been struggling with for years seem so small next to what I feel right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know what to do. I feel empty, I feel numb, I feel unmotivated and utterly depressed. I've been depressed for ages, but I can deal with that.\n\nMy girlfriend of 6 years broke up with me yesterday, however. She was the only thing that made everything worthwhile. She was the only thing that made me want to be a better person. In the end, it turns out I meant barely a thing to her, and she's in love with somebody else. I was just a consolation prize when he rejected her.\n\nI posted about this in 3 different subreddits in the past hour (or 2?), just looking for advice, or anything to help me. I realised now that no words can help me, though. I have nobody to turn to, no friends who care enough to listen.\n\nMy apartment isn't on the ground floor. I don't want to die, but when you lose your reason to live there's not much else to do. I'm panicked. I am quite literally *sick* to my stomach. I have no appetite. I honestly thought that people exaggerate these feelings, but now I know what true emptiness feels like. The depression I've been struggling with for years seem so small next to what I feel right now.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "255tvz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway546534", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/255tvz/numb/", "name": "t3_255tvz", "created": 1399700126.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/255tvz/numb/", "author_flair_text": null, "title": "Numb", "created_utc": 1399671326.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "che1iu7", "gilded": 0, "author": "Lemmus", "parent_id": "t3_255tvz", "approved_by": null, "body": "I know what you're going through buddy, I've been down the road of emptiness and lack of motivation and I've contemplated ending it. However, there's always a reason to keep going. Always a reason to keep fighting. A reason to keep living. You only need to find it.\n\nDo you have something you're good at or have a hobby you enjoy? If you don't, there is something out there for you and it is never too late. It doesn't matter if it's art, poetry, games, sports, building something, helping others in need, or whatever you fancy. You can do something, and make an impression on others for doing it.\n\nYour life matters. You are a living, breathing individual with a combination of skills and thoughts unique to you. And you can make a difference and create value in this world.\n\nYou say that you have no friends who care enough to listen, but if you talk to them about your issues you may be surprised. If they don't surprise you, it's time to find some new friends. While I know this can be hard to do as an adult, you need to try. Friends and the community around us are vital to our mental health. Go outside and do something. Find a community centre, a social club, somewhere to volunteer, to a place with people who share your hobbies. Expand the places you frequent and be open-minded with the people you meet.\n\nYou say yourself that you don't want to die. And therefore you shouldn't. You may not see a reason to live right now, but I promise you it's out there. If you need someone to turn to right away and you feel that you have nobody to listen, then vent your thoughts here. You've already taken a big step with making this post.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you&amp;#39;re going through buddy, I&amp;#39;ve been down the road of emptiness and lack of motivation and I&amp;#39;ve contemplated ending it. However, there&amp;#39;s always a reason to keep going. Always a reason to keep fighting. A reason to keep living. You only need to find it.&lt;/p&gt;\n\n&lt;p&gt;Do you have something you&amp;#39;re good at or have a hobby you enjoy? If you don&amp;#39;t, there is something out there for you and it is never too late. It doesn&amp;#39;t matter if it&amp;#39;s art, poetry, games, sports, building something, helping others in need, or whatever you fancy. You can do something, and make an impression on others for doing it.&lt;/p&gt;\n\n&lt;p&gt;Your life matters. You are a living, breathing individual with a combination of skills and thoughts unique to you. And you can make a difference and create value in this world.&lt;/p&gt;\n\n&lt;p&gt;You say that you have no friends who care enough to listen, but if you talk to them about your issues you may be surprised. If they don&amp;#39;t surprise you, it&amp;#39;s time to find some new friends. While I know this can be hard to do as an adult, you need to try. Friends and the community around us are vital to our mental health. Go outside and do something. Find a community centre, a social club, somewhere to volunteer, to a place with people who share your hobbies. Expand the places you frequent and be open-minded with the people you meet.&lt;/p&gt;\n\n&lt;p&gt;You say yourself that you don&amp;#39;t want to die. And therefore you shouldn&amp;#39;t. You may not see a reason to live right now, but I promise you it&amp;#39;s out there. If you need someone to turn to right away and you feel that you have nobody to listen, then vent your thoughts here. You&amp;#39;ve already taken a big step with making this post.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_255tvz", "score_hidden": false, "name": "t1_che1iu7", "created": 1399705884.0, "author_flair_text": null, "created_utc": 1399677084.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]