[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had my whole life turned upside down in the past few months.&lt;/p&gt;\n\n&lt;p&gt;I lost the love of my life for dumb reasons,  the most vivid and special love I have ever known. She&amp;#39;s gone and she&amp;#39;s not coming back.&lt;/p&gt;\n\n&lt;p&gt;I walked away from the perfect job for a raise and a better title. And because of misinformation about my job being in trouble. I am now at risk of losing this job because of my depression about the whole situation. The company has zero culture, no prestige, no redeeming qualities.  The work is bullshit non technical work meant for a monkey. Yet I am a developer. I was so shortsighted when I came in for the interviews and &lt;/p&gt;\n\n&lt;p&gt;I was once a clear thinking healthy guy and now I&amp;#39;m on antidepressants.  &lt;/p&gt;\n\n&lt;p&gt;I might have to move back home soon (I&amp;#39;m 26) and might lose my job if I do even the slightest thing wrong.&lt;/p&gt;\n\n&lt;p&gt;I made the wrong move and it haunts me every fucking day. It absolutely fucking burns more than anything could ever burn.&lt;/p&gt;\n\n&lt;p&gt;I know my family would be devastated but I feel like a fucking failure.  Depression has set in and I can barely get out of bed, focus, or enjoy much of anything.  I can&amp;#39;t get my old job back. I can&amp;#39;t get my lady back.&lt;/p&gt;\n\n&lt;p&gt;I am stuck. I&amp;#39;m fucking stuck. All of the goodness and answers are in the rear view mirror now.&lt;/p&gt;\n\n&lt;p&gt;Fuck making more money. Fuck misinformation. It led me to this hell. My career and life hang in the balance.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d truly love to die. If I can&amp;#39;t rewind to September 2013, I&amp;#39;d like to die. It&amp;#39;s that simple.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had my whole life turned upside down in the past few months.\n\nI lost the love of my life for dumb reasons,  the most vivid and special love I have ever known. She's gone and she's not coming back.\n\nI walked away from the perfect job for a raise and a better title. And because of misinformation about my job being in trouble. I am now at risk of losing this job because of my depression about the whole situation. The company has zero culture, no prestige, no redeeming qualities.  The work is bullshit non technical work meant for a monkey. Yet I am a developer. I was so shortsighted when I came in for the interviews and \n\nI was once a clear thinking healthy guy and now I'm on antidepressants.  \n\nI might have to move back home soon (I'm 26) and might lose my job if I do even the slightest thing wrong.\n\nI made the wrong move and it haunts me every fucking day. It absolutely fucking burns more than anything could ever burn.\n\nI know my family would be devastated but I feel like a fucking failure.  Depression has set in and I can barely get out of bed, focus, or enjoy much of anything.  I can't get my old job back. I can't get my lady back.\n\nI am stuck. I'm fucking stuck. All of the goodness and answers are in the rear view mirror now.\n\nFuck making more money. Fuck misinformation. It led me to this hell. My career and life hang in the balance.\n\nI'd truly love to die. If I can't rewind to September 2013, I'd like to die. It's that simple.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24eg35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cavingin25", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24eg35/planning_on_dying_soon/", "name": "t3_24eg35", "created": 1398921246.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24eg35/planning_on_dying_soon/", "author_flair_text": null, "title": "Planning on dying soon", "created_utc": 1398892446.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6cnoc", "gilded": 0, "author": "AbdiEkmekJones", "parent_id": "t3_24eg35", "approved_by": null, "body": "You seem like a reasonable guy. To my understanding you are full aware of the situation, although the situation might be bad. You say that you earn extra money from this new job you got. Is there enough for a vacation or some kind of trip? I think that a little time, without stress and being able to relax and have your own space would be good place to start. What you need to do right now, is to be sure of what direction your life takes. Life does not rewind but the future is yet to be written. Now that you are in this, you can learn from it and in the future you won't make the same mistakes. I'm sure of it. As I said you seem like a reasonable guy. I believe that time heals all wounds. Even the ones that go far deeper that you could ever imagine. All I have written is advice you shouldn't nececearly take literally. I'm no psycholygist, but I've had my fair share of helping people like yourself. Hope I was any help. Feel free to message me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem like a reasonable guy. To my understanding you are full aware of the situation, although the situation might be bad. You say that you earn extra money from this new job you got. Is there enough for a vacation or some kind of trip? I think that a little time, without stress and being able to relax and have your own space would be good place to start. What you need to do right now, is to be sure of what direction your life takes. Life does not rewind but the future is yet to be written. Now that you are in this, you can learn from it and in the future you won&amp;#39;t make the same mistakes. I&amp;#39;m sure of it. As I said you seem like a reasonable guy. I believe that time heals all wounds. Even the ones that go far deeper that you could ever imagine. All I have written is advice you shouldn&amp;#39;t nececearly take literally. I&amp;#39;m no psycholygist, but I&amp;#39;ve had my fair share of helping people like yourself. Hope I was any help. Feel free to message me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24eg35", "score_hidden": false, "name": "t1_ch6cnoc", "created": 1398899300.0, "author_flair_text": null, "created_utc": 1398895700.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]