[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When people say, suicide is a permanent fix to a temporary problem, in some instances, that may be true, but mine, I do not feel like that anymore.   I have been suffering from major depression, anxiety, PTSD (from my abusive ex husband that has my daughter that I&amp;#39;ve haven&amp;#39;t seen since for 10 years.&lt;br/&gt;\n It&amp;#39;s Mother&amp;#39;s Day today and her birthday is in May.  I was planning on committing this week, but I have family coming to visit.  I have had past attempts and been in the hospital for attempts in the past, and all they do is pump me full of more meds then I am embarrassed to return to work.&lt;br/&gt;\nYes I am on medication right now and have been in therapy.  I don&amp;#39;t know why I am posting here because I have a few plans.  The only thing is that I don&amp;#39;t know the exact time, place, or method.  I have been planning this for a few months.  Actually, over the years.  The plan and ideas get deeper and deeper.&lt;br/&gt;\nSo, I don&amp;#39;t know what else to say.   I feel like a shell in my body.  I am sick of acting happy when I am around people and am working.   I make up plans of what I have done on my time off.   I can&amp;#39;t tell them I don&amp;#39;t get out of bed my whole 3 days off from work.  &lt;/p&gt;\n\n&lt;p&gt;Thanks for listening.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "When people say, suicide is a permanent fix to a temporary problem, in some instances, that may be true, but mine, I do not feel like that anymore.   I have been suffering from major depression, anxiety, PTSD (from my abusive ex husband that has my daughter that I've haven't seen since for 10 years.  \n It's Mother's Day today and her birthday is in May.  I was planning on committing this week, but I have family coming to visit.  I have had past attempts and been in the hospital for attempts in the past, and all they do is pump me full of more meds then I am embarrassed to return to work.     \nYes I am on medication right now and have been in therapy.  I don't know why I am posting here because I have a few plans.  The only thing is that I don't know the exact time, place, or method.  I have been planning this for a few months.  Actually, over the years.  The plan and ideas get deeper and deeper.  \nSo, I don't know what else to say.   I feel like a shell in my body.  I am sick of acting happy when I am around people and am working.   I make up plans of what I have done on my time off.   I can't tell them I don't get out of bed my whole 3 days off from work.  \n\nThanks for listening.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25b82m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Sodonewithlife78", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25b82m/planning_this_for_awhile_im_just_done/", "name": "t3_25b82m", "created": 1399875575.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25b82m/planning_this_for_awhile_im_just_done/", "author_flair_text": null, "title": "Planning this for awhile... I'm just done", "created_utc": 1399846775.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chg1hmi", "gilded": 0, "author": "twinsfan68", "parent_id": "t1_chfuwd5", "approved_by": null, "body": "No problem, I'm always here to listen. I really hope your doctor finds you a good med combo and that you are able to find a therapist that you can trust. Let me know if you need anything else as your journey continues! Best of luck!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem, I&amp;#39;m always here to listen. I really hope your doctor finds you a good med combo and that you are able to find a therapist that you can trust. Let me know if you need anything else as your journey continues! Best of luck!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b82m", "score_hidden": false, "name": "t1_chg1hmi", "created": 1399941130.0, "author_flair_text": null, "created_utc": 1399912330.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfuwd5", "gilded": 0, "author": "Sodonewithlife78", "parent_id": "t1_chfhmfx", "approved_by": null, "body": "I have been seeing a really good psychiatrist that I feel like I cam really trust for the past 6 months.   I actually stopped seeing him for about 3 months and seeing someone closer to my house for a few months, huge mistake.   He welcomed me back like I never left.   I like him because I don't feel like a  number to him.  He knows my name and asks how things are going, not just about the medication.   I saw him a month ago and it really stinks because I have been on so many medication before.  He tells me to be patient and we will find the right combo.  So, as of now, we found an antidepressant that helps enough to get me to work full time without being catatonic.  I'm not a fan of the ad ons because they give me zombie effects. He just changed my daily anxiety med, and ordered my other prn to be taken daily as needed, plus as a 4times daily dose, which won't work because I work full time. \nI was seeing the same therapist until last month and she got a job working in a school. I was able to really open up to her without feeling judgement and she referred me to another therapist in her practice.  When I sat done and looked and thought about it, I wasn't sure if I would be able to talk with the new one and not get hostipalized, which doesn't help me.  I wish my insurance would cover intensive programming or  day treatment, but it does not.  Plus, I need to work full time.  I have child support I pay twice monthly and other bills to pay on meager wages.  Thanks for reading!!  \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been seeing a really good psychiatrist that I feel like I cam really trust for the past 6 months.   I actually stopped seeing him for about 3 months and seeing someone closer to my house for a few months, huge mistake.   He welcomed me back like I never left.   I like him because I don&amp;#39;t feel like a  number to him.  He knows my name and asks how things are going, not just about the medication.   I saw him a month ago and it really stinks because I have been on so many medication before.  He tells me to be patient and we will find the right combo.  So, as of now, we found an antidepressant that helps enough to get me to work full time without being catatonic.  I&amp;#39;m not a fan of the ad ons because they give me zombie effects. He just changed my daily anxiety med, and ordered my other prn to be taken daily as needed, plus as a 4times daily dose, which won&amp;#39;t work because I work full time. \nI was seeing the same therapist until last month and she got a job working in a school. I was able to really open up to her without feeling judgement and she referred me to another therapist in her practice.  When I sat done and looked and thought about it, I wasn&amp;#39;t sure if I would be able to talk with the new one and not get hostipalized, which doesn&amp;#39;t help me.  I wish my insurance would cover intensive programming or  day treatment, but it does not.  Plus, I need to work full time.  I have child support I pay twice monthly and other bills to pay on meager wages.  Thanks for reading!!  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b82m", "score_hidden": false, "name": "t1_chfuwd5", "created": 1399922193.0, "author_flair_text": null, "created_utc": 1399893393.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfhmfx", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_25b82m", "approved_by": null, "body": "I'm so sorry you're in such a dark place, it sounds like absolute hell. I don't know what else to say to you since you have already tried meds and therapy to no avail. When was the last time you tried therapy and/or a new medication? Perhaps give them both another real shot before doing anything rash. There are specialized ways of dealing specifically with PTSD and severe depression, and if your insurance will allow it, maybe try some more intensive inpatient or day program therapy. \n\nI know how this feels - when I was dealing with depression and suicidal ideation, I felt like some puppet on a string when I dealt with people. Just putting up a front of happiness to assure them that everything was okay when inside I was screaming. I did enter into residential treatment for my issues and slowly but surely I recovered. I'm now on medication and still talk to a therapist, even though my life has improved 100X over since leaving res treatment. I keep myself honest with how I am feeling - I hope you can do the same.\n\nIf you need anyone to talk to, feel free to PM me, or just keep reaching out to us here.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you&amp;#39;re in such a dark place, it sounds like absolute hell. I don&amp;#39;t know what else to say to you since you have already tried meds and therapy to no avail. When was the last time you tried therapy and/or a new medication? Perhaps give them both another real shot before doing anything rash. There are specialized ways of dealing specifically with PTSD and severe depression, and if your insurance will allow it, maybe try some more intensive inpatient or day program therapy. &lt;/p&gt;\n\n&lt;p&gt;I know how this feels - when I was dealing with depression and suicidal ideation, I felt like some puppet on a string when I dealt with people. Just putting up a front of happiness to assure them that everything was okay when inside I was screaming. I did enter into residential treatment for my issues and slowly but surely I recovered. I&amp;#39;m now on medication and still talk to a therapist, even though my life has improved 100X over since leaving res treatment. I keep myself honest with how I am feeling - I hope you can do the same.&lt;/p&gt;\n\n&lt;p&gt;If you need anyone to talk to, feel free to PM me, or just keep reaching out to us here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25b82m", "score_hidden": false, "name": "t1_chfhmfx", "created": 1399877537.0, "author_flair_text": null, "created_utc": 1399848737.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]