[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL;DR Please help me find the courage to kill myself NOW. I have tried EVERYTHING to get better and to start my life over, but I&amp;#39;ve wanted to die for 2 years. I can&amp;#39;t take it any longer. I cannot even come close to describing how bad it is. I even bought a gun that is now loaded with a hollow point. I just need the courage to pull the trigger.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t go into my compete back story. If you want, you can read it in r/depression. To sum it up, I have been severely depressed for most of the past 25 years. I&amp;#39;m now 47. My wife left me 2 years ago because of my depression. I&amp;#39;ve lost everything, even my dogs. I can&amp;#39;t find a job--ANY job, much less one that would allow me to live independently again. I&amp;#39;m living with my mom, at 47 for christ&amp;#39;s sake. It&amp;#39;s fucking embarrassing and unbearable. No friends to talk to, except one a few hours away who&amp;#39;s already burned out trying to help. I&amp;#39;ve tried every treatment for my depression, including ECT and a month-long 6-hour-per-day outpatient program with CBT, coping skills, mindfulness, etc. I try all the suggestions: get exercise, practice mindfulness, get a hobby. Nothing works. I can barely get the fuck off my mattress on the floor. I&amp;#39;m having a panic attack right now. Was just turned down for yet another job. There is no hope. NOTHING AT ALL in my life is worth living for. All I want is to die, but I can&amp;#39;t find a way that I have the courage to complete. I tried hanging myself but couldn&amp;#39;t find the balls to step off the ladder. I tried lighting a bucket of charcoal, letting it burn down for a bit, then putting it in my car so I die of CO poisoning. Couldn&amp;#39;t handle the fumes. I&amp;#39;ve tried to work up the courage to jump off a really high bridge near me, but I&amp;#39;m afraid of heights and can&amp;#39;t find the balls to climb over the rail and let go. For christ&amp;#39;s sake, why can&amp;#39;t I do that? If my goal is to die, why the fuck can&amp;#39;t I do it? So I bought a gun and some high velocity hollow point bullets. The gun is right next to me, and I could be dead in 5 seconds. Why the fuck can&amp;#39;t I do it? Part of me is afraid I&amp;#39;ll fuck it up. Hurting family isn&amp;#39;t really a factor because none of them give a fuck about me. Seriously. It&amp;#39;d hurt my one friend, who&amp;#39;s father shot himself in the head when my friend was young. But I&amp;#39;ve told him that I bought a gun, and he says that he doesn&amp;#39;t want me to do it but understands if that&amp;#39;s what I feel I have to do.&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t a cry for help. I honestly just want the courage to pull the fucking trigger. I can&amp;#39;t suffer any longer. There is truly no hope. I don&amp;#39;t fucking want to hear one more person say &amp;quot;Just hang on. It&amp;#39;ll get better.&amp;quot; No, it won&amp;#39;t; it hasn&amp;#39;t for 2 years, and it isn&amp;#39;t just going to magically fucking get better. I JUST WANT TO DIE.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TL;DR Please help me find the courage to kill myself NOW. I have tried EVERYTHING to get better and to start my life over, but I've wanted to die for 2 years. I can't take it any longer. I cannot even come close to describing how bad it is. I even bought a gun that is now loaded with a hollow point. I just need the courage to pull the trigger.\n\nI won't go into my compete back story. If you want, you can read it in r/depression. To sum it up, I have been severely depressed for most of the past 25 years. I'm now 47. My wife left me 2 years ago because of my depression. I've lost everything, even my dogs. I can't find a job--ANY job, much less one that would allow me to live independently again. I'm living with my mom, at 47 for christ's sake. It's fucking embarrassing and unbearable. No friends to talk to, except one a few hours away who's already burned out trying to help. I've tried every treatment for my depression, including ECT and a month-long 6-hour-per-day outpatient program with CBT, coping skills, mindfulness, etc. I try all the suggestions: get exercise, practice mindfulness, get a hobby. Nothing works. I can barely get the fuck off my mattress on the floor. I'm having a panic attack right now. Was just turned down for yet another job. There is no hope. NOTHING AT ALL in my life is worth living for. All I want is to die, but I can't find a way that I have the courage to complete. I tried hanging myself but couldn't find the balls to step off the ladder. I tried lighting a bucket of charcoal, letting it burn down for a bit, then putting it in my car so I die of CO poisoning. Couldn't handle the fumes. I've tried to work up the courage to jump off a really high bridge near me, but I'm afraid of heights and can't find the balls to climb over the rail and let go. For christ's sake, why can't I do that? If my goal is to die, why the fuck can't I do it? So I bought a gun and some high velocity hollow point bullets. The gun is right next to me, and I could be dead in 5 seconds. Why the fuck can't I do it? Part of me is afraid I'll fuck it up. Hurting family isn't really a factor because none of them give a fuck about me. Seriously. It'd hurt my one friend, who's father shot himself in the head when my friend was young. But I've told him that I bought a gun, and he says that he doesn't want me to do it but understands if that's what I feel I have to do.\n\nThis isn't a cry for help. I honestly just want the courage to pull the fucking trigger. I can't suffer any longer. There is truly no hope. I don't fucking want to hear one more person say \"Just hang on. It'll get better.\" No, it won't; it hasn't for 2 years, and it isn't just going to magically fucking get better. I JUST WANT TO DIE.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24v29y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "DevastatedSoul", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399383968.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24v29y/please_just_help_me_find_the_courage_to_pull_the/", "name": "t3_24v29y", "created": 1399412504.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24v29y/please_just_help_me_find_the_courage_to_pull_the/", "author_flair_text": null, "title": "Please just help me find the courage to pull the trigger.", "created_utc": 1399383704.0, "ups": 2, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chay6jh", "gilded": 0, "author": "throway8420", "parent_id": "t3_24v29y", "approved_by": null, "body": "I cannot give you the courage to pull the trigger OP. I am about your age and I too have been unemployed for the past 2 years. Prior to being laid off I had never been unemployed. The chaos, the crisis, the losses,  the depression have become unbearable for me as well and I am unable to get any treatment whatsoever right now. I am also alone-  no family and isolated from friends. I am so tired of swimming upstream that I came really close to calling it quits a few weeks ago. I think what stopped me was the idea that even though I would feel relief from the pain I was in, it also meant I would forever be denied the opportunity to help others going through difficult times.\n ", "edited": 1399387827.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cannot give you the courage to pull the trigger OP. I am about your age and I too have been unemployed for the past 2 years. Prior to being laid off I had never been unemployed. The chaos, the crisis, the losses,  the depression have become unbearable for me as well and I am unable to get any treatment whatsoever right now. I am also alone-  no family and isolated from friends. I am so tired of swimming upstream that I came really close to calling it quits a few weeks ago. I think what stopped me was the idea that even though I would feel relief from the pain I was in, it also meant I would forever be denied the opportunity to help others going through difficult times.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24v29y", "score_hidden": false, "name": "t1_chay6jh", "created": 1399415823.0, "author_flair_text": null, "created_utc": 1399387023.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbyoe8", "gilded": 0, "author": "JohnMalkovitchLover", "parent_id": "t3_24v29y", "approved_by": null, "body": "I have been there. Put the gun away; this is a bad way to end it. Many people \"mess up\" and become severely mentally and physically disabled. Don't kill yourself. Talk to us. You came here to reach out and that tells me that some part of you is fighting to live. Is there anything in this world you truly enjoy? It could be anything. Please find the will to go on another day OP we need you around. I'm a bit sad today but I came here and saw that I'm not alone and others care. I try to let others know they can keep going. If we walk together maybe it won't be such a bad journey right? Anyway, we are here for you. You're very brave to admit how awful you are feeling. You're brave for staying alive. The story of your life is far from over and I think part of you knows this. Hang on. You will be ok again. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been there. Put the gun away; this is a bad way to end it. Many people &amp;quot;mess up&amp;quot; and become severely mentally and physically disabled. Don&amp;#39;t kill yourself. Talk to us. You came here to reach out and that tells me that some part of you is fighting to live. Is there anything in this world you truly enjoy? It could be anything. Please find the will to go on another day OP we need you around. I&amp;#39;m a bit sad today but I came here and saw that I&amp;#39;m not alone and others care. I try to let others know they can keep going. If we walk together maybe it won&amp;#39;t be such a bad journey right? Anyway, we are here for you. You&amp;#39;re very brave to admit how awful you are feeling. You&amp;#39;re brave for staying alive. The story of your life is far from over and I think part of you knows this. Hang on. You will be ok again. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24v29y", "score_hidden": false, "name": "t1_chbyoe8", "created": 1399511787.0, "author_flair_text": null, "created_utc": 1399482987.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]