[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hit an all time low tonight. I feel so alone. More than usual. I cannot stop crying, but all I wanna do is fall asleep and I can&amp;#39;t. I feel so worthless right now. I told my boyfriend I was feeling kind of depressed on friday. I tried texting him because I felt lonely, but he says he&amp;#39;s just busy hanging out with friends and tells me whatever as if he doesn&amp;#39;t care. I am so fucking tired of feeling so alone. I&amp;#39;m sick of not having friends of my own. I can&amp;#39;t stand being me anymore. I wanna die so badly. I wanna leave. Never come back. But the only things keeping me away is my cat because there wouldn&amp;#39;t be anyone to feed him or take good care of him when I&amp;#39;m not here. The other reason is I don&amp;#39;t want my family to be upset. Can you fucking believe one of the only reasons why I don&amp;#39;t leave is because of a cat? How pathetic do I sound. God if I only knew someone would take him and love him the way I do, would I finally just leave. I would get rid of one less shitty person.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not good for anything. I have no friends. I have no one. The only person is my boyfriend but some things he does and some instances leads me to believe he doesn&amp;#39;t love or care about me at all. Sometimes he just bluntly says it. I&amp;#39;m such a fucking idiot. I think about suicide a lot, almost every day, but if some things are holding me back I won&amp;#39;t be able to. I&amp;#39;ll still be here wasting everyone&amp;#39;s time, being a fucking nuisance. I wanna leave so badly, I don&amp;#39;t want to live here anymore. If only someone would shoot me in the head, if it was that easy. As of right now, I don&amp;#39;t have anything to kill myself with, but I could never leave my cat, and I could never let my family find me dead. No matter what I do I&amp;#39;m going to fuck something up. I just need to not feel so alone. That hurts so fucking bad, I know I don&amp;#39;t make an effort to make friends, but it&amp;#39;s not easy for me, and it&amp;#39;s not like I enjoy being alone every fucking day. Every day, alone, no one to fucking talk to besides the internet. Shit, I&amp;#39;m the kind of loser everyone makes fun of. I&amp;#39;m nothing, people will just walk away from me. I just wanna stop crying, I have a headache from it. I just want to sleep.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hit an all time low tonight. I feel so alone. More than usual. I cannot stop crying, but all I wanna do is fall asleep and I can't. I feel so worthless right now. I told my boyfriend I was feeling kind of depressed on friday. I tried texting him because I felt lonely, but he says he's just busy hanging out with friends and tells me whatever as if he doesn't care. I am so fucking tired of feeling so alone. I'm sick of not having friends of my own. I can't stand being me anymore. I wanna die so badly. I wanna leave. Never come back. But the only things keeping me away is my cat because there wouldn't be anyone to feed him or take good care of him when I'm not here. The other reason is I don't want my family to be upset. Can you fucking believe one of the only reasons why I don't leave is because of a cat? How pathetic do I sound. God if I only knew someone would take him and love him the way I do, would I finally just leave. I would get rid of one less shitty person.\n\nI'm not good for anything. I have no friends. I have no one. The only person is my boyfriend but some things he does and some instances leads me to believe he doesn't love or care about me at all. Sometimes he just bluntly says it. I'm such a fucking idiot. I think about suicide a lot, almost every day, but if some things are holding me back I won't be able to. I'll still be here wasting everyone's time, being a fucking nuisance. I wanna leave so badly, I don't want to live here anymore. If only someone would shoot me in the head, if it was that easy. As of right now, I don't have anything to kill myself with, but I could never leave my cat, and I could never let my family find me dead. No matter what I do I'm going to fuck something up. I just need to not feel so alone. That hurts so fucking bad, I know I don't make an effort to make friends, but it's not easy for me, and it's not like I enjoy being alone every fucking day. Every day, alone, no one to fucking talk to besides the internet. Shit, I'm the kind of loser everyone makes fun of. I'm nothing, people will just walk away from me. I just wanna stop crying, I have a headache from it. I just want to sleep.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24346t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "aliceINchainz", "media": null, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24346t/please_i_need_someone_to_talk_to/", "name": "t3_24346t", "created": 1398605811.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24346t/please_i_need_someone_to_talk_to/", "author_flair_text": null, "title": "Please I need someone to talk to", "created_utc": 1398577011.0, "ups": 12, "num_comments": 18, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch351fa", "gilded": 0, "author": "PapaBear12", "parent_id": "t1_ch35090", "approved_by": null, "body": "Sounds like a plan. I understand your POV regarding strangers on the internet. But I'm still here if you ever need to talk.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like a plan. I understand your POV regarding strangers on the internet. But I&amp;#39;m still here if you ever need to talk.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch351fa", "created": 1398608301.0, "author_flair_text": null, "created_utc": 1398579501.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch35090", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch34x5p", "approved_by": null, "body": "I'm getting very tired right now. I think I want to try sleeping. Hopefully it'll work. I don't know what else to say. I don't want to expect strangers to automatically make me feel better and cheer me up right away, but I still feel horrible. But all I can do now is sleep. I might do that right now.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m getting very tired right now. I think I want to try sleeping. Hopefully it&amp;#39;ll work. I don&amp;#39;t know what else to say. I don&amp;#39;t want to expect strangers to automatically make me feel better and cheer me up right away, but I still feel horrible. But all I can do now is sleep. I might do that right now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch35090", "created": 1398608172.0, "author_flair_text": null, "created_utc": 1398579372.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch34x5p", "gilded": 0, "author": "PapaBear12", "parent_id": "t1_ch34rsu", "approved_by": null, "body": "Actually, I believe I read somewhere that exercise can keep you awake even longer. Do you have any aspirin? Take 2. When's the last time you drank water? Get yourself a nice tall glass of water. Sometimes dehydration can cause pretty bad headaches.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, I believe I read somewhere that exercise can keep you awake even longer. Do you have any aspirin? Take 2. When&amp;#39;s the last time you drank water? Get yourself a nice tall glass of water. Sometimes dehydration can cause pretty bad headaches.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34x5p", "created": 1398607838.0, "author_flair_text": null, "created_utc": 1398579038.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3km45", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch353sg", "approved_by": null, "body": "I know, finding people online who feel the same way I do is probably the only thing that still makes me happy.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know, finding people online who feel the same way I do is probably the only thing that still makes me happy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch3km45", "created": 1398636363.0, "author_flair_text": null, "created_utc": 1398632763.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch353sg", "gilded": 0, "author": "Iknowreally", "parent_id": "t1_ch34rsu", "approved_by": null, "body": "Sometimes it's easy to fall into self loathing.  I get it, I think.  Sometimes I feel like I don't have the right to comment on how people feel or even think that I understand about life to help other people but know this:  reading this forum I've recognized that other people feel exactly the same way I do.  Reading your expression of your feelings has helped me realized that I'm not alone in feeling the way I do.  I'm maybe assuming here, but if you care about your cat you posses the ability to feel and care for others.  That's a real skill, and even if you feel it is not.  Think about if someone else was feeling the exact same feelings you do, would you be okay with it?  It's hard to deal with.  I feel stupid for even trying to help others get through the things I don't know if even I can get through, but I hope you do.  Don't feel pathetic.  I feel pathetic, but it's not.  We all hate ourselves unnecessarily.  Your feelings are valid but don't let them control you.  You deserve to be happy, even if you think you don't deserve happiness.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes it&amp;#39;s easy to fall into self loathing.  I get it, I think.  Sometimes I feel like I don&amp;#39;t have the right to comment on how people feel or even think that I understand about life to help other people but know this:  reading this forum I&amp;#39;ve recognized that other people feel exactly the same way I do.  Reading your expression of your feelings has helped me realized that I&amp;#39;m not alone in feeling the way I do.  I&amp;#39;m maybe assuming here, but if you care about your cat you posses the ability to feel and care for others.  That&amp;#39;s a real skill, and even if you feel it is not.  Think about if someone else was feeling the exact same feelings you do, would you be okay with it?  It&amp;#39;s hard to deal with.  I feel stupid for even trying to help others get through the things I don&amp;#39;t know if even I can get through, but I hope you do.  Don&amp;#39;t feel pathetic.  I feel pathetic, but it&amp;#39;s not.  We all hate ourselves unnecessarily.  Your feelings are valid but don&amp;#39;t let them control you.  You deserve to be happy, even if you think you don&amp;#39;t deserve happiness.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch353sg", "created": 1398583356.0, "author_flair_text": null, "created_utc": 1398579756.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34rsu", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch34o0p", "approved_by": null, "body": "I can't help but feel pathetic. It's one of the only things I can feel for myself besides hatred. I think I'll do something to make myself tired, so I can sleep. Like exercise or something. But now I have such a terrible headache.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t help but feel pathetic. It&amp;#39;s one of the only things I can feel for myself besides hatred. I think I&amp;#39;ll do something to make myself tired, so I can sleep. Like exercise or something. But now I have such a terrible headache.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34rsu", "created": 1398607241.0, "author_flair_text": null, "created_utc": 1398578441.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34o0p", "gilded": 0, "author": "PapaBear12", "parent_id": "t3_24346t", "approved_by": null, "body": "Hi. First off, it is important to note that you do NOT sound pathetic at all and that you are NOT a loser. You are an incredible human being with a big future ahead of you.\n\nI know you're having trouble sleeping, but eventually you will fall asleep. I'm not saying sleeping will change things permanently, but sleeping on thoughts like this are a really good idea. When you're tired and awake and upset, your head is not in the right place.\n\nSo, do me one favor. Try and sleep on it tonight, and if you want to talk, send me a PM. I'd be happy to talk. Please, please, please reach out before doing anything rash.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. First off, it is important to note that you do NOT sound pathetic at all and that you are NOT a loser. You are an incredible human being with a big future ahead of you.&lt;/p&gt;\n\n&lt;p&gt;I know you&amp;#39;re having trouble sleeping, but eventually you will fall asleep. I&amp;#39;m not saying sleeping will change things permanently, but sleeping on thoughts like this are a really good idea. When you&amp;#39;re tired and awake and upset, your head is not in the right place.&lt;/p&gt;\n\n&lt;p&gt;So, do me one favor. Try and sleep on it tonight, and if you want to talk, send me a PM. I&amp;#39;d be happy to talk. Please, please, please reach out before doing anything rash.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34o0p", "created": 1398606833.0, "author_flair_text": null, "created_utc": 1398578033.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3g16e", "gilded": 0, "author": "BigDogeM", "parent_id": "t3_24346t", "approved_by": null, "body": "sounds like your bf is the worthless piece of shit, not you. I don't know you but would like to give you a big hug. I read some of your posts and you should try joining a crochet group in your area. it would be a great way to meet new friends with similar interests. I hate to say it but online dating is an easy way to meet a new bf. I have been with my gf for 7yrs and we met online. I am quite shy and it makes breaking the ice a lot easier.  PM me if you need to talk to someone.\n\nalso, smoking a joint always helps when in a funk. turn that frown upside down.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sounds like your bf is the worthless piece of shit, not you. I don&amp;#39;t know you but would like to give you a big hug. I read some of your posts and you should try joining a crochet group in your area. it would be a great way to meet new friends with similar interests. I hate to say it but online dating is an easy way to meet a new bf. I have been with my gf for 7yrs and we met online. I am quite shy and it makes breaking the ice a lot easier.  PM me if you need to talk to someone.&lt;/p&gt;\n\n&lt;p&gt;also, smoking a joint always helps when in a funk. turn that frown upside down.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch3g16e", "created": 1398626000.0, "author_flair_text": null, "created_utc": 1398622400.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch34xii", "gilded": 0, "author": "PapaBear12", "parent_id": "t1_ch34sgk", "approved_by": null, "body": "That sounds like a great idea if I do say so myself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds like a great idea if I do say so myself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34xii", "created": 1398582677.0, "author_flair_text": null, "created_utc": 1398579077.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34sgk", "gilded": 0, "author": "theatrelover", "parent_id": "t1_ch34r6w", "approved_by": null, "body": "I see /u/PapaBear12 offered to PM with you. Maybe talk to him a bit? Just to get some stuff of your chest? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see &lt;a href=\"/u/PapaBear12\"&gt;/u/PapaBear12&lt;/a&gt; offered to PM with you. Maybe talk to him a bit? Just to get some stuff of your chest? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34sgk", "created": 1398607315.0, "author_flair_text": null, "created_utc": 1398578515.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch34r6w", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch34npu", "approved_by": null, "body": "I just don't. It's not a simple answer.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just don&amp;#39;t. It&amp;#39;s not a simple answer.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34r6w", "created": 1398581972.0, "author_flair_text": null, "created_utc": 1398578372.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34npu", "gilded": 0, "author": "theatrelover", "parent_id": "t1_ch34n93", "approved_by": null, "body": "Can I ask why?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can I ask why?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34npu", "created": 1398606799.0, "author_flair_text": null, "created_utc": 1398577999.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34n93", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch34m3r", "approved_by": null, "body": "No I'm not going to any therapist or doctor or anyone. I'm never doing that, I don't care how horrible I feel.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No I&amp;#39;m not going to any therapist or doctor or anyone. I&amp;#39;m never doing that, I don&amp;#39;t care how horrible I feel.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34n93", "created": 1398606751.0, "author_flair_text": null, "created_utc": 1398577951.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch34m3r", "gilded": 0, "author": "theatrelover", "parent_id": "t3_24346t", "approved_by": null, "body": "I am so sorry you're in that much pain. Having a cat and a family that would miss you *isn't* a small thing-- it's everything. There's time for friends, later. Right now it sounds like you need some help for the pain you're in. Do you have a doctor, therapist, religious person or hotline you could call? They *want* to reach out and help you- you just have to make the first move.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry you&amp;#39;re in that much pain. Having a cat and a family that would miss you &lt;em&gt;isn&amp;#39;t&lt;/em&gt; a small thing-- it&amp;#39;s everything. There&amp;#39;s time for friends, later. Right now it sounds like you need some help for the pain you&amp;#39;re in. Do you have a doctor, therapist, religious person or hotline you could call? They &lt;em&gt;want&lt;/em&gt; to reach out and help you- you just have to make the first move.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch34m3r", "created": 1398606633.0, "author_flair_text": null, "created_utc": 1398577833.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4i6ax", "gilded": 0, "author": "the0riginalposter", "parent_id": "t3_24346t", "approved_by": null, "body": "I clicked on your user name and couldn't believe the most beautiful things you have made.  You have some amazing skills.  You should teach these skills to an audience.  I am amazed.\n\nAlice in Chains is a very awesome band.  Nutshell is a fucking amazing song.\n\nBeing alone sucks.  Most people like myself here, have complimented our depression with substance addiction.  You are lucky you have opportunity that doesn't require you breaking addiction.  I think if you just get out a little more from the house, you will find a new world.  Set a reminder on your computer to leave your house everyday at the same time and force yourself to find something.\n\nI think you are in the wrong place.  I think you need more...you will find it.  please go out and find it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I clicked on your user name and couldn&amp;#39;t believe the most beautiful things you have made.  You have some amazing skills.  You should teach these skills to an audience.  I am amazed.&lt;/p&gt;\n\n&lt;p&gt;Alice in Chains is a very awesome band.  Nutshell is a fucking amazing song.&lt;/p&gt;\n\n&lt;p&gt;Being alone sucks.  Most people like myself here, have complimented our depression with substance addiction.  You are lucky you have opportunity that doesn&amp;#39;t require you breaking addiction.  I think if you just get out a little more from the house, you will find a new world.  Set a reminder on your computer to leave your house everyday at the same time and force yourself to find something.&lt;/p&gt;\n\n&lt;p&gt;I think you are in the wrong place.  I think you need more...you will find it.  please go out and find it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch4i6ax", "created": 1398726884.0, "author_flair_text": null, "created_utc": 1398723284.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3y8e5", "gilded": 0, "author": "bluesky020", "parent_id": "t1_ch3kn1g", "approved_by": null, "body": "What are some hobbies that you have? Hobbies aren't do bad if they give you something to do! Maybe some goal setting with your hobbies would help as it gives you something to look forward to and work on when you don't have the motivation to do anything else or just need something to get you away from reality. \n\nThis may seem odd but you still have yourself as a companion and someone you can depend on to work through things. Was is it about yourself that you like and what specific things are you unhappy with? For example if your boyfriend causes you a lot of grief then perhaps your relationship is one of the problems you can work on. Some people are perfectly happy being alone and others find that they at times will have to be okay with being alone in order to meet people and keep friends. You are going to be one of the strongest supports for yourself and can be a support for others but if you can't be happy with who you are it makes it difficult for others to feel the same way even though you have great qualities. \n\nBesides, you aren't exactly alone! You still have your cat and your boyfriend and us. I know we can't exactly offer you what you may be looking for but we're hear to listen. ", "edited": 1398665918.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are some hobbies that you have? Hobbies aren&amp;#39;t do bad if they give you something to do! Maybe some goal setting with your hobbies would help as it gives you something to look forward to and work on when you don&amp;#39;t have the motivation to do anything else or just need something to get you away from reality. &lt;/p&gt;\n\n&lt;p&gt;This may seem odd but you still have yourself as a companion and someone you can depend on to work through things. Was is it about yourself that you like and what specific things are you unhappy with? For example if your boyfriend causes you a lot of grief then perhaps your relationship is one of the problems you can work on. Some people are perfectly happy being alone and others find that they at times will have to be okay with being alone in order to meet people and keep friends. You are going to be one of the strongest supports for yourself and can be a support for others but if you can&amp;#39;t be happy with who you are it makes it difficult for others to feel the same way even though you have great qualities. &lt;/p&gt;\n\n&lt;p&gt;Besides, you aren&amp;#39;t exactly alone! You still have your cat and your boyfriend and us. I know we can&amp;#39;t exactly offer you what you may be looking for but we&amp;#39;re hear to listen. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch3y8e5", "created": 1398669263.0, "author_flair_text": null, "created_utc": 1398665663.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3kn1g", "gilded": 0, "author": "aliceINchainz", "parent_id": "t1_ch35yyx", "approved_by": null, "body": "Yeah, I have hobbies, but that's all they are is a hobby. I'm still alone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I have hobbies, but that&amp;#39;s all they are is a hobby. I&amp;#39;m still alone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch3kn1g", "created": 1398636421.0, "author_flair_text": null, "created_utc": 1398632821.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch35yyx", "gilded": 0, "author": "bluesky020", "parent_id": "t3_24346t", "approved_by": null, "body": "Sometimes living for others isn't necessarily such a bad thing as it can provide a lot of meaning to one's life. Worrying about your family and cat reflects that they are important to you and perhaps when it seems like everyone else in the world has turned their back on you and you're completely alone there is still something keeping you here. If you feel that you have no one to talk to is there anything you like to do? A hobby perhaps? If you can't sleep then maybe you can do something you enjoy to help pass the time. I honestly don't think there is anything so bad about talking to people over the Internet instead of real life! If this is all you can do then go for it. There are so many people in online communities that sometimes the interactions online can be a lot more enriching than those in person. I hope that finding something enjoyable in life through a hobby or family can ease the pain a little bit and help give you the strength to endure everything you're going through (or at least a part of it all). ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes living for others isn&amp;#39;t necessarily such a bad thing as it can provide a lot of meaning to one&amp;#39;s life. Worrying about your family and cat reflects that they are important to you and perhaps when it seems like everyone else in the world has turned their back on you and you&amp;#39;re completely alone there is still something keeping you here. If you feel that you have no one to talk to is there anything you like to do? A hobby perhaps? If you can&amp;#39;t sleep then maybe you can do something you enjoy to help pass the time. I honestly don&amp;#39;t think there is anything so bad about talking to people over the Internet instead of real life! If this is all you can do then go for it. There are so many people in online communities that sometimes the interactions online can be a lot more enriching than those in person. I hope that finding something enjoyable in life through a hobby or family can ease the pain a little bit and help give you the strength to endure everything you&amp;#39;re going through (or at least a part of it all). &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24346t", "score_hidden": false, "name": "t1_ch35yyx", "created": 1398587240.0, "author_flair_text": null, "created_utc": 1398583640.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]