[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realise that this reason is stupider than most people&amp;#39;s reasons for wanting to die but please bear with me and try to be patient.\nI am fifteen years old. Two weeks ago my ex stopped loving me; he won&amp;#39;t tell me why and gets angry when I ask.\nFor about a month before this I had been contemplating suicide as the relationship had been unhappy. I had started self harming again. But this really pushed me over the edge.\nTwice in the last two weeks I have attempted suicide by cutting. I can&amp;#39;t make myself cut deep enough. I am too much of a coward to try other methods. This morning my ex blocked me for trying to force him to assist with my suicide. This has made everything much, much worse. I have four friends who I have talked to about this, but they just guilt me and make me feel awful for wanting to die. They do honestly care about me but they are the same age as me and don&amp;#39;t know how to deal with the situation. I feel terrible for burdening them like this.\nI know this sounds very much like I am a melodramatic teenager who&amp;#39;ll be over her ex in a matter of weeks, but I feel very strongly about this. I have a frankly unhealthy obsession with the relationship I used to have and find it very difficult to function without it. I&amp;#39;ve lost my appetite and I have nightmares every night.\nMy friend phoned my mother as she was worried about me hurting myself. I&amp;#39;m getting professional help but honestly everyone I have seen is condescending and I leave feeling worse than ever.\nI&amp;#39;m sorry if this post is mixed up and difficult to understand but I would greatly appreciate responses and advice if anyone is willing to share.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I realise that this reason is stupider than most people's reasons for wanting to die but please bear with me and try to be patient.\nI am fifteen years old. Two weeks ago my ex stopped loving me; he won't tell me why and gets angry when I ask.\nFor about a month before this I had been contemplating suicide as the relationship had been unhappy. I had started self harming again. But this really pushed me over the edge.\nTwice in the last two weeks I have attempted suicide by cutting. I can't make myself cut deep enough. I am too much of a coward to try other methods. This morning my ex blocked me for trying to force him to assist with my suicide. This has made everything much, much worse. I have four friends who I have talked to about this, but they just guilt me and make me feel awful for wanting to die. They do honestly care about me but they are the same age as me and don't know how to deal with the situation. I feel terrible for burdening them like this.\nI know this sounds very much like I am a melodramatic teenager who'll be over her ex in a matter of weeks, but I feel very strongly about this. I have a frankly unhealthy obsession with the relationship I used to have and find it very difficult to function without it. I've lost my appetite and I have nightmares every night.\nMy friend phoned my mother as she was worried about me hurting myself. I'm getting professional help but honestly everyone I have seen is condescending and I leave feeling worse than ever.\nI'm sorry if this post is mixed up and difficult to understand but I would greatly appreciate responses and advice if anyone is willing to share.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25aazj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawayndhlp", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25aazj/please_help/", "name": "t3_25aazj", "created": 1399852668.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25aazj/please_help/", "author_flair_text": null, "title": "Please help.", "created_utc": 1399823868.0, "ups": 1, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf8c42", "gilded": 0, "author": "Sukos", "parent_id": "t3_25aazj", "approved_by": null, "body": "Are you me? I'm a fifteen year old boy going through something exactly the same, even down to my ex blocking me. Pm me", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you me? I&amp;#39;m a fifteen year old boy going through something exactly the same, even down to my ex blocking me. Pm me&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25aazj", "score_hidden": false, "name": "t1_chf8c42", "created": 1399853672.0, "author_flair_text": null, "created_utc": 1399824872.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chf8l9s", "gilded": 0, "author": "maybethrowawayonce", "parent_id": "t3_25aazj", "approved_by": null, "body": "I know it may sound stupid, but what about giving yourself a chance? Say something like \"when I turn 19, if I still feel like this, I will kill myself\".\nI'm not trying to dismiss the pain you're going through right now, but it could be temporary. How would you know?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it may sound stupid, but what about giving yourself a chance? Say something like &amp;quot;when I turn 19, if I still feel like this, I will kill myself&amp;quot;.\nI&amp;#39;m not trying to dismiss the pain you&amp;#39;re going through right now, but it could be temporary. How would you know?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25aazj", "score_hidden": false, "name": "t1_chf8l9s", "created": 1399854346.0, "author_flair_text": null, "created_utc": 1399825546.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfdub1", "gilded": 0, "author": "here_t0_help", "parent_id": "t3_25aazj", "approved_by": null, "body": "You should not feel bad about your reasoning behind feeling this way. Everyone has different challenges, and nobody has the right to make you feel wrong for how you feel. Your reason is not stupid. It is very, very real for you. \n\nYou mentioned your mother -- has she been supportive or able to help at all? I understand the issue with your friends. It can be very hard for young people to understand these issues sometimes. Do you have any older friends or family that you trust to talk to about this? Or maybe a teacher or staff member at school? \n\n&gt; I have a frankly unhealthy obsession with the relationship I used to have\n\nIt is clear you are very, very smart -- you have more insight into the challenges you are facing than many people much older than you. It amazes me that you are able to step back and think about your situation and name it to be unhealthy. These same skills will help you to get through this. \n\nI would love to talk more about this with you. I went through a similar struggle just a few years ago when I was your age. Stay strong, you can get through it. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should not feel bad about your reasoning behind feeling this way. Everyone has different challenges, and nobody has the right to make you feel wrong for how you feel. Your reason is not stupid. It is very, very real for you. &lt;/p&gt;\n\n&lt;p&gt;You mentioned your mother -- has she been supportive or able to help at all? I understand the issue with your friends. It can be very hard for young people to understand these issues sometimes. Do you have any older friends or family that you trust to talk to about this? Or maybe a teacher or staff member at school? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I have a frankly unhealthy obsession with the relationship I used to have&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is clear you are very, very smart -- you have more insight into the challenges you are facing than many people much older than you. It amazes me that you are able to step back and think about your situation and name it to be unhealthy. These same skills will help you to get through this. &lt;/p&gt;\n\n&lt;p&gt;I would love to talk more about this with you. I went through a similar struggle just a few years ago when I was your age. Stay strong, you can get through it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25aazj", "score_hidden": false, "name": "t1_chfdub1", "created": 1399868017.0, "author_flair_text": null, "created_utc": 1399839217.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]