[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a sociopathic narcissist and the only reason I write now is to fish for emotional responses. There are many things I need to take care of right now. Not only things others expect of me, but things which are good for me. Things which when left alone, get worse. I know all this, but it does not influence my actions. This understanding of myself only provides me with a form of external viewpoint. I watch myself act, my life pass by. Somewhat like learned helplessness. &lt;/p&gt;\n\n&lt;p&gt;In childhood my parents decided to have my intelligence tested, I scored very highly. I learned to speak fluent English within half a year, have programmed since the fourth grade, and the list goes on. There is no point in enumerating. I&amp;#39;m always described as highly intelligent, &amp;quot;full of potential&amp;quot;. &amp;quot;You&amp;#39;ll do great things.&amp;quot; I often like to blame my lack of internal motivation on this. It is nonsense to do so, I am my own person now.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wish I was as smart as you&amp;quot;. No you don&amp;#39;t. When you have never needed to work hard for anything, it is all meaningless. A result means nothing if it only took a few hours of &amp;quot;work&amp;quot;. I have a friend, he always used to have the worst grades. He always worked hard. Very hard. Now he is doing very well at a good university. I wish I had what this friend has. He wishes he had what I have. Jealousy cuts two ways.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve recently (half a year ago) went to see a psychiatrist. She prescribed me anti-depressives. I was diagnosed with heavy depression. I should be over it now, and indeed, I do feel it gone. Now all which remains is emptiness. She has not helped me there. She cannot, I don&amp;#39;t let her.&lt;/p&gt;\n\n&lt;p&gt;I despise a large majority of people. They are so easily manipulated, so naive. Worse, their ignorance causes horrible consequences. I am not better. My inaction equates to the waste of a paid life. Every person I have ever loved was a mistake. Every time I convinced myself to trust a person, I have been betrayed, beginning with my (surprise, fucked up) family.&lt;/p&gt;\n\n&lt;p&gt;Every day I tell myself, I will try again, I will change. But everyday I fail. I&amp;#39;ve failed too many times now. I simply cannot get myself to do things which are good for me. I am speaking of the simplest of things, like brushing my teeth.&lt;/p&gt;\n\n&lt;p&gt;There is nothing in my life which makes me happy, nothing at all. I have given up searching. I know I cannot continue like this. But I am. Everyday. This is my last ditch effort. It is a twisted serpentine effort. I am young, I rot away. I&amp;#39;ve been through so much shit and there is no end in sight. Now I am alone, with a small debt, mounting bills, without any prospects of a future. I know, I will end this, one way or another. I cannot see.&lt;/p&gt;\n\n&lt;p&gt;Help&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a sociopathic narcissist and the only reason I write now is to fish for emotional responses. There are many things I need to take care of right now. Not only things others expect of me, but things which are good for me. Things which when left alone, get worse. I know all this, but it does not influence my actions. This understanding of myself only provides me with a form of external viewpoint. I watch myself act, my life pass by. Somewhat like learned helplessness. \n\nIn childhood my parents decided to have my intelligence tested, I scored very highly. I learned to speak fluent English within half a year, have programmed since the fourth grade, and the list goes on. There is no point in enumerating. I'm always described as highly intelligent, \"full of potential\". \"You'll do great things.\" I often like to blame my lack of internal motivation on this. It is nonsense to do so, I am my own person now.\n\n\"I wish I was as smart as you\". No you don't. When you have never needed to work hard for anything, it is all meaningless. A result means nothing if it only took a few hours of \"work\". I have a friend, he always used to have the worst grades. He always worked hard. Very hard. Now he is doing very well at a good university. I wish I had what this friend has. He wishes he had what I have. Jealousy cuts two ways.\n\nI've recently (half a year ago) went to see a psychiatrist. She prescribed me anti-depressives. I was diagnosed with heavy depression. I should be over it now, and indeed, I do feel it gone. Now all which remains is emptiness. She has not helped me there. She cannot, I don't let her.\n\nI despise a large majority of people. They are so easily manipulated, so naive. Worse, their ignorance causes horrible consequences. I am not better. My inaction equates to the waste of a paid life. Every person I have ever loved was a mistake. Every time I convinced myself to trust a person, I have been betrayed, beginning with my (surprise, fucked up) family.\n\nEvery day I tell myself, I will try again, I will change. But everyday I fail. I've failed too many times now. I simply cannot get myself to do things which are good for me. I am speaking of the simplest of things, like brushing my teeth.\n\nThere is nothing in my life which makes me happy, nothing at all. I have given up searching. I know I cannot continue like this. But I am. Everyday. This is my last ditch effort. It is a twisted serpentine effort. I am young, I rot away. I've been through so much shit and there is no end in sight. Now I am alone, with a small debt, mounting bills, without any prospects of a future. I know, I will end this, one way or another. I cannot see.\n\nHelp", "likes": null, "secure_media": null, "link_flair_text": null, "id": "242gbk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "aaaaaaaa12321", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/242gbk/please/", "name": "t3_242gbk", "created": 1398585992.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/242gbk/please/", "author_flair_text": null, "title": "Please", "created_utc": 1398557192.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2y862", "gilded": 0, "author": "yummycorndog", "parent_id": "t3_242gbk", "approved_by": null, "body": "I like how you prefaced your post... I think that is everyone's subversive motive but they don't even realize it. Haha.\n\nI've read something before that it is bad to tell a kid how smart he is, because that will make him believe he is already smart and doesn't need to try any harder. \n\nAs for feeling empty after getting rid of depression, I don't know. You are probably just in a \"2nd stage\" of depression, sort of like the 5 stages of grief. You may think you're not depressed anymore, but still are? That's my speculation.\n\nDon't know what else to say, but I hope my empathy was apparent and that you feel better. At least for a moment.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like how you prefaced your post... I think that is everyone&amp;#39;s subversive motive but they don&amp;#39;t even realize it. Haha.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read something before that it is bad to tell a kid how smart he is, because that will make him believe he is already smart and doesn&amp;#39;t need to try any harder. &lt;/p&gt;\n\n&lt;p&gt;As for feeling empty after getting rid of depression, I don&amp;#39;t know. You are probably just in a &amp;quot;2nd stage&amp;quot; of depression, sort of like the 5 stages of grief. You may think you&amp;#39;re not depressed anymore, but still are? That&amp;#39;s my speculation.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t know what else to say, but I hope my empathy was apparent and that you feel better. At least for a moment.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_242gbk", "score_hidden": false, "name": "t1_ch2y862", "created": 1398563446.0, "author_flair_text": null, "created_utc": 1398559846.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]