[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a senior in high school and have pretty much 0 chance of graduating. My dysfunctional psycho ass family has their mind set on throwing me out as soon as this school year is over, mostly my alcoholic poll junkie dad&amp;#39;s idea. I&amp;#39;ve got no job, no money, no where to go and I&amp;#39;ll have no means of transportation as the only vehicle I have they plan on keeping when I leave. I never really had a lot of friends, but the only people that really kept me going,  my now ex girlfriend and ex best friend are now fucking and completely dropped out of my life. I&amp;#39;ve got a couple of casual acquaintances/friends but no one I could talk to about anything. I feel so useless. No one gives a shit about me anymore and I&amp;#39;ve got no life ahead of me. I&amp;#39;d blow my brains out but every time I put the barrel of my shotgun in my mouth I pussy out and can&amp;#39;t pull the trigger. I&amp;#39;m worthless and it just seems like there&amp;#39;s no reason for me to go on. I don&amp;#39;t know why I haven&amp;#39;t ended it yet,  maybe it&amp;#39;s all the pain pills I&amp;#39;ve been taking to take the edge off or maybe it&amp;#39;s just not being able to find an easy way out. I tried overdosing, took 450 mg of tramadol and drank a bottle of nyquil after cutting my wrist again, but just woke up barely able to breath and covered in puke. I guess I could really just use some kind of encouragement. Please help me reddit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a senior in high school and have pretty much 0 chance of graduating. My dysfunctional psycho ass family has their mind set on throwing me out as soon as this school year is over, mostly my alcoholic poll junkie dad's idea. I've got no job, no money, no where to go and I'll have no means of transportation as the only vehicle I have they plan on keeping when I leave. I never really had a lot of friends, but the only people that really kept me going,  my now ex girlfriend and ex best friend are now fucking and completely dropped out of my life. I've got a couple of casual acquaintances/friends but no one I could talk to about anything. I feel so useless. No one gives a shit about me anymore and I've got no life ahead of me. I'd blow my brains out but every time I put the barrel of my shotgun in my mouth I pussy out and can't pull the trigger. I'm worthless and it just seems like there's no reason for me to go on. I don't know why I haven't ended it yet,  maybe it's all the pain pills I've been taking to take the edge off or maybe it's just not being able to find an easy way out. I tried overdosing, took 450 mg of tramadol and drank a bottle of nyquil after cutting my wrist again, but just woke up barely able to breath and covered in puke. I guess I could really just use some kind of encouragement. Please help me reddit.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250dy1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "-8675309", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250dy1/pointless/", "name": "t3_250dy1", "created": 1399546676.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250dy1/pointless/", "author_flair_text": null, "title": "Pointless", "created_utc": 1399517876.0, "ups": 2, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]