[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me start by saying that my pregnancy was planned. My husband and I tried very hard for this baby, and the pregnancy is still something I want. This will be our second child. Depression is not something new for me. I have been depressed since I was a child. I have never been truly suicidal, but I have thought about it quite often at times. I have had no great tragedy happen in my life. Yes, I&amp;#39;ve lost people I love. Who hasn&amp;#39;t. Yes, I was bullied as a kid. I&amp;#39;m not a kid any more, and that&amp;#39;s not the center of my universe. I guess my point is, I believe I&amp;#39;m just hard wired to be depressed. &lt;/p&gt;\n\n&lt;p&gt;I have not been on any antidepressants since I was in my early years of high school. I haven&amp;#39;t needed to be. I have low points, but mostly, I function very well. I find joy in my son. I maintain relationships and am successful in my career. With this pregnancy, my depression has become profound. I&amp;#39;m sure some of this is related to hormone changes, though none of this happened with my first pregnancy. &lt;/p&gt;\n\n&lt;p&gt;My doctor recommended I go on an antidepressant. The thing is, I&amp;#39;m educated enough to have a pretty good idea of what the risks to my baby will be if I do. I can&amp;#39;t justify to myself putting my baby at risk like that. &lt;/p&gt;\n\n&lt;p&gt;So therein lies the problem. I am thinking about suicide. I don&amp;#39;t think I would ever pull the trigger, so to speak, but Jesus! It&amp;#39;s not a good feeling to be thinking about it so much. I&amp;#39;m not sleeping. I&amp;#39;m crying all the time. I&amp;#39;m not having sex with my husband (mostly due to his disinterest). I am not much fun to be around. I feel like a terrible mother to my three year old. And to top it all off, I&amp;#39;m constantly thinking about how a beer or a joint or a Xanax might help relieve the pain in my chest long enough to help me take a deep breath. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do. I have six more months before I birth this kid. I don&amp;#39;t know if I, or my marriage can survive that long. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let me start by saying that my pregnancy was planned. My husband and I tried very hard for this baby, and the pregnancy is still something I want. This will be our second child. Depression is not something new for me. I have been depressed since I was a child. I have never been truly suicidal, but I have thought about it quite often at times. I have had no great tragedy happen in my life. Yes, I've lost people I love. Who hasn't. Yes, I was bullied as a kid. I'm not a kid any more, and that's not the center of my universe. I guess my point is, I believe I'm just hard wired to be depressed. \n\nI have not been on any antidepressants since I was in my early years of high school. I haven't needed to be. I have low points, but mostly, I function very well. I find joy in my son. I maintain relationships and am successful in my career. With this pregnancy, my depression has become profound. I'm sure some of this is related to hormone changes, though none of this happened with my first pregnancy. \n\nMy doctor recommended I go on an antidepressant. The thing is, I'm educated enough to have a pretty good idea of what the risks to my baby will be if I do. I can't justify to myself putting my baby at risk like that. \n\nSo therein lies the problem. I am thinking about suicide. I don't think I would ever pull the trigger, so to speak, but Jesus! It's not a good feeling to be thinking about it so much. I'm not sleeping. I'm crying all the time. I'm not having sex with my husband (mostly due to his disinterest). I am not much fun to be around. I feel like a terrible mother to my three year old. And to top it all off, I'm constantly thinking about how a beer or a joint or a Xanax might help relieve the pain in my chest long enough to help me take a deep breath. \n\nI don't know what to do. I have six more months before I birth this kid. I don't know if I, or my marriage can survive that long. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25c0qt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Swthrowawayduh", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25c0qt/pregnant_and_feeling_hopeless/", "name": "t3_25c0qt", "created": 1399896277.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25c0qt/pregnant_and_feeling_hopeless/", "author_flair_text": null, "title": "Pregnant and feeling hopeless", "created_utc": 1399867477.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfpwgi", "gilded": 0, "author": "Slyx", "parent_id": "t1_chfpr1q", "approved_by": null, "body": "Yeah, I can definitely relate to the denial thing. I didn't believe myself that depression or anxiety was a real thing until I actually experienced it myself - and, as someone currently taking an antidepressant for it, I completely understand why you don't want to take it during your pregnancy. \n\nBy chance, have you talked to a therapist at all about your depression? It may be something to think about looking into, someone who understands that it is a true disease and can be treated. \n\nDo you think that would be an option for you? It sounds to me like your husband truly loves you but just cannot 100% understand / believe / relate, etc - maybe this could be something to talk with a therapist, and then have your husband come with you to an appointment so the therapist can explain what you are going through - and the type of support you need from him during this time. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I can definitely relate to the denial thing. I didn&amp;#39;t believe myself that depression or anxiety was a real thing until I actually experienced it myself - and, as someone currently taking an antidepressant for it, I completely understand why you don&amp;#39;t want to take it during your pregnancy. &lt;/p&gt;\n\n&lt;p&gt;By chance, have you talked to a therapist at all about your depression? It may be something to think about looking into, someone who understands that it is a true disease and can be treated. &lt;/p&gt;\n\n&lt;p&gt;Do you think that would be an option for you? It sounds to me like your husband truly loves you but just cannot 100% understand / believe / relate, etc - maybe this could be something to talk with a therapist, and then have your husband come with you to an appointment so the therapist can explain what you are going through - and the type of support you need from him during this time. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c0qt", "score_hidden": false, "name": "t1_chfpwgi", "created": 1399898482.0, "author_flair_text": null, "created_utc": 1399869682.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfpr1q", "gilded": 0, "author": "Swthrowawayduh", "parent_id": "t1_chfpgfw", "approved_by": null, "body": "He's always been aware of my depression, and he's somewhat aware of my current situation. I say somewhat, because unless I'm actively having a meltdown in front of him, he convinces himself I'm fine. Denial's a funny thing. It took me nearly ten years to convince him that I wasn't just being dramatic, and I couldn't just decide to be happy. He supports me as best he can, but he's not really a source of comfort or advice for me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s always been aware of my depression, and he&amp;#39;s somewhat aware of my current situation. I say somewhat, because unless I&amp;#39;m actively having a meltdown in front of him, he convinces himself I&amp;#39;m fine. Denial&amp;#39;s a funny thing. It took me nearly ten years to convince him that I wasn&amp;#39;t just being dramatic, and I couldn&amp;#39;t just decide to be happy. He supports me as best he can, but he&amp;#39;s not really a source of comfort or advice for me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c0qt", "score_hidden": false, "name": "t1_chfpr1q", "created": 1399898047.0, "author_flair_text": null, "created_utc": 1399869247.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chfpgfw", "gilded": 0, "author": "Slyx", "parent_id": "t3_25c0qt", "approved_by": null, "body": "Hey there, \n\nI understand the despair you feel with your depression - while I'm a guy, I have read that it can be common during pregnancies due to all the hormonal changes, stresses, physical changes, and all of that. Try to focus on not the pain you are in right now, but the joy you will feel when your baby is born. I'm sure it will be so worth it. \n\nIs your husband aware of the way you feel right now? Do you think he would be understanding if you were to tell him? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there, &lt;/p&gt;\n\n&lt;p&gt;I understand the despair you feel with your depression - while I&amp;#39;m a guy, I have read that it can be common during pregnancies due to all the hormonal changes, stresses, physical changes, and all of that. Try to focus on not the pain you are in right now, but the joy you will feel when your baby is born. I&amp;#39;m sure it will be so worth it. &lt;/p&gt;\n\n&lt;p&gt;Is your husband aware of the way you feel right now? Do you think he would be understanding if you were to tell him? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c0qt", "score_hidden": false, "name": "t1_chfpgfw", "created": 1399897207.0, "author_flair_text": null, "created_utc": 1399868407.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfpypr", "gilded": 0, "author": "kittenkaboodlee", "parent_id": "t3_25c0qt", "approved_by": null, "body": "Hello! I think that it may be worth it to consider taking antidepressants. I don't know enough about them to recommend them, and it's obviously your choice whether you take them or not but if you don't think you can make it 6 months it might be a good idea. You can't leave your family behind and I know you'd regret it if you did.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello! I think that it may be worth it to consider taking antidepressants. I don&amp;#39;t know enough about them to recommend them, and it&amp;#39;s obviously your choice whether you take them or not but if you don&amp;#39;t think you can make it 6 months it might be a good idea. You can&amp;#39;t leave your family behind and I know you&amp;#39;d regret it if you did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c0qt", "score_hidden": false, "name": "t1_chfpypr", "created": 1399898666.0, "author_flair_text": null, "created_utc": 1399869866.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chft5m6", "gilded": 0, "author": "imaginaryannie", "parent_id": "t3_25c0qt", "approved_by": null, "body": "Aloha!\n\nI struggled with the idea of taking a medication that I knew would benefit me but could harm my baby, and the best course of action was for me to take the medication. I stayed on it until 24 weeks pregnant, and since I've gone off, I've started to get sick again (I have Crohn's Disease, so it's a medication for that), and I might be going back to the medication (I am 28 weeks pregnant now). Anyways, my point is, it can be really hard to balance what's good for you and what's good for baby. But a happy, healthy mama is best for baby. \n\nMaybe you could try a low dose of an antidepressant? If you don't have a tolerance for it now and haven't been on one (recently or ever), you might be able to get away with a dosage that keeps your sanity in tact and also doesn't make you fear for the development of your baby. Obviously, this is something you'd have to work out with your OB and Psych, but it's worth looking into.\n\nPregnancy hormones are very hard and overwhelming. If you're not a part of /r/babybumps, I definitely recommend it. Sometimes there are a few trolls that go through the sub, but it has been one of the most supportive, open subreddits I've ever been a part of.\n\nI hope you find something that works for you. Wishing you all the best for your growing family. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aloha!&lt;/p&gt;\n\n&lt;p&gt;I struggled with the idea of taking a medication that I knew would benefit me but could harm my baby, and the best course of action was for me to take the medication. I stayed on it until 24 weeks pregnant, and since I&amp;#39;ve gone off, I&amp;#39;ve started to get sick again (I have Crohn&amp;#39;s Disease, so it&amp;#39;s a medication for that), and I might be going back to the medication (I am 28 weeks pregnant now). Anyways, my point is, it can be really hard to balance what&amp;#39;s good for you and what&amp;#39;s good for baby. But a happy, healthy mama is best for baby. &lt;/p&gt;\n\n&lt;p&gt;Maybe you could try a low dose of an antidepressant? If you don&amp;#39;t have a tolerance for it now and haven&amp;#39;t been on one (recently or ever), you might be able to get away with a dosage that keeps your sanity in tact and also doesn&amp;#39;t make you fear for the development of your baby. Obviously, this is something you&amp;#39;d have to work out with your OB and Psych, but it&amp;#39;s worth looking into.&lt;/p&gt;\n\n&lt;p&gt;Pregnancy hormones are very hard and overwhelming. If you&amp;#39;re not a part of &lt;a href=\"/r/babybumps\"&gt;/r/babybumps&lt;/a&gt;, I definitely recommend it. Sometimes there are a few trolls that go through the sub, but it has been one of the most supportive, open subreddits I&amp;#39;ve ever been a part of.&lt;/p&gt;\n\n&lt;p&gt;I hope you find something that works for you. Wishing you all the best for your growing family. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25c0qt", "score_hidden": false, "name": "t1_chft5m6", "created": 1399911371.0, "author_flair_text": null, "created_utc": 1399882571.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]