[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, this is probably better to ask &lt;a href=\"/r/science\"&gt;/r/science&lt;/a&gt;, or &lt;a href=\"/r/askscience\"&gt;/r/askscience&lt;/a&gt;, but I&amp;#39;m guessing no one would answer or the text may get deleted. I live near a very large medical district with several hospitals, universities/research institutions, so I am guessing my cadaver will be put to use somewhere nearby as an organ donor. Hopefully in a transfusion, but I&amp;#39;m all for the betterment of medical research. I&amp;#39;m going to make necessary personal arrangements so everything is neat like cleaning out my room, placing it all in a prepaid Uhaul (so my mom can move everything or sell the rest of my belongings at a garage sale or whatever) giving away personal possessions to charities and hospitals. Maybe I&amp;#39;ll give the keys to my car to some lucky guy at the VA hospital. Anyway, this is going to take place a little while after I am due to donate blood for the very last time. I&amp;#39;m O negative, so I am guessing by the time they find out I&amp;#39;m dead, it will have already made it&amp;#39;s way into a patient. My job has to do with blood donation, so once they find out, I am sure they are going to try and recall it as fast as possible. I&amp;#39;m not looking to sabotage it in any way, but dying under such circumstances might trigger some sort of recall mandated by the FDA.) I figure two days after I donate should be enough time. If there is some sort of a higher being I have to answer to, I can at least say I tried to help someone else before I shot myself. &lt;/p&gt;\n\n&lt;p&gt;One thing I keep hearing about is how suicide is a selfish act. I&amp;#39;m single, no kids, just my mom and dad who are divorced and my sister. No one really to leave behind. My dad is remarried, my mom is probably going to find another asshole to emotionally abuse her, and my sister is a writing major. Maybe this will give my sister an exclusive story or inspiration for a best selling book, because I know she probably won&amp;#39;t find anything else worthwhile in that field. I&amp;#39;m sick with alcoholism thanks to my dad, (Yes I tried al-anon/alateen, yes I tried AA, yes I saw a shrink last month, yes I told her I have suicidal thoughts and no, nothing she told me helped. I even tried volunteering at the nearby cancer hospital in hopes of replacing my desire to drink with some altruism. Didn&amp;#39;t work.) I also have dysthymia, and I&amp;#39;m just not someone who should ever reproduce. I have abused former girlfriends just like my dad emotionally abused my mom, and it&amp;#39;s just a part of me. I owe it to my mom to give her a kick ass Mother&amp;#39;s Day with how much my dad shit on her and how much crap I have put her through growing up, so I guess that will be my final adieu to my mom and sister. I just hate the alcoholic, the abuser, and the asshole part of who I am and I do not want to turn in to my dad or have fucked up kids with my disorder(s) or my alcoholism. &lt;/p&gt;\n\n&lt;p&gt;I really would like my organs to go to someone though. I&amp;#39;m at an age where my heart may still be of use (25) as well as my kidneys, &lt;em&gt;maybe&lt;/em&gt; my liver, as well as intestines. I read the website where you go to register, and it states: &lt;em&gt;&amp;quot;Importantly, most people don’t die in a way that makes them eligible for organ/tissue donation…but we hope everyone registers, just in case. If a person dies in a way that does not allow for donation, then the family would need to contact the funeral home or willed body program to have the body transported there.&amp;quot;&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;So SW, does shooting yourself in the head make you eligible? Do I need to fill my tub up full of ice and do it there? Will that lower my body temperature enough? Or do I need to die in another manner inline with their requirements? Would anyone happen to know what those are for a deceased organ donor? I also have had high blood pressure for the past 3 years, would that also affect me being able to donate organs? And, would donating double red blood cells affect organ donation? I&amp;#39;ve heard your body replenishes the blood within hours of donating, but the time to stabilize your body chemistry is fucked up for a few weeks. If this is true, I guess I&amp;#39;ll have to wait longer. I&amp;#39;m kind of young and up until last year was somewhat physically active. I&amp;#39;m probably going to end up wrapping my lips around the muzzle that is pointed towards the back of my head in hopes of severing the brain stem with 00 buck. &lt;/p&gt;\n\n&lt;p&gt;If suicide does in fact rule out organ donation, I suppose I will have to get clever. I really don&amp;#39;t want to have to have a police officer do it, I&amp;#39;m afraid of falling from heights, I drive a pretty heavy and somewhat safe car, and I don&amp;#39;t know if people will buy me accidentally overdosing. I guess there is always drowning, but I don&amp;#39;t know if I will get to the hospital in time, if drowning in a chlorine pool affects my organ donation, or what. Too many factors come into play. But I guess I will cross that bridge if I have to get to it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, this is probably better to ask /r/science, or /r/askscience, but I'm guessing no one would answer or the text may get deleted. I live near a very large medical district with several hospitals, universities/research institutions, so I am guessing my cadaver will be put to use somewhere nearby as an organ donor. Hopefully in a transfusion, but I'm all for the betterment of medical research. I'm going to make necessary personal arrangements so everything is neat like cleaning out my room, placing it all in a prepaid Uhaul (so my mom can move everything or sell the rest of my belongings at a garage sale or whatever) giving away personal possessions to charities and hospitals. Maybe I'll give the keys to my car to some lucky guy at the VA hospital. Anyway, this is going to take place a little while after I am due to donate blood for the very last time. I'm O negative, so I am guessing by the time they find out I'm dead, it will have already made it's way into a patient. My job has to do with blood donation, so once they find out, I am sure they are going to try and recall it as fast as possible. I'm not looking to sabotage it in any way, but dying under such circumstances might trigger some sort of recall mandated by the FDA.) I figure two days after I donate should be enough time. If there is some sort of a higher being I have to answer to, I can at least say I tried to help someone else before I shot myself. \n\nOne thing I keep hearing about is how suicide is a selfish act. I'm single, no kids, just my mom and dad who are divorced and my sister. No one really to leave behind. My dad is remarried, my mom is probably going to find another asshole to emotionally abuse her, and my sister is a writing major. Maybe this will give my sister an exclusive story or inspiration for a best selling book, because I know she probably won't find anything else worthwhile in that field. I'm sick with alcoholism thanks to my dad, (Yes I tried al-anon/alateen, yes I tried AA, yes I saw a shrink last month, yes I told her I have suicidal thoughts and no, nothing she told me helped. I even tried volunteering at the nearby cancer hospital in hopes of replacing my desire to drink with some altruism. Didn't work.) I also have dysthymia, and I'm just not someone who should ever reproduce. I have abused former girlfriends just like my dad emotionally abused my mom, and it's just a part of me. I owe it to my mom to give her a kick ass Mother's Day with how much my dad shit on her and how much crap I have put her through growing up, so I guess that will be my final adieu to my mom and sister. I just hate the alcoholic, the abuser, and the asshole part of who I am and I do not want to turn in to my dad or have fucked up kids with my disorder(s) or my alcoholism. \n\nI really would like my organs to go to someone though. I'm at an age where my heart may still be of use (25) as well as my kidneys, *maybe* my liver, as well as intestines. I read the website where you go to register, and it states: *\"Importantly, most people don’t die in a way that makes them eligible for organ/tissue donation…but we hope everyone registers, just in case. If a person dies in a way that does not allow for donation, then the family would need to contact the funeral home or willed body program to have the body transported there.\"* \n\nSo SW, does shooting yourself in the head make you eligible? Do I need to fill my tub up full of ice and do it there? Will that lower my body temperature enough? Or do I need to die in another manner inline with their requirements? Would anyone happen to know what those are for a deceased organ donor? I also have had high blood pressure for the past 3 years, would that also affect me being able to donate organs? And, would donating double red blood cells affect organ donation? I've heard your body replenishes the blood within hours of donating, but the time to stabilize your body chemistry is fucked up for a few weeks. If this is true, I guess I'll have to wait longer. I'm kind of young and up until last year was somewhat physically active. I'm probably going to end up wrapping my lips around the muzzle that is pointed towards the back of my head in hopes of severing the brain stem with 00 buck. \n\nIf suicide does in fact rule out organ donation, I suppose I will have to get clever. I really don't want to have to have a police officer do it, I'm afraid of falling from heights, I drive a pretty heavy and somewhat safe car, and I don't know if people will buy me accidentally overdosing. I guess there is always drowning, but I don't know if I will get to the hospital in time, if drowning in a chlorine pool affects my organ donation, or what. Too many factors come into play. But I guess I will cross that bridge if I have to get to it. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245wc0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway24560000", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 5, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245wc0/probably_going_to_shoot_myself_with_my_870_next/", "name": "t3_245wc0", "created": 1398689829.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245wc0/probably_going_to_shoot_myself_with_my_870_next/", "author_flair_text": null, "title": "Probably going to shoot myself with my 870 next month, few things I guess I should try and figure out.", "created_utc": 1398661029.0, "ups": 8, "num_comments": 17, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3zk7r", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch3ywbm", "approved_by": null, "body": "&gt;To be a productive member of society? To make the world a better place for others? You want to select yourself out of existence, rather than make conscientious changes. OK- I get that. But I don't agree with it.\n\nIt's all over rated. Everything about being a good person is over rated and under appreciated. And it certainly isn't valued. Especially not by women. All of my worth as a man, is gone. Just last week, my roommate (brother of my landlord) had me *help* him for about an hour and a half with putting up a whiteboard in his room which used to be my room until he decided to move in. Because I know if I don't, he is probably going to elect to have me evicted under some kind of bullshit. And since I am not under any kind of lease right now, I don't even know my rights as a month to month tenant. He knows that I am a weak male who can't say no. He sees me as a beta introvert and I can't help it to stand up for myself because he knows that I know the political repercussions that he can use with his big brother who owns this place. Even though I have enough guns and ammunition to arm 6 people. Even after four years and two tours to Qatar and the UAE while in the Air Force. Even after riding my bike through 6 months of Texas heat when my shitty car broke down and I couldn't afford to fix it. Even after I rode 32 miles in August heat after donating blood just to see if I could do it without passing out. I have had that strength push through obstacles it in the past but now I am just a has been loser who does what he's asked to do. Even in my own dwelling. Even with my former roommate, I was too fucking polite because I didn't want to hurt his feelings or make things uncomfortable when the rent was late, or when he threw up on the carpet for drinking too much. Or when he took 2 weeks to move all his shit out and the new roommate (landlord's brother) was trying to move in. Or even when I let his teenage brother (against the terms of my lease at the time) stay the whole summer rent free because I was sympathetic to his summer internship near the apartment. And that I almost got him a job at my employer for some stupid reason. And for that I just got a thanks. \"Thanks bro! See ya later man!\" Because when it is all said and done, I'm still a bitch. There is not a worse feeling than knowing you have been taken advantage of by people you should not have trusted.  \n\n&gt;EMS is rougher. Every day, young women and men that tried to kill themselves, some cries for help, others that were more sincere. We had one young man who would have died were it not for the absence of a good industrial arts program at his school; his pants were all wet, but the nurse told us ahead of time it was because he tried to pull a toaster into the tub with him. We wheeled him out of the room to take him to an appropriate facility for psychiatric evaluation, and the second we got outside and away from staff, I asked him, \"I gotta know: did you realize the GFCI was going to save your life?\n\nI won't say I know, because I don't. I was a first responder in the Air Force and I might not have seen anything truly traumatizing in my time, if there is one thing I did learn, is that shots to the brain usually work. Not always, but usually. \n\n&gt;Sounds like you don't have a lot of ties. If you have the resources, get out of the house. Clear your mind. Take two weeks, find some national forest and hole up somewhere west of the Mississippi, away from frickin' everyone for as long as you can afford. I have a tent I can loan you. Four walls, a roof, and a computer monitor 8+ hours a day does a lot of damage, particularly if you're depressed.\n\nDude, I've tried. I really have. A few years ago, that was twenty mile bike rides in the summer heat with a friend I met at the grocery store. Then we would go rock climbing and just hang out, talk, drink. Then I got a job with a different schedule than his. And slowly but surely, our friendship deteriorated into Google talk and the occasional text message. Since then he has sold his bike as we work different schedules and he just doesn't care to ride anymore. \n\n&gt;Just as friendly advice- no, I don't know where you're coming from. I can't relate. But I've seen it a thousand times. I'm guessing you're mid-20s. I wish I knew what it was and what the reset button was, but I don't and it pains me because it's like watching a freight train derail in slow motion. People change; you can change, and you can make a conscious choice to be the person you want to be.\n\nI am mid twenties. Precisely. I don't know where the reset button is either, but sometimes machines are dangerous or don't work the way they are supposed to and need to be thrown away to keep others safe. \n\nedit: added a bit more from my former roommate", "edited": 1398674484.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;To be a productive member of society? To make the world a better place for others? You want to select yourself out of existence, rather than make conscientious changes. OK- I get that. But I don&amp;#39;t agree with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s all over rated. Everything about being a good person is over rated and under appreciated. And it certainly isn&amp;#39;t valued. Especially not by women. All of my worth as a man, is gone. Just last week, my roommate (brother of my landlord) had me &lt;em&gt;help&lt;/em&gt; him for about an hour and a half with putting up a whiteboard in his room which used to be my room until he decided to move in. Because I know if I don&amp;#39;t, he is probably going to elect to have me evicted under some kind of bullshit. And since I am not under any kind of lease right now, I don&amp;#39;t even know my rights as a month to month tenant. He knows that I am a weak male who can&amp;#39;t say no. He sees me as a beta introvert and I can&amp;#39;t help it to stand up for myself because he knows that I know the political repercussions that he can use with his big brother who owns this place. Even though I have enough guns and ammunition to arm 6 people. Even after four years and two tours to Qatar and the UAE while in the Air Force. Even after riding my bike through 6 months of Texas heat when my shitty car broke down and I couldn&amp;#39;t afford to fix it. Even after I rode 32 miles in August heat after donating blood just to see if I could do it without passing out. I have had that strength push through obstacles it in the past but now I am just a has been loser who does what he&amp;#39;s asked to do. Even in my own dwelling. Even with my former roommate, I was too fucking polite because I didn&amp;#39;t want to hurt his feelings or make things uncomfortable when the rent was late, or when he threw up on the carpet for drinking too much. Or when he took 2 weeks to move all his shit out and the new roommate (landlord&amp;#39;s brother) was trying to move in. Or even when I let his teenage brother (against the terms of my lease at the time) stay the whole summer rent free because I was sympathetic to his summer internship near the apartment. And that I almost got him a job at my employer for some stupid reason. And for that I just got a thanks. &amp;quot;Thanks bro! See ya later man!&amp;quot; Because when it is all said and done, I&amp;#39;m still a bitch. There is not a worse feeling than knowing you have been taken advantage of by people you should not have trusted.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;EMS is rougher. Every day, young women and men that tried to kill themselves, some cries for help, others that were more sincere. We had one young man who would have died were it not for the absence of a good industrial arts program at his school; his pants were all wet, but the nurse told us ahead of time it was because he tried to pull a toaster into the tub with him. We wheeled him out of the room to take him to an appropriate facility for psychiatric evaluation, and the second we got outside and away from staff, I asked him, &amp;quot;I gotta know: did you realize the GFCI was going to save your life?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I won&amp;#39;t say I know, because I don&amp;#39;t. I was a first responder in the Air Force and I might not have seen anything truly traumatizing in my time, if there is one thing I did learn, is that shots to the brain usually work. Not always, but usually. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sounds like you don&amp;#39;t have a lot of ties. If you have the resources, get out of the house. Clear your mind. Take two weeks, find some national forest and hole up somewhere west of the Mississippi, away from frickin&amp;#39; everyone for as long as you can afford. I have a tent I can loan you. Four walls, a roof, and a computer monitor 8+ hours a day does a lot of damage, particularly if you&amp;#39;re depressed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dude, I&amp;#39;ve tried. I really have. A few years ago, that was twenty mile bike rides in the summer heat with a friend I met at the grocery store. Then we would go rock climbing and just hang out, talk, drink. Then I got a job with a different schedule than his. And slowly but surely, our friendship deteriorated into Google talk and the occasional text message. Since then he has sold his bike as we work different schedules and he just doesn&amp;#39;t care to ride anymore. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just as friendly advice- no, I don&amp;#39;t know where you&amp;#39;re coming from. I can&amp;#39;t relate. But I&amp;#39;ve seen it a thousand times. I&amp;#39;m guessing you&amp;#39;re mid-20s. I wish I knew what it was and what the reset button was, but I don&amp;#39;t and it pains me because it&amp;#39;s like watching a freight train derail in slow motion. People change; you can change, and you can make a conscious choice to be the person you want to be.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I am mid twenties. Precisely. I don&amp;#39;t know where the reset button is either, but sometimes machines are dangerous or don&amp;#39;t work the way they are supposed to and need to be thrown away to keep others safe. &lt;/p&gt;\n\n&lt;p&gt;edit: added a bit more from my former roommate&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3zk7r", "created": 1398675362.0, "author_flair_text": null, "created_utc": 1398671762.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch3ywbm", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3yei1", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3ywbm", "created": 1398672015.0, "author_flair_text": null, "created_utc": 1398668415.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3yei1", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch3y4bw", "approved_by": null, "body": "Well, tell your dad I said thank you. Your dad and his comrades are some really tough people to get through what they went through. If you haven't seen the Chosin Reservoir documentary, I highly recommend it. \n\n&gt;do you feel your current situation is caused or made worse by your time in the service?\n\nI attempted suicide once when I was 16 after getting bullied. Downed a whole bottle of melatonin thinking it would kill me. I also called the suicide hotline while I was in and was put in the Do Not Arm list for a little while. I managed to figure out a way to not try to kill myself for six years and here I am. I used some of the GI Bill, realized school wasn't for me and that I'm not competent as a business major or as a boyfriend. \n\n&gt;Even then, there's no law that says you have to have kids.\n\nThen what exactly is my worth here if I am not going to reproduce? I know I don't like living alone, and I know I am at risk to abusing an SO. So even then, I'd still rather not subject that person to any predisposition I may have. \n\nWith that being said, thank you for sticking your neck out as a firefighter. Some of us do appreciate the work you guys and girls do everyday. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, tell your dad I said thank you. Your dad and his comrades are some really tough people to get through what they went through. If you haven&amp;#39;t seen the Chosin Reservoir documentary, I highly recommend it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;do you feel your current situation is caused or made worse by your time in the service?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I attempted suicide once when I was 16 after getting bullied. Downed a whole bottle of melatonin thinking it would kill me. I also called the suicide hotline while I was in and was put in the Do Not Arm list for a little while. I managed to figure out a way to not try to kill myself for six years and here I am. I used some of the GI Bill, realized school wasn&amp;#39;t for me and that I&amp;#39;m not competent as a business major or as a boyfriend. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even then, there&amp;#39;s no law that says you have to have kids.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then what exactly is my worth here if I am not going to reproduce? I know I don&amp;#39;t like living alone, and I know I am at risk to abusing an SO. So even then, I&amp;#39;d still rather not subject that person to any predisposition I may have. &lt;/p&gt;\n\n&lt;p&gt;With that being said, thank you for sticking your neck out as a firefighter. Some of us do appreciate the work you guys and girls do everyday. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3yei1", "created": 1398695122.0, "author_flair_text": null, "created_utc": 1398666322.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch3y4bw", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3xr11", "approved_by": null, "body": "&gt;If you call the Air Force a branch of the military, yes.\n\nWell, sure. My father was a Korean war vet, USAF.\n\nI don't know what I can do to change your mind other than to say there have been many people brought up with a world of shit on their shoulders, with horrible parents- and turned that around to have good kids, because they *made the choice* not to be like that themselves. Even then, there's no law that says you have to have kids.\n\nFirefighter/EMT here- do you feel your current situation is caused or made worse by your time in the service?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you call the Air Force a branch of the military, yes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, sure. My father was a Korean war vet, USAF.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I can do to change your mind other than to say there have been many people brought up with a world of shit on their shoulders, with horrible parents- and turned that around to have good kids, because they &lt;em&gt;made the choice&lt;/em&gt; not to be like that themselves. Even then, there&amp;#39;s no law that says you have to have kids.&lt;/p&gt;\n\n&lt;p&gt;Firefighter/EMT here- do you feel your current situation is caused or made worse by your time in the service?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3y4bw", "created": 1398694028.0, "author_flair_text": null, "created_utc": 1398665228.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3xr11", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch3xck4", "approved_by": null, "body": "&gt;Hey. Are y'all a veteran?\n\nIf you call the Air Force a branch of the military, yes. \n\n&gt;You have the option of changing that environment for your kids.\n\nEveryone has an option. Do I have the option and ability to do otherwise? Yes. Though I'd rather not expose any offspring I have to that risk of me acting and behaving how I was inadvertently nurtured to become. It's better for me to end the line with one life and prevent my kids, or their kids, or maybe even their kids, to my genes. Who knows how many other lives I am helping save by ending my own. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hey. Are y&amp;#39;all a veteran?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you call the Air Force a branch of the military, yes. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You have the option of changing that environment for your kids.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Everyone has an option. Do I have the option and ability to do otherwise? Yes. Though I&amp;#39;d rather not expose any offspring I have to that risk of me acting and behaving how I was inadvertently nurtured to become. It&amp;#39;s better for me to end the line with one life and prevent my kids, or their kids, or maybe even their kids, to my genes. Who knows how many other lives I am helping save by ending my own. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3xr11", "created": 1398692672.0, "author_flair_text": null, "created_utc": 1398663872.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3xck4", "gilded": 0, "author": "[deleted]", "parent_id": "t3_245wc0", "approved_by": null, "body": "&gt;Maybe I'll give the keys to my car to some lucky guy at the VA hospital. \n\nHey. Are y'all a veteran?\n\nCould you please give the suicide hotline a chance? 1-800-273-8255\n\nTo answer your question, a death investigation may preclude the opportunity for your organs to be used for transplant.\n\n&gt;I just hate the alcoholic, the abuser, and the asshole part of who I am and I do not want to turn in to my dad or have fucked up kids with my disorder(s) or my alcoholism. \n\nYou are a product of your genes and your environment. You have the option of changing that environment for your kids.\n\nYou also have the option of exploring alternatives to alcoholism- therapy, medication, \"alternative\" modalities such as [ibogaine](http://en.wikipedia.org/wiki/Ibogaine)- and for depression, including [ayahuasca.](http://en.wikipedia.org/wiki/Ayahuasca)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Maybe I&amp;#39;ll give the keys to my car to some lucky guy at the VA hospital. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hey. Are y&amp;#39;all a veteran?&lt;/p&gt;\n\n&lt;p&gt;Could you please give the suicide hotline a chance? 1-800-273-8255&lt;/p&gt;\n\n&lt;p&gt;To answer your question, a death investigation may preclude the opportunity for your organs to be used for transplant.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I just hate the alcoholic, the abuser, and the asshole part of who I am and I do not want to turn in to my dad or have fucked up kids with my disorder(s) or my alcoholism. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are a product of your genes and your environment. You have the option of changing that environment for your kids.&lt;/p&gt;\n\n&lt;p&gt;You also have the option of exploring alternatives to alcoholism- therapy, medication, &amp;quot;alternative&amp;quot; modalities such as &lt;a href=\"http://en.wikipedia.org/wiki/Ibogaine\"&gt;ibogaine&lt;/a&gt;- and for depression, including &lt;a href=\"http://en.wikipedia.org/wiki/Ayahuasca\"&gt;ayahuasca.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3xck4", "created": 1398691348.0, "author_flair_text": null, "created_utc": 1398662548.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3y6lp", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch3xhnt", "approved_by": null, "body": "&gt;The most valuable organ donators have suffered brain death but are still physically in one piece.\n\nThe brain stem also helps regulate respiratory and cardiac function. Other than blowing a hole through my heart, it's the one place in me I can shoot and have a guarantee of death. \n\n&gt;Even more valuable still are living, breathing, thinking human beings who really want the world to be a better place. There is a shortage. You will be needed.\n\nNo. I'm not needed. I don't wake up in the morning with missed calls saying how much the world needs me. The only thing worthy I have to realistically offer this world is my fucking blood. A bunch of red blood cells with 0 antibodies. That is my worth to people. And even then I am just a number. Even with my own company who I donate blood through. I get a thank you call and a \"Hey, would you like to come get punctured for your life giving nectar by some inexperienced phlebotomist who can navigate your veins about as well as Hellen Keller can parallel park? Great! See you Wednesday!\" Just so I can put blood into a bag and have that bag go off to whoever needs it. For all I know, the recipient is some lifer doing time in Huntsville who got himself knifed. If I had some control over who I gave to, maybe I would have chosen to stick around a little while longer. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The most valuable organ donators have suffered brain death but are still physically in one piece.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The brain stem also helps regulate respiratory and cardiac function. Other than blowing a hole through my heart, it&amp;#39;s the one place in me I can shoot and have a guarantee of death. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even more valuable still are living, breathing, thinking human beings who really want the world to be a better place. There is a shortage. You will be needed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. I&amp;#39;m not needed. I don&amp;#39;t wake up in the morning with missed calls saying how much the world needs me. The only thing worthy I have to realistically offer this world is my fucking blood. A bunch of red blood cells with 0 antibodies. That is my worth to people. And even then I am just a number. Even with my own company who I donate blood through. I get a thank you call and a &amp;quot;Hey, would you like to come get punctured for your life giving nectar by some inexperienced phlebotomist who can navigate your veins about as well as Hellen Keller can parallel park? Great! See you Wednesday!&amp;quot; Just so I can put blood into a bag and have that bag go off to whoever needs it. For all I know, the recipient is some lifer doing time in Huntsville who got himself knifed. If I had some control over who I gave to, maybe I would have chosen to stick around a little while longer. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3y6lp", "created": 1398694264.0, "author_flair_text": null, "created_utc": 1398665464.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3xhnt", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_245wc0", "approved_by": null, "body": "The most valuable organ donators have suffered brain death but are still physically in one piece.\n\nEven more valuable still are living, breathing, thinking human beings who really want the world to be a better place. There is a shortage. You will be needed.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The most valuable organ donators have suffered brain death but are still physically in one piece.&lt;/p&gt;\n\n&lt;p&gt;Even more valuable still are living, breathing, thinking human beings who really want the world to be a better place. There is a shortage. You will be needed.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3xhnt", "created": 1398691800.0, "author_flair_text": null, "created_utc": 1398663000.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4wl9r", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch4w7sc", "approved_by": null, "body": "&gt;Well having that record is inconceivably better than dying.\n\nIs it really? Have you ever died before? \n\nI guess it was silly of me to think you would answer that question about whether or not my organs would be refused. You aren't going to talk me down from it, it's going to happen. I'm keeping a pistol in my car if by chance my plan is found out and I have to off myself to prevent being taken into custody, I'll just have to do it at that moment. The only difference here is by you not telling me how I can donate some of my organs, you are potentially disappointing an otherwise willing and ready recipient. And having volunteered at a hospital, kids and otherwise good people die every day in hospitals because they don't receive the organs they need in time. \n\n&gt; since I travel through America on business a lot could you recommend a good place to eat in Texas?\n\nwhataburger is the staple fast food burger joint in Texas. I live in Houston, so a lot of the better restaurants are exclusive to just the city, but you also can't go wrong with tex mex. I'd recommend eating at establishments inside Hispanic parts of the city for the authentic food that hasn't been white washed. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well having that record is inconceivably better than dying.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is it really? Have you ever died before? &lt;/p&gt;\n\n&lt;p&gt;I guess it was silly of me to think you would answer that question about whether or not my organs would be refused. You aren&amp;#39;t going to talk me down from it, it&amp;#39;s going to happen. I&amp;#39;m keeping a pistol in my car if by chance my plan is found out and I have to off myself to prevent being taken into custody, I&amp;#39;ll just have to do it at that moment. The only difference here is by you not telling me how I can donate some of my organs, you are potentially disappointing an otherwise willing and ready recipient. And having volunteered at a hospital, kids and otherwise good people die every day in hospitals because they don&amp;#39;t receive the organs they need in time. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;since I travel through America on business a lot could you recommend a good place to eat in Texas?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;whataburger is the staple fast food burger joint in Texas. I live in Houston, so a lot of the better restaurants are exclusive to just the city, but you also can&amp;#39;t go wrong with tex mex. I&amp;#39;d recommend eating at establishments inside Hispanic parts of the city for the authentic food that hasn&amp;#39;t been white washed. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch4wl9r", "created": 1398789323.0, "author_flair_text": null, "created_utc": 1398760523.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4w7sc", "gilded": 0, "author": "benzidrine", "parent_id": "t1_ch4e5sw", "approved_by": null, "body": "&gt; I've tried it. And I'm not going to a call a hotline, and I'm definitely not telling a counselour my plan, because I think we all know where I will end up and what will always be on my record.\n\nWell having that record is inconceivably better than dying. I know people that have been institutionalized for serious psychosis that are now doing fine with jobs, one of them is rich. \n\nWhat I want to tell you is that the mind isn't static. It is always changing so that there is always hope of feeling better. No one including you can tell if you will be the same person in five years time. My life has changed radically in the last five years and before that I thought I was destined to be pretty horrible human being. I was sexually abused and my father was drinking constantly as a kid and I grew up angry even a touch of a monster. I became a gang associate been in the drug trade but now I'm educated and honestly doing well. When I was 15+ all I wanted to do was make people fear me because of the fear I lived with internally. I silenced internal anxiety by creating anxiety in others and I became good at doing it. Yet if you met people today they would be amazed that was my past because I help people out. I tell people about my past and I can see they genuinely don't believe it because that is not who I am today. \n\nI think you can do it too because as I said the mind isn't static and set one way for life. People really can improve, I have seen it and lived it. I think you should at least give it till you are 30. Because imagine if the future you that you will be killing would have looked back with regret at what you are planning. I tried to commit suicide twice and I look back now and just shake my head at where my mind was back then. \n\n&gt;Because getting verification from a girl that I am not someone to be desired to talk to is my low point. That is what I know will put me under. Maybe print out all my grades from the past year and leave that on my desk to look at when \n\nYeah the dating scene can be tough but you have a lot to offer. If your not having success that is likely a reflection of where your mind is at right now. I was a virgin until something like 22, never even had a girlfriend, never been kissed man. After a couple more years I had more relationships then I could count and was literally having to avoid certain girls because the attention was overwhelming. I am not what you would say is an attractive person either (virgin at 22 remember) we men have it lucky and unlucky in a way, it isn't how we are physically that means much but how we are mentally that attracts women.  \n\nI flunked out of high school at 15 (kind of expelled) and now I am studying honours at university with a view to do a doctorate. As I said the mind isn't static. Also when I was about 20 I finished an intro 6 month electrical college program at bottom of the class being the only person to fail the final and have to retake it. This was vocational stuff too. A big company came and hired every graduate but me. People can change, I did.\n\n---\n\nI want to finish on a happier note which seems a bit weird here I guess but you can find happiness anywhere, so while I'm not American since I travel through America on business a lot could you recommend a good place to eat in Texas?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve tried it. And I&amp;#39;m not going to a call a hotline, and I&amp;#39;m definitely not telling a counselour my plan, because I think we all know where I will end up and what will always be on my record.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well having that record is inconceivably better than dying. I know people that have been institutionalized for serious psychosis that are now doing fine with jobs, one of them is rich. &lt;/p&gt;\n\n&lt;p&gt;What I want to tell you is that the mind isn&amp;#39;t static. It is always changing so that there is always hope of feeling better. No one including you can tell if you will be the same person in five years time. My life has changed radically in the last five years and before that I thought I was destined to be pretty horrible human being. I was sexually abused and my father was drinking constantly as a kid and I grew up angry even a touch of a monster. I became a gang associate been in the drug trade but now I&amp;#39;m educated and honestly doing well. When I was 15+ all I wanted to do was make people fear me because of the fear I lived with internally. I silenced internal anxiety by creating anxiety in others and I became good at doing it. Yet if you met people today they would be amazed that was my past because I help people out. I tell people about my past and I can see they genuinely don&amp;#39;t believe it because that is not who I am today. &lt;/p&gt;\n\n&lt;p&gt;I think you can do it too because as I said the mind isn&amp;#39;t static and set one way for life. People really can improve, I have seen it and lived it. I think you should at least give it till you are 30. Because imagine if the future you that you will be killing would have looked back with regret at what you are planning. I tried to commit suicide twice and I look back now and just shake my head at where my mind was back then. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because getting verification from a girl that I am not someone to be desired to talk to is my low point. That is what I know will put me under. Maybe print out all my grades from the past year and leave that on my desk to look at when &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah the dating scene can be tough but you have a lot to offer. If your not having success that is likely a reflection of where your mind is at right now. I was a virgin until something like 22, never even had a girlfriend, never been kissed man. After a couple more years I had more relationships then I could count and was literally having to avoid certain girls because the attention was overwhelming. I am not what you would say is an attractive person either (virgin at 22 remember) we men have it lucky and unlucky in a way, it isn&amp;#39;t how we are physically that means much but how we are mentally that attracts women.  &lt;/p&gt;\n\n&lt;p&gt;I flunked out of high school at 15 (kind of expelled) and now I am studying honours at university with a view to do a doctorate. As I said the mind isn&amp;#39;t static. Also when I was about 20 I finished an intro 6 month electrical college program at bottom of the class being the only person to fail the final and have to retake it. This was vocational stuff too. A big company came and hired every graduate but me. People can change, I did.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I want to finish on a happier note which seems a bit weird here I guess but you can find happiness anywhere, so while I&amp;#39;m not American since I travel through America on business a lot could you recommend a good place to eat in Texas?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch4w7sc", "created": 1398787170.0, "author_flair_text": null, "created_utc": 1398758370.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4e5sw", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch40e04", "approved_by": null, "body": "Then I'll have to drive out in front of an ER and do this. I live in Harris County, TX so yeah, if you could tell me if it's refused that would be a huge help. \n\nI'm not justifying organ donation for my suicide. I've already made the personal justification to myself. Though since suicide in itself is selfish, I'm going to try and  make it so that it wasn't as selfish. So that anyone aware of the circumstance can say, well, not all was lost. Some kid got a heart, and another got a kidney, so a piece of me is out there somewhere still trying to help. \n\n&gt;An easier more reliable solution is that you get some help and find a way out of this. We've already established you are a good person by the thought you put into this so you are certainly worthwhile and deserve to live. \n\nI've tried it. And I'm not going to a call a hotline, and I'm definitely not telling a counselour my plan, because I think we all know where I will end up and what will always be on my record. \n\n&gt;This really interests me. That you suggested this, if you go to a bar depressed enough to commit suicide do you truly believe you could abstain from alcohol?\n\nBecause getting verification from a girl that I am not someone to be desired to talk to is my low point. That is what I know will put me under. Maybe print out all my grades from the past year and leave that on my desk to look at when I get home to further lower my self worth and seal the deal. If I'm going to do it sober, I'll have to trick myself into putting myself into that self destructive state of mind. I can abstain from alcohol for a few days or even a week if need be. I'm not physically dependent. Especially if I'm driving afterwards. I've seen enough DUI's and the repercussions of them to know that I can't risk it. ", "edited": 1398718243.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then I&amp;#39;ll have to drive out in front of an ER and do this. I live in Harris County, TX so yeah, if you could tell me if it&amp;#39;s refused that would be a huge help. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not justifying organ donation for my suicide. I&amp;#39;ve already made the personal justification to myself. Though since suicide in itself is selfish, I&amp;#39;m going to try and  make it so that it wasn&amp;#39;t as selfish. So that anyone aware of the circumstance can say, well, not all was lost. Some kid got a heart, and another got a kidney, so a piece of me is out there somewhere still trying to help. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An easier more reliable solution is that you get some help and find a way out of this. We&amp;#39;ve already established you are a good person by the thought you put into this so you are certainly worthwhile and deserve to live. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve tried it. And I&amp;#39;m not going to a call a hotline, and I&amp;#39;m definitely not telling a counselour my plan, because I think we all know where I will end up and what will always be on my record. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This really interests me. That you suggested this, if you go to a bar depressed enough to commit suicide do you truly believe you could abstain from alcohol?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because getting verification from a girl that I am not someone to be desired to talk to is my low point. That is what I know will put me under. Maybe print out all my grades from the past year and leave that on my desk to look at when I get home to further lower my self worth and seal the deal. If I&amp;#39;m going to do it sober, I&amp;#39;ll have to trick myself into putting myself into that self destructive state of mind. I can abstain from alcohol for a few days or even a week if need be. I&amp;#39;m not physically dependent. Especially if I&amp;#39;m driving afterwards. I&amp;#39;ve seen enough DUI&amp;#39;s and the repercussions of them to know that I can&amp;#39;t risk it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch4e5sw", "created": 1398743968.0, "author_flair_text": null, "created_utc": 1398715168.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch40e04", "gilded": 0, "author": "benzidrine", "parent_id": "t1_ch3zocf", "approved_by": null, "body": "There are so many things working against you here. To have a good chance of donating viable organs you need to be brain dead not cardiac dead. A close range shotgun wound would likely cause you to be cardiac dead in one minute. After that time your organs will stop having perfusion and begin to deteriorate through lack of oxygen. The people that commit suicide by gunshot wound and are able to donate organs are those who only half succeeded, ie they did massive brain damage but where still somewhat alive enough to be taken to a hospital. \n\nDepending on jurisdiction and even individual hospital your donation could be refused because of the suicide. If you tell me the jurisdiction I might be able to find out for you.\n\nThis is the biggest reason though: If you commit suicide in an icebath that is going to look suspicious just because it is unusual which drastically increases the chances of an investigation and therefore your body not being available for donation.\n\nI just want you to know that this is extremely unlikely to work. I will be completely honest your organs could be used but there are many ifs in this scenario, so many that if I was to honestly access it I would give you maybe a 1 out of 200 chance of successfully donating organs after death.\n\nOrgan donation cannot be used to justify your suicide.\n\nSo lets talk about why you feel the way you do. An easier more reliable solution is that you get some help and find a way out of this. We've already established you are a good person by the thought you put into this so you are certainly worthwhile and deserve to live. I'd love to talk to you.\n\n&gt;Maybe I can go out to a bar\n\nThis really interests me. That you suggested this, if you go to a bar depressed enough to commit suicide do you truly believe you could abstain from alcohol?\n\nThat you even suggested this (whether you could abstain or not) makes me think that your issue is more to do with how you perceive your self worth than alcohol.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are so many things working against you here. To have a good chance of donating viable organs you need to be brain dead not cardiac dead. A close range shotgun wound would likely cause you to be cardiac dead in one minute. After that time your organs will stop having perfusion and begin to deteriorate through lack of oxygen. The people that commit suicide by gunshot wound and are able to donate organs are those who only half succeeded, ie they did massive brain damage but where still somewhat alive enough to be taken to a hospital. &lt;/p&gt;\n\n&lt;p&gt;Depending on jurisdiction and even individual hospital your donation could be refused because of the suicide. If you tell me the jurisdiction I might be able to find out for you.&lt;/p&gt;\n\n&lt;p&gt;This is the biggest reason though: If you commit suicide in an icebath that is going to look suspicious just because it is unusual which drastically increases the chances of an investigation and therefore your body not being available for donation.&lt;/p&gt;\n\n&lt;p&gt;I just want you to know that this is extremely unlikely to work. I will be completely honest your organs could be used but there are many ifs in this scenario, so many that if I was to honestly access it I would give you maybe a 1 out of 200 chance of successfully donating organs after death.&lt;/p&gt;\n\n&lt;p&gt;Organ donation cannot be used to justify your suicide.&lt;/p&gt;\n\n&lt;p&gt;So lets talk about why you feel the way you do. An easier more reliable solution is that you get some help and find a way out of this. We&amp;#39;ve already established you are a good person by the thought you put into this so you are certainly worthwhile and deserve to live. I&amp;#39;d love to talk to you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Maybe I can go out to a bar&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This really interests me. That you suggested this, if you go to a bar depressed enough to commit suicide do you truly believe you could abstain from alcohol?&lt;/p&gt;\n\n&lt;p&gt;That you even suggested this (whether you could abstain or not) makes me think that your issue is more to do with how you perceive your self worth than alcohol.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch40e04", "created": 1398705797.0, "author_flair_text": null, "created_utc": 1398676997.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch3zocf", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch3z6uc", "approved_by": null, "body": "&gt; Organs deteriorate rapidly without blood flow and people have shot themselves right outside of hospitals and still failed to give organs successfully. \n\nBut they survive longer when kept cool right? \n\n&gt;That there will be alcohol in your system increases the problems due to reduced oxygenation of blood flow.\n\nYou're right, I will have to be sober. It might take some mental working up to do this, but in order for this to work, I'm going to have to be sober. Maybe I can go out to a bar, ask out some girls, get rejected, then do it. \n\n&gt;Do you start to shake after not having a drink for a while?\n\nWell. I inherited hypertension and high blood pressure from my father, so unless I take my blood pressure medication, I don't shake as much. If I didn't drink coffee that morning, and I am relatively at ease, and I am not drinking, no. I don't shake. Most of my addiction is mental and considering I work late into the night, it aids me in relaxing enough to sleep.  \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Organs deteriorate rapidly without blood flow and people have shot themselves right outside of hospitals and still failed to give organs successfully. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But they survive longer when kept cool right? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That there will be alcohol in your system increases the problems due to reduced oxygenation of blood flow.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re right, I will have to be sober. It might take some mental working up to do this, but in order for this to work, I&amp;#39;m going to have to be sober. Maybe I can go out to a bar, ask out some girls, get rejected, then do it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do you start to shake after not having a drink for a while?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well. I inherited hypertension and high blood pressure from my father, so unless I take my blood pressure medication, I don&amp;#39;t shake as much. If I didn&amp;#39;t drink coffee that morning, and I am relatively at ease, and I am not drinking, no. I don&amp;#39;t shake. Most of my addiction is mental and considering I work late into the night, it aids me in relaxing enough to sleep.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3zocf", "created": 1398701209.0, "author_flair_text": null, "created_utc": 1398672409.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3z6uc", "gilded": 0, "author": "benzidrine", "parent_id": "t3_245wc0", "approved_by": null, "body": "I'm just to be honest suicide which leads to reliable successful organ donation would be extremely difficult for the average person to achieve. I can think of a few methods that might work but they would require a lot of setup. Organs deteriorate rapidly without blood flow and people have shot themselves right outside of hospitals and still failed to give organs successfully. That there will be alcohol in your system increases the problems due to reduced oxygenation of blood flow. While being honest it is possible that you would donate some organs after death in the event of shooting yourself but it is not likely.\n\nIt is a heart warming idea but I think you need to rethink how you are going about this. Honestly there is hope my father had serious problems with alcohol and everyday told me that he wanted to quit his job to become a full time alcoholic yet today neither he nor I drink. It can be done honestly.\n\nIf you feel up to talking can I ask if there is a reason beyond the alcohol that makes you consider suicide?\nAlso are you physically dependent on alcohol or only mentally dependent? Do you start to shake after not having a drink for a while?\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just to be honest suicide which leads to reliable successful organ donation would be extremely difficult for the average person to achieve. I can think of a few methods that might work but they would require a lot of setup. Organs deteriorate rapidly without blood flow and people have shot themselves right outside of hospitals and still failed to give organs successfully. That there will be alcohol in your system increases the problems due to reduced oxygenation of blood flow. While being honest it is possible that you would donate some organs after death in the event of shooting yourself but it is not likely.&lt;/p&gt;\n\n&lt;p&gt;It is a heart warming idea but I think you need to rethink how you are going about this. Honestly there is hope my father had serious problems with alcohol and everyday told me that he wanted to quit his job to become a full time alcoholic yet today neither he nor I drink. It can be done honestly.&lt;/p&gt;\n\n&lt;p&gt;If you feel up to talking can I ask if there is a reason beyond the alcohol that makes you consider suicide?\nAlso are you physically dependent on alcohol or only mentally dependent? Do you start to shake after not having a drink for a while?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch3z6uc", "created": 1398698607.0, "author_flair_text": null, "created_utc": 1398669807.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch419vv", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch40xxx", "approved_by": null, "body": "&gt; Yeah, life sure does surprise people. Just today I seriously entertained the thought of blowing out the back of my brain. And maybe by this June, I might see and experience a life beyond this one what no one alive on this Earth will get to experience the same moment I pull the trigger. I can't think of something more exciting. \n\nYou are just overcome by your emotions, you are not thinking rationally at all. You think your path is already chosen, like if someone wrote it for you. I can assure you, there are no fates out there.\n\n&gt; And so I've learned. You aren't the first to tell me that, and I haven't found a way to overcome it. I'm just wired to do what is easy on everyone at my own expense. \n\nYou'll learn, don't worry. Things take time.\n\n&gt; When it's giving blood I'm doing a service to humanity, but when I \"lend favors\" I attract leeches. Tell me, what is the difference between giving blood and helping people in person? \n\nThis is different. And I can explain you the why.\nWhen you donate your blood, you are giving people the possibility to keep on living; think about it: if people do not get that blood, they will die. There is nothing after. Just despair.\nYou give them another choice. The choice to live.\n\n&gt; Because one is sanctioned by society to be a more honorable and selfless act than trying to help out simple acquaintances? \n\nThere is no more selfless act because you do not know whom you are giving blood; you do not choose who lives and who dies. You do not get back what you have given.\nHumanity is pragmatic; helping a friend could mean that you'll need something back, maybe later. Helping a complete stranger is totally different. It's like the most caritable act of love out there.\n\n&gt; Yes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. How about this, I suck start a twelve gauge. \n\nI was (extremely) addicted to computer since I was 11, like you are addicted to alcohol. But with time, I came to realize that computer was basically draining me off, and I started to cast it aside when I could. And I came to a point where, if I wanted to stop it and just stay away from it, I could. You are a human being capable to change; I am able to stay away from computer, why wouldn't you be able to throw away alcohol?\n\nHABERE NON HABERI\n\n&gt; Yes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. \n\nI was able to change, and you are able to change as well. You don't have to give up, there is always another choice. It is just hard to see it.\n\n&gt; I know I can't. I can tell you I was something a long time ago. I was something for my parents to brag about. I could play a musical instrument. I was in the Air Force. I could play a decent game of tennis. I helped some of my friends get through financial hardships on my own dime, particularly because I was a young fool. I dated some of the smartest girls in my school. One of whom went on to become a lawyer. Two years of self destructive behavior, a failed relationship, and countless half assed attempts at sobriety, dropping out of school, sometimes I have to wonder if it's all just me or if there is some recurring family habits here that I might be more prone to making.\n\nIt doesn't matter which errors you've made on the past. Do you think I'm perfect? I am not. No one out there is perfect. Errors are the things that define us and make us improve. If I was bound to be perfect and made no error I would be no human.\n\n&gt; For better and for worse. Except this time, I'm just going to \"change\" my life span from maybe being 70 something into 25. I'd say that's a a pretty big change. And I'd say soon after that \"change\" I'd cease to exist. \nI can tell you I was something a long time ago.\n\nYou are not renouncing to your life. You are just renouncing to fight. And you are still something, you are just renouncing to think that you are. Little steps. One by one. You'll get out of all this.\n\n", "edited": 1398697894.0, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Yeah, life sure does surprise people. Just today I seriously entertained the thought of blowing out the back of my brain. And maybe by this June, I might see and experience a life beyond this one what no one alive on this Earth will get to experience the same moment I pull the trigger. I can&amp;#39;t think of something more exciting. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are just overcome by your emotions, you are not thinking rationally at all. You think your path is already chosen, like if someone wrote it for you. I can assure you, there are no fates out there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And so I&amp;#39;ve learned. You aren&amp;#39;t the first to tell me that, and I haven&amp;#39;t found a way to overcome it. I&amp;#39;m just wired to do what is easy on everyone at my own expense. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ll learn, don&amp;#39;t worry. Things take time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When it&amp;#39;s giving blood I&amp;#39;m doing a service to humanity, but when I &amp;quot;lend favors&amp;quot; I attract leeches. Tell me, what is the difference between giving blood and helping people in person? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is different. And I can explain you the why.\nWhen you donate your blood, you are giving people the possibility to keep on living; think about it: if people do not get that blood, they will die. There is nothing after. Just despair.\nYou give them another choice. The choice to live.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because one is sanctioned by society to be a more honorable and selfless act than trying to help out simple acquaintances? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is no more selfless act because you do not know whom you are giving blood; you do not choose who lives and who dies. You do not get back what you have given.\nHumanity is pragmatic; helping a friend could mean that you&amp;#39;ll need something back, maybe later. Helping a complete stranger is totally different. It&amp;#39;s like the most caritable act of love out there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. How about this, I suck start a twelve gauge. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was (extremely) addicted to computer since I was 11, like you are addicted to alcohol. But with time, I came to realize that computer was basically draining me off, and I started to cast it aside when I could. And I came to a point where, if I wanted to stop it and just stay away from it, I could. You are a human being capable to change; I am able to stay away from computer, why wouldn&amp;#39;t you be able to throw away alcohol?&lt;/p&gt;\n\n&lt;p&gt;HABERE NON HABERI&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was able to change, and you are able to change as well. You don&amp;#39;t have to give up, there is always another choice. It is just hard to see it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I know I can&amp;#39;t. I can tell you I was something a long time ago. I was something for my parents to brag about. I could play a musical instrument. I was in the Air Force. I could play a decent game of tennis. I helped some of my friends get through financial hardships on my own dime, particularly because I was a young fool. I dated some of the smartest girls in my school. One of whom went on to become a lawyer. Two years of self destructive behavior, a failed relationship, and countless half assed attempts at sobriety, dropping out of school, sometimes I have to wonder if it&amp;#39;s all just me or if there is some recurring family habits here that I might be more prone to making.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter which errors you&amp;#39;ve made on the past. Do you think I&amp;#39;m perfect? I am not. No one out there is perfect. Errors are the things that define us and make us improve. If I was bound to be perfect and made no error I would be no human.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For better and for worse. Except this time, I&amp;#39;m just going to &amp;quot;change&amp;quot; my life span from maybe being 70 something into 25. I&amp;#39;d say that&amp;#39;s a a pretty big change. And I&amp;#39;d say soon after that &amp;quot;change&amp;quot; I&amp;#39;d cease to exist. \nI can tell you I was something a long time ago.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are not renouncing to your life. You are just renouncing to fight. And you are still something, you are just renouncing to think that you are. Little steps. One by one. You&amp;#39;ll get out of all this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch419vv", "created": 1398711626.0, "author_flair_text": null, "created_utc": 1398682826.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch40xxx", "gilded": 0, "author": "throwaway24560000", "parent_id": "t1_ch40en6", "approved_by": null, "body": "&gt;If there is one thing certain out there, well, it is death. And if people call you selfish for thinking about suicide, it shouldn't be because you have to be living for other people out. But it is, because by committing suicide, you are basically removing yourself many opportunities: - The opportunity to be happy - The opportunity to have kids - The opportunity to help people - The opportunity for a new beginning. [...] And the list could go on for quite a while, to be sincere. Life surprises people. If I had chosen the path you are currently taking, when I was 18, I would missing out things like meeting new great people, enjoying my current life that I wouldn’t have even dreamed of, giving love to people that deserve love and so on.\n\nYeah, life sure does surprise people. Just today I seriously entertained the thought of blowing out the back of my brain. And maybe by this June, I might see and experience a life beyond this one what no one alive on this Earth will get to experience the same moment I pull the trigger. I can't think of something more exciting. \n\n&gt;I don't think so. The difference between good people and bad people, is that the first are able to make people happy, while the second are able to make people sad. Would you call that over-rated? By the way, I read that you think that people over-extended with you because you were too kind. I do think that being kind is a great quality, to be sincere, and so I do not neglect you for being kind. What I want to suggest you, is to give trust to people, but this trust should be built upon time. You can’t hope to lend favors away like a bank, because you’ll likely attract leeches.\n\nAnd so I've learned. You aren't the first to tell me that, and I haven't found a way to overcome it. I'm just wired to do what is easy on everyone at my own expense. When it's giving blood I'm doing a service to humanity, but when I \"lend favors\" I attract leeches. Tell me, what is the difference between giving blood and helping people in person? Because one is sanctioned by society to be a more honorable and selfless act than trying to help out simple acquaintances? It's either me be accommodating or to be an asshole. Maybe I should just tell people to go get fucked more often, surely that will help make the world a better place. \n\n&gt;Do you think that is a “little” worth? You have saved so many lifes with your blood. You don’t realize it, but you are doing already a great service to humanity. You saved lives. Do you realize that? You diminish your own value by thinking that such blood went to help thugs.\n\nyea. blood. only by chance do i have that blood type, not by choice can i help people like that. And with how many units I have given in the past six years, I'd wager at least one of them was a detriment to society who didn't deserve it. \n\n&gt;I don’t understand one thing: why are you basically thinking of yourself as a slave of your own nature? You could have the willpower to change it, if only you wanted. Do you think changing yourself is easy? You are totally wrong. People think they can change the world, but they can’t change even themselves. So… you wanna change? You will have to act on it.\n\nYes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. How about this, I suck start a twelve gauge. \n\n&gt;And this one is exactly the thing I was talking about; The first set of impressions you're likely to face are variations on \"I can't\". You'll have the thought that you can't quit, aren't able to quit. Well, treat this rationally, philosophically, empirically. Where is the evidence that you can't? Other people have before. How can you predict the future like that? You don't know with certainty what you will accomplish in the future; there is no real evidence about the future. A similar kind of impression is variations on \"It's my nature\". The kind of thoughts that say your 'essence' is addicted. I call these trait theories. Thoughts like, \"I am too weak to quit\", \"Other people can quit because they are strong and disciplined and noble, but I'm no good; I'm not as strong as them\", \"I have an addictive personality\", \"It's genetic\", or \"It's just how I am\". Well, let's look at this rationally: where is the evidence for your 'essence'? No one has ever seen a human essence; they've seen human behaviours. Behave as someone who is not addicted and you're not an addict; that is correct use of impressions. Everything is impermanent, as Marcus Aurelius says in Meditations 4:3 “Everything you see will soon alter and cease to exist. Think of how many changes you've already seen. The world is nothing but change.” So, in a world where nothing stays the same for even one second, who says you can't change?\n\nI know I can't. I can tell you I was something a long time ago. I was something for my parents to brag about. I could play a musical instrument. I was in the Air Force. I could play a decent game of tennis. I helped some of my friends get through financial hardships on my own dime, particularly because I was a young fool. I dated some of the smartest girls in my school. One of whom went on to become a lawyer. Two years of self destructive behavior, a failed relationship, and countless half assed attempts at sobriety, dropping out of school, sometimes I have to wonder if it's all just me or if there is some recurring family habits here that I might be more prone to making. And yes, damn right there are about to be some changes. \"Everything you see will soon alter and cease to exist.\" Couldn't agree more. There have definitely been some changes in my life. For better and for worse. Except this time, I'm just going to \"change\" my life span from maybe being 70 something into 25. I'd say that's a a pretty big change. And I'd say soon after that \"change\" I'd cease to exist. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If there is one thing certain out there, well, it is death. And if people call you selfish for thinking about suicide, it shouldn&amp;#39;t be because you have to be living for other people out. But it is, because by committing suicide, you are basically removing yourself many opportunities: - The opportunity to be happy - The opportunity to have kids - The opportunity to help people - The opportunity for a new beginning. [...] And the list could go on for quite a while, to be sincere. Life surprises people. If I had chosen the path you are currently taking, when I was 18, I would missing out things like meeting new great people, enjoying my current life that I wouldn’t have even dreamed of, giving love to people that deserve love and so on.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, life sure does surprise people. Just today I seriously entertained the thought of blowing out the back of my brain. And maybe by this June, I might see and experience a life beyond this one what no one alive on this Earth will get to experience the same moment I pull the trigger. I can&amp;#39;t think of something more exciting. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think so. The difference between good people and bad people, is that the first are able to make people happy, while the second are able to make people sad. Would you call that over-rated? By the way, I read that you think that people over-extended with you because you were too kind. I do think that being kind is a great quality, to be sincere, and so I do not neglect you for being kind. What I want to suggest you, is to give trust to people, but this trust should be built upon time. You can’t hope to lend favors away like a bank, because you’ll likely attract leeches.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And so I&amp;#39;ve learned. You aren&amp;#39;t the first to tell me that, and I haven&amp;#39;t found a way to overcome it. I&amp;#39;m just wired to do what is easy on everyone at my own expense. When it&amp;#39;s giving blood I&amp;#39;m doing a service to humanity, but when I &amp;quot;lend favors&amp;quot; I attract leeches. Tell me, what is the difference between giving blood and helping people in person? Because one is sanctioned by society to be a more honorable and selfless act than trying to help out simple acquaintances? It&amp;#39;s either me be accommodating or to be an asshole. Maybe I should just tell people to go get fucked more often, surely that will help make the world a better place. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do you think that is a “little” worth? You have saved so many lifes with your blood. You don’t realize it, but you are doing already a great service to humanity. You saved lives. Do you realize that? You diminish your own value by thinking that such blood went to help thugs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yea. blood. only by chance do i have that blood type, not by choice can i help people like that. And with how many units I have given in the past six years, I&amp;#39;d wager at least one of them was a detriment to society who didn&amp;#39;t deserve it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don’t understand one thing: why are you basically thinking of yourself as a slave of your own nature? You could have the willpower to change it, if only you wanted. Do you think changing yourself is easy? You are totally wrong. People think they can change the world, but they can’t change even themselves. So… you wanna change? You will have to act on it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, I sure would have to act on it. Act on changing 19 years of upbringing and nurture. How about this, I suck start a twelve gauge. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And this one is exactly the thing I was talking about; The first set of impressions you&amp;#39;re likely to face are variations on &amp;quot;I can&amp;#39;t&amp;quot;. You&amp;#39;ll have the thought that you can&amp;#39;t quit, aren&amp;#39;t able to quit. Well, treat this rationally, philosophically, empirically. Where is the evidence that you can&amp;#39;t? Other people have before. How can you predict the future like that? You don&amp;#39;t know with certainty what you will accomplish in the future; there is no real evidence about the future. A similar kind of impression is variations on &amp;quot;It&amp;#39;s my nature&amp;quot;. The kind of thoughts that say your &amp;#39;essence&amp;#39; is addicted. I call these trait theories. Thoughts like, &amp;quot;I am too weak to quit&amp;quot;, &amp;quot;Other people can quit because they are strong and disciplined and noble, but I&amp;#39;m no good; I&amp;#39;m not as strong as them&amp;quot;, &amp;quot;I have an addictive personality&amp;quot;, &amp;quot;It&amp;#39;s genetic&amp;quot;, or &amp;quot;It&amp;#39;s just how I am&amp;quot;. Well, let&amp;#39;s look at this rationally: where is the evidence for your &amp;#39;essence&amp;#39;? No one has ever seen a human essence; they&amp;#39;ve seen human behaviours. Behave as someone who is not addicted and you&amp;#39;re not an addict; that is correct use of impressions. Everything is impermanent, as Marcus Aurelius says in Meditations 4:3 “Everything you see will soon alter and cease to exist. Think of how many changes you&amp;#39;ve already seen. The world is nothing but change.” So, in a world where nothing stays the same for even one second, who says you can&amp;#39;t change?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know I can&amp;#39;t. I can tell you I was something a long time ago. I was something for my parents to brag about. I could play a musical instrument. I was in the Air Force. I could play a decent game of tennis. I helped some of my friends get through financial hardships on my own dime, particularly because I was a young fool. I dated some of the smartest girls in my school. One of whom went on to become a lawyer. Two years of self destructive behavior, a failed relationship, and countless half assed attempts at sobriety, dropping out of school, sometimes I have to wonder if it&amp;#39;s all just me or if there is some recurring family habits here that I might be more prone to making. And yes, damn right there are about to be some changes. &amp;quot;Everything you see will soon alter and cease to exist.&amp;quot; Couldn&amp;#39;t agree more. There have definitely been some changes in my life. For better and for worse. Except this time, I&amp;#39;m just going to &amp;quot;change&amp;quot; my life span from maybe being 70 something into 25. I&amp;#39;d say that&amp;#39;s a a pretty big change. And I&amp;#39;d say soon after that &amp;quot;change&amp;quot; I&amp;#39;d cease to exist. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch40xxx", "created": 1398684348.0, "author_flair_text": null, "created_utc": 1398680748.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch40en6", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_245wc0", "approved_by": null, "body": "hi throwaway24560000, nice to meet you. \nI read everything you have written. So, let's start:\n&gt; One thing I keep hearing about is how suicide is a selfish act. I'm single, no kids, just my mom and dad who are divorced and my sister. No one really to leave behind.\n\nLet's think rationally, shall we?\nSuicide is a selfish act. But not in the way people intend it. You have 25 years old and you are thinking about suicide. If there is one thing certain out there, well, it is death.\nAnd if people call you selfish for thinking about suicide, it shouldn't be because you have to be living for other people out. But it is, because by committing suicide, you are basically removing yourself many opportunities:\n- The opportunity to be happy\n- The opportunity to have kids\n- The opportunity to help people\n- The opportunity for a new beginning.\n[...]\nAnd the list could go on for quite a while, to be sincere.  Life surprises people. If I had chosen the path you are currently taking, when I was 18, I would missing out things like meeting new great people, enjoying my current life that I wouldn’t have even dreamed of,  giving love to people that deserve love and so on.\n\n&gt; It's all over rated. Everything about being a good person is over rated and under appreciated. \n\nI don't think so. The difference between good people and bad people, is that the first are able to make people happy, while the second are able to make people sad.  Would you call that over-rated?\nBy the way, I read that you think that people over-extended with you because you were too kind. I do think that being kind is a great quality, to be sincere, and so I do not neglect you for being kind.\nWhat I want to suggest you, is to give trust to people, but this trust should be built upon time. You can’t hope to lend favors away like a bank, because you’ll likely attract leeches. \n\n&gt; And it certainly isn't valued. Especially not by women. \n\nOn that regard I may say that you could be right, but it depends certainly on the women you have found.\nIt is not black and white as you think. \n\n&gt; No. I'm not needed. I don't wake up in the morning with missed calls saying how much the world needs me. The only thing worthy I have to realistically offer this world is my fucking blood. A bunch of red blood cells with 0 antibodies. That is my worth to people.\n\nDo you think that is a “little” worth? You have saved so many lifes with your blood. You don’t realize it, but you are doing already a great service to humanity. You saved lives. Do you realize that? You diminish your own value by thinking that such blood went to help thugs. \n\n\n&gt; Then what exactly is my worth here if I am not going to reproduce? I know I don't like living alone, and I know I am at risk to abusing an SO. So even then, I'd still rather not subject that person to any predisposition I may have.\n\nI don’t understand one thing: why are you basically thinking of yourself as a slave of your own nature? You could have the willpower to change it, if only you wanted. Do you think changing yourself is easy? You are totally wrong. People think they can change the world, but they can’t change even themselves.\nSo… you wanna change? You will have to act on it.\n\n&gt; I'm sick with alcoholism thanks to my dad.\n\nAnd this one is exactly the thing I was talking about;\nThe first set of impressions you're likely to face are variations on \"I can't\". You'll have the thought that you can't quit, aren't able to quit. Well, treat this rationally, philosophically, empirically. Where is the evidence that you can't? Other people have before. How can you predict the future like that? You don't know with certainty what you will accomplish in the future; there is no real evidence about the future.\nA similar kind of impression is variations on \"It's my nature\". The kind of thoughts that say your 'essence' is addicted. I call these trait theories. Thoughts like, \"I am too weak to quit\", \"Other people can quit because they are strong and disciplined and noble, but I'm no good; I'm not as strong as them\", \"I have an addictive personality\", \"It's genetic\", or \"It's just how I am\". Well, let's look at this rationally: where is the evidence for your 'essence'? No one has ever seen a human essence; they've seen human behaviours. Behave as someone who is not addicted and you're not an addict; that is correct use of impressions. Everything is impermanent, as Marcus Aurelius says in Meditations 4:3 “Everything you see will soon alter and cease to exist. Think of how many changes you’ve already seen. The world is nothing but change.” So, in a world where nothing stays the same for even one second, who says you can't change?\n\nA fifth class of false impressions is \"It's too hard\". Look at this rationally: sure it's hard, it's difficult, it's uncomfortable. But \"too\" hard implies a standard. There's a philosophy there of: \"The world may be this hard, but if it's any harder, then the world sucks, it's no good. It's reality's fault for being harder than I have decided it should be.\" Here again you're focusing on what you can't control, whining and demanding that things be one way, when they indubitably are the other way. Being deprived of your instant gratification is bothersome, but you can stand it.\n\nCheck this link: http://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr\n\nI took some of the key points.\n\nI hope you the best !\n\n", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hi throwaway24560000, nice to meet you. \nI read everything you have written. So, let&amp;#39;s start:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;One thing I keep hearing about is how suicide is a selfish act. I&amp;#39;m single, no kids, just my mom and dad who are divorced and my sister. No one really to leave behind.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Let&amp;#39;s think rationally, shall we?\nSuicide is a selfish act. But not in the way people intend it. You have 25 years old and you are thinking about suicide. If there is one thing certain out there, well, it is death.\nAnd if people call you selfish for thinking about suicide, it shouldn&amp;#39;t be because you have to be living for other people out. But it is, because by committing suicide, you are basically removing yourself many opportunities:\n- The opportunity to be happy\n- The opportunity to have kids\n- The opportunity to help people\n- The opportunity for a new beginning.\n[...]\nAnd the list could go on for quite a while, to be sincere.  Life surprises people. If I had chosen the path you are currently taking, when I was 18, I would missing out things like meeting new great people, enjoying my current life that I wouldn’t have even dreamed of,  giving love to people that deserve love and so on.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s all over rated. Everything about being a good person is over rated and under appreciated. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think so. The difference between good people and bad people, is that the first are able to make people happy, while the second are able to make people sad.  Would you call that over-rated?\nBy the way, I read that you think that people over-extended with you because you were too kind. I do think that being kind is a great quality, to be sincere, and so I do not neglect you for being kind.\nWhat I want to suggest you, is to give trust to people, but this trust should be built upon time. You can’t hope to lend favors away like a bank, because you’ll likely attract leeches. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And it certainly isn&amp;#39;t valued. Especially not by women. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;On that regard I may say that you could be right, but it depends certainly on the women you have found.\nIt is not black and white as you think. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;No. I&amp;#39;m not needed. I don&amp;#39;t wake up in the morning with missed calls saying how much the world needs me. The only thing worthy I have to realistically offer this world is my fucking blood. A bunch of red blood cells with 0 antibodies. That is my worth to people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you think that is a “little” worth? You have saved so many lifes with your blood. You don’t realize it, but you are doing already a great service to humanity. You saved lives. Do you realize that? You diminish your own value by thinking that such blood went to help thugs. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Then what exactly is my worth here if I am not going to reproduce? I know I don&amp;#39;t like living alone, and I know I am at risk to abusing an SO. So even then, I&amp;#39;d still rather not subject that person to any predisposition I may have.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don’t understand one thing: why are you basically thinking of yourself as a slave of your own nature? You could have the willpower to change it, if only you wanted. Do you think changing yourself is easy? You are totally wrong. People think they can change the world, but they can’t change even themselves.\nSo… you wanna change? You will have to act on it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sick with alcoholism thanks to my dad.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And this one is exactly the thing I was talking about;\nThe first set of impressions you&amp;#39;re likely to face are variations on &amp;quot;I can&amp;#39;t&amp;quot;. You&amp;#39;ll have the thought that you can&amp;#39;t quit, aren&amp;#39;t able to quit. Well, treat this rationally, philosophically, empirically. Where is the evidence that you can&amp;#39;t? Other people have before. How can you predict the future like that? You don&amp;#39;t know with certainty what you will accomplish in the future; there is no real evidence about the future.\nA similar kind of impression is variations on &amp;quot;It&amp;#39;s my nature&amp;quot;. The kind of thoughts that say your &amp;#39;essence&amp;#39; is addicted. I call these trait theories. Thoughts like, &amp;quot;I am too weak to quit&amp;quot;, &amp;quot;Other people can quit because they are strong and disciplined and noble, but I&amp;#39;m no good; I&amp;#39;m not as strong as them&amp;quot;, &amp;quot;I have an addictive personality&amp;quot;, &amp;quot;It&amp;#39;s genetic&amp;quot;, or &amp;quot;It&amp;#39;s just how I am&amp;quot;. Well, let&amp;#39;s look at this rationally: where is the evidence for your &amp;#39;essence&amp;#39;? No one has ever seen a human essence; they&amp;#39;ve seen human behaviours. Behave as someone who is not addicted and you&amp;#39;re not an addict; that is correct use of impressions. Everything is impermanent, as Marcus Aurelius says in Meditations 4:3 “Everything you see will soon alter and cease to exist. Think of how many changes you’ve already seen. The world is nothing but change.” So, in a world where nothing stays the same for even one second, who says you can&amp;#39;t change?&lt;/p&gt;\n\n&lt;p&gt;A fifth class of false impressions is &amp;quot;It&amp;#39;s too hard&amp;quot;. Look at this rationally: sure it&amp;#39;s hard, it&amp;#39;s difficult, it&amp;#39;s uncomfortable. But &amp;quot;too&amp;quot; hard implies a standard. There&amp;#39;s a philosophy there of: &amp;quot;The world may be this hard, but if it&amp;#39;s any harder, then the world sucks, it&amp;#39;s no good. It&amp;#39;s reality&amp;#39;s fault for being harder than I have decided it should be.&amp;quot; Here again you&amp;#39;re focusing on what you can&amp;#39;t control, whining and demanding that things be one way, when they indubitably are the other way. Being deprived of your instant gratification is bothersome, but you can stand it.&lt;/p&gt;\n\n&lt;p&gt;Check this link: &lt;a href=\"http://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr\"&gt;http://www.reddit.com/r/Stoicism/comments/23qa8p/advice_on_dealing_with_addiction/cgzmrfr&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I took some of the key points.&lt;/p&gt;\n\n&lt;p&gt;I hope you the best !&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wc0", "score_hidden": false, "name": "t1_ch40en6", "created": 1398705917.0, "author_flair_text": null, "created_utc": 1398677117.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]