[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was in Grade 4, I was raped during recess by some teens and I never told anyone about it. That experience made me a loud, always happy kid because I wanted every kid and adult around me to be happy. It killed me everyday because when I got home, both my parents would beat me for no reason and fight with each other. I knew couldn&amp;#39;t tell them so I hid it. &lt;/p&gt;\n\n&lt;p&gt;In school, I worked super hard and got good grades. I was valedictorian in junior high and got high honors in high school. I was still the happy kid but I didn&amp;#39;t have many friends because I always shot down opportunities to hang out outside of school. My parents didn&amp;#39;t let me go anywhere and I couldn&amp;#39;t bring anyone home but I still tried very hard to make friends. My teens were really awkward because I always came home to a beating because my dad drank or my mom was sick of our poor family. My mom doesn&amp;#39;t work and my dad works at a Save on Foods as a cook. I would always get depressed and sleep, go on the internet and read to pass time.&lt;/p&gt;\n\n&lt;p&gt;When university came two years ago, I told my dad about what happened in Grade 4 and he beat me and told me he couldn&amp;#39;t care less. I kept crying and asked for him to stop because it really hurt me. I don&amp;#39;t ever remember speaking out when he or mom hit me, but this time it was too much. I called my two only friends to talk to them, individually. One told me to see a counselor and the other told me she doesn&amp;#39;t know what to do. Both of them stopped contact with me and no matter how much I called them back, they avoided me. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I thought that if I just focus on my studies. I can get money and take care of my poor family. That way, they would have to love me back. I just know they will love me if I show them that I love them.&lt;/p&gt;\n\n&lt;p&gt;But I couldn&amp;#39;t, I&amp;#39;ve done two years of university and failed a course that I redid twice and withdrawn from 3 courses. I was only doing 3 courses a semester too! I couldn&amp;#39;t help it. University was a place where I had no friends no matter how much I tried and I kept going into random panic attacks. It was so scary and I didn&amp;#39;t speak to anyone. For two years, I was completely mute around mom and dad and I couldn&amp;#39;t concentrate on school work. I didn&amp;#39;t have any ambitions. All I did two years ago and now is sleep till 1pm, eat, browse computer for 12 hours on 4chan and reddit and sleep. Sometimes my dad would get really angry with me and hurt me. I spent my life staying quiet when he beats me but now I scream out my throat out when he so much as speaks to me patronizingly or gives a threat in a small voice. I know I am going insane. &lt;/p&gt;\n\n&lt;p&gt;I went to see a psychologist at my university but I only have two sessions left. It was free and I can&amp;#39;t afford to go there anymore because I am not a student next year. I plan to work min wage and think it through. Today I got hired at a telemarketing job, but the hours are too long and I don&amp;#39;t even have money for more than one pair of business clothes. The manager was scary and my heart is still racing. Telemarketing isn&amp;#39;t for me. I keep thinking I should just get a simple min wage job at Target or Starbucks. But right now, I really want to eat some pills and just go away. I think about how I can take care of my family but I am no longer useful. I think about how no matter how much I try to love my mom and dad, the two people I can ever put my heart out for, I will get nothing back. I am so scared, I want to  believe I am I good person but can&amp;#39;t I just be selfish once and end my life? All I wanted in life was a good friend and maybe love but all I get is fear and rejection. I really appreciate you for reading all of this. Please help me. I am so scared.&lt;/p&gt;\n\n&lt;p&gt;TL;DR Raped as a kid, failed uni course twice, failed university, abusive poor family, no friends, psychologist sessions ending really soon, just want a friend, need help. &lt;/p&gt;\n\n&lt;p&gt;Edit/ some spelling mistakes&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "When I was in Grade 4, I was raped during recess by some teens and I never told anyone about it. That experience made me a loud, always happy kid because I wanted every kid and adult around me to be happy. It killed me everyday because when I got home, both my parents would beat me for no reason and fight with each other. I knew couldn't tell them so I hid it. \n\nIn school, I worked super hard and got good grades. I was valedictorian in junior high and got high honors in high school. I was still the happy kid but I didn't have many friends because I always shot down opportunities to hang out outside of school. My parents didn't let me go anywhere and I couldn't bring anyone home but I still tried very hard to make friends. My teens were really awkward because I always came home to a beating because my dad drank or my mom was sick of our poor family. My mom doesn't work and my dad works at a Save on Foods as a cook. I would always get depressed and sleep, go on the internet and read to pass time.\n\nWhen university came two years ago, I told my dad about what happened in Grade 4 and he beat me and told me he couldn't care less. I kept crying and asked for him to stop because it really hurt me. I don't ever remember speaking out when he or mom hit me, but this time it was too much. I called my two only friends to talk to them, individually. One told me to see a counselor and the other told me she doesn't know what to do. Both of them stopped contact with me and no matter how much I called them back, they avoided me. \n\nThat's when I thought that if I just focus on my studies. I can get money and take care of my poor family. That way, they would have to love me back. I just know they will love me if I show them that I love them.\n\nBut I couldn't, I've done two years of university and failed a course that I redid twice and withdrawn from 3 courses. I was only doing 3 courses a semester too! I couldn't help it. University was a place where I had no friends no matter how much I tried and I kept going into random panic attacks. It was so scary and I didn't speak to anyone. For two years, I was completely mute around mom and dad and I couldn't concentrate on school work. I didn't have any ambitions. All I did two years ago and now is sleep till 1pm, eat, browse computer for 12 hours on 4chan and reddit and sleep. Sometimes my dad would get really angry with me and hurt me. I spent my life staying quiet when he beats me but now I scream out my throat out when he so much as speaks to me patronizingly or gives a threat in a small voice. I know I am going insane. \n\nI went to see a psychologist at my university but I only have two sessions left. It was free and I can't afford to go there anymore because I am not a student next year. I plan to work min wage and think it through. Today I got hired at a telemarketing job, but the hours are too long and I don't even have money for more than one pair of business clothes. The manager was scary and my heart is still racing. Telemarketing isn't for me. I keep thinking I should just get a simple min wage job at Target or Starbucks. But right now, I really want to eat some pills and just go away. I think about how I can take care of my family but I am no longer useful. I think about how no matter how much I try to love my mom and dad, the two people I can ever put my heart out for, I will get nothing back. I am so scared, I want to  believe I am I good person but can't I just be selfish once and end my life? All I wanted in life was a good friend and maybe love but all I get is fear and rejection. I really appreciate you for reading all of this. Please help me. I am so scared.\n\nTL;DR Raped as a kid, failed uni course twice, failed university, abusive poor family, no friends, psychologist sessions ending really soon, just want a friend, need help. \n\nEdit/ some spelling mistakes", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240cxb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "canyouhelp8", "media": null, "score": 47, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398498049.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 8, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240cxb/raped_as_a_kid_beaten_as_a_teen_failed_uni_it_is/", "name": "t3_240cxb", "created": 1398515046.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240cxb/raped_as_a_kid_beaten_as_a_teen_failed_uni_it_is/", "author_flair_text": null, "title": "Raped as a kid, beaten as a teen, failed uni. It is all coming together.", "created_utc": 1398486246.0, "ups": 55, "num_comments": 60, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ydlo", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2gkfi", "approved_by": null, "body": "I read through the article but I think everyone's situation is different and everyone's mind works differently. \n\nThanks for tips about talking to people online. It's hard to make friends online but I can certainly try. Thanks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read through the article but I think everyone&amp;#39;s situation is different and everyone&amp;#39;s mind works differently. &lt;/p&gt;\n\n&lt;p&gt;Thanks for tips about talking to people online. It&amp;#39;s hard to make friends online but I can certainly try. Thanks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2ydlo", "created": 1398589057.0, "author_flair_text": null, "created_utc": 1398560257.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2gkfi", "gilded": 0, "author": "xlarukux", "parent_id": "t3_240cxb", "approved_by": null, "body": "Wow a lot of this is really similar to my life. Not going to go into details of it, but I really think you should limit your contact with your parents. I feel like you just need a few good friends or a significant other to talk to once in a while to get your feelings out. How to find them I can't really help you with that since I'm not good with these sort of things either. I can't really talk about these sort of things with most of my friends - they would just avoid talking to me like your friends did because they don't want to get involved in these sort of things. I've found that talking to people online helps, they seem more open.\n\nBut really try and do something for YOURSELF, not your parents. Some people are just not fit to be parents. \n\nAlso please read this http://www.slate.com/articles/life/family/2013/02/abusive_parents_what_do_grown_children_owe_the_mothers_and_fathers_who_made.single.html", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow a lot of this is really similar to my life. Not going to go into details of it, but I really think you should limit your contact with your parents. I feel like you just need a few good friends or a significant other to talk to once in a while to get your feelings out. How to find them I can&amp;#39;t really help you with that since I&amp;#39;m not good with these sort of things either. I can&amp;#39;t really talk about these sort of things with most of my friends - they would just avoid talking to me like your friends did because they don&amp;#39;t want to get involved in these sort of things. I&amp;#39;ve found that talking to people online helps, they seem more open.&lt;/p&gt;\n\n&lt;p&gt;But really try and do something for YOURSELF, not your parents. Some people are just not fit to be parents. &lt;/p&gt;\n\n&lt;p&gt;Also please read this &lt;a href=\"http://www.slate.com/articles/life/family/2013/02/abusive_parents_what_do_grown_children_owe_the_mothers_and_fathers_who_made.single.html\"&gt;http://www.slate.com/articles/life/family/2013/02/abusive_parents_what_do_grown_children_owe_the_mothers_and_fathers_who_made.single.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2gkfi", "created": 1398531309.0, "author_flair_text": null, "created_utc": 1398502509.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2zz61", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2yzn0", "approved_by": null, "body": "Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2zz61", "created": 1398593360.0, "author_flair_text": null, "created_utc": 1398564560.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2yzn0", "gilded": 0, "author": "LoveJustHate", "parent_id": "t1_ch2efmv", "approved_by": null, "body": "I don't really have advice but good luck with whatever you pursue ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really have advice but good luck with whatever you pursue &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yzn0", "created": 1398590689.0, "author_flair_text": null, "created_utc": 1398561889.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3w600", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch37aaj", "approved_by": null, "body": "Thanks for the reply. I appreciate it. \n\nI'm having a lot of trouble concentrating over every day tasks right now and reading these tips help me. Thanks. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the reply. I appreciate it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m having a lot of trouble concentrating over every day tasks right now and reading these tips help me. Thanks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch3w600", "created": 1398688102.0, "author_flair_text": null, "created_utc": 1398659302.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch37aaj", "gilded": 0, "author": "TheFarm", "parent_id": "t1_ch2efmv", "approved_by": null, "body": "No worries! It's fair enough that trades don't do well with your body, but eventually you will find something you can do, and enjoy. Maybe all you need is a different direction in uni, if what you are studying isn't working out.\n\nIf you need to stay with your parents, try getting into something that can keep you going, i.e. music, art etc. If you have a passion, you'll have something that will help you distract yourself from your parents, and something to put yourself into.\n\nReally, feel free to send me a message anytime. I don't ever mind talking to other people about their problems. Also, remember, Canada in the winter can be a serious demotivator. I'm Canadian, so I know. ;)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No worries! It&amp;#39;s fair enough that trades don&amp;#39;t do well with your body, but eventually you will find something you can do, and enjoy. Maybe all you need is a different direction in uni, if what you are studying isn&amp;#39;t working out.&lt;/p&gt;\n\n&lt;p&gt;If you need to stay with your parents, try getting into something that can keep you going, i.e. music, art etc. If you have a passion, you&amp;#39;ll have something that will help you distract yourself from your parents, and something to put yourself into.&lt;/p&gt;\n\n&lt;p&gt;Really, feel free to send me a message anytime. I don&amp;#39;t ever mind talking to other people about their problems. Also, remember, Canada in the winter can be a serious demotivator. I&amp;#39;m Canadian, so I know. ;)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch37aaj", "created": 1398620234.0, "author_flair_text": null, "created_utc": 1398591434.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2efmv", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2dg3i", "approved_by": null, "body": "Thanks for the motivation TheFarm. I live in Canada and trades don't fit well with my body shape. \n\nI know getting away from my parents seem core but I am dependent on them for survival. I can't find a job that works and living week to week isn't going to work out with my anxiety and wage. \n\nThanks for offering to talk to me. I might have to take up your offer. Please let me know if I ever drag you down though. I know how these \"let's talk\" \"ok\" things work. Haha.\n\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the motivation TheFarm. I live in Canada and trades don&amp;#39;t fit well with my body shape. &lt;/p&gt;\n\n&lt;p&gt;I know getting away from my parents seem core but I am dependent on them for survival. I can&amp;#39;t find a job that works and living week to week isn&amp;#39;t going to work out with my anxiety and wage. &lt;/p&gt;\n\n&lt;p&gt;Thanks for offering to talk to me. I might have to take up your offer. Please let me know if I ever drag you down though. I know how these &amp;quot;let&amp;#39;s talk&amp;quot; &amp;quot;ok&amp;quot; things work. Haha.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2efmv", "created": 1398520669.0, "author_flair_text": null, "created_utc": 1398491869.0, "distinguished": null, "num_reports": null, "ups": 8}}], "after": null, "before": null}}, "saved": false, "id": "ch2dg3i", "gilded": 0, "author": "TheFarm", "parent_id": "t3_240cxb", "approved_by": null, "body": "That is a tough childhood man. I can't even begin to imagine how hard it would be to go through, and as I never have, I can't give you much advice on that front.\n\nBut I did want to say that just because you failed college courses and dropped out, it doesn't mean you are a failure. Take up a trade, or learn to produce art, or start writing. I assume you live in the US, and I've no idea what kind of market you have for tradies, but in most countries around the world you can make as much money as a college graduate if you are a good plumber, electrician etc.\n\nAnyway, what I would suggest doing is trying to get away from your parents. Because they are clearly pretty confused about life themselves. \n\nEventually you will find love, whether it be love for a new passion, friend love, or romance. I can't say anything that will make life better instantly, but if you pull yourself out of your troubles, I can promise it is a rewarding feeling.\n\nFeel free to talk to me anytime if you need to!", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a tough childhood man. I can&amp;#39;t even begin to imagine how hard it would be to go through, and as I never have, I can&amp;#39;t give you much advice on that front.&lt;/p&gt;\n\n&lt;p&gt;But I did want to say that just because you failed college courses and dropped out, it doesn&amp;#39;t mean you are a failure. Take up a trade, or learn to produce art, or start writing. I assume you live in the US, and I&amp;#39;ve no idea what kind of market you have for tradies, but in most countries around the world you can make as much money as a college graduate if you are a good plumber, electrician etc.&lt;/p&gt;\n\n&lt;p&gt;Anyway, what I would suggest doing is trying to get away from your parents. Because they are clearly pretty confused about life themselves. &lt;/p&gt;\n\n&lt;p&gt;Eventually you will find love, whether it be love for a new passion, friend love, or romance. I can&amp;#39;t say anything that will make life better instantly, but if you pull yourself out of your troubles, I can promise it is a rewarding feeling.&lt;/p&gt;\n\n&lt;p&gt;Feel free to talk to me anytime if you need to!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2dg3i", "created": 1398517465.0, "author_flair_text": null, "created_utc": 1398488665.0, "distinguished": null, "num_reports": null, "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2fqha", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2fco0", "approved_by": null, "body": "Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2fqha", "created": 1398526333.0, "author_flair_text": null, "created_utc": 1398497533.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2fco0", "gilded": 0, "author": "[deleted]", "parent_id": "t3_240cxb", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2fco0", "created": 1398524459.0, "author_flair_text": null, "created_utc": 1398495659.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2y1u8", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2hf95", "approved_by": null, "body": "Thank you. I appreciate your kindness.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I appreciate your kindness.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2y1u8", "created": 1398588155.0, "author_flair_text": null, "created_utc": 1398559355.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2hf95", "gilded": 0, "author": "squireofverve", "parent_id": "t3_240cxb", "approved_by": null, "body": "please send me a PM if you want to. No one in this world should have to endure things that you have and I'd love to hear more about things that DO make you happy and what things you take an interest in", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;please send me a PM if you want to. No one in this world should have to endure things that you have and I&amp;#39;d love to hear more about things that DO make you happy and what things you take an interest in&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2hf95", "created": 1398537441.0, "author_flair_text": null, "created_utc": 1398508641.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2trjm", "gilded": 0, "author": "linglingvasprecious", "parent_id": "t1_ch2hybv", "approved_by": null, "body": "As a Canadian Citizen undergoing therapy, you need to pay a portion for the therapy (if you are covered by insurance). You can be assessed for free by a child psychologist if you are under 18 with a doctor's prescription. Mental Health is an issue here in Canada, whilst not as bad as America, it's not as accessible as one might think. \n\nOP, I've been through a lot in my own life, if you ever want to talk please send me a message, I am a survivor of sexual assault as well. I see some similarities in your story to mine, I finally have my feet under me, and I'll always be here to offer you support and advice :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a Canadian Citizen undergoing therapy, you need to pay a portion for the therapy (if you are covered by insurance). You can be assessed for free by a child psychologist if you are under 18 with a doctor&amp;#39;s prescription. Mental Health is an issue here in Canada, whilst not as bad as America, it&amp;#39;s not as accessible as one might think. &lt;/p&gt;\n\n&lt;p&gt;OP, I&amp;#39;ve been through a lot in my own life, if you ever want to talk please send me a message, I am a survivor of sexual assault as well. I see some similarities in your story to mine, I finally have my feet under me, and I&amp;#39;ll always be here to offer you support and advice :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2trjm", "created": 1398576765.0, "author_flair_text": null, "created_utc": 1398547965.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2yrme", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2hybv", "approved_by": null, "body": "I believe Canada has free health services. But I'm 19 and my health benefits and such are tied to my father. I have little to no knowledge about my benefits since he has control over everything. But I'm quite sure that he won't let me use it to see a psychologist. \n\nCurrently, I'm seeing a intern psychologist at my university but I have one session left since I am not a returning student. Most universities do not let you use their services if you are not a student. \n\nUsually I go online because I don't have a license or even a car to move around. I'll definitely look up couchsurfing and some local community services. Thanks a lot for the ideas. I really appreciate it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe Canada has free health services. But I&amp;#39;m 19 and my health benefits and such are tied to my father. I have little to no knowledge about my benefits since he has control over everything. But I&amp;#39;m quite sure that he won&amp;#39;t let me use it to see a psychologist. &lt;/p&gt;\n\n&lt;p&gt;Currently, I&amp;#39;m seeing a intern psychologist at my university but I have one session left since I am not a returning student. Most universities do not let you use their services if you are not a student. &lt;/p&gt;\n\n&lt;p&gt;Usually I go online because I don&amp;#39;t have a license or even a car to move around. I&amp;#39;ll definitely look up couchsurfing and some local community services. Thanks a lot for the ideas. I really appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yrme", "created": 1398590105.0, "author_flair_text": null, "created_utc": 1398561305.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2hybv", "gilded": 0, "author": "paulovsk", "parent_id": "t3_240cxb", "approved_by": null, "body": "Wow, that's really a tough childhood.\n\nI don't know what to say, but I think you'd benefit tremendously of seeing a therapist in a continuous way.\n\nDoesn't Canada offer public health service?\n\nIf not, you can search some nearby universities and take a look at their psychology department site. They usually have free therapy programs where their soon to be graduates work and serve the community around the uni.\n\nYou seem like a good person in a tough and toxic environment. I know making new friends is hard, even for me who have a more comfortable life situation now, but my tip is: set up an account on CouchSurfing website.\n\nThey usually have a local community in every city of people who receive foreigners and show them around in the town. They are REALLY welcoming for local people too. Language exchange portals work too. \n\nI saw you like to read, maybe try to search for any book clubs around? Another set of cool people.\n\nWrite down my username in your list of friends and do PM me anytime you feel like talking. Really.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that&amp;#39;s really a tough childhood.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to say, but I think you&amp;#39;d benefit tremendously of seeing a therapist in a continuous way.&lt;/p&gt;\n\n&lt;p&gt;Doesn&amp;#39;t Canada offer public health service?&lt;/p&gt;\n\n&lt;p&gt;If not, you can search some nearby universities and take a look at their psychology department site. They usually have free therapy programs where their soon to be graduates work and serve the community around the uni.&lt;/p&gt;\n\n&lt;p&gt;You seem like a good person in a tough and toxic environment. I know making new friends is hard, even for me who have a more comfortable life situation now, but my tip is: set up an account on CouchSurfing website.&lt;/p&gt;\n\n&lt;p&gt;They usually have a local community in every city of people who receive foreigners and show them around in the town. They are REALLY welcoming for local people too. Language exchange portals work too. &lt;/p&gt;\n\n&lt;p&gt;I saw you like to read, maybe try to search for any book clubs around? Another set of cool people.&lt;/p&gt;\n\n&lt;p&gt;Write down my username in your list of friends and do PM me anytime you feel like talking. Really.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2hybv", "created": 1398541046.0, "author_flair_text": null, "created_utc": 1398512246.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3ix1g", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch37ru0", "approved_by": null, "body": ":)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch3ix1g", "created": 1398657755.0, "author_flair_text": null, "created_utc": 1398628955.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch37ru0", "gilded": 0, "author": "no-mad", "parent_id": "t1_ch2yilq", "approved_by": null, "body": "Stop by an animal shelter lots of dogs and cats need petting.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop by an animal shelter lots of dogs and cats need petting.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch37ru0", "created": 1398623726.0, "author_flair_text": null, "created_utc": 1398594926.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2yilq", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2jeh9", "approved_by": null, "body": "I really like corgis. Maybe I'll pet one someday. Haha.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really like corgis. Maybe I&amp;#39;ll pet one someday. Haha.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yilq", "created": 1398589421.0, "author_flair_text": null, "created_utc": 1398560621.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2jeh9", "gilded": 0, "author": "no-mad", "parent_id": "t3_240cxb", "approved_by": null, "body": "I am sorry your parents suck. They should not beat you. No one deserves that. Consider developing a plan for leaving and starting a better life. Maybe you can get a dog for a friend. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry your parents suck. They should not beat you. No one deserves that. Consider developing a plan for leaving and starting a better life. Maybe you can get a dog for a friend. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2jeh9", "created": 1398548231.0, "author_flair_text": null, "created_utc": 1398519431.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2eaw5", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2d9o2", "approved_by": null, "body": "I volunteer with kids at an elementary school. Helping them jog and reading with them is something I enjoy. But I'll stop volunteering soon since I stopped university (it's one of their programs) and it's just too far without my bus pass. \n\nInternet comics and silly posts on reddit. Most of my smiles come from the internet and it's not someplace that I should spend all my time on. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I volunteer with kids at an elementary school. Helping them jog and reading with them is something I enjoy. But I&amp;#39;ll stop volunteering soon since I stopped university (it&amp;#39;s one of their programs) and it&amp;#39;s just too far without my bus pass. &lt;/p&gt;\n\n&lt;p&gt;Internet comics and silly posts on reddit. Most of my smiles come from the internet and it&amp;#39;s not someplace that I should spend all my time on. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2eaw5", "created": 1398520208.0, "author_flair_text": null, "created_utc": 1398491408.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch2d9o2", "gilded": 0, "author": "spewerOfRandomBS", "parent_id": "t3_240cxb", "approved_by": null, "body": "What makes you smile?\n\nYou know what makes me smile? It's the oddest of things that have nothing to do with me. I stand outside my office, smoking, yea I know, bad for me and all. And a family walks by, and there's this little kid, with a big grin on his/her face because he just saw that hideous \n\"trump tower\" for the first time and it made his day.\n\nIt reminds me of when I used to smile at things like that, and yea that makes me smile.\n\nSo, what makes you smile?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What makes you smile?&lt;/p&gt;\n\n&lt;p&gt;You know what makes me smile? It&amp;#39;s the oddest of things that have nothing to do with me. I stand outside my office, smoking, yea I know, bad for me and all. And a family walks by, and there&amp;#39;s this little kid, with a big grin on his/her face because he just saw that hideous \n&amp;quot;trump tower&amp;quot; for the first time and it made his day.&lt;/p&gt;\n\n&lt;p&gt;It reminds me of when I used to smile at things like that, and yea that makes me smile.&lt;/p&gt;\n\n&lt;p&gt;So, what makes you smile?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2d9o2", "created": 1398516916.0, "author_flair_text": null, "created_utc": 1398488116.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2fu5i", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2fnx1", "approved_by": null, "body": "Thanks for your kindness.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your kindness.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2fu5i", "created": 1398526886.0, "author_flair_text": null, "created_utc": 1398498086.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch2fnx1", "gilded": 0, "author": "Etonet", "parent_id": "t3_240cxb", "approved_by": null, "body": "I'm not particularly good at comforting people but I can definitely listen", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not particularly good at comforting people but I can definitely listen&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2fnx1", "created": 1398525950.0, "author_flair_text": null, "created_utc": 1398497150.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2g2yg", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2fxji", "approved_by": null, "body": "If I ever get enough money, I promise that I'll come back and help you. I hope that everything will go well for you soon. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I ever get enough money, I promise that I&amp;#39;ll come back and help you. I hope that everything will go well for you soon. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2g2yg", "created": 1398528287.0, "author_flair_text": null, "created_utc": 1398499487.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2fxji", "gilded": 0, "author": "yummycorndog", "parent_id": "t3_240cxb", "approved_by": null, "body": "I wish there were people in the world that read posts like these, realized the injustice being done to a good person, and had the (financial) means to do something about it. Some kind of 'credit' to front you, to help you get by for just a little bit longer until maybe, maybe one day, when you feel like you have the capacity to fight, and the will-power to proceed.  But there's no such thing as that. I wish there were. I could use it too. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish there were people in the world that read posts like these, realized the injustice being done to a good person, and had the (financial) means to do something about it. Some kind of &amp;#39;credit&amp;#39; to front you, to help you get by for just a little bit longer until maybe, maybe one day, when you feel like you have the capacity to fight, and the will-power to proceed.  But there&amp;#39;s no such thing as that. I wish there were. I could use it too. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2fxji", "created": 1398527419.0, "author_flair_text": null, "created_utc": 1398498619.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2yhim", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2h7pg", "approved_by": null, "body": "I'm sorry to hear about social anxiety and stress. How are things now? If you'd like, we can message each other about it. I don't know much about helping anyone, but if talking makes you feel better, then I am all ears. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear about social anxiety and stress. How are things now? If you&amp;#39;d like, we can message each other about it. I don&amp;#39;t know much about helping anyone, but if talking makes you feel better, then I am all ears. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yhim", "created": 1398589341.0, "author_flair_text": null, "created_utc": 1398560541.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2h7pg", "gilded": 0, "author": "ffffuuuf", "parent_id": "t3_240cxb", "approved_by": null, "body": "I don't really know what I can say to help but thats really fucked up what you went through, and I hope you can get far away from it as soon as possible. As you can see from all the people who have commented and so on you should try to never blame yourself or hate yourself for how bad you feel or anything you dislike about yourself. Anyone who goes through such horrible experiences is going to have troubles, thats normal.  Sorry to hear how bad you've had it. I also only lasted 2 weeks in uni and then I had to stop going because the social anxiety and stress because of that made it impossible, you accomplished alot more then me!", "edited": 1398510690.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really know what I can say to help but thats really fucked up what you went through, and I hope you can get far away from it as soon as possible. As you can see from all the people who have commented and so on you should try to never blame yourself or hate yourself for how bad you feel or anything you dislike about yourself. Anyone who goes through such horrible experiences is going to have troubles, thats normal.  Sorry to hear how bad you&amp;#39;ve had it. I also only lasted 2 weeks in uni and then I had to stop going because the social anxiety and stress because of that made it impossible, you accomplished alot more then me!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2h7pg", "created": 1398535878.0, "author_flair_text": null, "created_utc": 1398507078.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2yhsh", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2inlx", "approved_by": null, "body": " I appreciate it. Thanks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate it. Thanks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yhsh", "created": 1398589361.0, "author_flair_text": null, "created_utc": 1398560561.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2inlx", "gilded": 0, "author": "yukoko", "parent_id": "t3_240cxb", "approved_by": null, "body": "If you ever, ever need someone to speak to, regardless of what the context is, I'll be here. Send me a PM if you feel like it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you ever, ever need someone to speak to, regardless of what the context is, I&amp;#39;ll be here. Send me a PM if you feel like it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2inlx", "created": 1398544923.0, "author_flair_text": null, "created_utc": 1398516123.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2yit2", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2k81v", "approved_by": null, "body": "I super appreciate it. Thanks. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I super appreciate it. Thanks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yit2", "created": 1398589439.0, "author_flair_text": null, "created_utc": 1398560639.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2k81v", "gilded": 0, "author": "Bwandon", "parent_id": "t3_240cxb", "approved_by": null, "body": "That's a rough childhood, and the thought that your friends cut contact after you opened up to them like that actually makes me really angry. My heart completely goes out to you.\n\nSend me a PM if you'd like to talk about anything, be it your life or just general chit-chat. Smile!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a rough childhood, and the thought that your friends cut contact after you opened up to them like that actually makes me really angry. My heart completely goes out to you.&lt;/p&gt;\n\n&lt;p&gt;Send me a PM if you&amp;#39;d like to talk about anything, be it your life or just general chit-chat. Smile!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2k81v", "created": 1398551250.0, "author_flair_text": null, "created_utc": 1398522450.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch30pzr", "gilded": 0, "author": "exgiexpcv", "parent_id": "t1_ch2zamj", "approved_by": null, "body": "I don't want you to feel alone.  Even if it's just here on Reddit, you have people who want you to succeed and have better, happier life.  Some of us have had serious challenges as well, and we're still here.  Helping others find their way can help us, as well.\n\nIt's not just finding our way to cope to what has happened to us, but find meaning in our lives afterward, to live meaningful lives.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want you to feel alone.  Even if it&amp;#39;s just here on Reddit, you have people who want you to succeed and have better, happier life.  Some of us have had serious challenges as well, and we&amp;#39;re still here.  Helping others find their way can help us, as well.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not just finding our way to cope to what has happened to us, but find meaning in our lives afterward, to live meaningful lives.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch30pzr", "created": 1398595361.0, "author_flair_text": null, "created_utc": 1398566561.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2zamj", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2kv49", "approved_by": null, "body": "I'm really bad with words but you are a very strong and optimistic person. There's a lot of respect that I hold for you and I'm really thankful that you shared your story. \n\nThank you very much for your support. I have talked to my psychologist about other resources but none of them are free. I think taking things one step at a time and solving my issues by myself would be best for now. Again, thanks for your support. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really bad with words but you are a very strong and optimistic person. There&amp;#39;s a lot of respect that I hold for you and I&amp;#39;m really thankful that you shared your story. &lt;/p&gt;\n\n&lt;p&gt;Thank you very much for your support. I have talked to my psychologist about other resources but none of them are free. I think taking things one step at a time and solving my issues by myself would be best for now. Again, thanks for your support. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2zamj", "created": 1398591508.0, "author_flair_text": null, "created_utc": 1398562708.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2kv49", "gilded": 0, "author": "exgiexpcv", "parent_id": "t3_240cxb", "approved_by": null, "body": "Something similar happened to me.  Sexual assault and torture in childhood, lots of physical violence and neglect growing up -- at the time I suspected something was different and wrong with our family, but didn't understand to what degree or why.\n\nI was picked on and brutalised continually throughout my formative and school years, even though I fought back as well.  We were poor in a fairly nice area.  I got PTSD from childhood, same as you likely did, and got more piled on in the military.\n\nI also did poorly in uni, thanks to PTSD, multiple TBIs, multiple assaults during those years, one home invasion, and one reasonably good attempt to murder me.  Add to that I was working full-time, sometimes three jobs at once, while carrying a full load, and trying to apply myself to classes I had no background in, and it was tough.\n\nYou have been through the wringer, same as me.  We will both of us likely deal with the effects of our past trauma for the rest of our lives, **BUT!** in exchange for that trauma, we will see some things more clearly, have insights where the rest of the population has none, and there will be moments like precious gems hanging in the air that they will never experience.\n\nI urge you to keep going.  Find more help.  Ask the professionals you see before you leave your course for suggestions.  Just because uni is working out right now doesn't mean it won't later, or that there isn't meaningful work for you.\n\nAnd know that there are strangers out there who, like me, send their love and encouragement to you, wherever you are.\n\nAnd you can PM me.  Whenever.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something similar happened to me.  Sexual assault and torture in childhood, lots of physical violence and neglect growing up -- at the time I suspected something was different and wrong with our family, but didn&amp;#39;t understand to what degree or why.&lt;/p&gt;\n\n&lt;p&gt;I was picked on and brutalised continually throughout my formative and school years, even though I fought back as well.  We were poor in a fairly nice area.  I got PTSD from childhood, same as you likely did, and got more piled on in the military.&lt;/p&gt;\n\n&lt;p&gt;I also did poorly in uni, thanks to PTSD, multiple TBIs, multiple assaults during those years, one home invasion, and one reasonably good attempt to murder me.  Add to that I was working full-time, sometimes three jobs at once, while carrying a full load, and trying to apply myself to classes I had no background in, and it was tough.&lt;/p&gt;\n\n&lt;p&gt;You have been through the wringer, same as me.  We will both of us likely deal with the effects of our past trauma for the rest of our lives, &lt;strong&gt;BUT!&lt;/strong&gt; in exchange for that trauma, we will see some things more clearly, have insights where the rest of the population has none, and there will be moments like precious gems hanging in the air that they will never experience.&lt;/p&gt;\n\n&lt;p&gt;I urge you to keep going.  Find more help.  Ask the professionals you see before you leave your course for suggestions.  Just because uni is working out right now doesn&amp;#39;t mean it won&amp;#39;t later, or that there isn&amp;#39;t meaningful work for you.&lt;/p&gt;\n\n&lt;p&gt;And know that there are strangers out there who, like me, send their love and encouragement to you, wherever you are.&lt;/p&gt;\n\n&lt;p&gt;And you can PM me.  Whenever.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2kv49", "created": 1398553315.0, "author_flair_text": null, "created_utc": 1398524515.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch335n3", "gilded": 0, "author": "emils_tekcor", "parent_id": "t1_ch2yli7", "approved_by": null, "body": "I havent really been nice I just don't want anyone to be sad ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I havent really been nice I just don&amp;#39;t want anyone to be sad &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch335n3", "created": 1398601999.0, "author_flair_text": null, "created_utc": 1398573199.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2yli7", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2n5n2", "approved_by": null, "body": "You're really nice and I super appreciate your kindness. Thanks. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re really nice and I super appreciate your kindness. Thanks. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2yli7", "created": 1398589643.0, "author_flair_text": null, "created_utc": 1398560843.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2n5n2", "gilded": 0, "author": "emils_tekcor", "parent_id": "t3_240cxb", "approved_by": null, "body": "Wow just wow... okay so I should start with that I don't mind if you are suicidal or anything actually but you have my friendship and can always talk to me while it is horrible beyond words actually I sincerely hope you will at least talk to us and try to rekindle yourself to live and be happy.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow just wow... okay so I should start with that I don&amp;#39;t mind if you are suicidal or anything actually but you have my friendship and can always talk to me while it is horrible beyond words actually I sincerely hope you will at least talk to us and try to rekindle yourself to live and be happy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2n5n2", "created": 1398559844.0, "author_flair_text": null, "created_utc": 1398531044.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch7izuo", "children": ["ch7qwg0"], "name": "t1_ch7qwg0", "id": "ch7qwg0"}}], "after": null, "before": null}}, "saved": false, "id": "ch7izuo", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch7i2mu", "approved_by": null, "body": "Ice cream is great. I ate Marble Slab ice cream consecutively a few days ago. No problems with that. Ice cream is fucking delicious. If you ever need someone to lay down your emotions with, I'm here for you. I don't know if I can do much but I'm definitely here to talk!\n\nI love Naruto! I started watching that when I was 10! Naruto always taught me to believe it and believe in myself. He's such a great idol! Most of my friends watched sailor moon and even though I liked that princess like aspect and being save my by knight in shining armour or whatever, Naruto was the best!\n\nWell it's a great quote. And you live by it right? Forever?\n\nOk! and yeah, they're pretty fun!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ice cream is great. I ate Marble Slab ice cream consecutively a few days ago. No problems with that. Ice cream is fucking delicious. If you ever need someone to lay down your emotions with, I&amp;#39;m here for you. I don&amp;#39;t know if I can do much but I&amp;#39;m definitely here to talk!&lt;/p&gt;\n\n&lt;p&gt;I love Naruto! I started watching that when I was 10! Naruto always taught me to believe it and believe in myself. He&amp;#39;s such a great idol! Most of my friends watched sailor moon and even though I liked that princess like aspect and being save my by knight in shining armour or whatever, Naruto was the best!&lt;/p&gt;\n\n&lt;p&gt;Well it&amp;#39;s a great quote. And you live by it right? Forever?&lt;/p&gt;\n\n&lt;p&gt;Ok! and yeah, they&amp;#39;re pretty fun!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch7izuo", "created": 1399036672.0, "author_flair_text": null, "created_utc": 1399007872.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7i2mu", "gilded": 0, "author": "daniell61", "parent_id": "t1_ch7fx13", "approved_by": null, "body": "cool! and dude. im here for you. you can message me when ever you want :)\n\nI may have just broken up with my good friend who was my girlfriend but thats not keeping me down!(eh who am i lying....i ate half a tub of ice cream yesterday &lt;.&lt;)\n\nand nice. anime is awesome! do you watch/read naruto?\n\ncrime and fantasy. hard to put together but a damn good genre\n\n'\nhow did i make the quote?  \"Never back down, never give up, never stop going for your goal. Ever.\" i googled around. i got nothing.\n\nso i guess i made it and ive never heard it anywhere else. Never back down,(just like a soldier) Never give up(Just like the veteran fighting for his family back home) Never back down(just like the man killing dozens so his family can stay free over here) Never stop going for our goal.(If you have no goal....what are you fighting for?)\n\n\nThats how i understand my quote at least :P\n\nbut seriously. PM me when ever :p and nice. i hear 3DS's are awesome :D", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;cool! and dude. im here for you. you can message me when ever you want :)&lt;/p&gt;\n\n&lt;p&gt;I may have just broken up with my good friend who was my girlfriend but thats not keeping me down!(eh who am i lying....i ate half a tub of ice cream yesterday &amp;lt;.&amp;lt;)&lt;/p&gt;\n\n&lt;p&gt;and nice. anime is awesome! do you watch/read naruto?&lt;/p&gt;\n\n&lt;p&gt;crime and fantasy. hard to put together but a damn good genre&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;\nhow did i make the quote?  &amp;quot;Never back down, never give up, never stop going for your goal. Ever.&amp;quot; i googled around. i got nothing.&lt;/p&gt;\n\n&lt;p&gt;so i guess i made it and ive never heard it anywhere else. Never back down,(just like a soldier) Never give up(Just like the veteran fighting for his family back home) Never back down(just like the man killing dozens so his family can stay free over here) Never stop going for our goal.(If you have no goal....what are you fighting for?)&lt;/p&gt;\n\n&lt;p&gt;Thats how i understand my quote at least :P&lt;/p&gt;\n\n&lt;p&gt;but seriously. PM me when ever :p and nice. i hear 3DS&amp;#39;s are awesome :D&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch7i2mu", "created": 1399033860.0, "author_flair_text": null, "created_utc": 1399005060.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7fx13", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch51904", "approved_by": null, "body": "Sorry, I don't have live. I only have my 3ds right now. If i ever get one, I'll add you!\n\nI usually read some anime or harry potter fanfiction. For books I like crime and fantasy. Can I message you on inbox? I promise I won't bother you everyday and it'll be completely fine if you need to disconnect me whenever.\n\nThe quote is still cool though. But how did you make it up?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I don&amp;#39;t have live. I only have my 3ds right now. If i ever get one, I&amp;#39;ll add you!&lt;/p&gt;\n\n&lt;p&gt;I usually read some anime or harry potter fanfiction. For books I like crime and fantasy. Can I message you on inbox? I promise I won&amp;#39;t bother you everyday and it&amp;#39;ll be completely fine if you need to disconnect me whenever.&lt;/p&gt;\n\n&lt;p&gt;The quote is still cool though. But how did you make it up?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch7fx13", "created": 1399028488.0, "author_flair_text": null, "created_utc": 1398999688.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch51904", "gilded": 0, "author": "daniell61", "parent_id": "t1_ch4s33j", "approved_by": null, "body": "Well that *is* interesting we btoh have a similair teenage growth..\n\nbut alas im in Florida and you dont owe me anything man, and highclass? sure its great paying but ill end up paying off my parents debts :l (we built our house in 00 and the debt is high now...) so that will be fun but managable.\n\nand yeah man if you ever want to hit me up on live my GT is the same as my username\n\nand thank you :) but yeah its true about the comparison... all these people fleeing to the USA who bad mouth the US its funny really... they abandon their country and come here and live of us and then they bitch about how bad it is.....but ignoring htat(shits depresssing yo) i read a lot to man :D\n\nWhat do you tend to read? (is it just me or is my inbox reallly far behind?)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well that &lt;em&gt;is&lt;/em&gt; interesting we btoh have a similair teenage growth..&lt;/p&gt;\n\n&lt;p&gt;but alas im in Florida and you dont owe me anything man, and highclass? sure its great paying but ill end up paying off my parents debts :l (we built our house in 00 and the debt is high now...) so that will be fun but managable.&lt;/p&gt;\n\n&lt;p&gt;and yeah man if you ever want to hit me up on live my GT is the same as my username&lt;/p&gt;\n\n&lt;p&gt;and thank you :) but yeah its true about the comparison... all these people fleeing to the USA who bad mouth the US its funny really... they abandon their country and come here and live of us and then they bitch about how bad it is.....but ignoring htat(shits depresssing yo) i read a lot to man :D&lt;/p&gt;\n\n&lt;p&gt;What do you tend to read? (is it just me or is my inbox reallly far behind?)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch51904", "created": 1398809561.0, "author_flair_text": null, "created_utc": 1398780761.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5rgoa", "gilded": 0, "author": "daniell61", "parent_id": "t1_ch4s33j", "approved_by": null, "body": "and i guess i made the quote myself...\n\n\na quick google search of \"Non redeunt, numquam Numquam subsisto iens in dolor. Semper.\"\n\ntranslation: \"Never back down, never give up, never stop going for your goal. Ever.\"\n\n\neither part shows up in google as this thread only...guess you and me are reddit famous now.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and i guess i made the quote myself...&lt;/p&gt;\n\n&lt;p&gt;a quick google search of &amp;quot;Non redeunt, numquam Numquam subsisto iens in dolor. Semper.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;translation: &amp;quot;Never back down, never give up, never stop going for your goal. Ever.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;either part shows up in google as this thread only...guess you and me are reddit famous now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch5rgoa", "created": 1398864923.0, "author_flair_text": null, "created_utc": 1398836123.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4s33j", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch3wk87", "approved_by": null, "body": "Your past sounds exactly like mine. I spent my teen and even now playing tons of video games. I'm actually going to buy a new game tomorrow secondhand. And I always write and read fanfiction on fanfiction.net and aoo. \n\nI'm happy Redditors were able to help you and your family and friends. I don't have any of the two latter but I got some replies to this post. So I got that going for me, which is good. \n\n98k is really good...it's high class. Middle class is around 50k where I'm from. \n\nYour Mexican example was right. Comparison always makes some of the worst situations seem like heaven. \n\nI live in Alberta, so not one of the big Toronto or Vancouver places. But if you can get me in touch somehow, I'd be forever in your debt. I'd have to treat you to lunch for sure!\n\nI dunno if I need anymore distracting. I've got tons of games to play. You really are helping me. I really appreciate you replying back. There's a unique charm about you that's similar to Rocky Balboa and it's comforting to listen to.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your past sounds exactly like mine. I spent my teen and even now playing tons of video games. I&amp;#39;m actually going to buy a new game tomorrow secondhand. And I always write and read fanfiction on fanfiction.net and aoo. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m happy Redditors were able to help you and your family and friends. I don&amp;#39;t have any of the two latter but I got some replies to this post. So I got that going for me, which is good. &lt;/p&gt;\n\n&lt;p&gt;98k is really good...it&amp;#39;s high class. Middle class is around 50k where I&amp;#39;m from. &lt;/p&gt;\n\n&lt;p&gt;Your Mexican example was right. Comparison always makes some of the worst situations seem like heaven. &lt;/p&gt;\n\n&lt;p&gt;I live in Alberta, so not one of the big Toronto or Vancouver places. But if you can get me in touch somehow, I&amp;#39;d be forever in your debt. I&amp;#39;d have to treat you to lunch for sure!&lt;/p&gt;\n\n&lt;p&gt;I dunno if I need anymore distracting. I&amp;#39;ve got tons of games to play. You really are helping me. I really appreciate you replying back. There&amp;#39;s a unique charm about you that&amp;#39;s similar to Rocky Balboa and it&amp;#39;s comforting to listen to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch4s33j", "created": 1398772734.0, "author_flair_text": null, "created_utc": 1398743934.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3wk87", "gilded": 0, "author": "daniell61", "parent_id": "t1_ch3vfty", "approved_by": null, "body": "Huh saw you mentioned you where in canada over here baristas seem to make pretty good money(tips)\n\nand book stores wihle not superbly high on a resume can get you a job somewhere else(credible, reliable, they dont die out)\n\nhow did i get my act together? aside from my family hounding my ass?(my family has EXTREMELY high expectations...my dad was a first generation engineer in all of my family since they came from cuba and im second generation and i have no idea what to do officially...so im just doing what ever presents an opportunity)\n\n\nwell... i did my best to stop procrastinating. Dropped the excessive amounts of money and time i wasted on games(~$2500 on my xbox 360 alone...) then after that i started focusin on math and 3d modelling a bit(i hate math but im good at it...so everyone tells me)\n\nWhat was i doing procrastinating? gaming when i should have been studying/schooling..reading fanfictions,general dicking around when i shouldnt have been.\n\nI like to think ive picked myself up but it wasnt me... it was a bunch of people on reddit, a bunch of people i know in real life(friends, family, etc) and mainly my best friend. *THEY* are the ones who kept me from ending it all and helping me turn my life around.\n\nAnd yeah helicopter mechanic it sounds more glamoruos than it is(decent paying job though.. 98K a year if you're decent more if youre really good)\n\nWorking to save others lives? eh ide look at it more like i give people the tools to do that instead.\n\nMedtrans(medical division AKA helicopter transport) are the people i intern for, they fly the chopper and get people to the hospital.\n\n\nAnd thank you :) you never know when quotes can be useful i know they've brought me up at times!\n\nWonderful person? aw shucks...i dont know what to say to that\n\nAnd i have your respect? man you are a damn fine individual yourself.\n\nIf i had the childhood you had or the life you had i dont think i would have stayed as calm as you did.\n\nAnd frankly..when it comes to suicide(not trying to guilt trip) i do understand partially why someone would do it...but the thing i can never really get... why? most people who end it think they have nothing but in reality they do have something. Take mexicans in the USA for example... they hop the border and evade our patrols they come here and have NOTHING but each other and they work for dirt money and make a life for themselves...one things for sure they have a good work ethic man....\n\nAnd if you want i might be able to put you in touch with a friend of mine for a job opening if he expands into canada soon :D\n\n\n\nI feel ive helped you a bit... do you think the same man? like always im usually here :)\n\nand if you ever want or need something to read wether real life or fanfiction i know of some good stories people write that can help distract yourself for a bit :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh saw you mentioned you where in canada over here baristas seem to make pretty good money(tips)&lt;/p&gt;\n\n&lt;p&gt;and book stores wihle not superbly high on a resume can get you a job somewhere else(credible, reliable, they dont die out)&lt;/p&gt;\n\n&lt;p&gt;how did i get my act together? aside from my family hounding my ass?(my family has EXTREMELY high expectations...my dad was a first generation engineer in all of my family since they came from cuba and im second generation and i have no idea what to do officially...so im just doing what ever presents an opportunity)&lt;/p&gt;\n\n&lt;p&gt;well... i did my best to stop procrastinating. Dropped the excessive amounts of money and time i wasted on games(~$2500 on my xbox 360 alone...) then after that i started focusin on math and 3d modelling a bit(i hate math but im good at it...so everyone tells me)&lt;/p&gt;\n\n&lt;p&gt;What was i doing procrastinating? gaming when i should have been studying/schooling..reading fanfictions,general dicking around when i shouldnt have been.&lt;/p&gt;\n\n&lt;p&gt;I like to think ive picked myself up but it wasnt me... it was a bunch of people on reddit, a bunch of people i know in real life(friends, family, etc) and mainly my best friend. &lt;em&gt;THEY&lt;/em&gt; are the ones who kept me from ending it all and helping me turn my life around.&lt;/p&gt;\n\n&lt;p&gt;And yeah helicopter mechanic it sounds more glamoruos than it is(decent paying job though.. 98K a year if you&amp;#39;re decent more if youre really good)&lt;/p&gt;\n\n&lt;p&gt;Working to save others lives? eh ide look at it more like i give people the tools to do that instead.&lt;/p&gt;\n\n&lt;p&gt;Medtrans(medical division AKA helicopter transport) are the people i intern for, they fly the chopper and get people to the hospital.&lt;/p&gt;\n\n&lt;p&gt;And thank you :) you never know when quotes can be useful i know they&amp;#39;ve brought me up at times!&lt;/p&gt;\n\n&lt;p&gt;Wonderful person? aw shucks...i dont know what to say to that&lt;/p&gt;\n\n&lt;p&gt;And i have your respect? man you are a damn fine individual yourself.&lt;/p&gt;\n\n&lt;p&gt;If i had the childhood you had or the life you had i dont think i would have stayed as calm as you did.&lt;/p&gt;\n\n&lt;p&gt;And frankly..when it comes to suicide(not trying to guilt trip) i do understand partially why someone would do it...but the thing i can never really get... why? most people who end it think they have nothing but in reality they do have something. Take mexicans in the USA for example... they hop the border and evade our patrols they come here and have NOTHING but each other and they work for dirt money and make a life for themselves...one things for sure they have a good work ethic man....&lt;/p&gt;\n\n&lt;p&gt;And if you want i might be able to put you in touch with a friend of mine for a job opening if he expands into canada soon :D&lt;/p&gt;\n\n&lt;p&gt;I feel ive helped you a bit... do you think the same man? like always im usually here :)&lt;/p&gt;\n\n&lt;p&gt;and if you ever want or need something to read wether real life or fanfiction i know of some good stories people write that can help distract yourself for a bit :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch3wk87", "created": 1398689141.0, "author_flair_text": null, "created_utc": 1398660341.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3vfty", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch34dqf", "approved_by": null, "body": "Nah, Baristas are about 10 an hour. And yea, Chapters is a big bookstore. \n\nHow did you get your act together after procrastinating? What were you doing during that procrastinating time? You really picked yourself up. A helicopter mechanic is an amazing job. You're literally working to save other people's lives. \n\nYou have a lot of quotes in you that I find really helpful. I think you are a wonderful person. I can't really you LT but you're a person that deserves a lot of respect and you have mine.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, Baristas are about 10 an hour. And yea, Chapters is a big bookstore. &lt;/p&gt;\n\n&lt;p&gt;How did you get your act together after procrastinating? What were you doing during that procrastinating time? You really picked yourself up. A helicopter mechanic is an amazing job. You&amp;#39;re literally working to save other people&amp;#39;s lives. &lt;/p&gt;\n\n&lt;p&gt;You have a lot of quotes in you that I find really helpful. I think you are a wonderful person. I can&amp;#39;t really you LT but you&amp;#39;re a person that deserves a lot of respect and you have mine.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch3vfty", "created": 1398686245.0, "author_flair_text": null, "created_utc": 1398657445.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch34dqf", "gilded": 0, "author": "daniell61", "parent_id": "t1_ch2zmzb", "approved_by": null, "body": "Yeah man i know what its like not being able to drive.\n\nNot sure what a chapters is(reader?) but Baristas can make really good money dude.\n\nand glad you like the quote :) its a real quote that applies to everything\n\n\nThink small then think bigger as you go.\n\nhell im finally getting my shit together after four years of being a a procrastinating person and i am doing what i can about it...got a decent intern with a Chopper mechanic(helicopter mechanic... 98K a year job....hard as balls but worth it)\n\n\nyou gotta think small before you think big man :) and rocky was being honest.\n\nIf i can punch with 100 LBS of force but cant take a 10 LBS hit then whats the point?\n\nthere are three options in life as my vet friends say... \"Giveup, try, and stare the challenge in the eye and give it your all.\"\n\n\nTLDR start slow man. incremental rewards help build yourself up. everyone has to work the shitty jobs before they get a good one...it sucks but its true. and damn it if those jobs dont teach you things you need to know.\n\nAnd damn it Vets know a lot more than people give them credit for..and please.... dont call me LT, i havent served in the USAF yet, im serving in the auxillary, Civil Air Patrol FL024.\n\nSearching the ground for stranded people and downed aircraft since 2011.\n\n\n\n\nE: if you want ill be on and off so shoot me a pm or something if you ever want to talk man :)\n\ni always have time for someone who may make a very bad decision....Dont make promises when sugar happy, dont make rash decisions when angry.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah man i know what its like not being able to drive.&lt;/p&gt;\n\n&lt;p&gt;Not sure what a chapters is(reader?) but Baristas can make really good money dude.&lt;/p&gt;\n\n&lt;p&gt;and glad you like the quote :) its a real quote that applies to everything&lt;/p&gt;\n\n&lt;p&gt;Think small then think bigger as you go.&lt;/p&gt;\n\n&lt;p&gt;hell im finally getting my shit together after four years of being a a procrastinating person and i am doing what i can about it...got a decent intern with a Chopper mechanic(helicopter mechanic... 98K a year job....hard as balls but worth it)&lt;/p&gt;\n\n&lt;p&gt;you gotta think small before you think big man :) and rocky was being honest.&lt;/p&gt;\n\n&lt;p&gt;If i can punch with 100 LBS of force but cant take a 10 LBS hit then whats the point?&lt;/p&gt;\n\n&lt;p&gt;there are three options in life as my vet friends say... &amp;quot;Giveup, try, and stare the challenge in the eye and give it your all.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;TLDR start slow man. incremental rewards help build yourself up. everyone has to work the shitty jobs before they get a good one...it sucks but its true. and damn it if those jobs dont teach you things you need to know.&lt;/p&gt;\n\n&lt;p&gt;And damn it Vets know a lot more than people give them credit for..and please.... dont call me LT, i havent served in the USAF yet, im serving in the auxillary, Civil Air Patrol FL024.&lt;/p&gt;\n\n&lt;p&gt;Searching the ground for stranded people and downed aircraft since 2011.&lt;/p&gt;\n\n&lt;p&gt;E: if you want ill be on and off so shoot me a pm or something if you ever want to talk man :)&lt;/p&gt;\n\n&lt;p&gt;i always have time for someone who may make a very bad decision....Dont make promises when sugar happy, dont make rash decisions when angry.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch34dqf", "created": 1398605797.0, "author_flair_text": null, "created_utc": 1398576997.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2zmzb", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2onk9", "approved_by": null, "body": "I wrote down the quote because I really like it. It reminds me of my favorite quotes by Rocky Balboa's \"It ain't about how hard you hit. It's about hard hard you can get hit and keep moving forward. How much you can take, and keep moving forward. That's how winning is done.\" \n\nI've thought about applying at Chapters or a Barista job. The thing that is holding me back is that these jobs pay minumum wage and they don't look so good on my resume at age 19. \n\nShort goals. Yeah. I'm think of getting my learner's for driving and exercising more. I'm too focused on getting the big thing, the big money making career with a good pension that I never do small things to build up to that big change. It's a good reminder for me. \n\nI really appreciate you taking the time to reply to my post. \n\nThank you LT daniell61. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote down the quote because I really like it. It reminds me of my favorite quotes by Rocky Balboa&amp;#39;s &amp;quot;It ain&amp;#39;t about how hard you hit. It&amp;#39;s about hard hard you can get hit and keep moving forward. How much you can take, and keep moving forward. That&amp;#39;s how winning is done.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve thought about applying at Chapters or a Barista job. The thing that is holding me back is that these jobs pay minumum wage and they don&amp;#39;t look so good on my resume at age 19. &lt;/p&gt;\n\n&lt;p&gt;Short goals. Yeah. I&amp;#39;m think of getting my learner&amp;#39;s for driving and exercising more. I&amp;#39;m too focused on getting the big thing, the big money making career with a good pension that I never do small things to build up to that big change. It&amp;#39;s a good reminder for me. &lt;/p&gt;\n\n&lt;p&gt;I really appreciate you taking the time to reply to my post. &lt;/p&gt;\n\n&lt;p&gt;Thank you LT daniell61. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2zmzb", "created": 1398592433.0, "author_flair_text": null, "created_utc": 1398563633.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2onk9", "gilded": 0, "author": "daniell61", "parent_id": "t3_240cxb", "approved_by": null, "body": "No one is a failure.\n\nMy uncle was a grade A+ student and flunked college. now he is working week to week to pay things off.\n\nNO ONE is a failure those who tell you that you are a failure are just scared of what you can become..\n\ni know someone who grew up with virtually nothing and now he owns a 2 million dollar yacht and he is rich...\n\n\nTry distancing yourself from your parents a little, sounds like they dont know how to handle life very well and are reacting how they think is fit(which really isnt very ideal..)\n\nmaybe you could try picking up a less stress full job? walmart? target? gamestop? EBgames? hell you could try finding a scrapyard and working there to or mabe find a place that takes adn teachers you how to weld?\n\nThere is always something out there for everyone. the hard thing about it is finding *What* that something is for you...\n\nI cant say my childhood was like yours so im not going to try. that shit is tough man...if you ever want someone to just vent to feel free to PM me im usually on reddit :)\n\nBut hell you can get through this man. We're all here to support you. dont let anyone tell you that you are worthless....you are worth more than you think.\none of my motto's which is also a military quote is this:\n\n\"Non redeunt, numquam Numquam subsisto iens in dolor. Semper.\" it means \"Never back down, never give up, never stop going for your goal. Ever.\"\n\nJust remember. never back down. never stop. Always go for your goals.\n\nSo set some goals for yourself. they can be short term or long term.\n\nA short term goal could be get a simple job, or find a trade and pick it up.\n\nGood luck man we're always here for you.\n\n-2nd LT daniell61. USA\n\n\n(Mods if you believe that im being tough or braking a rule you may delete this post or alert me. do so at your choice)\n\n", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one is a failure.&lt;/p&gt;\n\n&lt;p&gt;My uncle was a grade A+ student and flunked college. now he is working week to week to pay things off.&lt;/p&gt;\n\n&lt;p&gt;NO ONE is a failure those who tell you that you are a failure are just scared of what you can become..&lt;/p&gt;\n\n&lt;p&gt;i know someone who grew up with virtually nothing and now he owns a 2 million dollar yacht and he is rich...&lt;/p&gt;\n\n&lt;p&gt;Try distancing yourself from your parents a little, sounds like they dont know how to handle life very well and are reacting how they think is fit(which really isnt very ideal..)&lt;/p&gt;\n\n&lt;p&gt;maybe you could try picking up a less stress full job? walmart? target? gamestop? EBgames? hell you could try finding a scrapyard and working there to or mabe find a place that takes adn teachers you how to weld?&lt;/p&gt;\n\n&lt;p&gt;There is always something out there for everyone. the hard thing about it is finding &lt;em&gt;What&lt;/em&gt; that something is for you...&lt;/p&gt;\n\n&lt;p&gt;I cant say my childhood was like yours so im not going to try. that shit is tough man...if you ever want someone to just vent to feel free to PM me im usually on reddit :)&lt;/p&gt;\n\n&lt;p&gt;But hell you can get through this man. We&amp;#39;re all here to support you. dont let anyone tell you that you are worthless....you are worth more than you think.\none of my motto&amp;#39;s which is also a military quote is this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Non redeunt, numquam Numquam subsisto iens in dolor. Semper.&amp;quot; it means &amp;quot;Never back down, never give up, never stop going for your goal. Ever.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Just remember. never back down. never stop. Always go for your goals.&lt;/p&gt;\n\n&lt;p&gt;So set some goals for yourself. they can be short term or long term.&lt;/p&gt;\n\n&lt;p&gt;A short term goal could be get a simple job, or find a trade and pick it up.&lt;/p&gt;\n\n&lt;p&gt;Good luck man we&amp;#39;re always here for you.&lt;/p&gt;\n\n&lt;p&gt;-2nd LT daniell61. USA&lt;/p&gt;\n\n&lt;p&gt;(Mods if you believe that im being tough or braking a rule you may delete this post or alert me. do so at your choice)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2onk9", "created": 1398563742.0, "author_flair_text": null, "created_utc": 1398534942.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5g7r1", "gilded": 0, "author": "thewisefoolHHH", "parent_id": "t1_ch2zygn", "approved_by": null, "body": "No problem man. I know exactly what you're going through, and if you need someone to talk to, don't even hesitate to send me a message. Best of luck bud.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem man. I know exactly what you&amp;#39;re going through, and if you need someone to talk to, don&amp;#39;t even hesitate to send me a message. Best of luck bud.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch5g7r1", "created": 1398839990.0, "author_flair_text": null, "created_utc": 1398811190.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2zygn", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2peij", "approved_by": null, "body": "Thanks for sharing your story. I really appreciate it. You are a strong person and I'm happy that you are in a better situation.\n\n&gt;  it's absolutely true when they say things get better. \n\nEvery I turn to help I hear this sentence. I really hope it applies to every single one in the world that's suffering. It's something for people to look forward to and I'm happy that there are people who recover and become successful in their lives. \n\nThank you very much for replying to my post. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for sharing your story. I really appreciate it. You are a strong person and I&amp;#39;m happy that you are in a better situation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s absolutely true when they say things get better. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Every I turn to help I hear this sentence. I really hope it applies to every single one in the world that&amp;#39;s suffering. It&amp;#39;s something for people to look forward to and I&amp;#39;m happy that there are people who recover and become successful in their lives. &lt;/p&gt;\n\n&lt;p&gt;Thank you very much for replying to my post. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2zygn", "created": 1398593308.0, "author_flair_text": null, "created_utc": 1398564508.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2peij", "gilded": 0, "author": "thewisefoolHHH", "parent_id": "t3_240cxb", "approved_by": null, "body": "I'm in the same boat man. For so long, my parents abused me verbally and physically. My mom would say that I was too stupid to make it into community college, and every day she would shatter my self-esteem. She would make me feel so bad about myself, and then my dad would beat me afterwards, and late elementary school to the end of high school was a miserable experience for me.\n\nWhen I came to college, that translated over. I didn't do well in my courses at all, and I got put on academic probation my first semester. Then my dad had a stroke and my world was flipped upside down. My grades kept getting worse and worse, and at some point I quit school for a semester to figure myself out before I ruined my future. \n\nI came back feeling much better about myself. I took time away from my parents, away from my friends, away from my ex-girlfriend, away from anyone and everyone who may have made me feel poorly about myself, and when I came back I felt like I knew who I was. But those 10 years up until then, with the abuse and not being able to tell my friends what was going on in my life for fear of being a charity case, those were 10 years I wouldn't wish on even my worst enemy.\n\nHonestly, nothing is worse than knowing that the two people who are supposed to look after you the most in life--your mom and dad--were the ones making your life miserable, on top of bullying at school. I felt like I didn't belong anywhere, and at some points I was damn near suicidal. But I kept going, and it's absolutely true when they say things get better. \n\nNobody's life will ever be perfect, and yours and mine may have been far from it, but there's always room to make it better. Keep going man, and if I could give you a hug I would. I know how it feels, and I really hope you pull through. Take time for yourself and focus on figuring out who you are, get past all the shit in your past, and I think you'll be glad you did.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the same boat man. For so long, my parents abused me verbally and physically. My mom would say that I was too stupid to make it into community college, and every day she would shatter my self-esteem. She would make me feel so bad about myself, and then my dad would beat me afterwards, and late elementary school to the end of high school was a miserable experience for me.&lt;/p&gt;\n\n&lt;p&gt;When I came to college, that translated over. I didn&amp;#39;t do well in my courses at all, and I got put on academic probation my first semester. Then my dad had a stroke and my world was flipped upside down. My grades kept getting worse and worse, and at some point I quit school for a semester to figure myself out before I ruined my future. &lt;/p&gt;\n\n&lt;p&gt;I came back feeling much better about myself. I took time away from my parents, away from my friends, away from my ex-girlfriend, away from anyone and everyone who may have made me feel poorly about myself, and when I came back I felt like I knew who I was. But those 10 years up until then, with the abuse and not being able to tell my friends what was going on in my life for fear of being a charity case, those were 10 years I wouldn&amp;#39;t wish on even my worst enemy.&lt;/p&gt;\n\n&lt;p&gt;Honestly, nothing is worse than knowing that the two people who are supposed to look after you the most in life--your mom and dad--were the ones making your life miserable, on top of bullying at school. I felt like I didn&amp;#39;t belong anywhere, and at some points I was damn near suicidal. But I kept going, and it&amp;#39;s absolutely true when they say things get better. &lt;/p&gt;\n\n&lt;p&gt;Nobody&amp;#39;s life will ever be perfect, and yours and mine may have been far from it, but there&amp;#39;s always room to make it better. Keep going man, and if I could give you a hug I would. I know how it feels, and I really hope you pull through. Take time for yourself and focus on figuring out who you are, get past all the shit in your past, and I think you&amp;#39;ll be glad you did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2peij", "created": 1398565655.0, "author_flair_text": null, "created_utc": 1398536855.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch343he", "gilded": 0, "author": "OmegaJaeger", "parent_id": "t1_ch2ysjz", "approved_by": null, "body": "Thanks for the support! Hope you can overcome the hardships that trouble you now and what lies ahead. Whenever you need someone to vent to, I am here for you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the support! Hope you can overcome the hardships that trouble you now and what lies ahead. Whenever you need someone to vent to, I am here for you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch343he", "created": 1398604822.0, "author_flair_text": null, "created_utc": 1398576022.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2ysjz", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2pxjw", "approved_by": null, "body": "Thanks for the offer Omega, I really appreciate it. Good luck with high school. I hope you have lots of fun!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the offer Omega, I really appreciate it. Good luck with high school. I hope you have lots of fun!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2ysjz", "created": 1398590171.0, "author_flair_text": null, "created_utc": 1398561371.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2pxjw", "gilded": 0, "author": "OmegaJaeger", "parent_id": "t3_240cxb", "approved_by": null, "body": "Wow, that's a tough childhood. I cannot fathom the pain you suffered through. But, try and meet friends of similar interests and who are all around sensible. I am only a high school freshman, but I understand your pain. If you need to talk, just PM me or ask for my skype. I will be happy enough to help you through your struggles. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that&amp;#39;s a tough childhood. I cannot fathom the pain you suffered through. But, try and meet friends of similar interests and who are all around sensible. I am only a high school freshman, but I understand your pain. If you need to talk, just PM me or ask for my skype. I will be happy enough to help you through your struggles. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2pxjw", "created": 1398566991.0, "author_flair_text": null, "created_utc": 1398538191.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ehtw", "gilded": 0, "author": "canyouhelp8", "parent_id": "t1_ch2dmmw", "approved_by": null, "body": "Thanks for your kind words. It feels very unfair to know good people don't get good results. It's why I hate trying so hard and why I hate that I push myself to try hard. \n\nThanks for offering to talk to me. I might have to take up your offer. If it's alright, I'd like to hear about your experiences as well. Please let me know if I ever drag you down though. I know how these \"let's talk\" \"ok\" things work. Haha.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your kind words. It feels very unfair to know good people don&amp;#39;t get good results. It&amp;#39;s why I hate trying so hard and why I hate that I push myself to try hard. &lt;/p&gt;\n\n&lt;p&gt;Thanks for offering to talk to me. I might have to take up your offer. If it&amp;#39;s alright, I&amp;#39;d like to hear about your experiences as well. Please let me know if I ever drag you down though. I know how these &amp;quot;let&amp;#39;s talk&amp;quot; &amp;quot;ok&amp;quot; things work. Haha.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2ehtw", "created": 1398520898.0, "author_flair_text": null, "created_utc": 1398492098.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch2dmmw", "gilded": 0, "author": "Shinikage1", "parent_id": "t3_240cxb", "approved_by": null, "body": "None of those things are your fault, therefore you shouldn't let it ruin your life. As a person who went through similar occurrences, I found an outcome in using my skills to break out of my bad cycle of life. I've always enjoyed drawing and was quite good at it but at uni I didn't study anything of the sorts and flunked (twice btw). I then put all effort into the only thing that seemed worth my time which was drawing. I submitted art online and was hired hired by a small company and am now an illustrator. I live by myself, far away from my family. \n\nI have already tried to commit suicide twice a few years ago. It obviously failed, but the truth is it really is never a solution. I hope that you understand that people are never born into an equally peaceful environment. You need to take charge of your existence. \n\nAs for the horrible ordeal you suffered as a child, it truly enraged me to hear that. I understand what its like to have parents like that. Constantly feeling that you have been a wasteful burden to them. I am no psychologist, but I will always help through a conversation if you need someone to talk to.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;None of those things are your fault, therefore you shouldn&amp;#39;t let it ruin your life. As a person who went through similar occurrences, I found an outcome in using my skills to break out of my bad cycle of life. I&amp;#39;ve always enjoyed drawing and was quite good at it but at uni I didn&amp;#39;t study anything of the sorts and flunked (twice btw). I then put all effort into the only thing that seemed worth my time which was drawing. I submitted art online and was hired hired by a small company and am now an illustrator. I live by myself, far away from my family. &lt;/p&gt;\n\n&lt;p&gt;I have already tried to commit suicide twice a few years ago. It obviously failed, but the truth is it really is never a solution. I hope that you understand that people are never born into an equally peaceful environment. You need to take charge of your existence. &lt;/p&gt;\n\n&lt;p&gt;As for the horrible ordeal you suffered as a child, it truly enraged me to hear that. I understand what its like to have parents like that. Constantly feeling that you have been a wasteful burden to them. I am no psychologist, but I will always help through a conversation if you need someone to talk to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240cxb", "score_hidden": false, "name": "t1_ch2dmmw", "created": 1398518022.0, "author_flair_text": null, "created_utc": 1398489222.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]