[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had bouts of depression since I was a teen and took an overdose when I was 16. I had to take a year out of school to recover/get my shit together enough to face normality. I&amp;#39;ve been extremely anxious for as long as I can remember, but it only dawned on me fairly recently it&amp;#39;s a severe issue (I occasionally have panic attacks and almost constantly feel extremely self-conscious). I&amp;#39;ve been on an SSRI for a while but it&amp;#39;s been really getting me down recently, even though I am hopefully going to start some CBT when I finish my exams (I&amp;#39;m a final year university student). Sometimes I just hate the way I am but can&amp;#39;t stop my body freaking out. I sometimes feel like I&amp;#39;m going to pass out in a supermarket or walking down the street because I feel so anxious/embarrassed to be seen. I sometimes feel like my brain is shutting down if I have to speak to someone who catches me really off-guard because I feel like I&amp;#39;m stupid/awkward as soon as we start talking. Last week I nearly passed out in the shower and had to lie down in the bathroom to stop myself feeling like I was having a mental breakdown.&lt;/p&gt;\n\n&lt;p&gt;I have a wide circle of friends, and a few very close ones I love very much, so I am not isolated by any means. I&amp;#39;ve never had trouble making/having friends but I was also bullied through secondary school, so I suppose that&amp;#39;s what triggered my social anxiety. I just feel like I can&amp;#39;t really honestly talk to anyone about it because they just don&amp;#39;t get it when I say I feel like I&amp;#39;m going to have a nervous breakdown/start shaking when I&amp;#39;m doing something as normal as buying some groceries. Some of my friends have told me they look up to me as a confident person, so they just don&amp;#39;t get how I could have these problems because they don&amp;#39;t see me like that. My mother is very supportive and has been amazing throughout my ups and downs but I hate talking to her about things other than letting her know I&amp;#39;m not in a good place because it upsets her, and must remind her of how much my suicide attempt hurt her.&lt;/p&gt;\n\n&lt;p&gt;Since my first bout of depression I&amp;#39;ve swung between phases of being severely depressed and feeling normal/happy, so I can&amp;#39;t say I feel completely hopeless. It&amp;#39;s more that when I feel really down/hate myself I have thoughts about slitting my wrists or taking an overdose, and not having to carry on. I love my mother and sister very, very much and when I recall what I did to them when I tried to kill myself, I don&amp;#39;t think I would ever actually follow through with it again. It&amp;#39;s just making me feel terrible because it comes into my mind a lot when I&amp;#39;m having a &amp;#39;black day&amp;#39;. I still enjoy things when I&amp;#39;m doing them, like going out with my friends, but I am finding it so hard to get out of bed in the morning. Often I sleep until 1-2pm because I don&amp;#39;t want to face the day.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t lack happiness in my life, but I also often feel really depressed and like I can&amp;#39;t face the day. I don&amp;#39;t feel down all the time and still have days where I feel good, but I think depression is turning into a serious problem again. I feel terrible that I keep thinking about committing suicide when I know the devastation it would cause everyone I care about. I just feel horrible and confused.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had bouts of depression since I was a teen and took an overdose when I was 16. I had to take a year out of school to recover/get my shit together enough to face normality. I've been extremely anxious for as long as I can remember, but it only dawned on me fairly recently it's a severe issue (I occasionally have panic attacks and almost constantly feel extremely self-conscious). I've been on an SSRI for a while but it's been really getting me down recently, even though I am hopefully going to start some CBT when I finish my exams (I'm a final year university student). Sometimes I just hate the way I am but can't stop my body freaking out. I sometimes feel like I'm going to pass out in a supermarket or walking down the street because I feel so anxious/embarrassed to be seen. I sometimes feel like my brain is shutting down if I have to speak to someone who catches me really off-guard because I feel like I'm stupid/awkward as soon as we start talking. Last week I nearly passed out in the shower and had to lie down in the bathroom to stop myself feeling like I was having a mental breakdown.\n\nI have a wide circle of friends, and a few very close ones I love very much, so I am not isolated by any means. I've never had trouble making/having friends but I was also bullied through secondary school, so I suppose that's what triggered my social anxiety. I just feel like I can't really honestly talk to anyone about it because they just don't get it when I say I feel like I'm going to have a nervous breakdown/start shaking when I'm doing something as normal as buying some groceries. Some of my friends have told me they look up to me as a confident person, so they just don't get how I could have these problems because they don't see me like that. My mother is very supportive and has been amazing throughout my ups and downs but I hate talking to her about things other than letting her know I'm not in a good place because it upsets her, and must remind her of how much my suicide attempt hurt her.\n\nSince my first bout of depression I've swung between phases of being severely depressed and feeling normal/happy, so I can't say I feel completely hopeless. It's more that when I feel really down/hate myself I have thoughts about slitting my wrists or taking an overdose, and not having to carry on. I love my mother and sister very, very much and when I recall what I did to them when I tried to kill myself, I don't think I would ever actually follow through with it again. It's just making me feel terrible because it comes into my mind a lot when I'm having a 'black day'. I still enjoy things when I'm doing them, like going out with my friends, but I am finding it so hard to get out of bed in the morning. Often I sleep until 1-2pm because I don't want to face the day.\n\nI don't lack happiness in my life, but I also often feel really depressed and like I can't face the day. I don't feel down all the time and still have days where I feel good, but I think depression is turning into a serious problem again. I feel terrible that I keep thinking about committing suicide when I know the devastation it would cause everyone I care about. I just feel horrible and confused.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2483t2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "icouldthrowitaway", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398724585.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2483t2/recurring_thoughts_of_suicide_i_need_to_talk_about/", "name": "t3_2483t2", "created": 1398752203.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2483t2/recurring_thoughts_of_suicide_i_need_to_talk_about/", "author_flair_text": null, "title": "Recurring thoughts of suicide I need to talk about.", "created_utc": 1398723403.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4km1x", "gilded": 0, "author": "saved_by_grace", "parent_id": "t3_2483t2", "approved_by": null, "body": "I'm here if you want to talk. Reply here or PM me ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m here if you want to talk. Reply here or PM me &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2483t2", "score_hidden": false, "name": "t1_ch4km1x", "created": 1398732173.0, "author_flair_text": null, "created_utc": 1398728573.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]