[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This will be a long post, I appreciate the time taken to read it if you do.&lt;/p&gt;\n\n&lt;p&gt;Heartbreak is a powerful thing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 21, male, I live in the UK and I&amp;#39;ve never had many friends. I&amp;#39;ve never been a very happy person, and I currently see a therapist for severe anxiety and depression. Today, I made my first major step in 21 years towards happiness.&lt;/p&gt;\n\n&lt;p&gt;Back in 2007/08, I was 15, and I met my first love. This girl was beautiful. I was with her every waking moment and I was head over heels in love. But naturally, things began to break down. Eventually, she turned into.. Someone else. She hurt me for fun, until that unforgettable night in August 08. She told me straight up she was going to cheat. I was powerless, she was out with this guy and I was laid in bed, unable to do anything but cry. She broke my heart, and I thought that was game over for me. I attempted suicide, I failed and I moved on.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to 2010, and I&amp;#39;m finally ready to open up again. She was intelligent, funny, and her smile put the stars to shame. A few months in we were at a party together, and she told me she loved me for the first time. My smile touched my ears, I kissed her, and I told her I loved her too. That same night, she drunkenly slept with one of my best friends. I forgave her, and we went another year. Another year of torture, it was always at the back of my mind. I wanted to spend my life with this girl, but I just couldn&amp;#39;t. Eventually the lack of trust broke us apart, and I was done for. I actually feared love.&lt;/p&gt;\n\n&lt;p&gt;Jump ahead again to March, last year, when I meet a girl in Leeds. I was scared, but she opened me up and warmed my heart, and I fell for her. I went to a party to see her (Getting to Leeds is about 45mins on the train, so I didn&amp;#39;t see her regularly). I saw her in the corridor, and she sprinted up to me, grabbed me and kissed me for the first time. In front of everybody. It was like a movie scene, only without the cameras, the good looking guy and of course... The happy ending. That same night, the girls went to see live bands while the guys played football. We got back first and I waited for her excitedly. She eventually returned, with another guy, slept with him and never spoke to me again. I left at 5am, sat at the station for 3 hours and thought about just.. Jumping.&lt;/p&gt;\n\n&lt;p&gt;But life goes on. And in August last year, I started hanging with a girl I&amp;#39;ve known as an acquaintance since I was a child. She quickly became my best friend. Now.. How I&amp;#39;ve spoken about these girls is true, and while they all had their unique personalities and all beautiful - This one was the diamond. We did everything together, nobody could get us away from eachother, and I fell in love. We were very intimate, we did sleep together twice, but she never quite felt the same way back, which hurt. Nevertheless, I loved this girl more than I&amp;#39;ve ever loved anything in my life. When I was with her, time stopped, nothing else mattered. Now I&amp;#39;m crying haha, but anyway. Last night, I was with her, and she was texting this other guy all night. When she left, she just shut me out. Completely. She still won&amp;#39;t speak to me. I spent all night last night crying, and I wanted to die. End it. Nothing mattered anymore. One minute I was with her laughing, seeing her beautiful smile and knowing it was for me. Next minute, gone. I was just about to kill myself, but I just couldn&amp;#39;t do it. And here&amp;#39;s why.&lt;/p&gt;\n\n&lt;p&gt;Back in 2011, in August (I hate August), my dad attempted suicide. I&amp;#39;m thankful every day that he survived, but the effect it had on me was devastating. So I didn&amp;#39;t do it.&lt;/p&gt;\n\n&lt;p&gt;So now, reddit, you&amp;#39;re thinking - Where&amp;#39;s this going?&lt;/p&gt;\n\n&lt;p&gt;I woke up today, and I refused to be upset. Heartbreak is a powerful thing, when used correctly. I&amp;#39;ve chosen to better myself.&lt;/p&gt;\n\n&lt;p&gt;I wanted to slam the door on my life, my friends, my job - everything. And just start again. But the past is what defines you. So instead, I left the door open, and I opened a new one.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve decided to power through my shitty minimum wage job to pay for the Accounting course I applied for today. I&amp;#39;ve decided to make more friends, and make people feel happy. I&amp;#39;ve decided to be happy. And I am.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still hurt, and I cry, but I&amp;#39;m taking steps to make myself better. You may hate yourself, hate your body, and hate your life. But those things never say a bad word about you. Treat them well, actively drive yourself towards happiness, and good luck to every single one of you through your troubles.&lt;/p&gt;\n\n&lt;p&gt;If you ever need a friend, a shoulder, or just somebody to listen. I&amp;#39;m here for you. All of you. Let&amp;#39;s get through this together.&lt;/p&gt;\n\n&lt;p&gt;Love. Live. Laugh.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This will be a long post, I appreciate the time taken to read it if you do.\n\nHeartbreak is a powerful thing.\n\nI'm 21, male, I live in the UK and I've never had many friends. I've never been a very happy person, and I currently see a therapist for severe anxiety and depression. Today, I made my first major step in 21 years towards happiness.\n\nBack in 2007/08, I was 15, and I met my first love. This girl was beautiful. I was with her every waking moment and I was head over heels in love. But naturally, things began to break down. Eventually, she turned into.. Someone else. She hurt me for fun, until that unforgettable night in August 08. She told me straight up she was going to cheat. I was powerless, she was out with this guy and I was laid in bed, unable to do anything but cry. She broke my heart, and I thought that was game over for me. I attempted suicide, I failed and I moved on.\n\nFast forward to 2010, and I'm finally ready to open up again. She was intelligent, funny, and her smile put the stars to shame. A few months in we were at a party together, and she told me she loved me for the first time. My smile touched my ears, I kissed her, and I told her I loved her too. That same night, she drunkenly slept with one of my best friends. I forgave her, and we went another year. Another year of torture, it was always at the back of my mind. I wanted to spend my life with this girl, but I just couldn't. Eventually the lack of trust broke us apart, and I was done for. I actually feared love.\n\nJump ahead again to March, last year, when I meet a girl in Leeds. I was scared, but she opened me up and warmed my heart, and I fell for her. I went to a party to see her (Getting to Leeds is about 45mins on the train, so I didn't see her regularly). I saw her in the corridor, and she sprinted up to me, grabbed me and kissed me for the first time. In front of everybody. It was like a movie scene, only without the cameras, the good looking guy and of course... The happy ending. That same night, the girls went to see live bands while the guys played football. We got back first and I waited for her excitedly. She eventually returned, with another guy, slept with him and never spoke to me again. I left at 5am, sat at the station for 3 hours and thought about just.. Jumping.\n\nBut life goes on. And in August last year, I started hanging with a girl I've known as an acquaintance since I was a child. She quickly became my best friend. Now.. How I've spoken about these girls is true, and while they all had their unique personalities and all beautiful - This one was the diamond. We did everything together, nobody could get us away from eachother, and I fell in love. We were very intimate, we did sleep together twice, but she never quite felt the same way back, which hurt. Nevertheless, I loved this girl more than I've ever loved anything in my life. When I was with her, time stopped, nothing else mattered. Now I'm crying haha, but anyway. Last night, I was with her, and she was texting this other guy all night. When she left, she just shut me out. Completely. She still won't speak to me. I spent all night last night crying, and I wanted to die. End it. Nothing mattered anymore. One minute I was with her laughing, seeing her beautiful smile and knowing it was for me. Next minute, gone. I was just about to kill myself, but I just couldn't do it. And here's why.\n\nBack in 2011, in August (I hate August), my dad attempted suicide. I'm thankful every day that he survived, but the effect it had on me was devastating. So I didn't do it.\n\nSo now, reddit, you're thinking - Where's this going?\n\nI woke up today, and I refused to be upset. Heartbreak is a powerful thing, when used correctly. I've chosen to better myself.\n\nI wanted to slam the door on my life, my friends, my job - everything. And just start again. But the past is what defines you. So instead, I left the door open, and I opened a new one.\n\nI've decided to power through my shitty minimum wage job to pay for the Accounting course I applied for today. I've decided to make more friends, and make people feel happy. I've decided to be happy. And I am.\n\nI'm still hurt, and I cry, but I'm taking steps to make myself better. You may hate yourself, hate your body, and hate your life. But those things never say a bad word about you. Treat them well, actively drive yourself towards happiness, and good luck to every single one of you through your troubles.\n\nIf you ever need a friend, a shoulder, or just somebody to listen. I'm here for you. All of you. Let's get through this together.\n\nLove. Live. Laugh.\n\nThank you for reading.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252ll6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Legatron", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252ll6/rsuicidewatch_let_me_share_my_story/", "name": "t3_252ll6", "created": 1399610399.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252ll6/rsuicidewatch_let_me_share_my_story/", "author_flair_text": null, "title": "/r/suicidewatch, let me share my story", "created_utc": 1399581599.0, "ups": 10, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd5emm", "gilded": 0, "author": "Legatron", "parent_id": "t1_chd2xbb", "approved_by": null, "body": "That quote is beautiful, thank you so much for sharing. It should be in a post of it's own for everyone else to see ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That quote is beautiful, thank you so much for sharing. It should be in a post of it&amp;#39;s own for everyone else to see &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd5emm", "created": 1399619763.0, "author_flair_text": null, "created_utc": 1399590963.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chd2xbb", "gilded": 0, "author": "womancat", "parent_id": "t3_252ll6", "approved_by": null, "body": "d(·__· )b *insert here a highfive* OP, it's both wonderful and terrible to read your story here! I've had some breakups on the past year that left me some bad scars, but that isn't going to put me down for too long.\n\nI'll leave here a quote from the Art of Loving (Erich Fromm), which I wanted to share\n\"To die is poignantly bitter, but the idea of having to die without having lived is unbearable\".", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;d(·__· )b &lt;em&gt;insert here a highfive&lt;/em&gt; OP, it&amp;#39;s both wonderful and terrible to read your story here! I&amp;#39;ve had some breakups on the past year that left me some bad scars, but that isn&amp;#39;t going to put me down for too long.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll leave here a quote from the Art of Loving (Erich Fromm), which I wanted to share\n&amp;quot;To die is poignantly bitter, but the idea of having to die without having lived is unbearable&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd2xbb", "created": 1399614245.0, "author_flair_text": null, "created_utc": 1399585445.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd5u6y", "gilded": 0, "author": "Legatron", "parent_id": "t1_chd5mv8", "approved_by": null, "body": "I will definitely try, as hard as it may be. Your words are encouraging, and I'm really grateful. I wish you all the luck in the world. You seem like a great person, I'm sure you'll make some good friends", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will definitely try, as hard as it may be. Your words are encouraging, and I&amp;#39;m really grateful. I wish you all the luck in the world. You seem like a great person, I&amp;#39;m sure you&amp;#39;ll make some good friends&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd5u6y", "created": 1399620740.0, "author_flair_text": null, "created_utc": 1399591940.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chd5mv8", "gilded": 0, "author": "heyimtalking", "parent_id": "t1_chd5dpn", "approved_by": null, "body": "I would absolutely hope that you get out there, your story is inspiring for me as I tend to stay in my cave and have very few people in my life that care about me. I would encourage you to be open, but also maybe be a little guarded in how much you emotionally invest in a person before you can truly understand who they are and whether you can trust them. I'd like to hope that it was bad luck that you were in a series of relationships with people who cheated, but maybe it is you being too trusting too quickly? Obviously, I don't know, and no matter what, it is certainly not your fault that they are terrible people, but I would urge you to put yourself out there and try and meet a wide variety of people and only get closer to the ones who seem like decent people who aren't going to hurt you. That's my aim - I'm moving to a new city in a few weeks and I only know my roommate.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would absolutely hope that you get out there, your story is inspiring for me as I tend to stay in my cave and have very few people in my life that care about me. I would encourage you to be open, but also maybe be a little guarded in how much you emotionally invest in a person before you can truly understand who they are and whether you can trust them. I&amp;#39;d like to hope that it was bad luck that you were in a series of relationships with people who cheated, but maybe it is you being too trusting too quickly? Obviously, I don&amp;#39;t know, and no matter what, it is certainly not your fault that they are terrible people, but I would urge you to put yourself out there and try and meet a wide variety of people and only get closer to the ones who seem like decent people who aren&amp;#39;t going to hurt you. That&amp;#39;s my aim - I&amp;#39;m moving to a new city in a few weeks and I only know my roommate.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd5mv8", "created": 1399620282.0, "author_flair_text": null, "created_utc": 1399591482.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chd5dpn", "gilded": 0, "author": "Legatron", "parent_id": "t1_chd55vs", "approved_by": null, "body": "Thank you. I have my problems but I've never hurt anyone in my life. I'm a nice guy, but maybe that's the problem.\n\nI'm considering getting back out there, because I am alone, but unfortunately anxiety is a bitch :(", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I have my problems but I&amp;#39;ve never hurt anyone in my life. I&amp;#39;m a nice guy, but maybe that&amp;#39;s the problem.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m considering getting back out there, because I am alone, but unfortunately anxiety is a bitch :(&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd5dpn", "created": 1399619706.0, "author_flair_text": null, "created_utc": 1399590906.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chd55vs", "gilded": 0, "author": "heyimtalking", "parent_id": "t3_252ll6", "approved_by": null, "body": "Your attitude is inspiring! Those girls sound incredibly shitty to me, and I know how much of a toll that breaking of trust can have on a person. I hope you meet someone who won't treat you like shit, you deserve much more than that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your attitude is inspiring! Those girls sound incredibly shitty to me, and I know how much of a toll that breaking of trust can have on a person. I hope you meet someone who won&amp;#39;t treat you like shit, you deserve much more than that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd55vs", "created": 1399619204.0, "author_flair_text": null, "created_utc": 1399590404.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd6asu", "gilded": 0, "author": "Legatron", "parent_id": "t1_chd617c", "approved_by": null, "body": "I don't hold grudges against any of them, I've even tried contacting a couple just to see how they are. They hurt me but we all make mistakes, I wish them all the best. I finally spoke to that last girl about half hour ago. I told her I'm gonna let go and let her live her life without me. It hurt but in the long run, it'll be for the best.\n\nThanks for the kindness, I wish you happiness. If you need a friend, I want to be here for anyone in this sub reddit. Getting through shit is hard, but with help it gets easier.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t hold grudges against any of them, I&amp;#39;ve even tried contacting a couple just to see how they are. They hurt me but we all make mistakes, I wish them all the best. I finally spoke to that last girl about half hour ago. I told her I&amp;#39;m gonna let go and let her live her life without me. It hurt but in the long run, it&amp;#39;ll be for the best.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the kindness, I wish you happiness. If you need a friend, I want to be here for anyone in this sub reddit. Getting through shit is hard, but with help it gets easier.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd6asu", "created": 1399621771.0, "author_flair_text": null, "created_utc": 1399592971.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chd617c", "gilded": 0, "author": "Kalleh", "parent_id": "t3_252ll6", "approved_by": null, "body": "Hey OP,\n\nGirls can be completely terrible people. I know, because once I was a stupid, terrible girl as well. But I've learned my lesson and smartened up and now I realize my mistakes. If any of those girls ever learns anything from what they did to you, they will realize how wrong they were and how great of a guy you really are.\n\nI'm 17 now and I'm going through a lot of shit, but this post inspired me a lot. :)\n\nKeep bein' great, keep doin' you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP,&lt;/p&gt;\n\n&lt;p&gt;Girls can be completely terrible people. I know, because once I was a stupid, terrible girl as well. But I&amp;#39;ve learned my lesson and smartened up and now I realize my mistakes. If any of those girls ever learns anything from what they did to you, they will realize how wrong they were and how great of a guy you really are.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 17 now and I&amp;#39;m going through a lot of shit, but this post inspired me a lot. :)&lt;/p&gt;\n\n&lt;p&gt;Keep bein&amp;#39; great, keep doin&amp;#39; you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ll6", "score_hidden": false, "name": "t1_chd617c", "created": 1399621182.0, "author_flair_text": null, "created_utc": 1399592382.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]