[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve contemplated suicide at many different times in my life, mostly due to being transgendered. But now, I’m stuggling in school. I never really had any legitimate difficulty in High School, but in my first semester, I failed Mechanics and Cal 1. My Calc teacher saw I was making an effort to get help regularly so he gave me an extra 2% that allowed me to pass the course. Now, I’m in his class again for Cal 2 and am currently sitting at a 57% with one more test worth 25% of my mark and I’ve concluded that if I fail the course, I will commit suicide. I’ve spent 50% of my last 4 years (I’m 18) in depression and have been once again depressed for 3 weeks. I’ve struggled with anorexia and isolation. I don’t have a social life, all I do on my free time is play league of legends and try to stream to get (somewhat) popular even though I’m sitting at just below 1400 followers on twitch. I work a fast food job which I hate on the weekend and so I have to go to school or work 7 days a week and have maintained this since January. I studied 12 + hours on my last integral test and essentially failed it with a 45%. I just got back an assignment I thought I did fairly well on and turns out I got 60%. I have an obsession with trying to make something out of myself within the League of Legends scene but not much seems to work out for me. I realize this post is a bit all over the place, but my mind isn’t in the best of states right now and I have a major stomach ache because I haven’t eaten in 3 days. I feel like a failure and barely receive any positive feedback in my life. Concerning my situation of being transgendered, I feel like I’m a fairly attractive girl now and the situation doesn’t import to me much other than still being pre-op and the fact that I carry a fear of rejection in any relationship I try to enter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I’ve contemplated suicide at many different times in my life, mostly due to being transgendered. But now, I’m stuggling in school. I never really had any legitimate difficulty in High School, but in my first semester, I failed Mechanics and Cal 1. My Calc teacher saw I was making an effort to get help regularly so he gave me an extra 2% that allowed me to pass the course. Now, I’m in his class again for Cal 2 and am currently sitting at a 57% with one more test worth 25% of my mark and I’ve concluded that if I fail the course, I will commit suicide. I’ve spent 50% of my last 4 years (I’m 18) in depression and have been once again depressed for 3 weeks. I’ve struggled with anorexia and isolation. I don’t have a social life, all I do on my free time is play league of legends and try to stream to get (somewhat) popular even though I’m sitting at just below 1400 followers on twitch. I work a fast food job which I hate on the weekend and so I have to go to school or work 7 days a week and have maintained this since January. I studied 12 + hours on my last integral test and essentially failed it with a 45%. I just got back an assignment I thought I did fairly well on and turns out I got 60%. I have an obsession with trying to make something out of myself within the League of Legends scene but not much seems to work out for me. I realize this post is a bit all over the place, but my mind isn’t in the best of states right now and I have a major stomach ache because I haven’t eaten in 3 days. I feel like a failure and barely receive any positive feedback in my life. Concerning my situation of being transgendered, I feel like I’m a fairly attractive girl now and the situation doesn’t import to me much other than still being pre-op and the fact that I carry a fear of rejection in any relationship I try to enter.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23vfhi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "017211", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23vfhi/school_troubles_and_the_lack_of_positive/", "name": "t3_23vfhi", "created": 1398387235.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23vfhi/school_troubles_and_the_lack_of_positive/", "author_flair_text": null, "title": "School troubles and the lack of positive reinforcement has made me contemplate committing suicide if I don't pass calculus.", "created_utc": 1398358435.0, "ups": 6, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0y5v0", "gilded": 0, "author": "infinitecircus", "parent_id": "t3_23vfhi", "approved_by": null, "body": "I know it's hard to believe but school is a fraction of your life. Unfortunate we live in a time where self worth is seemingly based on monetary success. This simply is not true. You could try changing your major, dropping out of school and doing something else. Pursuing other aspects of life. If school makes you feel this way it may not be for you. It doesn't make your a failure, the society we live in right now is the failure. The education system is a failure but people are not failures because they can't fit in or bring them selves to care or just simply are not good at certain things. You haven't found your niche yet but the most unfortunate thing about suicide is all the simple joys you will miss out on. Having been in a similar situation as far as academics and forcing myself to slog trough it, I wish I had simply taken time off, take medical leave. Take any time you need for your self. Use your story to inspire others, there is someone just like you that needs the strength your story can provide.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s hard to believe but school is a fraction of your life. Unfortunate we live in a time where self worth is seemingly based on monetary success. This simply is not true. You could try changing your major, dropping out of school and doing something else. Pursuing other aspects of life. If school makes you feel this way it may not be for you. It doesn&amp;#39;t make your a failure, the society we live in right now is the failure. The education system is a failure but people are not failures because they can&amp;#39;t fit in or bring them selves to care or just simply are not good at certain things. You haven&amp;#39;t found your niche yet but the most unfortunate thing about suicide is all the simple joys you will miss out on. Having been in a similar situation as far as academics and forcing myself to slog trough it, I wish I had simply taken time off, take medical leave. Take any time you need for your self. Use your story to inspire others, there is someone just like you that needs the strength your story can provide.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vfhi", "score_hidden": false, "name": "t1_ch0y5v0", "created": 1398362983.0, "author_flair_text": null, "created_utc": 1398359383.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0yo3s", "gilded": 0, "author": "KingWhoBoreTheSword", "parent_id": "t3_23vfhi", "approved_by": null, "body": "Holy shit I felt the exact same way after I failed calc 1. I wanted to end it all because I thought I was a failure. But I didn't, I kept going and passed the class on my second attempt. Dude it's completely okay to fail once in a while, and it's even more okay to change switch majors to something you enjoy doing. Oh btw 1400 followers! Damn that's a big accomplishment for a live stream especially considering how saturated the market is. It takes a person who can connect with people to do that so congratz! Also consider pursuing a degree that can help you with that. This also seems like a difficult time if your still transitioning, going to school, and working in a crappy fast food job (been there it fuckin blows!) but you have to know it will pay off. If you take anything away from this it's things aren't as important as they seem to be just try to look at the big picture. Anyway feel free to msg me anytime and stay safe!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit I felt the exact same way after I failed calc 1. I wanted to end it all because I thought I was a failure. But I didn&amp;#39;t, I kept going and passed the class on my second attempt. Dude it&amp;#39;s completely okay to fail once in a while, and it&amp;#39;s even more okay to change switch majors to something you enjoy doing. Oh btw 1400 followers! Damn that&amp;#39;s a big accomplishment for a live stream especially considering how saturated the market is. It takes a person who can connect with people to do that so congratz! Also consider pursuing a degree that can help you with that. This also seems like a difficult time if your still transitioning, going to school, and working in a crappy fast food job (been there it fuckin blows!) but you have to know it will pay off. If you take anything away from this it&amp;#39;s things aren&amp;#39;t as important as they seem to be just try to look at the big picture. Anyway feel free to msg me anytime and stay safe!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vfhi", "score_hidden": false, "name": "t1_ch0yo3s", "created": 1398363988.0, "author_flair_text": null, "created_utc": 1398360388.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0ylxl", "gilded": 0, "author": "WheresTibbers", "parent_id": "t3_23vfhi", "approved_by": null, "body": "I know they tell you your gap in hs is important, but unless you are wanting to go to prestigious schools, it isn't. High school seems like a big deal in your life but it's really a growing period. I'm not saying don't try to do well, but know that it is not worth the ending of a life. \n\nLeague is awesome. I don't have the confidence or skill to stream so great job on that! It's not a solid plan for your future but it's a start. Playing video games starting me on graphic design and coding. \n\nReach out to teachers and tutors. I'm sure they will see you are struggling and hopefully they can help you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know they tell you your gap in hs is important, but unless you are wanting to go to prestigious schools, it isn&amp;#39;t. High school seems like a big deal in your life but it&amp;#39;s really a growing period. I&amp;#39;m not saying don&amp;#39;t try to do well, but know that it is not worth the ending of a life. &lt;/p&gt;\n\n&lt;p&gt;League is awesome. I don&amp;#39;t have the confidence or skill to stream so great job on that! It&amp;#39;s not a solid plan for your future but it&amp;#39;s a start. Playing video games starting me on graphic design and coding. &lt;/p&gt;\n\n&lt;p&gt;Reach out to teachers and tutors. I&amp;#39;m sure they will see you are struggling and hopefully they can help you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vfhi", "score_hidden": false, "name": "t1_ch0ylxl", "created": 1398363867.0, "author_flair_text": null, "created_utc": 1398360267.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1a6io", "gilded": 0, "author": "I_Am_Zarathustra", "parent_id": "t3_23vfhi", "approved_by": null, "body": "**\"There are two ways to do great mathematics. The first is to be smarter than everyone else. The second is to be stupider than everyone else -- but persistent.\"**\n- John Von Neumann \n\nI'm doing a math degree right now and I (as well as almost every other math student I know) has had their fair share of fuck-ups. I got 44% on my linear algebra exam last semester despite studying hard, but I've managed to pass the year and I'm going to tutor freshmen next year. I felt shit for about a week, but you know why I got over it? Because really, shit exams happen and honestly exams are bullshit in general. Try not to evaluate yourself based on what score you get on an exam. Honestly, I can set a problem up for myself that's 5 times more complicated than anything on my exam but put me in that exam hall and my math skills suddenly relapse to that of a 10-year-old.\n\nIt sounds like you've got a whole load of shit on your plate but don't give up, friend. ", "edited": 1398391492.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;&amp;quot;There are two ways to do great mathematics. The first is to be smarter than everyone else. The second is to be stupider than everyone else -- but persistent.&amp;quot;&lt;/strong&gt;\n- John Von Neumann &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m doing a math degree right now and I (as well as almost every other math student I know) has had their fair share of fuck-ups. I got 44% on my linear algebra exam last semester despite studying hard, but I&amp;#39;ve managed to pass the year and I&amp;#39;m going to tutor freshmen next year. I felt shit for about a week, but you know why I got over it? Because really, shit exams happen and honestly exams are bullshit in general. Try not to evaluate yourself based on what score you get on an exam. Honestly, I can set a problem up for myself that&amp;#39;s 5 times more complicated than anything on my exam but put me in that exam hall and my math skills suddenly relapse to that of a 10-year-old.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;ve got a whole load of shit on your plate but don&amp;#39;t give up, friend. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23vfhi", "score_hidden": false, "name": "t1_ch1a6io", "created": 1398412528.0, "author_flair_text": null, "created_utc": 1398383728.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]