[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every mistake I make, big or small, I feel like a failure. Everything&amp;#39;s falling apart, nothing&amp;#39;s getting better. You guys said it&amp;#39;d get better, but RS not. I have a moment, just a moment of happiness, and something goes wrong. I hate my life I&amp;#39;m tired of taking pills and crying myself at night. I&amp;#39;m a 16 year old girl, I already hate my life and I haven&amp;#39;t lived that long an I don&amp;#39;t want to anymore. The only thing keeping me on this earth is my Spanish teacher, she&amp;#39;s like a sister to me, but i can&amp;#39;t do it anymore. I wrote a note to her, I hope she&amp;#39;ll understand. It&amp;#39;s no use staying here. Thank you all for trying to help before, but I feel like I was meant to die young anyways, I could never imagine myself as an adult or having a future unlike other kids. This is supposed to happen.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Every mistake I make, big or small, I feel like a failure. Everything's falling apart, nothing's getting better. You guys said it'd get better, but RS not. I have a moment, just a moment of happiness, and something goes wrong. I hate my life I'm tired of taking pills and crying myself at night. I'm a 16 year old girl, I already hate my life and I haven't lived that long an I don't want to anymore. The only thing keeping me on this earth is my Spanish teacher, she's like a sister to me, but i can't do it anymore. I wrote a note to her, I hope she'll understand. It's no use staying here. Thank you all for trying to help before, but I feel like I was meant to die young anyways, I could never imagine myself as an adult or having a future unlike other kids. This is supposed to happen.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ljem", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Kass1207", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ljem/screw_it_im_done/", "name": "t3_24ljem", "created": 1399117709.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ljem/screw_it_im_done/", "author_flair_text": null, "title": "Screw it. I'm done.", "created_utc": 1399088909.0, "ups": 1, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8ayf7", "gilded": 0, "author": "sexiquebecbabe69", "parent_id": "t3_24ljem", "approved_by": null, "body": "Hey Kass, I'm Elizabeth. I'm also a teenage girl. I'm really sorry you are feeling this way. It sucks feeling like a failure. I don't exactly why you feel that way maybe you can elaborate? What I can tell though is that you have people that support you. Your spanish teacher loves you very much and would willingly help you. You just need to tell someone how you actually feel. You are young and can do so much with your life. I know you say you hate it but you can change that with the time you have. Best wishes! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Kass, I&amp;#39;m Elizabeth. I&amp;#39;m also a teenage girl. I&amp;#39;m really sorry you are feeling this way. It sucks feeling like a failure. I don&amp;#39;t exactly why you feel that way maybe you can elaborate? What I can tell though is that you have people that support you. Your spanish teacher loves you very much and would willingly help you. You just need to tell someone how you actually feel. You are young and can do so much with your life. I know you say you hate it but you can change that with the time you have. Best wishes! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ljem", "score_hidden": false, "name": "t1_ch8ayf7", "created": 1399118212.0, "author_flair_text": null, "created_utc": 1399089412.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch95umk", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t1_ch8jsqt", "approved_by": null, "body": "Good morning Kass1207 :-) \n\nIt sounds like you're doing just fine at the moment :-) It's incredibly tough being a teenager. Everyone seems to treat you as a halfway house between a kid and an adult. Not only this, but there's so much pressure on you, what with work and school and friends, and through all of this you're desperately trying to discover what kind of a person you would like to become.\n\nAs for work, I wish I could tell you that it all gets better, but sometimes that's just what work is like! The general public are usually horrible, mangers are usually angry and incompetent, and hours are long and pay is low. Don't worry about your mistakes :-) Never forget, it's incredibly important to make mistakes and screw up in life sometimes, because it's how we learn! If we never fucked up every now and again, we would never make ourselves better :-)\n\nI'm sorry to hear your Grandma is in hospital, I hope she gets better soon, and I wish her the speediest recovery. I'm certain your parents love you very much, and only get mad at you because this is all scary and confusing for them too! You never really feel like an adult, just like a big kid whose faking adulthood.\n\nThat's a very noble and selfless thing to write to your Spanish teacher like that :-) Small selfless actions like this can really make someones whole month, and will be cherished forever. As for messing up speeches and presentations, that's absolutely fine, we all do that! The best orators give speeches and presentations every single day, and have had tonnes of practice and time to refine! I guarantee you they were terrible when they first started out :-P Heck! Samuel L Jackson apparently had a horrific stutter when he was younger!\n\nI'm not going to tell you things are going to get better. They might, they might not. Sometimes things will get better, sometimes they'll get worse. But they do change. So I can promise you change. And I can promise you you're not a failure :-)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good morning Kass1207 :-) &lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re doing just fine at the moment :-) It&amp;#39;s incredibly tough being a teenager. Everyone seems to treat you as a halfway house between a kid and an adult. Not only this, but there&amp;#39;s so much pressure on you, what with work and school and friends, and through all of this you&amp;#39;re desperately trying to discover what kind of a person you would like to become.&lt;/p&gt;\n\n&lt;p&gt;As for work, I wish I could tell you that it all gets better, but sometimes that&amp;#39;s just what work is like! The general public are usually horrible, mangers are usually angry and incompetent, and hours are long and pay is low. Don&amp;#39;t worry about your mistakes :-) Never forget, it&amp;#39;s incredibly important to make mistakes and screw up in life sometimes, because it&amp;#39;s how we learn! If we never fucked up every now and again, we would never make ourselves better :-)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry to hear your Grandma is in hospital, I hope she gets better soon, and I wish her the speediest recovery. I&amp;#39;m certain your parents love you very much, and only get mad at you because this is all scary and confusing for them too! You never really feel like an adult, just like a big kid whose faking adulthood.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a very noble and selfless thing to write to your Spanish teacher like that :-) Small selfless actions like this can really make someones whole month, and will be cherished forever. As for messing up speeches and presentations, that&amp;#39;s absolutely fine, we all do that! The best orators give speeches and presentations every single day, and have had tonnes of practice and time to refine! I guarantee you they were terrible when they first started out :-P Heck! Samuel L Jackson apparently had a horrific stutter when he was younger!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to tell you things are going to get better. They might, they might not. Sometimes things will get better, sometimes they&amp;#39;ll get worse. But they do change. So I can promise you change. And I can promise you you&amp;#39;re not a failure :-)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ljem", "score_hidden": false, "name": "t1_ch95umk", "created": 1399227885.0, "author_flair_text": null, "created_utc": 1399199085.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8jsqt", "gilded": 0, "author": "Kass1207", "parent_id": "t1_ch8b32x", "approved_by": null, "body": "Work, school, life, everything. I started working at hobby lobby about a month ago; customers are mean, managers are mean and I always mess up somehow. At school I can never do anything right I mess up on speeches and presentations all the time. On top of all that my grandmas in the hospital, my parents always seem to be mad at me, and I don't like being at home. I just want to go to school.\nI wrote to my teacher how much she means to me and that she'll always be my favorite teacher and like a sister to me. I thanked her for all she does for all her students and wish her the best of life. At the end I put Love Kassidy like I do on all the cards I've oven to her and emails I've sent to her.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Work, school, life, everything. I started working at hobby lobby about a month ago; customers are mean, managers are mean and I always mess up somehow. At school I can never do anything right I mess up on speeches and presentations all the time. On top of all that my grandmas in the hospital, my parents always seem to be mad at me, and I don&amp;#39;t like being at home. I just want to go to school.\nI wrote to my teacher how much she means to me and that she&amp;#39;ll always be my favorite teacher and like a sister to me. I thanked her for all she does for all her students and wish her the best of life. At the end I put Love Kassidy like I do on all the cards I&amp;#39;ve oven to her and emails I&amp;#39;ve sent to her.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ljem", "score_hidden": false, "name": "t1_ch8jsqt", "created": 1399159394.0, "author_flair_text": null, "created_utc": 1399130594.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8b32x", "gilded": 0, "author": "Friendly_drunk", "parent_id": "t3_24ljem", "approved_by": null, "body": "Hello there Kass1207, it's lovely to meet you :-)\n\nWould you like to talk some more about what's going on in your life?  What kind of mistakes do you feel you've made recently? Feel free to pm me or talk openly here. What was written in that note to your Spanish teacher? You sound like a really nice person who really cares about how other perceive you. And whether or not things will get better soon, it seems you genuinely care about others, and that is a very noble and honorable thing to be :-)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello there Kass1207, it&amp;#39;s lovely to meet you :-)&lt;/p&gt;\n\n&lt;p&gt;Would you like to talk some more about what&amp;#39;s going on in your life?  What kind of mistakes do you feel you&amp;#39;ve made recently? Feel free to pm me or talk openly here. What was written in that note to your Spanish teacher? You sound like a really nice person who really cares about how other perceive you. And whether or not things will get better soon, it seems you genuinely care about others, and that is a very noble and honorable thing to be :-)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ljem", "score_hidden": false, "name": "t1_ch8b32x", "created": 1399118593.0, "author_flair_text": null, "created_utc": 1399089793.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]