[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s crossed  my mind in the past but never as a real option, it&amp;#39;s looking a lot better to me now.&lt;/p&gt;\n\n&lt;p&gt;Literally the only reason I haven&amp;#39;t already done it is because I don&amp;#39;t want to do that to my boyfriend, but at this point I feel like once he finds out what a failure I am he won&amp;#39;t love me anymore anyway. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m failing half my classes in college. One I already knew about, and was planning on using my one-time-drop for, but the other one is due to attendance and I really was not expecting it. I&amp;#39;m already on academic probation, I already feel like I&amp;#39;m disappointing my parents so much and I had told them I could turn things around this semester. But nooooo, I just had to go fuck it all up and do even worse this time around. I don&amp;#39;t feel like I have any control left over my life. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know what to do. I have nobody to talk to. My boyfriend knows I&amp;#39;m depressed but he doesn&amp;#39;t know the extent, I can&amp;#39;t tell him how bad it is or he&amp;#39;d look down on me. He&amp;#39;s stressed out with his own stuff anyway right now. &lt;/p&gt;\n\n&lt;p&gt;I have it all planned out. I&amp;#39;d call him and break up with him, write notes for him and my parents, walk to the river and just go for a swim. Tire myself out, and get out far enough that there&amp;#39;s no getting back to the shore. I know drowning is a bad way to go, but I&amp;#39;d be unconscious within a few minutes and it&amp;#39;s night so nobody would notice my body until tomorrow at the earliest. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even go through with it. Thinking about it brings me so much peace but I know I wont&amp;#39; even beable to fucking do it. I&amp;#39;ll take the cowards way out like always as my life goes down in flames around me. I&amp;#39;ll end up a shitty call center agent for another five years until it finally gets unbearable enough that I actually do it, but not before eveyrone knows wghat a failure i am. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's crossed  my mind in the past but never as a real option, it's looking a lot better to me now.\n\nLiterally the only reason I haven't already done it is because I don't want to do that to my boyfriend, but at this point I feel like once he finds out what a failure I am he won't love me anymore anyway. \n\nI'm failing half my classes in college. One I already knew about, and was planning on using my one-time-drop for, but the other one is due to attendance and I really was not expecting it. I'm already on academic probation, I already feel like I'm disappointing my parents so much and I had told them I could turn things around this semester. But nooooo, I just had to go fuck it all up and do even worse this time around. I don't feel like I have any control left over my life. \n\nI don't even know what to do. I have nobody to talk to. My boyfriend knows I'm depressed but he doesn't know the extent, I can't tell him how bad it is or he'd look down on me. He's stressed out with his own stuff anyway right now. \n\nI have it all planned out. I'd call him and break up with him, write notes for him and my parents, walk to the river and just go for a swim. Tire myself out, and get out far enough that there's no getting back to the shore. I know drowning is a bad way to go, but I'd be unconscious within a few minutes and it's night so nobody would notice my body until tomorrow at the earliest. \n\nI can't even go through with it. Thinking about it brings me so much peace but I know I wont' even beable to fucking do it. I'll take the cowards way out like always as my life goes down in flames around me. I'll end up a shitty call center agent for another five years until it finally gets unbearable enough that I actually do it, but not before eveyrone knows wghat a failure i am. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24icty", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwriver", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24icty/seriously_considering_suicide_for_the_first_time/", "name": "t3_24icty", "created": 1399025741.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24icty/seriously_considering_suicide_for_the_first_time/", "author_flair_text": null, "title": "Seriously considering suicide for the first time", "created_utc": 1398996941.0, "ups": 2, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch871lv", "gilded": 0, "author": "Nimtike", "parent_id": "t1_ch7zwyu", "approved_by": null, "body": "I left only like a year or two ago, but stop going actively about 5 years ago when I was 16. I didn't have exactly the same experience as you (I actually did believe everything for a while), but my senses were finally returned to me and here I am now.\n\nMormons are some of the most judgmental people out there that I know of. Not necessarily on a front level, but the fact that anyone who isn't doing everything specifically by the book doesn't have a chance for celestial glory. SMH\n\nUnfortunately, the only solution with dealing with Mormons is to leave. Ignoring them won't do anything, and Bill Nye proved you can't really argue with someone of that ideology and win. Do you have any possible way of moving out? \n\nI know you have sunk a lot of time and money on college, but if global studies is something you hate then fuck college. More and more people are becoming successful without a college degree. However, without being able to take care of yourself then no amount of education or degrees will be able to make anything better. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I left only like a year or two ago, but stop going actively about 5 years ago when I was 16. I didn&amp;#39;t have exactly the same experience as you (I actually did believe everything for a while), but my senses were finally returned to me and here I am now.&lt;/p&gt;\n\n&lt;p&gt;Mormons are some of the most judgmental people out there that I know of. Not necessarily on a front level, but the fact that anyone who isn&amp;#39;t doing everything specifically by the book doesn&amp;#39;t have a chance for celestial glory. SMH&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, the only solution with dealing with Mormons is to leave. Ignoring them won&amp;#39;t do anything, and Bill Nye proved you can&amp;#39;t really argue with someone of that ideology and win. Do you have any possible way of moving out? &lt;/p&gt;\n\n&lt;p&gt;I know you have sunk a lot of time and money on college, but if global studies is something you hate then fuck college. More and more people are becoming successful without a college degree. However, without being able to take care of yourself then no amount of education or degrees will be able to make anything better. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch871lv", "created": 1399107490.0, "author_flair_text": null, "created_utc": 1399078690.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7zwyu", "gilded": 0, "author": "throwriver", "parent_id": "t1_ch7xrxf", "approved_by": null, "body": "Whoa, what a coincidence! Yeah, it really sucks. And I tried the whole perfect Mormon thing for years without ever really believing, and all it did was make me feel like I was lying to everyone. When did you leave the church? (I'm assuming you did, since you're calling it idiotic and hypocritical)\n\nHe is not religious at all.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa, what a coincidence! Yeah, it really sucks. And I tried the whole perfect Mormon thing for years without ever really believing, and all it did was make me feel like I was lying to everyone. When did you leave the church? (I&amp;#39;m assuming you did, since you&amp;#39;re calling it idiotic and hypocritical)&lt;/p&gt;\n\n&lt;p&gt;He is not religious at all.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7zwyu", "created": 1399089975.0, "author_flair_text": null, "created_utc": 1399061175.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7xrxf", "gilded": 0, "author": "Nimtike", "parent_id": "t1_ch7soz7", "approved_by": null, "body": "Both of my parents are Mormon so I know exactly what you're talking about. It is the biggest struggle to have to both deal with feelings of inadequacy and with people telling you that you are inadequate. Not to mention the idiotic Mormon teaching that you can't be perfect than turning around and saying that you can be perfect in some things (e.g. reading scriptures, saying prayers, etc). Hypocrisy at it's finest.\n\nIs you boyfriend Mormon, or religious at all?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both of my parents are Mormon so I know exactly what you&amp;#39;re talking about. It is the biggest struggle to have to both deal with feelings of inadequacy and with people telling you that you are inadequate. Not to mention the idiotic Mormon teaching that you can&amp;#39;t be perfect than turning around and saying that you can be perfect in some things (e.g. reading scriptures, saying prayers, etc). Hypocrisy at it&amp;#39;s finest.&lt;/p&gt;\n\n&lt;p&gt;Is you boyfriend Mormon, or religious at all?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7xrxf", "created": 1399085423.0, "author_flair_text": null, "created_utc": 1399056623.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7soz7", "gilded": 0, "author": "throwriver", "parent_id": "t1_ch7kr68", "approved_by": null, "body": "That is exactly it. I don't like anything anymore, the only thing that makes me happy is my boyfriend but even then I feel bad because he's a super energetic happy person and I just don't have the energy to do all these activities he likes. And when I tell him that he's like \"that's fine, let's do something you like to do!\" which is sweet, but there literally isn't anything.\n\nI can see how you'd feel that way! My parents are Mormon, and they're convinced the cure for all depression is religion (Mormons often say they're the only ones who experience \"true joy\"), so I'm kind of the opposite--I hate that my depression has worsened after leaving the church, because it feels like I'm proving them right.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is exactly it. I don&amp;#39;t like anything anymore, the only thing that makes me happy is my boyfriend but even then I feel bad because he&amp;#39;s a super energetic happy person and I just don&amp;#39;t have the energy to do all these activities he likes. And when I tell him that he&amp;#39;s like &amp;quot;that&amp;#39;s fine, let&amp;#39;s do something you like to do!&amp;quot; which is sweet, but there literally isn&amp;#39;t anything.&lt;/p&gt;\n\n&lt;p&gt;I can see how you&amp;#39;d feel that way! My parents are Mormon, and they&amp;#39;re convinced the cure for all depression is religion (Mormons often say they&amp;#39;re the only ones who experience &amp;quot;true joy&amp;quot;), so I&amp;#39;m kind of the opposite--I hate that my depression has worsened after leaving the church, because it feels like I&amp;#39;m proving them right.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7soz7", "created": 1399074629.0, "author_flair_text": null, "created_utc": 1399045829.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7kr68", "gilded": 0, "author": "Nimtike", "parent_id": "t1_ch7jgmc", "approved_by": null, "body": "3 years is a long time when suicide is knocking on your door. Some people may ask, \"Well, what do you like to do?\" The problem with that question is that the people asking are missing the point. Nothing is enjoyable when you are depressed. (And when sex isn't even enjoyable... I don't know what to think anymore)\n\nIt is so frustrating listening to those people who say that depression is just weakness. It downplays the struggle, and almost makes me want to stay depressed just to show them that it isn't curable. I'm not sure if you feel similarly but that is what I get out of those conversations.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3 years is a long time when suicide is knocking on your door. Some people may ask, &amp;quot;Well, what do you like to do?&amp;quot; The problem with that question is that the people asking are missing the point. Nothing is enjoyable when you are depressed. (And when sex isn&amp;#39;t even enjoyable... I don&amp;#39;t know what to think anymore)&lt;/p&gt;\n\n&lt;p&gt;It is so frustrating listening to those people who say that depression is just weakness. It downplays the struggle, and almost makes me want to stay depressed just to show them that it isn&amp;#39;t curable. I&amp;#39;m not sure if you feel similarly but that is what I get out of those conversations.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7kr68", "created": 1399043330.0, "author_flair_text": null, "created_utc": 1399014530.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7jgmc", "gilded": 0, "author": "throwriver", "parent_id": "t1_ch7feom", "approved_by": null, "body": "None of my family or friends know, they're all  of the \"depression is just mental weakness\" ilk so I can't bear to tell them\n\nGlobal studies. I hate it, but there isn't anything I like more and I've already sunk 3 years into it", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;None of my family or friends know, they&amp;#39;re all  of the &amp;quot;depression is just mental weakness&amp;quot; ilk so I can&amp;#39;t bear to tell them&lt;/p&gt;\n\n&lt;p&gt;Global studies. I hate it, but there isn&amp;#39;t anything I like more and I&amp;#39;ve already sunk 3 years into it&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7jgmc", "created": 1399038170.0, "author_flair_text": null, "created_utc": 1399009370.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7feom", "gilded": 0, "author": "Nimtike", "parent_id": "t3_24icty", "approved_by": null, "body": "Being alone in my depression is one of the hardest things for me too. Not that friends and family don't count, but in a way they really don't...\n\nI don't know if you' et ever to anyone about the depression or if you have a therapist or not. It seems weird that everyone is always so distressed at the thought of a loved one dying, yet when suicide comes up some tend to brush it off. Therapists have told me that opening up is the first step to getting better. Bull Shit. If that were true I'd be a Polly Anna by now.\n\nAnyway, enough of my ramblings, What are you majoring in? It sometimes helps my mood in the present to think about what my end goal has been despite never really seeing myself get there.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being alone in my depression is one of the hardest things for me too. Not that friends and family don&amp;#39;t count, but in a way they really don&amp;#39;t...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if you&amp;#39; et ever to anyone about the depression or if you have a therapist or not. It seems weird that everyone is always so distressed at the thought of a loved one dying, yet when suicide comes up some tend to brush it off. Therapists have told me that opening up is the first step to getting better. Bull Shit. If that were true I&amp;#39;d be a Polly Anna by now.&lt;/p&gt;\n\n&lt;p&gt;Anyway, enough of my ramblings, What are you majoring in? It sometimes helps my mood in the present to think about what my end goal has been despite never really seeing myself get there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24icty", "score_hidden": false, "name": "t1_ch7feom", "created": 1399027298.0, "author_flair_text": null, "created_utc": 1398998498.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]