[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Chances are this doesn&amp;#39;t belong in this sub, I just don&amp;#39;t know where else to go..&lt;/p&gt;\n\n&lt;p&gt;Information: I&amp;#39;m now 16/M and live in Ireland&lt;/p&gt;\n\n&lt;p&gt;Growing up I had a decent life, up until about 7 where I started to get bullied. To a 7 year old, you&amp;#39;d wonder how bad it can get, but being excluded from all games in school, along with being excluded in any after school sports and such is pretty bad. My sister, for the first 2 years of &amp;#39;elementary school&amp;#39; (we call it primary school, moving along..) had to walk around the school yard with me some lunchtimes. She didn&amp;#39;t like doing it, but I had absolutely no-one else to turn to. I would have walked around alone, not playing any games or doing anything, I guess I thank her for doing it for me. This went on until my sister left primary school, after those 2 years. Going into first class (Irish school system is odd, there are 2 &amp;#39;infant&amp;#39; years before that, which is what I&amp;#39;m talking about) I had absolutely no friends, but my mum had to get someone to look after me while she was working, so incomes &amp;#39;X&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;X&amp;#39;s mother was &amp;#39;looking after me&amp;#39;, which basically I was told to go play with X, but since he didn&amp;#39;t want to (like at all, I remember being told to go away when I asked something). X&amp;#39;s sister was roughly my sister&amp;#39;s age, so I generally turned to her to play games and do stuff with. &lt;/p&gt;\n\n&lt;p&gt;This &amp;#39;looking after me&amp;#39; went on for about a year until we finished school at a later time.&lt;/p&gt;\n\n&lt;p&gt;Anyway, this whole &amp;#39;being excluded&amp;#39; went on the whole way until I left for Secondary school (high school for you muricans). X went on to cause more problems, I remember once being in a physical fight with X, which I ended up crying after. In the eyes of everyone else there I was a &amp;#39;bitch&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;This is getting boring, I have countless stories with X and about how abusive he was. &lt;/p&gt;\n\n&lt;p&gt;Anyway Secondary school time. The greatest years of your life. Your place to forge a path through this jungle. Well, not for me, not so far anyway..&lt;/p&gt;\n\n&lt;p&gt;Right at the start of it I found games interesting. I would spend hour, days and even at a point weeks playing them.\nQuick tl;dr, first year of secondary, games, games and more games. Second year was the same. &lt;/p&gt;\n\n&lt;p&gt;Third year I found a real interest in programming, computers and such. As I spend all my time other than school at home, I loved this. At the end of third year, and somewhat during it I didn&amp;#39;t go into school some days. I lost all hope, and with semi-important exams coming up this wasn&amp;#39;t the place to be. I would spend days at a time not going into school, not talking to people, not doing anything. In bed, probably crying, I lost all hope and very nearly attempted suicide. Didn&amp;#39;t go into school for around 60 days that year, at the end of the year it was 3 weeks before anyone saw me. &lt;/p&gt;\n\n&lt;p&gt;Next up: Transition Year (4th year, and I will abbreviate this to &amp;#39;TY&amp;#39;). Where I was and where I am now. We don&amp;#39;t do much work in TY, like I mean some days we would do absolutely nothing. This started off all and well, me still being depressed and suicidal as usual.. until about a month ago. I said &amp;#39;fuck it&amp;#39; and decided to at least try make friends outside of school. &lt;/p&gt;\n\n&lt;p&gt;This has worked, but I am still in an awful position. I met this person, who may or may not read this post, who I really like. I would probably take a bullet for her (no joke, couldn&amp;#39;t care about my own life anymore..) as she has been there for me more than anyone else over this past month. Borderline love her? You could say that..&lt;/p&gt;\n\n&lt;p&gt;I hit a self destruct period on Wednesday night, I started hitting the wall to inflict pain on myself, tried cutting my arms open (didn&amp;#39;t get very far with that..) and so on. I have hit this before quite recently, but the person mentioned above was talking me to try calm me down. &lt;/p&gt;\n\n&lt;p&gt;I am still thinking about killing myself, it&amp;#39;s always* on my mind. I just think myself into situations that don&amp;#39;t exist and this pops into my mind. &lt;/p&gt;\n\n&lt;p&gt;*One minute I can be happy, 5 mins later I can break down crying and such. &lt;/p&gt;\n\n&lt;p&gt;Sorry, I know this probably didn&amp;#39;t make much sense to any of you, I just need to write. Spent an hour at this, that&amp;#39;s an hour I didn&amp;#39;t waste wanting to kill myself. &lt;/p&gt;\n\n&lt;p&gt;Edit: spelling&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Chances are this doesn't belong in this sub, I just don't know where else to go..\n\nInformation: I'm now 16/M and live in Ireland\n\nGrowing up I had a decent life, up until about 7 where I started to get bullied. To a 7 year old, you'd wonder how bad it can get, but being excluded from all games in school, along with being excluded in any after school sports and such is pretty bad. My sister, for the first 2 years of 'elementary school' (we call it primary school, moving along..) had to walk around the school yard with me some lunchtimes. She didn't like doing it, but I had absolutely no-one else to turn to. I would have walked around alone, not playing any games or doing anything, I guess I thank her for doing it for me. This went on until my sister left primary school, after those 2 years. Going into first class (Irish school system is odd, there are 2 'infant' years before that, which is what I'm talking about) I had absolutely no friends, but my mum had to get someone to look after me while she was working, so incomes 'X'. \n\nX's mother was 'looking after me', which basically I was told to go play with X, but since he didn't want to (like at all, I remember being told to go away when I asked something). X's sister was roughly my sister's age, so I generally turned to her to play games and do stuff with. \n\nThis 'looking after me' went on for about a year until we finished school at a later time.\n\nAnyway, this whole 'being excluded' went on the whole way until I left for Secondary school (high school for you muricans). X went on to cause more problems, I remember once being in a physical fight with X, which I ended up crying after. In the eyes of everyone else there I was a 'bitch'. \n\nThis is getting boring, I have countless stories with X and about how abusive he was. \n\nAnyway Secondary school time. The greatest years of your life. Your place to forge a path through this jungle. Well, not for me, not so far anyway..\n\nRight at the start of it I found games interesting. I would spend hour, days and even at a point weeks playing them.\nQuick tl;dr, first year of secondary, games, games and more games. Second year was the same. \n\nThird year I found a real interest in programming, computers and such. As I spend all my time other than school at home, I loved this. At the end of third year, and somewhat during it I didn't go into school some days. I lost all hope, and with semi-important exams coming up this wasn't the place to be. I would spend days at a time not going into school, not talking to people, not doing anything. In bed, probably crying, I lost all hope and very nearly attempted suicide. Didn't go into school for around 60 days that year, at the end of the year it was 3 weeks before anyone saw me. \n\nNext up: Transition Year (4th year, and I will abbreviate this to 'TY'). Where I was and where I am now. We don't do much work in TY, like I mean some days we would do absolutely nothing. This started off all and well, me still being depressed and suicidal as usual.. until about a month ago. I said 'fuck it' and decided to at least try make friends outside of school. \n\nThis has worked, but I am still in an awful position. I met this person, who may or may not read this post, who I really like. I would probably take a bullet for her (no joke, couldn't care about my own life anymore..) as she has been there for me more than anyone else over this past month. Borderline love her? You could say that..\n\nI hit a self destruct period on Wednesday night, I started hitting the wall to inflict pain on myself, tried cutting my arms open (didn't get very far with that..) and so on. I have hit this before quite recently, but the person mentioned above was talking me to try calm me down. \n\nI am still thinking about killing myself, it's always* on my mind. I just think myself into situations that don't exist and this pops into my mind. \n\n*One minute I can be happy, 5 mins later I can break down crying and such. \n\nSorry, I know this probably didn't make much sense to any of you, I just need to write. Spent an hour at this, that's an hour I didn't waste wanting to kill myself. \n\nEdit: spelling", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zlio", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "IVIodern", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398465369.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zlio/sharing_my_life_up_until_now_dont_know_what_to_do/", "name": "t3_23zlio", "created": 1398493643.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zlio/sharing_my_life_up_until_now_dont_know_what_to_do/", "author_flair_text": null, "title": "Sharing my life up until now, don't know what to do anymore..", "created_utc": 1398464843.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch24inf", "gilded": 0, "author": "IVIodern", "parent_id": "t1_ch24fv5", "approved_by": null, "body": "Completely hopeless, started hitting the wall. Kept on doing it until the point of breaking, then tried to cut my arm open. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Completely hopeless, started hitting the wall. Kept on doing it until the point of breaking, then tried to cut my arm open. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zlio", "score_hidden": false, "name": "t1_ch24inf", "created": 1398469135.0, "author_flair_text": null, "created_utc": 1398465535.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch24fv5", "gilded": 0, "author": "MistorBibble", "parent_id": "t3_23zlio", "approved_by": null, "body": "Hey man, I'm sorry that things turned out that way. What happened on Wednesday?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I&amp;#39;m sorry that things turned out that way. What happened on Wednesday?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zlio", "score_hidden": false, "name": "t1_ch24fv5", "created": 1398468958.0, "author_flair_text": null, "created_utc": 1398465358.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]