[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey. In 13 days I&amp;#39;m going to sit exams that will dictate my future career options for the rest of my life. I&amp;#39;m predicted shitty grades, C&amp;#39;s and B&amp;#39;s. Few A&amp;#39;s in Chem and Drama but nothing else. I burst under pressure. Ask me any question in class and I can answer it, I&amp;#39;m smart, but when it comes down to exams I buckle. &lt;/p&gt;\n\n&lt;p&gt;I know I&amp;#39;m going to get average results. I&amp;#39;m not going to be able to study chemistry at a higher level with my results being higher, so I ask what&amp;#39;s the point? Whats the fucking point anymore? If I can&amp;#39;t get the grades, I wont be able to study my passion and I&amp;#39;ll have to study somthing shitty. I wont get a good job and my life will be ruined? I seriosuly feel like ending it. It&amp;#39;s stressing me out. Help me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey. In 13 days I'm going to sit exams that will dictate my future career options for the rest of my life. I'm predicted shitty grades, C's and B's. Few A's in Chem and Drama but nothing else. I burst under pressure. Ask me any question in class and I can answer it, I'm smart, but when it comes down to exams I buckle. \n\nI know I'm going to get average results. I'm not going to be able to study chemistry at a higher level with my results being higher, so I ask what's the point? Whats the fucking point anymore? If I can't get the grades, I wont be able to study my passion and I'll have to study somthing shitty. I wont get a good job and my life will be ruined? I seriosuly feel like ending it. It's stressing me out. Help me.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bqgq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "IdiotThrowaway-", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24bqgq/shit_grades_predicted_whats_the_point_anymore/", "name": "t3_24bqgq", "created": 1398846362.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24bqgq/shit_grades_predicted_whats_the_point_anymore/", "author_flair_text": null, "title": "Shit grades predicted - What's the point anymore?", "created_utc": 1398817562.0, "ups": 15, "num_comments": 15, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch62nf9", "gilded": 0, "author": "EngrishMawfin", "parent_id": "t1_ch5k7ty", "approved_by": null, "body": "Honestly I finished college with a degree in computer science a year ago and have gotten TONS of job offers for freelance stuff as well as permanent jobs and literally not a single one of those people that were hiring asked me about my grades or even my degree for that matter. They just want to see some of my work I've done and could care less about how I performed in school. Obviously that's not the case for all jobs especially if you're trying to work for Google or something, but just wanted to let you know that it's a whole different world out there once you graduate (or even if you decide to just quit school and start your programming career without a degree). I look back at my schooling and how stressed out I was working 40 hrs/week while balancing 4-5 Comp Sci classes at a time for four years and just laugh now because apparently nobody even cares that much in the long term. Anyway, you still have time to prove yourself after schooling is over. And especially since you have a passion for programming I'm positive everything will turn out just fine. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I finished college with a degree in computer science a year ago and have gotten TONS of job offers for freelance stuff as well as permanent jobs and literally not a single one of those people that were hiring asked me about my grades or even my degree for that matter. They just want to see some of my work I&amp;#39;ve done and could care less about how I performed in school. Obviously that&amp;#39;s not the case for all jobs especially if you&amp;#39;re trying to work for Google or something, but just wanted to let you know that it&amp;#39;s a whole different world out there once you graduate (or even if you decide to just quit school and start your programming career without a degree). I look back at my schooling and how stressed out I was working 40 hrs/week while balancing 4-5 Comp Sci classes at a time for four years and just laugh now because apparently nobody even cares that much in the long term. Anyway, you still have time to prove yourself after schooling is over. And especially since you have a passion for programming I&amp;#39;m positive everything will turn out just fine. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch62nf9", "created": 1398904274.0, "author_flair_text": null, "created_utc": 1398875474.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5k7ty", "gilded": 0, "author": "MuffinzPlox", "parent_id": "t3_24bqgq", "approved_by": null, "body": "I'm in the same exact situation at the moment. I'm studying computer science. I failed my calculus 2 class for the second time. I got A's in all my other classes (including calculus 1 the previous semester). But I feel as though my mental limit ends at calculus 2. Which is horrible because linear algebra is required for my major and calc 2 is required for linear algebra. Just a few minutes ago I had withdrawal from the class because I just got an email from my teacher saying there is no possible way to pass the class. (All my test scores were 58%, 55%, 55%) I do great on the homework and practice tests my tutors give me but I always fail the tests. \nI don't know how I'm going to pass college. Programming is the only thing I like doing and its the only thing I'm good at. It's been a dream of mine since 7th grade. \nI had almost killed myself last week but I stopped after hearing kind words from a friend. \nNow I need to find a way to tell my parents because they don't know. Both of them were valedictorians so they expect things from me. It's going to crush them and they are going to get angry at me. (they might kick me out of the house). In 5 mins I have to go to the mall and hang out in my car instead of going to the class I just dropped so I can find a way how to talk to them about it. \nI am having a hard time. And I might not be any help to you but just know that your not alone. The school system is fucked anyway.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the same exact situation at the moment. I&amp;#39;m studying computer science. I failed my calculus 2 class for the second time. I got A&amp;#39;s in all my other classes (including calculus 1 the previous semester). But I feel as though my mental limit ends at calculus 2. Which is horrible because linear algebra is required for my major and calc 2 is required for linear algebra. Just a few minutes ago I had withdrawal from the class because I just got an email from my teacher saying there is no possible way to pass the class. (All my test scores were 58%, 55%, 55%) I do great on the homework and practice tests my tutors give me but I always fail the tests. \nI don&amp;#39;t know how I&amp;#39;m going to pass college. Programming is the only thing I like doing and its the only thing I&amp;#39;m good at. It&amp;#39;s been a dream of mine since 7th grade. \nI had almost killed myself last week but I stopped after hearing kind words from a friend. \nNow I need to find a way to tell my parents because they don&amp;#39;t know. Both of them were valedictorians so they expect things from me. It&amp;#39;s going to crush them and they are going to get angry at me. (they might kick me out of the house). In 5 mins I have to go to the mall and hang out in my car instead of going to the class I just dropped so I can find a way how to talk to them about it. \nI am having a hard time. And I might not be any help to you but just know that your not alone. The school system is fucked anyway.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5k7ty", "created": 1398848486.0, "author_flair_text": null, "created_utc": 1398819686.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5livm", "gilded": 0, "author": "PurpleJollyBastard", "parent_id": "t3_24bqgq", "approved_by": null, "body": "you can change your program after you get into a university.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you can change your program after you get into a university.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5livm", "created": 1398851169.0, "author_flair_text": null, "created_utc": 1398822369.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5prub", "gilded": 0, "author": "Mara__Jade", "parent_id": "t1_ch5ocip", "approved_by": null, "body": "We don't tend to say \"sit exams\" in the US. I'm guessing elsewhere.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We don&amp;#39;t tend to say &amp;quot;sit exams&amp;quot; in the US. I&amp;#39;m guessing elsewhere.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5prub", "created": 1398860260.0, "author_flair_text": null, "created_utc": 1398831460.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5pu9f", "gilded": 0, "author": "Mara__Jade", "parent_id": "t1_ch5ocip", "approved_by": null, "body": "I agree. In the US, you can just say, \"I'm majoring in Chemistry.\" And then you are! \n\nOf my closest friends in college, 1 of us is working in the field they majored in. One. I personally don't do anything close to my college major. Even your college major doesn't define you!\n\nYou said you have As in Chem. That counts for something!!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. In the US, you can just say, &amp;quot;I&amp;#39;m majoring in Chemistry.&amp;quot; And then you are! &lt;/p&gt;\n\n&lt;p&gt;Of my closest friends in college, 1 of us is working in the field they majored in. One. I personally don&amp;#39;t do anything close to my college major. Even your college major doesn&amp;#39;t define you!&lt;/p&gt;\n\n&lt;p&gt;You said you have As in Chem. That counts for something!!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5pu9f", "created": 1398860422.0, "author_flair_text": null, "created_utc": 1398831622.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5ocip", "gilded": 0, "author": "Minoko", "parent_id": "t3_24bqgq", "approved_by": null, "body": "I agree with what the others wrote before me :) \n\n  Also,You will pretty much always be able to study what you want to study, if youre flexible! I'm assuming youre from the US, just because the majority of reddit seems to be. Youre fluent in english and we live in a globalized world, which means you are not confined to stay in the same area for the rest of your life. I know for a fact that - just for example - ina lot of european countries they dont look at your grades as much, like in the netherlands. I live in germany and maaaaaaaany people I know have gone to the netherlands to study things like medicine or psychology, because their grades were too low for german standards. other friends have started with internships, working their way up til they were able to study what they wanted. It takes more time, sure, but in the end they are able to do what they wanted to do from the start.\n  I'm in no way urging you to emigrate or anything, I'm just saying that if you really want to study chemistry, you will be able to. It really all depends on how far youre willing to go (literally in my example..ha) \n\n\nDont be scared. You can do it!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with what the others wrote before me :) &lt;/p&gt;\n\n&lt;p&gt;Also,You will pretty much always be able to study what you want to study, if youre flexible! I&amp;#39;m assuming youre from the US, just because the majority of reddit seems to be. Youre fluent in english and we live in a globalized world, which means you are not confined to stay in the same area for the rest of your life. I know for a fact that - just for example - ina lot of european countries they dont look at your grades as much, like in the netherlands. I live in germany and maaaaaaaany people I know have gone to the netherlands to study things like medicine or psychology, because their grades were too low for german standards. other friends have started with internships, working their way up til they were able to study what they wanted. It takes more time, sure, but in the end they are able to do what they wanted to do from the start.\n  I&amp;#39;m in no way urging you to emigrate or anything, I&amp;#39;m just saying that if you really want to study chemistry, you will be able to. It really all depends on how far youre willing to go (literally in my example..ha) &lt;/p&gt;\n\n&lt;p&gt;Dont be scared. You can do it!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5ocip", "created": 1398857042.0, "author_flair_text": null, "created_utc": 1398828242.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5p7f8", "gilded": 0, "author": "PoetJustice", "parent_id": "t3_24bqgq", "approved_by": null, "body": "Remember grades don't define who you are. The grades you get when you were in your teens doesn't decide if you are more or less qualified to do a job that you want to do. While education is important, much of the stuff you learn in school is never used in what you are interested. You aren't your grades, they're just numbers, they don't tell who you are. If you need anyone to talk to, I'll be here for you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember grades don&amp;#39;t define who you are. The grades you get when you were in your teens doesn&amp;#39;t decide if you are more or less qualified to do a job that you want to do. While education is important, much of the stuff you learn in school is never used in what you are interested. You aren&amp;#39;t your grades, they&amp;#39;re just numbers, they don&amp;#39;t tell who you are. If you need anyone to talk to, I&amp;#39;ll be here for you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5p7f8", "created": 1398858950.0, "author_flair_text": null, "created_utc": 1398830150.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5kr8a", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24bqgq", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5kr8a", "created": 1398849594.0, "author_flair_text": null, "created_utc": 1398820794.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5myve", "gilded": 0, "author": "sunflower0123", "parent_id": "t3_24bqgq", "approved_by": null, "body": "I know you predict that your grades will be horrible, but are you sure they will be? I had a test today and I was actually going to skip going because I thought I'd fail. I managed to make myself go anyways. And guess what? The exam questions were surprisingly easy and I got an A.\n\nI worry a lot about the future. I think up worst case scenarios and fear future outcomes. Doing this doesn't make me feel good. All it does is raise my anxiety. Anyways, rarely any of the things I negatively imagine ever happen. There's a possibility you can get good grades so don't sell yourself short.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you predict that your grades will be horrible, but are you sure they will be? I had a test today and I was actually going to skip going because I thought I&amp;#39;d fail. I managed to make myself go anyways. And guess what? The exam questions were surprisingly easy and I got an A.&lt;/p&gt;\n\n&lt;p&gt;I worry a lot about the future. I think up worst case scenarios and fear future outcomes. Doing this doesn&amp;#39;t make me feel good. All it does is raise my anxiety. Anyways, rarely any of the things I negatively imagine ever happen. There&amp;#39;s a possibility you can get good grades so don&amp;#39;t sell yourself short.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5myve", "created": 1398854104.0, "author_flair_text": null, "created_utc": 1398825304.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5sm96", "gilded": 0, "author": "1235678951", "parent_id": "t3_24bqgq", "approved_by": null, "body": "what do you want in life?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what do you want in life?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5sm96", "created": 1398843909.0, "author_flair_text": null, "created_utc": 1398840309.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5x3zc", "gilded": 0, "author": "winkie5970", "parent_id": "t3_24bqgq", "approved_by": null, "body": "I failed out of college when I was 20 years old. I was depressed and even once upon a time suicidal. I worked a lot of low-paying jobs and got fired because I was late or absent a lot due to the depression. I struggled for years to make ends meet and at one point had over $10k in credit card debt.\n\nI'm now 29 years old and make over $90k per year. I went back to school part-time in 2009 and finished my degree in 2012 while working full-time. I can't help with your text-taking anxiety but I can tell you that life doesn't need to end because you have bad grades.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I failed out of college when I was 20 years old. I was depressed and even once upon a time suicidal. I worked a lot of low-paying jobs and got fired because I was late or absent a lot due to the depression. I struggled for years to make ends meet and at one point had over $10k in credit card debt.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m now 29 years old and make over $90k per year. I went back to school part-time in 2009 and finished my degree in 2012 while working full-time. I can&amp;#39;t help with your text-taking anxiety but I can tell you that life doesn&amp;#39;t need to end because you have bad grades.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bqgq", "score_hidden": false, "name": "t1_ch5x3zc", "created": 1398891549.0, "author_flair_text": null, "created_utc": 1398862749.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]