[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used of cared about living.  I use to feel any sense of happieness or excitement in life.  5 or 6 years ago....its so tough to remember anymore I start drinking every day after ending a relationship with a girlfriend of 5 years.  Now I drink and smoke m everyday and have no one who cares about me.  The girl who I loved got married yesterday.&lt;/p&gt;\n\n&lt;p&gt;Everyday since we broke up, I have debated on ending my life.  I have dated a few girls but stopped dating a couple of years ago because I am not a very positive person.  I don&amp;#39;t feel anyone else cares about me except my mom.  I randomly cry.  I am a 33 year old guy who lives in midwest.  I can barely take care of myself.  I have a great job but I cannot be happy ever.  The substance abuse is killing me.  I can remember anything anymore and dont ever want to be around anybody.  I don&amp;#39;t understand why I continue to live.  I spend 14 hours a day in front of a computer or cell phone.  I have tons and tons of debt and have nothing to look forward too in life.  I really am apart of nothing...no plan.&lt;/p&gt;\n\n&lt;p&gt;Feels like every year I write one of these.  I wish I had the guts to not share anymore.  I wish there was a reason to keep going on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I used of cared about living.  I use to feel any sense of happieness or excitement in life.  5 or 6 years ago....its so tough to remember anymore I start drinking every day after ending a relationship with a girlfriend of 5 years.  Now I drink and smoke m everyday and have no one who cares about me.  The girl who I loved got married yesterday.\n\nEveryday since we broke up, I have debated on ending my life.  I have dated a few girls but stopped dating a couple of years ago because I am not a very positive person.  I don't feel anyone else cares about me except my mom.  I randomly cry.  I am a 33 year old guy who lives in midwest.  I can barely take care of myself.  I have a great job but I cannot be happy ever.  The substance abuse is killing me.  I can remember anything anymore and dont ever want to be around anybody.  I don't understand why I continue to live.  I spend 14 hours a day in front of a computer or cell phone.  I have tons and tons of debt and have nothing to look forward too in life.  I really am apart of nothing...no plan.\n\nFeels like every year I write one of these.  I wish I had the guts to not share anymore.  I wish there was a reason to keep going on.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2450nb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "the0riginalposter", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2450nb/so_depressed/", "name": "t3_2450nb", "created": 1398667548.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2450nb/so_depressed/", "author_flair_text": null, "title": "So Depressed", "created_utc": 1398638748.0, "ups": 8, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yqre", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch3oiys", "approved_by": null, "body": "You are welcome. \n\nThe curious thing about being depressed is that you can paint depression as an abyss. You just start being depressed for that or this reason, and the thing that hit me as the most dangerous about this \"state of mind\" is the fact that you become stuck. \nYour feelings overcome you and your mind starts wandering about what you could do to change, but you see no solution. And so the abyss becomes bigger and bigger. The fact you are stuck also enforces your thoughts of inability to change. How can someone feel hope, happyness, if everyday is exactly the same as yesterday, or the day before yesterday, and so on?\n\nAnd that's exactly the point: leaving this \"grey\" area is hard. It is indeed a act that requires much willpower. And the thing is, that it is gradual. But when you'll leave it, you'll be changed, and I assure you, for the best. \n\n\n", "edited": 1398668189.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are welcome. &lt;/p&gt;\n\n&lt;p&gt;The curious thing about being depressed is that you can paint depression as an abyss. You just start being depressed for that or this reason, and the thing that hit me as the most dangerous about this &amp;quot;state of mind&amp;quot; is the fact that you become stuck. \nYour feelings overcome you and your mind starts wandering about what you could do to change, but you see no solution. And so the abyss becomes bigger and bigger. The fact you are stuck also enforces your thoughts of inability to change. How can someone feel hope, happyness, if everyday is exactly the same as yesterday, or the day before yesterday, and so on?&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s exactly the point: leaving this &amp;quot;grey&amp;quot; area is hard. It is indeed a act that requires much willpower. And the thing is, that it is gradual. But when you&amp;#39;ll leave it, you&amp;#39;ll be changed, and I assure you, for the best. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2450nb", "score_hidden": false, "name": "t1_ch3yqre", "created": 1398671330.0, "author_flair_text": null, "created_utc": 1398667730.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3oiys", "gilded": 0, "author": "the0riginalposter", "parent_id": "t1_ch3ny1c", "approved_by": null, "body": "Thanks for your nice and well thought out post.  It brought tears to my eyes that someone even cared enough to reply let alone read my disgusting thoughts.\n\nI don't care about the money or the people anymore...it just I want to just be happy that is why I turn to substance.  I just can't find happieness anymore.  I wish I knew what would make me happy but I just don't know.  perhaps your right someone to communicate with.  can you imagine waking up everyday and having nothing to motivate you or have anything to look forward to, to get excited about.  there is nothing but substance.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your nice and well thought out post.  It brought tears to my eyes that someone even cared enough to reply let alone read my disgusting thoughts.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care about the money or the people anymore...it just I want to just be happy that is why I turn to substance.  I just can&amp;#39;t find happieness anymore.  I wish I knew what would make me happy but I just don&amp;#39;t know.  perhaps your right someone to communicate with.  can you imagine waking up everyday and having nothing to motivate you or have anything to look forward to, to get excited about.  there is nothing but substance.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2450nb", "score_hidden": false, "name": "t1_ch3oiys", "created": 1398645226.0, "author_flair_text": null, "created_utc": 1398641626.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3ny1c", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_2450nb", "approved_by": null, "body": "Hi OriginalPoster,\nnice to meet you.\n\nFirst of all, I'm sorry to hear what you are passing through. \nI do care about you, or else I wouldn't be writing this post ;)\n\nI want to say you some things, though, so bear with me if this will be long.\n\n1) the first thing you should do, is to tell someone you love how you feel. You said you start to cry randomly sometimes. This is probably because you are suffering much, as I can tell by your post.\n\nYou have to share your pain with someone else. You have chosen reddit and I'll do my best to help you. But I know for sure you've got someone around that cares about you that can help you. Let it be your mother, if that may help you.\n\n2) The second thing I want to tell you is about your girlfriend. You were able to bright my eyes a bit with tears because you made me think about what I've passed through. After the girl I loved the most left me, I felt empty and sad and void. I lived through two years where my life had become senseless, and I couldn't see the light.\nI had to rethink myself as a whole. That's what I would like to show you, how I got out:\nI had to close contact with that girlfriend. You can't think to keep in touch with a girl with whom you have shared so much. What I like to think, and that helped me pass through this (and I needed time even to realize this) was thinking that our lives are made of chapters, and the time you've passed with girlfriend was one of these. But that chapter is now closed. You'll have to accept it.\n\n3) Another thing I would like to tell you, is that you got 33 years. If things go as I think, you'll live for another 60 years. This means you have basically a lot of time to meet new people, and amongst them a new girl that will send shiver down your spine.\nLove is a thing that has to be coltivated. When I was in love, I always saw my girlfriend as the one who never meant harm to me, but even indirectly people will harm you, even your girlfriend. Think about it.\nThis doesn't mean that she wanted it. It just mean that you'll have to avoid making her able to do that.\n\n4) If you can, gradually stop drinking and start taking care of yourself once again.  Stop abusing with the substance. \n\n5) You said you've got a good job, so your debts aren't irreparable. \n\nBy little steps, you can fix everything. It will be hard, but happyness, excitement, will be your reward.\n\nIf you wish tell something else, just answer to this post. As soon as I get back, I'll answer to you once again. Have a good day.\n\n", "edited": 1398664467.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi OriginalPoster,\nnice to meet you.&lt;/p&gt;\n\n&lt;p&gt;First of all, I&amp;#39;m sorry to hear what you are passing through. \nI do care about you, or else I wouldn&amp;#39;t be writing this post ;)&lt;/p&gt;\n\n&lt;p&gt;I want to say you some things, though, so bear with me if this will be long.&lt;/p&gt;\n\n&lt;p&gt;1) the first thing you should do, is to tell someone you love how you feel. You said you start to cry randomly sometimes. This is probably because you are suffering much, as I can tell by your post.&lt;/p&gt;\n\n&lt;p&gt;You have to share your pain with someone else. You have chosen reddit and I&amp;#39;ll do my best to help you. But I know for sure you&amp;#39;ve got someone around that cares about you that can help you. Let it be your mother, if that may help you.&lt;/p&gt;\n\n&lt;p&gt;2) The second thing I want to tell you is about your girlfriend. You were able to bright my eyes a bit with tears because you made me think about what I&amp;#39;ve passed through. After the girl I loved the most left me, I felt empty and sad and void. I lived through two years where my life had become senseless, and I couldn&amp;#39;t see the light.\nI had to rethink myself as a whole. That&amp;#39;s what I would like to show you, how I got out:\nI had to close contact with that girlfriend. You can&amp;#39;t think to keep in touch with a girl with whom you have shared so much. What I like to think, and that helped me pass through this (and I needed time even to realize this) was thinking that our lives are made of chapters, and the time you&amp;#39;ve passed with girlfriend was one of these. But that chapter is now closed. You&amp;#39;ll have to accept it.&lt;/p&gt;\n\n&lt;p&gt;3) Another thing I would like to tell you, is that you got 33 years. If things go as I think, you&amp;#39;ll live for another 60 years. This means you have basically a lot of time to meet new people, and amongst them a new girl that will send shiver down your spine.\nLove is a thing that has to be coltivated. When I was in love, I always saw my girlfriend as the one who never meant harm to me, but even indirectly people will harm you, even your girlfriend. Think about it.\nThis doesn&amp;#39;t mean that she wanted it. It just mean that you&amp;#39;ll have to avoid making her able to do that.&lt;/p&gt;\n\n&lt;p&gt;4) If you can, gradually stop drinking and start taking care of yourself once again.  Stop abusing with the substance. &lt;/p&gt;\n\n&lt;p&gt;5) You said you&amp;#39;ve got a good job, so your debts aren&amp;#39;t irreparable. &lt;/p&gt;\n\n&lt;p&gt;By little steps, you can fix everything. It will be hard, but happyness, excitement, will be your reward.&lt;/p&gt;\n\n&lt;p&gt;If you wish tell something else, just answer to this post. As soon as I get back, I&amp;#39;ll answer to you once again. Have a good day.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2450nb", "score_hidden": false, "name": "t1_ch3ny1c", "created": 1398643882.0, "author_flair_text": null, "created_utc": 1398640282.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4g3wd", "gilded": 0, "author": "the0riginalposter", "parent_id": "t1_ch3tmfd", "approved_by": null, "body": "Its very tough....I haven't dated anyone in years.  I have become obese and my social skills have went down the drain from my substance abuse.  I don't really know what to do anymore.  I will never ashame my family and talk to a professional.  I will never open up to a professional.  the only reason I come here is because I know it is anonymous and I feel like I have to tell someone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its very tough....I haven&amp;#39;t dated anyone in years.  I have become obese and my social skills have went down the drain from my substance abuse.  I don&amp;#39;t really know what to do anymore.  I will never ashame my family and talk to a professional.  I will never open up to a professional.  the only reason I come here is because I know it is anonymous and I feel like I have to tell someone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2450nb", "score_hidden": false, "name": "t1_ch4g3wd", "created": 1398722642.0, "author_flair_text": null, "created_utc": 1398719042.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3tmfd", "gilded": 0, "author": "hyuga488", "parent_id": "t3_2450nb", "approved_by": null, "body": "Hey there Original. I know you probably don't care what I have to say, but I'll say it anyways.\n\nTalk to people that you care about.\n\nYour debts are nothing, just another expense at the end of the month. Don't think of them as a daunting number, but as an electric bill or water bill.\n\nYour girlfriend of five years- I know it's hard, my friend, but take heart knowing that she is happy. Don't be afraid to put yourself out there to other girls.\n\nThe thing that really struck me about your post was the fact that you said that nobody cares about you. Well, I know Nemesis and I wouldn't be here if we didn't.\n\nTalk to a professional, because I know they help a lot more than I ever could.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there Original. I know you probably don&amp;#39;t care what I have to say, but I&amp;#39;ll say it anyways.&lt;/p&gt;\n\n&lt;p&gt;Talk to people that you care about.&lt;/p&gt;\n\n&lt;p&gt;Your debts are nothing, just another expense at the end of the month. Don&amp;#39;t think of them as a daunting number, but as an electric bill or water bill.&lt;/p&gt;\n\n&lt;p&gt;Your girlfriend of five years- I know it&amp;#39;s hard, my friend, but take heart knowing that she is happy. Don&amp;#39;t be afraid to put yourself out there to other girls.&lt;/p&gt;\n\n&lt;p&gt;The thing that really struck me about your post was the fact that you said that nobody cares about you. Well, I know Nemesis and I wouldn&amp;#39;t be here if we didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Talk to a professional, because I know they help a lot more than I ever could.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2450nb", "score_hidden": false, "name": "t1_ch3tmfd", "created": 1398682062.0, "author_flair_text": null, "created_utc": 1398653262.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]