[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m new, if I&amp;#39;m breaking any rules tell me and I&amp;#39;ll fix it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had major depression for as long as I can remember. I first tried to kill myself when I was 9 (tried starving myself but then I forgot because i&amp;#39;m ADHD). When I was 13 I started cutting. Five months ago I started taking pills in an attempt to kill myself. Every time, a friend or my boyfriend would catch on and stop me. I think there was a part of me that secretly didn&amp;#39;t actually want to die. But this time everything has gotten to a point where I can&amp;#39;t take it anymore. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always hated myself, my appearance, my grades, my &amp;quot;talents&amp;quot;, etc. I&amp;#39;ve always been a terrible person. I always try to help everyone but I just end up hurting them. So I guess that&amp;#39;s my &amp;quot;reasoning&amp;quot; although I don&amp;#39;t think its easy to put into words so what I&amp;#39;ve said probably doesn&amp;#39;t make much sense.\nMy parents don&amp;#39;t really know the whole truth. My mum found out I was suicidal and sent me to a therapist but doesn&amp;#39;t know about the cutting. My dad knows as much as she does and cursed me out for it. I&amp;#39;ve dealt with abuse from them (mental and a little physical from my mum) so there&amp;#39;s that. The only people I really have is my older brother, my boyfriend, and a few friends. My friends are scared of all this suicidalness and have been ignoring me. &lt;/p&gt;\n\n&lt;p&gt;My brother would always be there to protect me and help me, but then he got a girlfriend and he became completely different towards me. I&amp;#39;ll admit I haven&amp;#39;t always been the best sister, but since he started dating her he started saying things like &amp;quot;you&amp;#39;re a selfish bitch&amp;quot; and &amp;quot;all you do is hurt everyone and thats why everyone abandons you&amp;quot;. And I honestly think he&amp;#39;s right. I also think that my boyfriend deserves better. I really wanted to be able to end everyone&amp;#39;s suffering, not just my own. So this is really all for them, so they can be happy again.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s it. Sorry if I broke any rules, I just wanted to get everything off my chest before I go. I&amp;#39;ll stick around until like 10-11 so that I can fall asleep for the last time. Not really sure how to end this, so this post is ending right here. &lt;/p&gt;\n\n&lt;p&gt;Edit: I realise I haven&amp;#39;t really explained my reasons that well. If anyone cares I&amp;#39;ll try to explain it better in comments or whatever (still not really sure how this subreddit works).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm new, if I'm breaking any rules tell me and I'll fix it.\n\nI've had major depression for as long as I can remember. I first tried to kill myself when I was 9 (tried starving myself but then I forgot because i'm ADHD). When I was 13 I started cutting. Five months ago I started taking pills in an attempt to kill myself. Every time, a friend or my boyfriend would catch on and stop me. I think there was a part of me that secretly didn't actually want to die. But this time everything has gotten to a point where I can't take it anymore. \n\nI've always hated myself, my appearance, my grades, my \"talents\", etc. I've always been a terrible person. I always try to help everyone but I just end up hurting them. So I guess that's my \"reasoning\" although I don't think its easy to put into words so what I've said probably doesn't make much sense.\nMy parents don't really know the whole truth. My mum found out I was suicidal and sent me to a therapist but doesn't know about the cutting. My dad knows as much as she does and cursed me out for it. I've dealt with abuse from them (mental and a little physical from my mum) so there's that. The only people I really have is my older brother, my boyfriend, and a few friends. My friends are scared of all this suicidalness and have been ignoring me. \n\nMy brother would always be there to protect me and help me, but then he got a girlfriend and he became completely different towards me. I'll admit I haven't always been the best sister, but since he started dating her he started saying things like \"you're a selfish bitch\" and \"all you do is hurt everyone and thats why everyone abandons you\". And I honestly think he's right. I also think that my boyfriend deserves better. I really wanted to be able to end everyone's suffering, not just my own. So this is really all for them, so they can be happy again.\n\nSo that's it. Sorry if I broke any rules, I just wanted to get everything off my chest before I go. I'll stick around until like 10-11 so that I can fall asleep for the last time. Not really sure how to end this, so this post is ending right here. \n\nEdit: I realise I haven't really explained my reasons that well. If anyone cares I'll try to explain it better in comments or whatever (still not really sure how this subreddit works).\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bj0o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "goodoldwhatshername", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24bj0o/so_im_leaving_tonight/", "name": "t3_24bj0o", "created": 1398841606.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24bj0o/so_im_leaving_tonight/", "author_flair_text": null, "title": "So I'm Leaving Tonight...", "created_utc": 1398812806.0, "ups": 3, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5wqlb", "gilded": 0, "author": "Elzith_", "parent_id": "t1_ch5jvp8", "approved_by": null, "body": "We all remember the bad over the good. But I'm sure your friends would stand by you if you needed them. As to your parents..well..you're not going to have to be around them forever. So, hang on and you'll be free within a few years I would of thought. Don't let them win, eh?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We all remember the bad over the good. But I&amp;#39;m sure your friends would stand by you if you needed them. As to your parents..well..you&amp;#39;re not going to have to be around them forever. So, hang on and you&amp;#39;ll be free within a few years I would of thought. Don&amp;#39;t let them win, eh?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bj0o", "score_hidden": false, "name": "t1_ch5wqlb", "created": 1398865118.0, "author_flair_text": null, "created_utc": 1398861518.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5jvp8", "gilded": 0, "author": "goodoldwhatshername", "parent_id": "t1_ch5jh09", "approved_by": null, "body": "Its kinda difficult to explain but pretty much I help people when they need it, but when I need help with something I get nothing. So I get pissed about it. And I end up hurting people. And it makes everyone forget the \"good\" things I've done. My family doesn't really love me. As I said, my brother has completely forsaken me. My mum abuses me and has left over post pardum depression or something because she always makes sure that I know how much she despises me. And my dad isn't around much, and when he is he only spends time with my other brother (who hates me to the point that he hides food on me to starve me). ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its kinda difficult to explain but pretty much I help people when they need it, but when I need help with something I get nothing. So I get pissed about it. And I end up hurting people. And it makes everyone forget the &amp;quot;good&amp;quot; things I&amp;#39;ve done. My family doesn&amp;#39;t really love me. As I said, my brother has completely forsaken me. My mum abuses me and has left over post pardum depression or something because she always makes sure that I know how much she despises me. And my dad isn&amp;#39;t around much, and when he is he only spends time with my other brother (who hates me to the point that he hides food on me to starve me). &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bj0o", "score_hidden": false, "name": "t1_ch5jvp8", "created": 1398822613.0, "author_flair_text": null, "created_utc": 1398819013.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5jh09", "gilded": 0, "author": "Elzith_", "parent_id": "t3_24bj0o", "approved_by": null, "body": "Hey there!\n\n\"I've always been a terrible person. I always try to help everyone but I just end up hurting them. \"\n\nNot sure how to quote :3\n\nAnyway! To my mind and most anyone else, it's the trying that helps. We all hurt people, it's just one of those things. Death and taxes and all that. But those of us that try to do better by them and continue trying to make the world a better place..well..they're the best of us. No question about that.  \n\n\"I really wanted to be able to end everyone's suffering, not just my own. So this is really all for them, so they can be happy again.\"\n\n\nWho is it that will be better off? Your friends do not know how to handle it, your boyfriend cares but does not know how he can help. Your family..well..they're your family. They love you and will stand by you, no matter what. Nobody will be better off you are gone. Nobody.\n\n\nIt takes a rare person to go out of there way for others. It's beyond tragic that the world sees fit to hurt us so. But beyond amazing that other people, with their own problems and issues, will help other people also suffering.\n\n\nWhatever you decide, people will be thinking about you and if you do decide to go through with it, the world will miss you terribly. Sorry if I'm rambling..but..yeah. Enough now I suppose ^^\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there!&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve always been a terrible person. I always try to help everyone but I just end up hurting them. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Not sure how to quote :3&lt;/p&gt;\n\n&lt;p&gt;Anyway! To my mind and most anyone else, it&amp;#39;s the trying that helps. We all hurt people, it&amp;#39;s just one of those things. Death and taxes and all that. But those of us that try to do better by them and continue trying to make the world a better place..well..they&amp;#39;re the best of us. No question about that.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I really wanted to be able to end everyone&amp;#39;s suffering, not just my own. So this is really all for them, so they can be happy again.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Who is it that will be better off? Your friends do not know how to handle it, your boyfriend cares but does not know how he can help. Your family..well..they&amp;#39;re your family. They love you and will stand by you, no matter what. Nobody will be better off you are gone. Nobody.&lt;/p&gt;\n\n&lt;p&gt;It takes a rare person to go out of there way for others. It&amp;#39;s beyond tragic that the world sees fit to hurt us so. But beyond amazing that other people, with their own problems and issues, will help other people also suffering.&lt;/p&gt;\n\n&lt;p&gt;Whatever you decide, people will be thinking about you and if you do decide to go through with it, the world will miss you terribly. Sorry if I&amp;#39;m rambling..but..yeah. Enough now I suppose &lt;sup&gt;^&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bj0o", "score_hidden": false, "name": "t1_ch5jh09", "created": 1398821765.0, "author_flair_text": null, "created_utc": 1398818165.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]