[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;what is this life i&amp;#39;m living? why am i forcing myself to see another day, when i wake up and i&amp;#39;m disappointed that i didn&amp;#39;t die in my sleep?&lt;/p&gt;\n\n&lt;p&gt;i know i&amp;#39;m going to end it. i know how i&amp;#39;m going to end it. i just don&amp;#39;t want anyone to think &amp;quot;it&amp;#39;s not our fault. he was mentally unstable&amp;quot;. that&amp;#39;s not true. i&amp;#39;ll make it a point to let everyone who is at fault KNOW they are at fault. their friends might tell them &amp;quot;don&amp;#39;t blame yourself&amp;quot;, but I&amp;#39;M THE SOURCE, AND I&amp;#39;M DIRECTLY SAYING I BLAME YOU.&lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t know why i&amp;#39;m posting here. nobody here knows what i&amp;#39;m talking about. it doesn&amp;#39;t make a difference. people who commit suicide are just written off as being unstable, and everyone they leave just tell each other &amp;quot;it wasn&amp;#39;t our fault&amp;quot;. even i leave a note directly saying who led me to this, they&amp;#39;ll still say &amp;quot;don&amp;#39;t blame yourself&amp;quot;. I BLAME YOU&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "what is this life i'm living? why am i forcing myself to see another day, when i wake up and i'm disappointed that i didn't die in my sleep?\n\ni know i'm going to end it. i know how i'm going to end it. i just don't want anyone to think \"it's not our fault. he was mentally unstable\". that's not true. i'll make it a point to let everyone who is at fault KNOW they are at fault. their friends might tell them \"don't blame yourself\", but I'M THE SOURCE, AND I'M DIRECTLY SAYING I BLAME YOU.\n\ni don't know why i'm posting here. nobody here knows what i'm talking about. it doesn't make a difference. people who commit suicide are just written off as being unstable, and everyone they leave just tell each other \"it wasn't our fault\". even i leave a note directly saying who led me to this, they'll still say \"don't blame yourself\". I BLAME YOU", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250f35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nadhvg", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250f35/so_much_anger_so_much_sadness/", "name": "t3_250f35", "created": 1399547422.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250f35/so_much_anger_so_much_sadness/", "author_flair_text": null, "title": "so much anger. so much sadness", "created_utc": 1399518622.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcguqd", "gilded": 0, "author": "FrankenswinesLobster", "parent_id": "t3_250f35", "approved_by": null, "body": "I can't know what you're talking about.\n\nI've been suicidal, I often am suicidal.\n\nFuck them. Don't kill yourself because they are to blame. If you're gonna kill yourself, kill yourself for you.\n\nThey are fucked. You make your own choice.\n\nRandom stranger, message me if you feel like it. I've seen some shit. I'm going through some shit.\n\nShit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t know what you&amp;#39;re talking about.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been suicidal, I often am suicidal.&lt;/p&gt;\n\n&lt;p&gt;Fuck them. Don&amp;#39;t kill yourself because they are to blame. If you&amp;#39;re gonna kill yourself, kill yourself for you.&lt;/p&gt;\n\n&lt;p&gt;They are fucked. You make your own choice.&lt;/p&gt;\n\n&lt;p&gt;Random stranger, message me if you feel like it. I&amp;#39;ve seen some shit. I&amp;#39;m going through some shit.&lt;/p&gt;\n\n&lt;p&gt;Shit.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250f35", "score_hidden": false, "name": "t1_chcguqd", "created": 1399550780.0, "author_flair_text": null, "created_utc": 1399521980.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chch5ii", "gilded": 0, "author": "MattColt", "parent_id": "t3_250f35", "approved_by": null, "body": "Sometimes I feel so angry that I'm past punching a wall, and I just let it poison my soul. And sometimes I feel so sad I feel delirious and I don't even feel depressed. As a human individual you only have a finite control over the world around you. One thing you might not be able to control right now is your depression, but something you can control is letting the people you surround yourself with or that surround you be stronger than you. The best revenge is living a good life. When I feel suicidal, sometimes I romanticize the idea of people crying over my body and making all those that wronged me feel like shit. But then I imagine them a year or two after my death, sipping iced tea on a porch and laughing on a beautiful day. You can't win by quitting the game. Prove that you are better and stronger than them by living another day, and another day, until you've lived long enough you don't even think about them anymore. That day is in the future, in life, not in death.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel so angry that I&amp;#39;m past punching a wall, and I just let it poison my soul. And sometimes I feel so sad I feel delirious and I don&amp;#39;t even feel depressed. As a human individual you only have a finite control over the world around you. One thing you might not be able to control right now is your depression, but something you can control is letting the people you surround yourself with or that surround you be stronger than you. The best revenge is living a good life. When I feel suicidal, sometimes I romanticize the idea of people crying over my body and making all those that wronged me feel like shit. But then I imagine them a year or two after my death, sipping iced tea on a porch and laughing on a beautiful day. You can&amp;#39;t win by quitting the game. Prove that you are better and stronger than them by living another day, and another day, until you&amp;#39;ve lived long enough you don&amp;#39;t even think about them anymore. That day is in the future, in life, not in death.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250f35", "score_hidden": false, "name": "t1_chch5ii", "created": 1399551585.0, "author_flair_text": null, "created_utc": 1399522785.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]