[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want to die now i can&amp;#39;t take it anymore i don&amp;#39;t think i can solve my problems on my own and no one has any interest in helping me.&lt;/p&gt;\n\n&lt;p&gt;Life sucks when it was my sister&amp;#39;s birthday her friends came here at 12 am and congratulated her and me no one cares! expect my mom maybe.&lt;/p&gt;\n\n&lt;p&gt;I have completely skipped college, overweight, jobless, friendless i basically do nothing nowadays i mean nothing not a damn thing i just lie down on the bed i also have a bed wetting problem here at 23 now so it&amp;#39;s this i go to sleep wet my bed and when wake up i lie down on it all day on the bed with my own urine funny isn&amp;#39;t it, i don&amp;#39;t brush anymore, i bathe sometimes. Most of time on the bed consists of me thinking about dying usually my thought process is today i should die like this tommorow like that.&lt;/p&gt;\n\n&lt;p&gt;I have too many problems i don&amp;#39;t know which step which the doctor i had gone to previously told my parents that i was running away from life from responsibility and told them to pay attention but guess what they didn&amp;#39;t but it&amp;#39;s not their problem they have their own lives by they i mean my mom. I have only caused her grief i wanted to wait till she dies so i die after that but then there was a awful family quarrel where she was being manipulative and told me sure kill yourself but give me in writing none of us are responsible. My sister hates me again i am not making this up she will abuse scream at me constantly raise an outcry to get what she wants and uses me as a spacegoat. My dad doesn&amp;#39;t give a shit about me he didn&amp;#39;t come to see in the hospital when i killed myself. Mental help guys aren&amp;#39;t much help. Suicide hotlines are interested mostly in suicide not depression OR LAZINESS. But i don&amp;#39;t mind them would you have a sibling like me in your house? you won&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;My results for exams came in january and i haven&amp;#39;t gone to college to see it. My clothes won&amp;#39;t fit me i am either locked in my room naked or wear a oversized longskirt.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see how things can get better see i need to go out but my weight always blocks me from doing anything and to cope with it i either eat or computer or Tv i am leech i know it and even hate me for it maybe this and depression sub won&amp;#39;t but i am sure pretty much every other sub and non self help site will.&lt;/p&gt;\n\n&lt;p&gt;I am lazy and useless and i don&amp;#39;t wanna change anymore i just wanna die people speak so negatively about life these days anyways and the best part of my dying now is i don&amp;#39;t have to see my grandfather or mom die i can be at peace it sounds damn liberating and peaceful it makes me so happy :) very happy indeed.&lt;/p&gt;\n\n&lt;p&gt;People marry and have kids one of the positives is you can get over your dead parents more easily haha. I am never getting married and i a wimpy child all my life.&lt;/p&gt;\n\n&lt;p&gt;Most of people i ask for help compare and tell look a someone with hands or legs or eyesight got 75% to 90% and u? 49 damn they had so many obstacles but you failed because ur lazy.&lt;/p&gt;\n\n&lt;p&gt;This world is for the mentally strong and for the people who have dreams and want to fight for them it&amp;#39;s not for useless scumbags like  me. I am a moron and idiot and this isn&amp;#39;t negative thinking this is the TRUTH I AM NOT NEGATIVELY thinking of myself i contribute nothing to the house but consume i am literally a parasite don&amp;#39;t you dare say it&amp;#39;s otherwise. ASTROLOGERS HATE ME THEY SEE MY ASTROLOGICAL DOCUMENTS AND SAY MAN THIS GUY IS BETTER IF HES THROWN OUT OF HOUSE usually they scam or suggest a puja or stone but for me this. I truly am better of dead i just want to die now please i wanna be at peace i WANNA BE AT PEACE DAMN IT.&lt;/p&gt;\n\n&lt;p&gt;right now i feel like going to a cold place and dying there of well hypothermia? or some shit like that whatever. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just want to die now i can't take it anymore i don't think i can solve my problems on my own and no one has any interest in helping me.\n\nLife sucks when it was my sister's birthday her friends came here at 12 am and congratulated her and me no one cares! expect my mom maybe.\n\nI have completely skipped college, overweight, jobless, friendless i basically do nothing nowadays i mean nothing not a damn thing i just lie down on the bed i also have a bed wetting problem here at 23 now so it's this i go to sleep wet my bed and when wake up i lie down on it all day on the bed with my own urine funny isn't it, i don't brush anymore, i bathe sometimes. Most of time on the bed consists of me thinking about dying usually my thought process is today i should die like this tommorow like that.\n\nI have too many problems i don't know which step which the doctor i had gone to previously told my parents that i was running away from life from responsibility and told them to pay attention but guess what they didn't but it's not their problem they have their own lives by they i mean my mom. I have only caused her grief i wanted to wait till she dies so i die after that but then there was a awful family quarrel where she was being manipulative and told me sure kill yourself but give me in writing none of us are responsible. My sister hates me again i am not making this up she will abuse scream at me constantly raise an outcry to get what she wants and uses me as a spacegoat. My dad doesn't give a shit about me he didn't come to see in the hospital when i killed myself. Mental help guys aren't much help. Suicide hotlines are interested mostly in suicide not depression OR LAZINESS. But i don't mind them would you have a sibling like me in your house? you won't.\n\nMy results for exams came in january and i haven't gone to college to see it. My clothes won't fit me i am either locked in my room naked or wear a oversized longskirt.\n\nI don't see how things can get better see i need to go out but my weight always blocks me from doing anything and to cope with it i either eat or computer or Tv i am leech i know it and even hate me for it maybe this and depression sub won't but i am sure pretty much every other sub and non self help site will.\n\nI am lazy and useless and i don't wanna change anymore i just wanna die people speak so negatively about life these days anyways and the best part of my dying now is i don't have to see my grandfather or mom die i can be at peace it sounds damn liberating and peaceful it makes me so happy :) very happy indeed.\n\nPeople marry and have kids one of the positives is you can get over your dead parents more easily haha. I am never getting married and i a wimpy child all my life.\n\nMost of people i ask for help compare and tell look a someone with hands or legs or eyesight got 75% to 90% and u? 49 damn they had so many obstacles but you failed because ur lazy.\n\nThis world is for the mentally strong and for the people who have dreams and want to fight for them it's not for useless scumbags like  me. I am a moron and idiot and this isn't negative thinking this is the TRUTH I AM NOT NEGATIVELY thinking of myself i contribute nothing to the house but consume i am literally a parasite don't you dare say it's otherwise. ASTROLOGERS HATE ME THEY SEE MY ASTROLOGICAL DOCUMENTS AND SAY MAN THIS GUY IS BETTER IF HES THROWN OUT OF HOUSE usually they scam or suggest a puja or stone but for me this. I truly am better of dead i just want to die now please i wanna be at peace i WANNA BE AT PEACE DAMN IT.\n\nright now i feel like going to a cold place and dying there of well hypothermia? or some shit like that whatever. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23w3sq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "skjansz", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23w3sq/so_today_is_my_birthday_and_every_conclusion_i/", "name": "t3_23w3sq", "created": 1398400529.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23w3sq/so_today_is_my_birthday_and_every_conclusion_i/", "author_flair_text": null, "title": "So today is my birthday and every conclusion i come to is killing myself.", "created_utc": 1398371729.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1f32v", "gilded": 0, "author": "cuddlethisrebuttal", "parent_id": "t3_23w3sq", "approved_by": null, "body": "Happy Birthday :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happy Birthday :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23w3sq", "score_hidden": false, "name": "t1_ch1f32v", "created": 1398398131.0, "author_flair_text": null, "created_utc": 1398394531.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch39tj7", "gilded": 0, "author": "cuddlethisrebuttal", "parent_id": "t3_23w3sq", "approved_by": null, "body": "But on a serious note.. no one can help you but yourself. Mind over matter is a real thing. If you want to feel better DO something about it. If you want to lose weight.. start by walking everyday. Increased bloodflow is very beneficial to the mind body and soul. Cheer up pip and start stepping.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But on a serious note.. no one can help you but yourself. Mind over matter is a real thing. If you want to feel better DO something about it. If you want to lose weight.. start by walking everyday. Increased bloodflow is very beneficial to the mind body and soul. Cheer up pip and start stepping.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23w3sq", "score_hidden": false, "name": "t1_ch39tj7", "created": 1398609552.0, "author_flair_text": null, "created_utc": 1398605952.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]