[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been doing not too hot in my college. I switched out from premed to computer science, even though my parents did not want me to (and they&amp;#39;re paying for my college ~$25k+ per year). I&amp;#39;m about to finish my second year of college and I&amp;#39;m probably going to fail my core computer science class. Apparently, a good chunk of my code for my labs have been partially deleted somehow before my submission and I&amp;#39;ve been doing poorly because of it. I cannot even tell my professor that this is a problem, because there is no way to prove it. In order to continue with my courses, i need at least a C- in this class, but that doesn&amp;#39;t look like its going to happen.&lt;/p&gt;\n\n&lt;p&gt;If I&amp;#39;m trying my best and not reaching my, my parents, or my schools  expectations, I do not see a need to continue. Even though my grandfather just passed away, I think me being gone would cause less pain for my parents than me failing all their expectations. Please do not just tell me that people have it worse or try transferring out. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been doing not too hot in my college. I switched out from premed to computer science, even though my parents did not want me to (and they're paying for my college ~$25k+ per year). I'm about to finish my second year of college and I'm probably going to fail my core computer science class. Apparently, a good chunk of my code for my labs have been partially deleted somehow before my submission and I've been doing poorly because of it. I cannot even tell my professor that this is a problem, because there is no way to prove it. In order to continue with my courses, i need at least a C- in this class, but that doesn't look like its going to happen.\n\nIf I'm trying my best and not reaching my, my parents, or my schools  expectations, I do not see a need to continue. Even though my grandfather just passed away, I think me being gone would cause less pain for my parents than me failing all their expectations. Please do not just tell me that people have it worse or try transferring out. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ev0n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "aHuynher", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ev0n/so_why_shouldnt_i_die_again/", "name": "t3_24ev0n", "created": 1398930428.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ev0n/so_why_shouldnt_i_die_again/", "author_flair_text": null, "title": "So why shouldn't I die again?", "created_utc": 1398901628.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6fke9", "gilded": 0, "author": "cheese725", "parent_id": "t3_24ev0n", "approved_by": null, "body": "If you're at all interested in doing anything in the military, you could join ROTC and get all the debt paid off. And you could fly helicopters, which is one of the least physically demamding things in the entire military. Even if you don't this isn't a big deal. Everyone and their brother is in debt and if you work hard, you could pay it off. One of THE most important things in life is working hard. If anyone works hard, with a little bit of luck you'll land a nice job with nice pay doing what you like. Just found this http://marketingartfully.com/wp-content/uploads/2012/08/hard-work-hard-luck-quote.jpg\nVery true.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re at all interested in doing anything in the military, you could join ROTC and get all the debt paid off. And you could fly helicopters, which is one of the least physically demamding things in the entire military. Even if you don&amp;#39;t this isn&amp;#39;t a big deal. Everyone and their brother is in debt and if you work hard, you could pay it off. One of THE most important things in life is working hard. If anyone works hard, with a little bit of luck you&amp;#39;ll land a nice job with nice pay doing what you like. Just found this &lt;a href=\"http://marketingartfully.com/wp-content/uploads/2012/08/hard-work-hard-luck-quote.jpg\"&gt;http://marketingartfully.com/wp-content/uploads/2012/08/hard-work-hard-luck-quote.jpg&lt;/a&gt;\nVery true.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ev0n", "score_hidden": false, "name": "t1_ch6fke9", "created": 1398931030.0, "author_flair_text": null, "created_utc": 1398902230.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]