[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So let me introduce myself. I&amp;#39;m 17 and a senior about to graduate in June. I&amp;#39;m not really one of those angry people that wants to do it because they hate the world, I&amp;#39;m more just someone that&amp;#39;s just done with living. I&amp;#39;m just tired of it. They say life is full of so many beautiful things but it seems like every time one of those beautiful things comes my way, it takes me forever to work to the point where I can get to it, and then before I even realize I have it, it gets taken away. But anyway, I guess I could start this off by giving some background as to why I feel this way but instead of making a long detailed boring life story, I&amp;#39;ll just sum it up quickly. 4th Grade- Grandfather (also one of my best friends and greatest mentors) passes away from cancer. Mom starts to drink. 6th grade- Dad marries girlfriend and him and I move in with her and her 3 kids. New step-mom goes from coolest person ever to controlling psycho bitch. Now also get little to no attention from Dad unless I do something wrong. I&amp;#39;m also the youngest of the 4 of us. I begin to eat and get fat. 7th grade- made some friends, however also ate more, got fatter. Meet girl of my dreams. Think I&amp;#39;m in love. 8th grade- Super fat. Decide to start wrestling. Get destroyed but start losing weight. Summer after 8th grade- Staying with mom for summer. She drinks heavily now. Uncle dies. 2 weeks later, dog gets put down. Night after dog dies, girl of my dreams dumps me and says she hates me.  9th grade- Do better in wrestling, losing more weight and gaining muscle. Do &amp;quot;eh&amp;quot; in school. 10th grade- gaining more muscle, doing terrible in school, have to have small intervention for mom. 11th grade- do &amp;quot;eh&amp;quot;, getting more fit, mom still drinks a little. Get better at talking to people (very socially awkward) even start flirting a little bit with a couple of girls. Summer- Get a job at local pool, make some money, start flirting a little with one of the lifeguards. Nothing happens. Overall, one of my best years. Now for the current, and also the worst year yet. 12th grade- starts off amazing. Getting incredible grades, have plenty of friends (although still no social life) and now I&amp;#39;ve made a complete 180 from junior high in terms of fitness. I went from 5&amp;#39;7&amp;quot;, 215 lbs., 33% body fat, and a max bench press of about 50 lbs., to 5&amp;#39;11&amp;quot;, 200 lbs., 20% body fat, and a max bench of 225 lbs. Around October- Grades still amazing. Finally have an excuse to talk to this girl I&amp;#39;ve had a MASSIVE little boy crush on for about 2 years. My excuse: she moves right across the street from me. First time we hangout: My friend and I are digging a hole in my backyard. What&amp;#39;s the hole for? My other dog who is nearing the end of his life. I text her, asking which house is hers (she lives behind me across the street). She asks why I want to know so, I tell her. For some odd reason, she finds some sort of charm in the fact that I am digging a random hole in my backyard so she decides to come over. My friend goes home and her and I just sort of talk and hangout for a little bit. After this, her and I start texting. A lot. All day everyday. So, after a while, I decide to ask her to a movie. We go out, have fun, it&amp;#39;s amazing. We start hanging out like every other night. Finally, I ask her if we can make it official. She says yes. I&amp;#39;m on cloud fucking nine. Now, fast forward about a month and a half. It&amp;#39;s been the best of my life and the first time since 6th grade I haven&amp;#39;t thought about suicide everyday. It&amp;#39;s her birthday. I go over, have dinner and celebrate with her family, everything is fun and amazing. I go home. My dog is literally dying in front of me. I sit down on the kitchen floor and cry like a fucking baby. The next morning, he&amp;#39;s gone. I&amp;#39;m devastated. My now girlfriend comforts me. She&amp;#39;s honestly perfect. Jump ahead two weeks. She finally meets my mom (I live with my dad and my mom lives kind of far so I rarely see her anymore) on my senior night for wrestling (for those of you that don&amp;#39;t know, senior night is the last home game, match, meet etc. and they honor all of the seniors). Everything goes pretty well. The next night, she dumps me. I won&amp;#39;t lie, I cried myself to sleep. I&amp;#39;ve had eyes for only this girl and when I finally have her, I lose her right away. Now comes the best part. To put it bluntly, over the next two months, I unintentionally stalk her. I try to get her back, pushing way too hard and not realizing it until she finally completely cuts me off from her and her dad (though him and I are actually still relatively friendly towards one another) threatens to call the cops on me if I try to talk to her again. She is all I think about. When it&amp;#39;s not her running through my mind, it&amp;#39;s images of me hanging from the tree by my dog&amp;#39;s grave out back where her and I first hung out. A few days ago, I make the mistake of telling her I&amp;#39;ve been thinking about suicide. She tells me to stop wallowing in self pit, grow up, and move on. I know she&amp;#39;s right. I know she hates me. I know there will never be any kind of relationship or anything there again. But for some reason I can&amp;#39;t stop thinking about her. I&amp;#39;m finally in such a deep depression that I decide to tell my dad that I&amp;#39;d like to start talking to a therapist. I haven&amp;#39;t told him just how depressed I am, just that I am. I haven&amp;#39;t gotten my first appointment with the shrink yet, so nothing&amp;#39;s changed. Now here&amp;#39;s the kicker, and why I&amp;#39;m deciding to post something here tonight: It&amp;#39;s my school&amp;#39;s prom night. I&amp;#39;m home, alone, doing nothing, while all of my friends are at prom. Including her. I log onto facebook about an hour ago and what&amp;#39;s the first thing that pops up? Pictures of her and one of our mutual friends (I know there&amp;#39;s nothing romantic between them, but it still stings) going to prom together. I&amp;#39;m at the end of my rope. I don&amp;#39;t know how much more of this I can take. I&amp;#39;ve slowly already started killing myself honestly. Ever since she dumped me, I&amp;#39;ve been having a lot of stomach problems so, instead of seeing a doctor, I&amp;#39;ve just been not eating. I&amp;#39;ve been purposely starving myself. Not like anorexia or anything, where I just want to get thin, I&amp;#39;m hoping I&amp;#39;ll eventually starve to death. To put it into perspective, we&amp;#39;ve been broken up 2 months, and since then I&amp;#39;ve gone from 205 lbs to 180 lbs and I get 0 physical activity per day. As I said I have no social life, just friends I talk to in school. I just want someone to talk to. I&amp;#39;m extremely lonely. She took my mind off of all of my worries. Speaking of which, another thing: I graduate in June and still have almost no idea of what I want to do. I&amp;#39;m taking classes at my Community College to give me more time to decide. Please, just help me. It&amp;#39;s getting unbearable. I&amp;#39;m having trouble finding joy in anything anymore. I&amp;#39;m only 17. I&amp;#39;m way too young to have this happen too me. Lately the only things that can make me smile are listening to some upbeat, happy type music (specifically Jeremy Fisher for some unknown reason) and binge-watching episodes of Community. Help. I&amp;#39;m desperate. I just want to be truly happy again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So let me introduce myself. I'm 17 and a senior about to graduate in June. I'm not really one of those angry people that wants to do it because they hate the world, I'm more just someone that's just done with living. I'm just tired of it. They say life is full of so many beautiful things but it seems like every time one of those beautiful things comes my way, it takes me forever to work to the point where I can get to it, and then before I even realize I have it, it gets taken away. But anyway, I guess I could start this off by giving some background as to why I feel this way but instead of making a long detailed boring life story, I'll just sum it up quickly. 4th Grade- Grandfather (also one of my best friends and greatest mentors) passes away from cancer. Mom starts to drink. 6th grade- Dad marries girlfriend and him and I move in with her and her 3 kids. New step-mom goes from coolest person ever to controlling psycho bitch. Now also get little to no attention from Dad unless I do something wrong. I'm also the youngest of the 4 of us. I begin to eat and get fat. 7th grade- made some friends, however also ate more, got fatter. Meet girl of my dreams. Think I'm in love. 8th grade- Super fat. Decide to start wrestling. Get destroyed but start losing weight. Summer after 8th grade- Staying with mom for summer. She drinks heavily now. Uncle dies. 2 weeks later, dog gets put down. Night after dog dies, girl of my dreams dumps me and says she hates me.  9th grade- Do better in wrestling, losing more weight and gaining muscle. Do \"eh\" in school. 10th grade- gaining more muscle, doing terrible in school, have to have small intervention for mom. 11th grade- do \"eh\", getting more fit, mom still drinks a little. Get better at talking to people (very socially awkward) even start flirting a little bit with a couple of girls. Summer- Get a job at local pool, make some money, start flirting a little with one of the lifeguards. Nothing happens. Overall, one of my best years. Now for the current, and also the worst year yet. 12th grade- starts off amazing. Getting incredible grades, have plenty of friends (although still no social life) and now I've made a complete 180 from junior high in terms of fitness. I went from 5'7\", 215 lbs., 33% body fat, and a max bench press of about 50 lbs., to 5'11\", 200 lbs., 20% body fat, and a max bench of 225 lbs. Around October- Grades still amazing. Finally have an excuse to talk to this girl I've had a MASSIVE little boy crush on for about 2 years. My excuse: she moves right across the street from me. First time we hangout: My friend and I are digging a hole in my backyard. What's the hole for? My other dog who is nearing the end of his life. I text her, asking which house is hers (she lives behind me across the street). She asks why I want to know so, I tell her. For some odd reason, she finds some sort of charm in the fact that I am digging a random hole in my backyard so she decides to come over. My friend goes home and her and I just sort of talk and hangout for a little bit. After this, her and I start texting. A lot. All day everyday. So, after a while, I decide to ask her to a movie. We go out, have fun, it's amazing. We start hanging out like every other night. Finally, I ask her if we can make it official. She says yes. I'm on cloud fucking nine. Now, fast forward about a month and a half. It's been the best of my life and the first time since 6th grade I haven't thought about suicide everyday. It's her birthday. I go over, have dinner and celebrate with her family, everything is fun and amazing. I go home. My dog is literally dying in front of me. I sit down on the kitchen floor and cry like a fucking baby. The next morning, he's gone. I'm devastated. My now girlfriend comforts me. She's honestly perfect. Jump ahead two weeks. She finally meets my mom (I live with my dad and my mom lives kind of far so I rarely see her anymore) on my senior night for wrestling (for those of you that don't know, senior night is the last home game, match, meet etc. and they honor all of the seniors). Everything goes pretty well. The next night, she dumps me. I won't lie, I cried myself to sleep. I've had eyes for only this girl and when I finally have her, I lose her right away. Now comes the best part. To put it bluntly, over the next two months, I unintentionally stalk her. I try to get her back, pushing way too hard and not realizing it until she finally completely cuts me off from her and her dad (though him and I are actually still relatively friendly towards one another) threatens to call the cops on me if I try to talk to her again. She is all I think about. When it's not her running through my mind, it's images of me hanging from the tree by my dog's grave out back where her and I first hung out. A few days ago, I make the mistake of telling her I've been thinking about suicide. She tells me to stop wallowing in self pit, grow up, and move on. I know she's right. I know she hates me. I know there will never be any kind of relationship or anything there again. But for some reason I can't stop thinking about her. I'm finally in such a deep depression that I decide to tell my dad that I'd like to start talking to a therapist. I haven't told him just how depressed I am, just that I am. I haven't gotten my first appointment with the shrink yet, so nothing's changed. Now here's the kicker, and why I'm deciding to post something here tonight: It's my school's prom night. I'm home, alone, doing nothing, while all of my friends are at prom. Including her. I log onto facebook about an hour ago and what's the first thing that pops up? Pictures of her and one of our mutual friends (I know there's nothing romantic between them, but it still stings) going to prom together. I'm at the end of my rope. I don't know how much more of this I can take. I've slowly already started killing myself honestly. Ever since she dumped me, I've been having a lot of stomach problems so, instead of seeing a doctor, I've just been not eating. I've been purposely starving myself. Not like anorexia or anything, where I just want to get thin, I'm hoping I'll eventually starve to death. To put it into perspective, we've been broken up 2 months, and since then I've gone from 205 lbs to 180 lbs and I get 0 physical activity per day. As I said I have no social life, just friends I talk to in school. I just want someone to talk to. I'm extremely lonely. She took my mind off of all of my worries. Speaking of which, another thing: I graduate in June and still have almost no idea of what I want to do. I'm taking classes at my Community College to give me more time to decide. Please, just help me. It's getting unbearable. I'm having trouble finding joy in anything anymore. I'm only 17. I'm way too young to have this happen too me. Lately the only things that can make me smile are listening to some upbeat, happy type music (specifically Jeremy Fisher for some unknown reason) and binge-watching episodes of Community. Help. I'm desperate. I just want to be truly happy again.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24kqzc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "baciocco7", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24kqzc/so_yeah/", "name": "t3_24kqzc", "created": 1399096026.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24kqzc/so_yeah/", "author_flair_text": null, "title": "So yeah...", "created_utc": 1399067226.0, "ups": 6, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch87pg7", "gilded": 0, "author": "baciocco7", "parent_id": "t1_ch86zv7", "approved_by": null, "body": "I'd like to get into Architecture. That's the program I'm taking at the community college", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to get into Architecture. That&amp;#39;s the program I&amp;#39;m taking at the community college&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kqzc", "score_hidden": false, "name": "t1_ch87pg7", "created": 1399084097.0, "author_flair_text": null, "created_utc": 1399080497.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch86zv7", "gilded": 0, "author": "darkupondark", "parent_id": "t1_ch865ce", "approved_by": null, "body": "It sounds like you really liked building something with your hands, have you thought about something like that for a career? Having some plans for a career may help you a lot mentally, figuring out how you'll be able to put your life together.\n\nIt may be putting your life together, figuring out what kinds of places you'd want to live, etc, that may help you a bit. Working in those kinds of fields may give you the chance to be fairly mobile, (depending of course) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you really liked building something with your hands, have you thought about something like that for a career? Having some plans for a career may help you a lot mentally, figuring out how you&amp;#39;ll be able to put your life together.&lt;/p&gt;\n\n&lt;p&gt;It may be putting your life together, figuring out what kinds of places you&amp;#39;d want to live, etc, that may help you a bit. Working in those kinds of fields may give you the chance to be fairly mobile, (depending of course) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kqzc", "score_hidden": false, "name": "t1_ch86zv7", "created": 1399107359.0, "author_flair_text": null, "created_utc": 1399078559.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch865ce", "gilded": 0, "author": "baciocco7", "parent_id": "t1_ch8315z", "approved_by": null, "body": "I agree with the whole interests/projects thing. About a week or so after the breakup, wrestling season was over, so to occupy my mind a little more, I started staying after school every day to work on a table I was building for my shop class. Even though it was only a half hour a day, it was amazing how much it cleared my mind up and got me thinking about other things. But now shop class is over and I don't really have anymore hands-on classes like that coming up nor do I have the means to do stuff like that at home so that's another sort of dilemma I have. Even if I can't find something to make me happy, I need something that would occupy enough of my time and my mind to get me to stop thinking and stressing out about everything. This whole feeling shitty and not wanting to be around anymore thing? It kinda sucks. A lot.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with the whole interests/projects thing. About a week or so after the breakup, wrestling season was over, so to occupy my mind a little more, I started staying after school every day to work on a table I was building for my shop class. Even though it was only a half hour a day, it was amazing how much it cleared my mind up and got me thinking about other things. But now shop class is over and I don&amp;#39;t really have anymore hands-on classes like that coming up nor do I have the means to do stuff like that at home so that&amp;#39;s another sort of dilemma I have. Even if I can&amp;#39;t find something to make me happy, I need something that would occupy enough of my time and my mind to get me to stop thinking and stressing out about everything. This whole feeling shitty and not wanting to be around anymore thing? It kinda sucks. A lot.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kqzc", "score_hidden": false, "name": "t1_ch865ce", "created": 1399105043.0, "author_flair_text": null, "created_utc": 1399076243.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch8315z", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24kqzc", "approved_by": null, "body": "Hey. \n\nIt can be extraordinarily tough to find life or joy in life, at all.. for me it is something that comes and goes, it's not always here, and a lot of times it really can be hell.\n\nLove is another place of hell, too, it's something that just doesn't work for people like us, not the way that it seems to work for others. \n\nAs you get older (and I'm not saying this to be a jerk, just something I've realized over time) you begin to see the flaws in other people's romantic relationships and realize how truly rare it is to find people who are actually good for each other --\n\nWhat I've found, or what I believe, is that in order for us to have stable and good romance in life, we need to find what we want to be and become those things - first. \n\nThis is extraordinarily difficult when all we've had to experience has been grief or shame, that's what I had growing up, essentially all of my life after childhood.\n\nThe only things which brought me happiness or fulfillment were videogames, however, they pulled me so far away from the real world that it's been a struggle to get back into it. No social skills, nothing, for a long long time.\n\nPlaying guitar and music in general was perhaps my only anchor here, and more and more I've found that metal music has really reached a part of me that felt certain ways.\n\nI encourage you to make art, to write, to dance, to skateboard, to do anything that has ever impressed you, to try those things, and to find something that you want to become, because I think that that's a major piece of life, to find things we want to become and to be those things. \n\nI think that love comes later, that we're sorta genetically pre-disposed to seek love early, but that it's a mistake, a cruel stupid mistake of our biology to seek love so early.\n\nOnce you have interests/projects you're working on, things you want to become, the impact of love becomes a lot less, perhaps because you're so focused on improving and finding what makes you tick, and perhaps because you have a rock to come back to, a place that isn't just hell and confusion, your own life, your own development as a person.\n\nI know what it's like to go through hell over girls man, I've been there, so many times, love was always just hell for me, and now I feel like I've been able to extract myself from it, in a way that's actually good for me.\n\nI feel like I may end up in a relationship like 6-10 years from now, but I don't think I'm ready for one for quite a while. I hope to just make friends who have similar passions as me.. I know too well what it's like to drown in the hell of another person, and most people are just sorta hell-ish to be around.. It's so sad, but it's true and it sucks :(.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey. &lt;/p&gt;\n\n&lt;p&gt;It can be extraordinarily tough to find life or joy in life, at all.. for me it is something that comes and goes, it&amp;#39;s not always here, and a lot of times it really can be hell.&lt;/p&gt;\n\n&lt;p&gt;Love is another place of hell, too, it&amp;#39;s something that just doesn&amp;#39;t work for people like us, not the way that it seems to work for others. &lt;/p&gt;\n\n&lt;p&gt;As you get older (and I&amp;#39;m not saying this to be a jerk, just something I&amp;#39;ve realized over time) you begin to see the flaws in other people&amp;#39;s romantic relationships and realize how truly rare it is to find people who are actually good for each other --&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;ve found, or what I believe, is that in order for us to have stable and good romance in life, we need to find what we want to be and become those things - first. &lt;/p&gt;\n\n&lt;p&gt;This is extraordinarily difficult when all we&amp;#39;ve had to experience has been grief or shame, that&amp;#39;s what I had growing up, essentially all of my life after childhood.&lt;/p&gt;\n\n&lt;p&gt;The only things which brought me happiness or fulfillment were videogames, however, they pulled me so far away from the real world that it&amp;#39;s been a struggle to get back into it. No social skills, nothing, for a long long time.&lt;/p&gt;\n\n&lt;p&gt;Playing guitar and music in general was perhaps my only anchor here, and more and more I&amp;#39;ve found that metal music has really reached a part of me that felt certain ways.&lt;/p&gt;\n\n&lt;p&gt;I encourage you to make art, to write, to dance, to skateboard, to do anything that has ever impressed you, to try those things, and to find something that you want to become, because I think that that&amp;#39;s a major piece of life, to find things we want to become and to be those things. &lt;/p&gt;\n\n&lt;p&gt;I think that love comes later, that we&amp;#39;re sorta genetically pre-disposed to seek love early, but that it&amp;#39;s a mistake, a cruel stupid mistake of our biology to seek love so early.&lt;/p&gt;\n\n&lt;p&gt;Once you have interests/projects you&amp;#39;re working on, things you want to become, the impact of love becomes a lot less, perhaps because you&amp;#39;re so focused on improving and finding what makes you tick, and perhaps because you have a rock to come back to, a place that isn&amp;#39;t just hell and confusion, your own life, your own development as a person.&lt;/p&gt;\n\n&lt;p&gt;I know what it&amp;#39;s like to go through hell over girls man, I&amp;#39;ve been there, so many times, love was always just hell for me, and now I feel like I&amp;#39;ve been able to extract myself from it, in a way that&amp;#39;s actually good for me.&lt;/p&gt;\n\n&lt;p&gt;I feel like I may end up in a relationship like 6-10 years from now, but I don&amp;#39;t think I&amp;#39;m ready for one for quite a while. I hope to just make friends who have similar passions as me.. I know too well what it&amp;#39;s like to drown in the hell of another person, and most people are just sorta hell-ish to be around.. It&amp;#39;s so sad, but it&amp;#39;s true and it sucks :(.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24kqzc", "score_hidden": false, "name": "t1_ch8315z", "created": 1399071832.0, "author_flair_text": null, "created_utc": 1399068232.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]