[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today like everyday was a family fight happen the subject was there were rats in the house and so we should buy rat poison for it my mother made a excuse saying we can&amp;#39;t since i tried to kill myself.&lt;/p&gt;\n\n&lt;p&gt;Well then what the entire family unloads on me my gradpa laughs it off my sister says big deal he can kill myself why should i inconvinence myself. &lt;/p&gt;\n\n&lt;p&gt;I tired now and honestly i deserved to be laughed at i am a failure and i am responsible for it i did it with my own hands. I choose to be lazy i let my negative thoughts over power me i failed exams i tried to off myself.&lt;/p&gt;\n\n&lt;p&gt;Everyday my minds finds new reasons why i should kill myself it will be a soothing end no matter how i attain it it will be a end and the rest doesn&amp;#39;t matter. &lt;/p&gt;\n\n&lt;p&gt;My actions won&amp;#39;t matter to me my feeling won&amp;#39;t matter to me after i am dead. Screw your pep talk and encourage can&amp;#39;t you see i am the fault here i created it. The april of this year was really awful first week like 10 people i know died one after other they were from different walks of people they were mourned, people talked about them but then they moved on like nothing hapened i am sick of my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Today like everyday was a family fight happen the subject was there were rats in the house and so we should buy rat poison for it my mother made a excuse saying we can't since i tried to kill myself.\n\nWell then what the entire family unloads on me my gradpa laughs it off my sister says big deal he can kill myself why should i inconvinence myself. \n\n\nI tired now and honestly i deserved to be laughed at i am a failure and i am responsible for it i did it with my own hands. I choose to be lazy i let my negative thoughts over power me i failed exams i tried to off myself.\n\nEveryday my minds finds new reasons why i should kill myself it will be a soothing end no matter how i attain it it will be a end and the rest doesn't matter. \n\nMy actions won't matter to me my feeling won't matter to me after i am dead. Screw your pep talk and encourage can't you see i am the fault here i created it. The april of this year was really awful first week like 10 people i know died one after other they were from different walks of people they were mourned, people talked about them but then they moved on like nothing hapened i am sick of my life.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25be59", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ratitie", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25be59/so_yeah_another_one/", "name": "t3_25be59", "created": 1399879981.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25be59/so_yeah_another_one/", "author_flair_text": null, "title": "So yeah another one.", "created_utc": 1399851181.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfj0pi", "gilded": 0, "author": "ShadowShine57", "parent_id": "t3_25be59", "approved_by": null, "body": "Sounds like your family is the problem here... You had a really bad time. You said screw pep talks, so I won't give you one, but your family seems very hateful", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like your family is the problem here... You had a really bad time. You said screw pep talks, so I won&amp;#39;t give you one, but your family seems very hateful&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25be59", "score_hidden": false, "name": "t1_chfj0pi", "created": 1399881227.0, "author_flair_text": null, "created_utc": 1399852427.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfl807", "gilded": 0, "author": "syslinkdown", "parent_id": "t3_25be59", "approved_by": null, "body": "I'm sorry to be so blunt, but _fuck_ your family. That is not okay. You're dealing with something that's REALLY big and REALLY hard. The last thing you need is for the people you trust to kick you when you're down. I don't know what age you are, but when could you maybe get away from these people?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to be so blunt, but &lt;em&gt;fuck&lt;/em&gt; your family. That is not okay. You&amp;#39;re dealing with something that&amp;#39;s REALLY big and REALLY hard. The last thing you need is for the people you trust to kick you when you&amp;#39;re down. I don&amp;#39;t know what age you are, but when could you maybe get away from these people?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25be59", "score_hidden": false, "name": "t1_chfl807", "created": 1399886875.0, "author_flair_text": null, "created_utc": 1399858075.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfvznz", "gilded": 0, "author": "vtaznj", "parent_id": "t3_25be59", "approved_by": null, "body": "We don't get to chose our family members, or the hurtful things that come out of their mouths. \n\nI'm a strong believer in that we create our own reality. I'm not saying it's your fault you have the family that you do, but you have the power to end your life. \n\nIt's hard to stay positive when you have negative people in your life, but just tell yourself everyday that you are important, that you have a purpose, and that you'll never know what tomorrow will bring. Or could have brought if you end your life.\n\nFind something you're passionate about. I don't know you, but I'm willing to bet you have some smarts and that you're not useless. When I was in high school I totally flunked out of public school because of a series of events that I had no control over. Depression is hard to handle, and even harder to handle when you want to off yourself. Just remember, it's not you. It's the negative people that you have no other choice but to be around... Think of them as a deck of cards. They were the hand that was dealt to you and it's up to you to figure out how to play that hand. Will power is a strong thing. \n\nOh and btw when I started doing online high high school, I graduated with a 3.9. For me, it was adapt or die. Stay strong. The best thing about living is no matter what, there is always another day.\n\nPM me if you need. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We don&amp;#39;t get to chose our family members, or the hurtful things that come out of their mouths. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a strong believer in that we create our own reality. I&amp;#39;m not saying it&amp;#39;s your fault you have the family that you do, but you have the power to end your life. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to stay positive when you have negative people in your life, but just tell yourself everyday that you are important, that you have a purpose, and that you&amp;#39;ll never know what tomorrow will bring. Or could have brought if you end your life.&lt;/p&gt;\n\n&lt;p&gt;Find something you&amp;#39;re passionate about. I don&amp;#39;t know you, but I&amp;#39;m willing to bet you have some smarts and that you&amp;#39;re not useless. When I was in high school I totally flunked out of public school because of a series of events that I had no control over. Depression is hard to handle, and even harder to handle when you want to off yourself. Just remember, it&amp;#39;s not you. It&amp;#39;s the negative people that you have no other choice but to be around... Think of them as a deck of cards. They were the hand that was dealt to you and it&amp;#39;s up to you to figure out how to play that hand. Will power is a strong thing. &lt;/p&gt;\n\n&lt;p&gt;Oh and btw when I started doing online high high school, I graduated with a 3.9. For me, it was adapt or die. Stay strong. The best thing about living is no matter what, there is always another day.&lt;/p&gt;\n\n&lt;p&gt;PM me if you need. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25be59", "score_hidden": false, "name": "t1_chfvznz", "created": 1399927089.0, "author_flair_text": null, "created_utc": 1399898289.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]