[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This may seem a bit over-dramatic, and I don&amp;#39;t know if I&amp;#39;m actually suicidal. But it&amp;#39;s probably better to seek some support regarding it before it&amp;#39;s a significant mistake.&lt;/p&gt;\n\n&lt;p&gt;I just had the most amazing relationship of my life. But it only lasted about a year. Three weeks ago, we broke up. There wasn&amp;#39;t any anger. Neither of us did anything &lt;em&gt;bad&lt;/em&gt;. And I&amp;#39;m having a very difficult time coming to terms. I&amp;#39;m 30, I&amp;#39;m tired and done with dating. Due to my upbringing and surroundings, I have very few friends. Before the relationship, I was just coming out of depression. But during the relationship, I started caring more about myself. I even just bought my first house.&lt;/p&gt;\n\n&lt;p&gt;There was no fighting that lead up to it - but the relationship just ended. Very suddenly. &lt;a href=\"http://www.reddit.com/r/MMFB/comments/24zvvr/broke_up_3_weeks_ago_with_a_girl_im_still_madly/\"&gt;I posted more about all this here on /r/MMFB&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;My life had never been better with her, and now I&amp;#39;m in a place worse than I&amp;#39;ve ever been in. I&amp;#39;ve lost the will to really live. I stopped caring about my diet. This last weekend, I was incredibly sick. With symptoms so violent it would normally would be concerning. I checked online, and saw it could be a few things, but if symptoms lasted more than 48 hours, it could easily be a sign of a type of cancer. That was a little frightening of a thought but I was also a bit excited. I&amp;#39;m probably too much of a coward to try and kill myself, but I&amp;#39;m constantly berated with thoughts of how if I died - it would be a good thing. &lt;/p&gt;\n\n&lt;p&gt;When I think about why I shouldn&amp;#39;t die, I find that the reasons of why I should die add up so much easier.&lt;/p&gt;\n\n&lt;p&gt;I live by myself. I have very few friends, and the ones I do have are pretty busy people. My job has been very demanding and very stressful. I just got a house and it went from feeling like a stepping stone in my life to a burden too heavy to carry.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This may seem a bit over-dramatic, and I don't know if I'm actually suicidal. But it's probably better to seek some support regarding it before it's a significant mistake.\n\nI just had the most amazing relationship of my life. But it only lasted about a year. Three weeks ago, we broke up. There wasn't any anger. Neither of us did anything *bad*. And I'm having a very difficult time coming to terms. I'm 30, I'm tired and done with dating. Due to my upbringing and surroundings, I have very few friends. Before the relationship, I was just coming out of depression. But during the relationship, I started caring more about myself. I even just bought my first house.\n\nThere was no fighting that lead up to it - but the relationship just ended. Very suddenly. [I posted more about all this here on /r/MMFB](http://www.reddit.com/r/MMFB/comments/24zvvr/broke_up_3_weeks_ago_with_a_girl_im_still_madly/).\n\nMy life had never been better with her, and now I'm in a place worse than I've ever been in. I've lost the will to really live. I stopped caring about my diet. This last weekend, I was incredibly sick. With symptoms so violent it would normally would be concerning. I checked online, and saw it could be a few things, but if symptoms lasted more than 48 hours, it could easily be a sign of a type of cancer. That was a little frightening of a thought but I was also a bit excited. I'm probably too much of a coward to try and kill myself, but I'm constantly berated with thoughts of how if I died - it would be a good thing. \n\nWhen I think about why I shouldn't die, I find that the reasons of why I should die add up so much easier.\n\nI live by myself. I have very few friends, and the ones I do have are pretty busy people. My job has been very demanding and very stressful. I just got a house and it went from feeling like a stepping stone in my life to a burden too heavy to carry.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "251c0z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "anon5132013", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/251c0z/someone_suggested_i_go_here/", "name": "t3_251c0z", "created": 1399581743.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/251c0z/someone_suggested_i_go_here/", "author_flair_text": null, "title": "Someone suggested I go here.", "created_utc": 1399552943.0, "ups": 4, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcsh1m", "gilded": 0, "author": "AfroCircuit", "parent_id": "t1_chcs7sm", "approved_by": null, "body": "Please do if ya need to. Have a good day at work.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do if ya need to. Have a good day at work.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcsh1m", "created": 1399593576.0, "author_flair_text": null, "created_utc": 1399564776.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcxero", "gilded": 0, "author": "AfroCircuit", "parent_id": "t1_chcxbau", "approved_by": null, "body": "Alrighty, I'll be busy from 2 until 3, but expect to hear back from me around then.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alrighty, I&amp;#39;ll be busy from 2 until 3, but expect to hear back from me around then.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcxero", "created": 1399603393.0, "author_flair_text": null, "created_utc": 1399574593.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd518m", "gilded": 0, "author": "AfroCircuit", "parent_id": "t1_chcxbau", "approved_by": null, "body": "Hey, sorry I cam so much later than I said I would. I ended up having to drive a friend and hour and a half away from where we live and I'm about to head back now but expect to hear from me again in about and hour and a half.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, sorry I cam so much later than I said I would. I ended up having to drive a friend and hour and a half away from where we live and I&amp;#39;m about to head back now but expect to hear from me again in about and hour and a half.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chd518m", "created": 1399618902.0, "author_flair_text": null, "created_utc": 1399590102.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcxbau", "gilded": 0, "author": "anon5132013", "parent_id": "t1_chcu8kj", "approved_by": null, "body": "I'm all ears. I'll gladly hear them.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m all ears. I&amp;#39;ll gladly hear them.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcxbau", "created": 1399603207.0, "author_flair_text": null, "created_utc": 1399574407.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcu8kj", "gilded": 0, "author": "AfroCircuit", "parent_id": "t1_chcs7sm", "approved_by": null, "body": "Also whenever you get back, if you'd like I can also maybe help ya out with your unresolved feelings about the relationship.  I got snoopy and poked around on this accounts history and I think I have a few words of wisdom that'll help ^ _ ^", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also whenever you get back, if you&amp;#39;d like I can also maybe help ya out with your unresolved feelings about the relationship.  I got snoopy and poked around on this accounts history and I think I have a few words of wisdom that&amp;#39;ll help ^ _ ^&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcu8kj", "created": 1399597180.0, "author_flair_text": null, "created_utc": 1399568380.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcs7sm", "gilded": 0, "author": "anon5132013", "parent_id": "t1_chcrubb", "approved_by": null, "body": "This actually did help quite a bit. I need to step away from this stuff as I'm at work and a mess - I need to collect myself here and focus on my job, but thank you. I'll probably respond again later.", "edited": 1399574597.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This actually did help quite a bit. I need to step away from this stuff as I&amp;#39;m at work and a mess - I need to collect myself here and focus on my job, but thank you. I&amp;#39;ll probably respond again later.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcs7sm", "created": 1399593048.0, "author_flair_text": null, "created_utc": 1399564248.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcrubb", "gilded": 0, "author": "AfroCircuit", "parent_id": "t3_251c0z", "approved_by": null, "body": "Howdy,\n\nFirst off let me say that you did a very thorough job of explaining your situation, I was in a similar place in my  life not too long ago and I know how it feels.\n\nOne of the main things your feeling right now, as you probably already know, is that feeling of loneliness when you've lost a close emotional connection with someone. Human beings are social creatures by nature and we need a certain level of interaction with our own kind on a regular basis to ever feel a certain level of psychological contentment. \n\nBecause of this we value the connection we have with those closest too us and when those connections are lost, whether it be break up or death or anything else, we feel that loss. I know it's been said a million times over by everyone but nothing is more important than the people you love. When times are good you can enjoy the company of others, make god memories and stay motivated to do whatever it is you need to do to stay happy and content with your life. When times are bad, they're there to support you and help you through it so you don't feel like you're alone in whatever struggle you're dealing with.\n\nWhen you loose this, it's almost like having the ground ripped out from under you. Everything suddenly goes down hill. Good things turn bad, bad things get worse and suddenly life just sucks all together. you're alone and everything just feels downright shitty and even the important things can start to feel like they don't matter and that there's no point to it all.\n\nYou start to weigh your options and giving up starts to have more Pros than cons. Whether it be at keeping a home tidy, keeping a diet, or life itself. You just kinda start to feel like it might not be worth it.\n\nMillions of people struggle with this everyday. Some who have lost someone, others who never had a friend or someone to say they love and are stuck alone somewhere, but one of the most important things to remember is this.\n\nIt can and will pass as long you want it to. Now I don't think you're suicidal especially since you've only been battling some of these worse feelings for a few weeks (not to belittle that, it sucks no matter how long it lasts). If anything you're just still going through the grief of a break up. It hasn't even been a month so you're gonna feel like shit for a bit longer. Might be for a few more weeks, maybe a few more months, but don't let it eat at ya too much.\n\nYou may never completely get over this relationship depending on who you are so if you keep focusing on it's loss, well that's a slippery slope back down to depressionville. So again, it's okay to be sad now, but try to motivate yourself to move forward. Give yourself another few weeks then try and reset to how it was a year ago, back when you were out looking to make friends and potentially more.\n\nNow, all of this is entirely up to you. I won't say you have to do any of this, because in the end you have to wan't to do all of these things. It's not easy, but you can take it at your own pace.\n\nOne of my biggest motivators when I was digging myself out of a depression was when the amazing feeling I got every time I succeeded at conquering being lonely in some way. Whether it be meeting a potential new close friend, or hitting it off with a girl. Those little things help bring the hope back into my life that as long as I kept going everything would work out eventually.\n\nI failed some times sure. I'd consider saying fuck it I'm done, but, (and this is where I'm going to sound unfortunately generic again), If you give up you'll never succeed.\n\nSo i suppose to sum everything up. I don't think your suicidal, you're just sad after ending a long term relationship and you're dealing with the loneliness alone. Give yourself some time, then just get back out there, keep on trying to make friends. Over time it's more than likely you'll at least find a close friend who you can count on to talk about stuff and hang out, and if you're lucky in the game of love, you'll find someone else who will hopefully make sure you're never lonely again.\n\nI apologize ahead of time if I misinterpreted you in anyway and please call me out on it and I'll be happy to listen ^ _ ^.\n\nIn the mean time if you'd like to talk or feel like something wasn't said, or you just want to tell me every way that what I said wont work for you. Please do I'll be happy to amend my recommendations with the addition of more information from you as well as added insight to you current state of mind.\n\nHope this helps or that i can be of more help later ^ _ ^.\n\nEdit: fixed some grammar and added words/phrases here and there.", "edited": 1399563984.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Howdy,&lt;/p&gt;\n\n&lt;p&gt;First off let me say that you did a very thorough job of explaining your situation, I was in a similar place in my  life not too long ago and I know how it feels.&lt;/p&gt;\n\n&lt;p&gt;One of the main things your feeling right now, as you probably already know, is that feeling of loneliness when you&amp;#39;ve lost a close emotional connection with someone. Human beings are social creatures by nature and we need a certain level of interaction with our own kind on a regular basis to ever feel a certain level of psychological contentment. &lt;/p&gt;\n\n&lt;p&gt;Because of this we value the connection we have with those closest too us and when those connections are lost, whether it be break up or death or anything else, we feel that loss. I know it&amp;#39;s been said a million times over by everyone but nothing is more important than the people you love. When times are good you can enjoy the company of others, make god memories and stay motivated to do whatever it is you need to do to stay happy and content with your life. When times are bad, they&amp;#39;re there to support you and help you through it so you don&amp;#39;t feel like you&amp;#39;re alone in whatever struggle you&amp;#39;re dealing with.&lt;/p&gt;\n\n&lt;p&gt;When you loose this, it&amp;#39;s almost like having the ground ripped out from under you. Everything suddenly goes down hill. Good things turn bad, bad things get worse and suddenly life just sucks all together. you&amp;#39;re alone and everything just feels downright shitty and even the important things can start to feel like they don&amp;#39;t matter and that there&amp;#39;s no point to it all.&lt;/p&gt;\n\n&lt;p&gt;You start to weigh your options and giving up starts to have more Pros than cons. Whether it be at keeping a home tidy, keeping a diet, or life itself. You just kinda start to feel like it might not be worth it.&lt;/p&gt;\n\n&lt;p&gt;Millions of people struggle with this everyday. Some who have lost someone, others who never had a friend or someone to say they love and are stuck alone somewhere, but one of the most important things to remember is this.&lt;/p&gt;\n\n&lt;p&gt;It can and will pass as long you want it to. Now I don&amp;#39;t think you&amp;#39;re suicidal especially since you&amp;#39;ve only been battling some of these worse feelings for a few weeks (not to belittle that, it sucks no matter how long it lasts). If anything you&amp;#39;re just still going through the grief of a break up. It hasn&amp;#39;t even been a month so you&amp;#39;re gonna feel like shit for a bit longer. Might be for a few more weeks, maybe a few more months, but don&amp;#39;t let it eat at ya too much.&lt;/p&gt;\n\n&lt;p&gt;You may never completely get over this relationship depending on who you are so if you keep focusing on it&amp;#39;s loss, well that&amp;#39;s a slippery slope back down to depressionville. So again, it&amp;#39;s okay to be sad now, but try to motivate yourself to move forward. Give yourself another few weeks then try and reset to how it was a year ago, back when you were out looking to make friends and potentially more.&lt;/p&gt;\n\n&lt;p&gt;Now, all of this is entirely up to you. I won&amp;#39;t say you have to do any of this, because in the end you have to wan&amp;#39;t to do all of these things. It&amp;#39;s not easy, but you can take it at your own pace.&lt;/p&gt;\n\n&lt;p&gt;One of my biggest motivators when I was digging myself out of a depression was when the amazing feeling I got every time I succeeded at conquering being lonely in some way. Whether it be meeting a potential new close friend, or hitting it off with a girl. Those little things help bring the hope back into my life that as long as I kept going everything would work out eventually.&lt;/p&gt;\n\n&lt;p&gt;I failed some times sure. I&amp;#39;d consider saying fuck it I&amp;#39;m done, but, (and this is where I&amp;#39;m going to sound unfortunately generic again), If you give up you&amp;#39;ll never succeed.&lt;/p&gt;\n\n&lt;p&gt;So i suppose to sum everything up. I don&amp;#39;t think your suicidal, you&amp;#39;re just sad after ending a long term relationship and you&amp;#39;re dealing with the loneliness alone. Give yourself some time, then just get back out there, keep on trying to make friends. Over time it&amp;#39;s more than likely you&amp;#39;ll at least find a close friend who you can count on to talk about stuff and hang out, and if you&amp;#39;re lucky in the game of love, you&amp;#39;ll find someone else who will hopefully make sure you&amp;#39;re never lonely again.&lt;/p&gt;\n\n&lt;p&gt;I apologize ahead of time if I misinterpreted you in anyway and please call me out on it and I&amp;#39;ll be happy to listen ^ _ &lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;In the mean time if you&amp;#39;d like to talk or feel like something wasn&amp;#39;t said, or you just want to tell me every way that what I said wont work for you. Please do I&amp;#39;ll be happy to amend my recommendations with the addition of more information from you as well as added insight to you current state of mind.&lt;/p&gt;\n\n&lt;p&gt;Hope this helps or that i can be of more help later ^ _ &lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: fixed some grammar and added words/phrases here and there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251c0z", "score_hidden": false, "name": "t1_chcrubb", "created": 1399592264.0, "author_flair_text": null, "created_utc": 1399563464.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]