[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi,\nI have the worst ideas in my head right now. I lost my girlfriend in February. Well technically it was my fault. Sometimes I behaved like a d*ckhead but at the end of the day I would anything for her. I really love her. Well I realised the hard way how wrong I was - I had to lost her to understand how she felt and what she was expecting from me. She wanted to become friends but we haven&amp;#39;t spoken since end of March. My good friend wrote to her on Facebook but she just replied that: she was talking with me and I know everything, she won&amp;#39;t write to me because she doesn&amp;#39;t want me to get my hopes up and that I will manage (my sister wrote to her as well but as far as I know she never read that...). Last month when I tried last time talk to her, she &amp;quot;offered&amp;quot; me her friend (I think she wants me to move on so it would be easy for her as well?) and she said she wont come back due to many reasons. She knows my feelings and it hurts me that after 3 years of relationship (7 years of friendship), most of it was long distance, she just throws me away and cuts off. I know long distance is hard, but I couldn&amp;#39;t manage with school so I threw everything to relationship, well sometimes she did the same and we fought. &lt;/p&gt;\n\n&lt;p&gt;Because of that my laziness is winning. I have problems at my university. I&amp;#39;m Computer Science student. I never was brilliant at it, well I suck at programming like hell, but I love technology - I enjoy working with it and that&amp;#39;s one of the closest things to it. I just can&amp;#39;t motivate myself do to something as most of stuff in my life came to me easy - thanks to my parent&amp;#39;s hard work. I can&amp;#39;t do programming (I started to do something with Ruby, and I want to move to Ruby on Rails and other web crap). I have issues with Calculus. Actually I feel quite hopeless as 22 years old. &lt;/p&gt;\n\n&lt;p&gt;My friends are taking me to parties but when I get drunk I just could think about the one - but I&amp;#39;m not writing to her just not to humiliate myself. Everybody, even here on reddit, advised to wait, move on or find someone else. All those 3 options are killing me. I&amp;#39;m don&amp;#39;t enjoy going to clubs (I love Electronic Dance Music though :) ) I hate to party and prefer to sit and drink, I have problems meeting new people and as I said sometimes I behave like a d*ck and I don&amp;#39;t know it.  &lt;/p&gt;\n\n&lt;p&gt;Since last week I started to think the best way to end all this crap is to kill myself. But that will be stupid. Everybody probably would blame my ex-girlfriend and I know that she would collapse, my parents and sister would also get depression or even worse. But all of that is killing me and I start not to care about it because it will end. I just would like to talk to someone, who doesn&amp;#39;t know me and maybe help be before I destroy other people&amp;#39;s world.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi,\nI have the worst ideas in my head right now. I lost my girlfriend in February. Well technically it was my fault. Sometimes I behaved like a d*ckhead but at the end of the day I would anything for her. I really love her. Well I realised the hard way how wrong I was - I had to lost her to understand how she felt and what she was expecting from me. She wanted to become friends but we haven't spoken since end of March. My good friend wrote to her on Facebook but she just replied that: she was talking with me and I know everything, she won't write to me because she doesn't want me to get my hopes up and that I will manage (my sister wrote to her as well but as far as I know she never read that...). Last month when I tried last time talk to her, she \"offered\" me her friend (I think she wants me to move on so it would be easy for her as well?) and she said she wont come back due to many reasons. She knows my feelings and it hurts me that after 3 years of relationship (7 years of friendship), most of it was long distance, she just throws me away and cuts off. I know long distance is hard, but I couldn't manage with school so I threw everything to relationship, well sometimes she did the same and we fought. \n\nBecause of that my laziness is winning. I have problems at my university. I'm Computer Science student. I never was brilliant at it, well I suck at programming like hell, but I love technology - I enjoy working with it and that's one of the closest things to it. I just can't motivate myself do to something as most of stuff in my life came to me easy - thanks to my parent's hard work. I can't do programming (I started to do something with Ruby, and I want to move to Ruby on Rails and other web crap). I have issues with Calculus. Actually I feel quite hopeless as 22 years old. \n\nMy friends are taking me to parties but when I get drunk I just could think about the one - but I'm not writing to her just not to humiliate myself. Everybody, even here on reddit, advised to wait, move on or find someone else. All those 3 options are killing me. I'm don't enjoy going to clubs (I love Electronic Dance Music though :) ) I hate to party and prefer to sit and drink, I have problems meeting new people and as I said sometimes I behave like a d*ck and I don't know it.  \n\nSince last week I started to think the best way to end all this crap is to kill myself. But that will be stupid. Everybody probably would blame my ex-girlfriend and I know that she would collapse, my parents and sister would also get depression or even worse. But all of that is killing me and I start not to care about it because it will end. I just would like to talk to someone, who doesn't know me and maybe help be before I destroy other people's world.\n\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "243dvt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "mars83", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/243dvt/someone_i_could_talk_to_or_i_will_go_crazy/", "name": "t3_243dvt", "created": 1398617110.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/243dvt/someone_i_could_talk_to_or_i_will_go_crazy/", "author_flair_text": null, "title": "Someone I could talk to or I will go crazy.", "created_utc": 1398588310.0, "ups": 7, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3b5tg", "gilded": 0, "author": "Marc_Vesper", "parent_id": "t1_ch38mw4", "approved_by": null, "body": "we should have a megareddit of all the support subs, not like a multi. people might not know about a bunch of them until it's too late. if something happens you could tell them the one sub.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;we should have a megareddit of all the support subs, not like a multi. people might not know about a bunch of them until it&amp;#39;s too late. if something happens you could tell them the one sub.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch3b5tg", "created": 1398613971.0, "author_flair_text": null, "created_utc": 1398610371.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch38mw4", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t1_ch37pe3", "approved_by": null, "body": "Putting ourselves together is really tough, and talking with people about our lives helps us with that - I sorta believe that romance is only possible after we've put ourselves together (like our dreams, futures, emotional, stress coping, etc)-\n\nWhat you can see from this (I am *not* someone who stresses on the positive, I don't believe in positive thinking etc.) is that you *are* capable of being with someone you care for, and that in *time* and as you come to understand yourself and work on your self and what you are capable of, and feel like you can be what you want, create what you want out of life - I think you'll have the stability to be in a relationship where you truly love the person you are with again.\n\nYou've gotta find that stability and what it takes for *you* to be alive. it's not about the zen bs or the \"oh you can't depend on anyone\" sorta stuff, it's finding how *you* work, which is going to be different from what anyone says it is, but it *is* something that you can do, and you can do this with us!!! Because we're all on our way towards trying to do that, all of us people on these like\n\nsocial anxiety, depression, offmychest, raisedbynarcissists, like, all of us are attemping to get ourselves together\n\nAnd you can figure your stuff out with us :). Share your stories and how things have worked for you, and what hasn't, share your grief, and contribute yourself, and I think you'll appreciate what you get back too. :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Putting ourselves together is really tough, and talking with people about our lives helps us with that - I sorta believe that romance is only possible after we&amp;#39;ve put ourselves together (like our dreams, futures, emotional, stress coping, etc)-&lt;/p&gt;\n\n&lt;p&gt;What you can see from this (I am &lt;em&gt;not&lt;/em&gt; someone who stresses on the positive, I don&amp;#39;t believe in positive thinking etc.) is that you &lt;em&gt;are&lt;/em&gt; capable of being with someone you care for, and that in &lt;em&gt;time&lt;/em&gt; and as you come to understand yourself and work on your self and what you are capable of, and feel like you can be what you want, create what you want out of life - I think you&amp;#39;ll have the stability to be in a relationship where you truly love the person you are with again.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve gotta find that stability and what it takes for &lt;em&gt;you&lt;/em&gt; to be alive. it&amp;#39;s not about the zen bs or the &amp;quot;oh you can&amp;#39;t depend on anyone&amp;quot; sorta stuff, it&amp;#39;s finding how &lt;em&gt;you&lt;/em&gt; work, which is going to be different from what anyone says it is, but it &lt;em&gt;is&lt;/em&gt; something that you can do, and you can do this with us!!! Because we&amp;#39;re all on our way towards trying to do that, all of us people on these like&lt;/p&gt;\n\n&lt;p&gt;social anxiety, depression, offmychest, raisedbynarcissists, like, all of us are attemping to get ourselves together&lt;/p&gt;\n\n&lt;p&gt;And you can figure your stuff out with us :). Share your stories and how things have worked for you, and what hasn&amp;#39;t, share your grief, and contribute yourself, and I think you&amp;#39;ll appreciate what you get back too. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch38mw4", "created": 1398604077.0, "author_flair_text": null, "created_utc": 1398600477.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch37pe3", "gilded": 0, "author": "mars83", "parent_id": "t1_ch376hd", "approved_by": null, "body": "I had. That makes me angry. Because if not her I would be probably in different place. I would be probably still alone. She was my first one and I still really love her. I know that if I love her I need to let her go if it is that what she wants but last couple of months are devastating for me due to her, school etc", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had. That makes me angry. Because if not her I would be probably in different place. I would be probably still alone. She was my first one and I still really love her. I know that if I love her I need to let her go if it is that what she wants but last couple of months are devastating for me due to her, school etc&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch37pe3", "created": 1398598029.0, "author_flair_text": null, "created_utc": 1398594429.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch376hd", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_243dvt", "approved_by": null, "body": "You had someone. Even if you lost her, that's more than a lot of people get.\n\nYou acknowledge that you learned things from this too, and if you had someone in the past and now know more then there is a future.", "edited": 1398590977.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You had someone. Even if you lost her, that&amp;#39;s more than a lot of people get.&lt;/p&gt;\n\n&lt;p&gt;You acknowledge that you learned things from this too, and if you had someone in the past and now know more then there is a future.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch376hd", "created": 1398619483.0, "author_flair_text": null, "created_utc": 1398590683.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38c7t", "gilded": 0, "author": "mars83", "parent_id": "t1_ch37tl6", "approved_by": null, "body": "Well I find it hard to go out. I'm quite shy and I'm home guy. I met my ex over the Internet. We were 2000kms apart, and we talked and talked. I decided to come back (I moved with parents, and she was from my old home town), now due to school we were a little bit closer, but yet living apart. She last year moved to my town for a year and we had good and bad times. Now she moved again to study medicine. So my little adventure with her lasted great 7 years which I miss because she is quite hard to replace. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I find it hard to go out. I&amp;#39;m quite shy and I&amp;#39;m home guy. I met my ex over the Internet. We were 2000kms apart, and we talked and talked. I decided to come back (I moved with parents, and she was from my old home town), now due to school we were a little bit closer, but yet living apart. She last year moved to my town for a year and we had good and bad times. Now she moved again to study medicine. So my little adventure with her lasted great 7 years which I miss because she is quite hard to replace. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch38c7t", "created": 1398602353.0, "author_flair_text": null, "created_utc": 1398598753.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch37tl6", "gilded": 0, "author": "Dunkindonuts64", "parent_id": "t3_243dvt", "approved_by": null, "body": "Well in my opinion, I think you should find a new friend. I know that is easier said than done, I am trying to do the exact same thing, there are very few people I can call friends any more. My girlfriend dumped me for someone else back in January after 1 and a half years, I only recently got over her. I think you just need some time away from her and you need to be around new people.\n\nI hope everything works out for you, you sound like a good person :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well in my opinion, I think you should find a new friend. I know that is easier said than done, I am trying to do the exact same thing, there are very few people I can call friends any more. My girlfriend dumped me for someone else back in January after 1 and a half years, I only recently got over her. I think you just need some time away from her and you need to be around new people.&lt;/p&gt;\n\n&lt;p&gt;I hope everything works out for you, you sound like a good person :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch37tl6", "created": 1398598875.0, "author_flair_text": null, "created_utc": 1398595275.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch38non", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_243dvt", "approved_by": null, "body": "I also totally encourage you to get more involved with EDM. Have you ever wanted to be a producer? \n\nGiven that you are into CS, I encourage you to make (electronic? Industrial?) music (/beats?)!!! I bet that sharing music or DJing would be awesome for you and be something that you can connect to people with, just making music with other people who care about it could help.\n\n(I play guitar and I hope to play guitar over EDM tracks in the future!!!)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also totally encourage you to get more involved with EDM. Have you ever wanted to be a producer? &lt;/p&gt;\n\n&lt;p&gt;Given that you are into CS, I encourage you to make (electronic? Industrial?) music (/beats?)!!! I bet that sharing music or DJing would be awesome for you and be something that you can connect to people with, just making music with other people who care about it could help.&lt;/p&gt;\n\n&lt;p&gt;(I play guitar and I hope to play guitar over EDM tracks in the future!!!)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_243dvt", "score_hidden": false, "name": "t1_ch38non", "created": 1398604199.0, "author_flair_text": null, "created_utc": 1398600599.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]