[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;not my first time to this subreddit. wrote a post here about my life in it&amp;#39;s current state about 7-8 months ago under a different account. had an alias that i commonly used, had to delete the account to hide my life from people i may know. anyway, i&amp;#39;ll write a little bit about myself, and the things i&amp;#39;m going through. i&amp;#39;m nearly 17, and i feel so alone. i hated being around people, whenever i went to class i would start panicking about being in public near people. i had no friends back then.  it was my first day back from summer, and i walked into first hour, nervous as ever. i hated being around people. i skipped the rest of my classes, and skipped the next 2 days. my parents got a call about how i wasn&amp;#39;t showing up to class, and i told them i was getting bullied in school. told them about online school, and got switched to it. i had horrible thoughts in my head, and considered suicide every waking moment of the day. i still went to a single class a day at a different school. i was nervous the first few days, but soon met 3 people like me that i actually can meet up with all the time, and not feel awkward. i was still skipping doing school work, but hey, i was having some fun. we played video games and saw movies. it was still hard to get motivation to do anything. it&amp;#39;s still hard waking up in the morning, and i still feel no reason to live. it&amp;#39;s so difficult putting on that smile so i don&amp;#39;t lose them as friends. life has become so difficult recently. my grades are catching up on me, as i had barely saved them last semester. those thoughts are coming back, and now that horrible feeling in my stomach is back. \nsorry for the horrible writing, didn&amp;#39;t really think this through too much. just in a haze right now about my life. feels like i&amp;#39;m not going to accomplish anything in my life. i went from a solid 4.0 gpa student in all honors to a mess, just because i have no motivation to do any of it. feels like there&amp;#39;s no point anymore. any advice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "not my first time to this subreddit. wrote a post here about my life in it's current state about 7-8 months ago under a different account. had an alias that i commonly used, had to delete the account to hide my life from people i may know. anyway, i'll write a little bit about myself, and the things i'm going through. i'm nearly 17, and i feel so alone. i hated being around people, whenever i went to class i would start panicking about being in public near people. i had no friends back then.  it was my first day back from summer, and i walked into first hour, nervous as ever. i hated being around people. i skipped the rest of my classes, and skipped the next 2 days. my parents got a call about how i wasn't showing up to class, and i told them i was getting bullied in school. told them about online school, and got switched to it. i had horrible thoughts in my head, and considered suicide every waking moment of the day. i still went to a single class a day at a different school. i was nervous the first few days, but soon met 3 people like me that i actually can meet up with all the time, and not feel awkward. i was still skipping doing school work, but hey, i was having some fun. we played video games and saw movies. it was still hard to get motivation to do anything. it's still hard waking up in the morning, and i still feel no reason to live. it's so difficult putting on that smile so i don't lose them as friends. life has become so difficult recently. my grades are catching up on me, as i had barely saved them last semester. those thoughts are coming back, and now that horrible feeling in my stomach is back. \nsorry for the horrible writing, didn't really think this through too much. just in a haze right now about my life. feels like i'm not going to accomplish anything in my life. i went from a solid 4.0 gpa student in all honors to a mess, just because i have no motivation to do any of it. feels like there's no point anymore. any advice?\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ubyu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lonesomeday", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ubyu/sometimes_i_wonder/", "name": "t3_24ubyu", "created": 1399383199.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ubyu/sometimes_i_wonder/", "author_flair_text": null, "title": "sometimes i wonder", "created_utc": 1399354399.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chazi51", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24ubyu", "approved_by": null, "body": "I understand the lack of motivation so much. \n\nBack in middle school I was an all A student no problems, did tons of homework each night. Then highschool came along and although I had much less homework, It was more stressful and I just stopped doing it, my A's turned to B's and then to C's. I was stressed and one night I was taking a shower and was really pissed about something. I started hitting myself in the head as hard as I could hoping it would somehow cause me to die. Then I just had a moment of what am I doing to myself.\n\nAfter that moment I woke up the next morning feeling like absolute shit, I started to think about how awful today would be, then I remembered the shower the night before and decided I needed to stop being so pessimistic and start forcing myself to be optimistic. I had ALWAYS been forcing the smile on my face but once the optimism started coming naturally the smile stayed on my face. \n\nOptimism can do great things, but only you can make life seem better then it really is.\n\nThere is always light at the end of even the longest and darkest tunnels, you just have to get yourself there.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand the lack of motivation so much. &lt;/p&gt;\n\n&lt;p&gt;Back in middle school I was an all A student no problems, did tons of homework each night. Then highschool came along and although I had much less homework, It was more stressful and I just stopped doing it, my A&amp;#39;s turned to B&amp;#39;s and then to C&amp;#39;s. I was stressed and one night I was taking a shower and was really pissed about something. I started hitting myself in the head as hard as I could hoping it would somehow cause me to die. Then I just had a moment of what am I doing to myself.&lt;/p&gt;\n\n&lt;p&gt;After that moment I woke up the next morning feeling like absolute shit, I started to think about how awful today would be, then I remembered the shower the night before and decided I needed to stop being so pessimistic and start forcing myself to be optimistic. I had ALWAYS been forcing the smile on my face but once the optimism started coming naturally the smile stayed on my face. &lt;/p&gt;\n\n&lt;p&gt;Optimism can do great things, but only you can make life seem better then it really is.&lt;/p&gt;\n\n&lt;p&gt;There is always light at the end of even the longest and darkest tunnels, you just have to get yourself there.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ubyu", "score_hidden": false, "name": "t1_chazi51", "created": 1399418918.0, "author_flair_text": null, "created_utc": 1399390118.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]