[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;long story short, I went through a lot of depression, drug and alcohol issues, self induced isolation, for 3 years. It started when I dropped out of high school. I didn&amp;#39;t have many friends then but I lost contact with the few I had. I&amp;#39;ve tried to get back in touch with absolutely everyone I could but after maybe seeing them once or twice they start ignoring me. Whats so wrong with me? Why don&amp;#39;t I deserve any love or genuine friendship? Why don&amp;#39;t I deserve a SO, ever? I know I&amp;#39;m a loser but am I really that bad? I just want it to be over. I&amp;#39;ve had these issues my whole life. It&amp;#39;s so hard for me to get close to anyone. I just want to hold someone so bad, and be told I&amp;#39;m loved. I&amp;#39;m completely socially dysfunctional. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "long story short, I went through a lot of depression, drug and alcohol issues, self induced isolation, for 3 years. It started when I dropped out of high school. I didn't have many friends then but I lost contact with the few I had. I've tried to get back in touch with absolutely everyone I could but after maybe seeing them once or twice they start ignoring me. Whats so wrong with me? Why don't I deserve any love or genuine friendship? Why don't I deserve a SO, ever? I know I'm a loser but am I really that bad? I just want it to be over. I've had these issues my whole life. It's so hard for me to get close to anyone. I just want to hold someone so bad, and be told I'm loved. I'm completely socially dysfunctional. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xkxh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "awewew", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xkxh/soul_crushing_loneliness/", "name": "t3_23xkxh", "created": 1398436743.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xkxh/soul_crushing_loneliness/", "author_flair_text": null, "title": "Soul crushing loneliness", "created_utc": 1398407943.0, "ups": 5, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1kn95", "gilded": 0, "author": "Caleus", "parent_id": "t3_23xkxh", "approved_by": null, "body": "being lonely absolutely sucks so theres nothing wrong with wanting friendship and love and you deserve every bit of it. I cant be there for you in person, but i am *here*. for whatever you need, if you need a friend, or just to talk. i dont want you to be depressed!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;being lonely absolutely sucks so theres nothing wrong with wanting friendship and love and you deserve every bit of it. I cant be there for you in person, but i am &lt;em&gt;here&lt;/em&gt;. for whatever you need, if you need a friend, or just to talk. i dont want you to be depressed!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xkxh", "score_hidden": false, "name": "t1_ch1kn95", "created": 1398415064.0, "author_flair_text": null, "created_utc": 1398411464.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1lwp1", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_23xkxh", "approved_by": null, "body": "I know what you mean. I've really been in that place, and.. well.. please don't dismiss what I'm saying here - what I really had to figure out was how to grow as a person into something that I respected and to care for myself in ways that changed how I looked, which was very important for me.\n\nSocial acceptance and connection is one of the most important factors of life, yet the truth of it is that most of our connections are very very difficult to maintain unless we are connected to a goal that is driving us - that lies beyond the interaction.\n\nWe are all people being pulled towards our destinies, or rather where we are going, and keeping that place in mind, can help make a lot of the in-between stuff make a lot more sense.\n\nWhen it comes to people, anyone who will listen to you can be a tremendous boon. What you want to do is to begin creating some form of project that you can work on regularly, because this helps to shape and form who you want to be and how you represent yourself to others.\n\nPeople who are poets for example, express themselves quite differently. Drawing in crowds helped me tremendously with working up the courage to meet strangers. \n\nThe truth is that people are not quite so far from where you are as you may think, it's just that they are connected to things that you are not connected to yet.\n\nYou happen to be someone who is connected to the suicide forums, the depression/support community. Welcome, we have many loves and passions and desperations and maybe even help. And we are glad that you are here to talk to us, because no one should suffer alone. \n\nWhat I want to say is that your situation is something you can get over, and that expression of your own emotions and thoughts can be a major step in getting to a place where you can be less socially dysfunctional.\n\nI think that a good example of this is stuff like anime-cons, because people who were considered absolute geeks are getting wide scale acceptance now, and I feel like this is a very good thing, there are some truly beautiful people in cosplay, and being able to connect to people who love the same worlds as you I think is something that is life-affirming.\n\nI am also a big music fan, bands that have helped me a lot are Bring me the Horizon, Pierce the Veil, Asking Alexandria, Avenged Sevenfold, Nine Inch Nails. etc etc.\n\nTLDR: Romance has a lot to do with friend groups. Finding friend groups can be a matter of finding people who are in similar situations as you and learning how to relate to them and build them up. Art can help a lot with this.\n\nThe more friends you build, people you can count on, who have felt like you (odds are, people who have felt like you won't leave you out!) the more true connections you can make that introduce you to people you can hold in your life. It's the friends you have that give you the strength to become someone who can hold romance in your life, and you are among friends here. :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you mean. I&amp;#39;ve really been in that place, and.. well.. please don&amp;#39;t dismiss what I&amp;#39;m saying here - what I really had to figure out was how to grow as a person into something that I respected and to care for myself in ways that changed how I looked, which was very important for me.&lt;/p&gt;\n\n&lt;p&gt;Social acceptance and connection is one of the most important factors of life, yet the truth of it is that most of our connections are very very difficult to maintain unless we are connected to a goal that is driving us - that lies beyond the interaction.&lt;/p&gt;\n\n&lt;p&gt;We are all people being pulled towards our destinies, or rather where we are going, and keeping that place in mind, can help make a lot of the in-between stuff make a lot more sense.&lt;/p&gt;\n\n&lt;p&gt;When it comes to people, anyone who will listen to you can be a tremendous boon. What you want to do is to begin creating some form of project that you can work on regularly, because this helps to shape and form who you want to be and how you represent yourself to others.&lt;/p&gt;\n\n&lt;p&gt;People who are poets for example, express themselves quite differently. Drawing in crowds helped me tremendously with working up the courage to meet strangers. &lt;/p&gt;\n\n&lt;p&gt;The truth is that people are not quite so far from where you are as you may think, it&amp;#39;s just that they are connected to things that you are not connected to yet.&lt;/p&gt;\n\n&lt;p&gt;You happen to be someone who is connected to the suicide forums, the depression/support community. Welcome, we have many loves and passions and desperations and maybe even help. And we are glad that you are here to talk to us, because no one should suffer alone. &lt;/p&gt;\n\n&lt;p&gt;What I want to say is that your situation is something you can get over, and that expression of your own emotions and thoughts can be a major step in getting to a place where you can be less socially dysfunctional.&lt;/p&gt;\n\n&lt;p&gt;I think that a good example of this is stuff like anime-cons, because people who were considered absolute geeks are getting wide scale acceptance now, and I feel like this is a very good thing, there are some truly beautiful people in cosplay, and being able to connect to people who love the same worlds as you I think is something that is life-affirming.&lt;/p&gt;\n\n&lt;p&gt;I am also a big music fan, bands that have helped me a lot are Bring me the Horizon, Pierce the Veil, Asking Alexandria, Avenged Sevenfold, Nine Inch Nails. etc etc.&lt;/p&gt;\n\n&lt;p&gt;TLDR: Romance has a lot to do with friend groups. Finding friend groups can be a matter of finding people who are in similar situations as you and learning how to relate to them and build them up. Art can help a lot with this.&lt;/p&gt;\n\n&lt;p&gt;The more friends you build, people you can count on, who have felt like you (odds are, people who have felt like you won&amp;#39;t leave you out!) the more true connections you can make that introduce you to people you can hold in your life. It&amp;#39;s the friends you have that give you the strength to become someone who can hold romance in your life, and you are among friends here. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xkxh", "score_hidden": false, "name": "t1_ch1lwp1", "created": 1398422466.0, "author_flair_text": null, "created_utc": 1398418866.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]