[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little over a year ago the only person I loved killed himself.  I&amp;#39;ve been through every range of emotion since.  I&amp;#39;ve realized I&amp;#39;m at the point where none of it matters. i barely even feel emotions anymore.  I just want to sleep forever.  Nothing will ever make me feel like caring again.  so goodnight.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A little over a year ago the only person I loved killed himself.  I've been through every range of emotion since.  I've realized I'm at the point where none of it matters. i barely even feel emotions anymore.  I just want to sleep forever.  Nothing will ever make me feel like caring again.  so goodnight.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245t06", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "LawyersRock", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/245t06/stop_caring/", "name": "t3_245t06", "created": 1398687024.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/245t06/stop_caring/", "author_flair_text": null, "title": "stop caring", "created_utc": 1398658224.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3wbqh", "gilded": 0, "author": "AlwaysTodash", "parent_id": "t3_245t06", "approved_by": null, "body": "I know what it's like to have someone very close to you take their own life. It's almost definitely the worst thing in life, depending on how close you where to the person, and it seems like you were very close to him. \nI would be willing to bet that a lot of different thoughts have occurred to you since then, whether you realize it or not.\n\nI'd bet that you sometimes think/thought it was your fault. And I'm sure that's not true. If he was the only person you loved, I think he would have known that.\n\nI'd also bet you've thought you don't want to get that close to anyone else because you think they'll do the same thing. And you can't let that stop you. You cannot control what other people do. So there's no sense worrying about it. Having someone in your life might bring some of the emotion back into your life.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what it&amp;#39;s like to have someone very close to you take their own life. It&amp;#39;s almost definitely the worst thing in life, depending on how close you where to the person, and it seems like you were very close to him. \nI would be willing to bet that a lot of different thoughts have occurred to you since then, whether you realize it or not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d bet that you sometimes think/thought it was your fault. And I&amp;#39;m sure that&amp;#39;s not true. If he was the only person you loved, I think he would have known that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also bet you&amp;#39;ve thought you don&amp;#39;t want to get that close to anyone else because you think they&amp;#39;ll do the same thing. And you can&amp;#39;t let that stop you. You cannot control what other people do. So there&amp;#39;s no sense worrying about it. Having someone in your life might bring some of the emotion back into your life.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245t06", "score_hidden": false, "name": "t1_ch3wbqh", "created": 1398663307.0, "author_flair_text": null, "created_utc": 1398659707.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3w4hh", "gilded": 0, "author": "AlphaMongoose", "parent_id": "t3_245t06", "approved_by": null, "body": "Think about the happiest moment in your life. Think that it could happen again if you keep going. If you want to sleep, sleep for 9 hours or so. I don't recommend using anything to get there. And when you wake up, look around. Look around at everything you can find. And try to find something to make you care again. Good luck.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think about the happiest moment in your life. Think that it could happen again if you keep going. If you want to sleep, sleep for 9 hours or so. I don&amp;#39;t recommend using anything to get there. And when you wake up, look around. Look around at everything you can find. And try to find something to make you care again. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245t06", "score_hidden": false, "name": "t1_ch3w4hh", "created": 1398662795.0, "author_flair_text": null, "created_utc": 1398659195.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3wagm", "gilded": 0, "author": "EpicXY", "parent_id": "t3_245t06", "approved_by": null, "body": "I'm sorry, but if someone killed themselves, that doesn't mean you should do the same. This only seems to be \"the point where none of it matters\" only because you lost the person that really mattered to you. So I'm sorry for your loss. \n\nBut remember, people come and go. No one stays alive forever. It's a sad concept, but life starts and ends. That's just how it works. \n\nNow, this is perfectly normal. If I lost a loved one, I would feel the same. Heck everyone would feel the same if they truly love him/her. So don't worry. You're not the only one. \n\nYou can cry and grieve, but you'll eventually have to come back and accept reality. It will be extremely difficult and painful to do so without that person, but you have to. Life moves on and so should you. Just think about it. If that person was still here today, would he want you to feel sad forever? I doubt so. \n\nPlease rest for now. When you see this comment, you don't have to reply. Just go to sleep. But in the morning, wake up and keep going. You will randomly break down and start crying, but you must stand up and keep going. Eventually you will move on and become stronger. \n\nAlways remember this. The person may be gone, but memories will never fade. I don't mean to be cheesy, but if you truly loved him, you'll remember all the good times and you should keep on to that. With those good memories, move on and enjoy life. You'll eventually find something or someone else to care for, but you'll always have that person with you. (Again I don't mean to be cheesy, but it's true. Feel free to disagree.)\n\nOverall, rest for now. But then get up and move on. I know it's not easy but it'll work out. \n\nI wish you good luck and again, very sorry for your loss. Have hope and keep going.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, but if someone killed themselves, that doesn&amp;#39;t mean you should do the same. This only seems to be &amp;quot;the point where none of it matters&amp;quot; only because you lost the person that really mattered to you. So I&amp;#39;m sorry for your loss. &lt;/p&gt;\n\n&lt;p&gt;But remember, people come and go. No one stays alive forever. It&amp;#39;s a sad concept, but life starts and ends. That&amp;#39;s just how it works. &lt;/p&gt;\n\n&lt;p&gt;Now, this is perfectly normal. If I lost a loved one, I would feel the same. Heck everyone would feel the same if they truly love him/her. So don&amp;#39;t worry. You&amp;#39;re not the only one. &lt;/p&gt;\n\n&lt;p&gt;You can cry and grieve, but you&amp;#39;ll eventually have to come back and accept reality. It will be extremely difficult and painful to do so without that person, but you have to. Life moves on and so should you. Just think about it. If that person was still here today, would he want you to feel sad forever? I doubt so. &lt;/p&gt;\n\n&lt;p&gt;Please rest for now. When you see this comment, you don&amp;#39;t have to reply. Just go to sleep. But in the morning, wake up and keep going. You will randomly break down and start crying, but you must stand up and keep going. Eventually you will move on and become stronger. &lt;/p&gt;\n\n&lt;p&gt;Always remember this. The person may be gone, but memories will never fade. I don&amp;#39;t mean to be cheesy, but if you truly loved him, you&amp;#39;ll remember all the good times and you should keep on to that. With those good memories, move on and enjoy life. You&amp;#39;ll eventually find something or someone else to care for, but you&amp;#39;ll always have that person with you. (Again I don&amp;#39;t mean to be cheesy, but it&amp;#39;s true. Feel free to disagree.)&lt;/p&gt;\n\n&lt;p&gt;Overall, rest for now. But then get up and move on. I know it&amp;#39;s not easy but it&amp;#39;ll work out. &lt;/p&gt;\n\n&lt;p&gt;I wish you good luck and again, very sorry for your loss. Have hope and keep going.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245t06", "score_hidden": false, "name": "t1_ch3wagm", "created": 1398663213.0, "author_flair_text": null, "created_utc": 1398659613.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]