[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am in my mid-20&amp;#39;s, I&amp;#39;ve been depressed for a decade. I gave up on myself and my life years ago and have just dug a bigger and bigger hole for myself. I&amp;#39;ve lived with my parents during this time and they allowed me to flounder like this because they didn&amp;#39;t know what else to do and they feared that if they kicked me out, I wouldn&amp;#39;t do what it takes to survive and would instead try to kill myself. Obviously, living at home like a hermit and refusing to engage with the world has done nothing to improve my mood or my prospects in life. I do not want to go on living like this and I also have no desire or motivation to do what is required to fix my life. I think life is meaningless, I think I am a total failure, I don&amp;#39;t think I even have a potential pathway to forging any kind of &amp;quot;successful&amp;quot; life, I don&amp;#39;t believe I can ever recover to a point where I either enjoy life or don&amp;#39;t feel like a complete fuck up. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t tried to kill myself before for two reasons: one is that I&amp;#39;ve done my research, and I&amp;#39;m aware that it isn&amp;#39;t that easy to successfully kill yourself...second, the guilt over what it would do to my parents is very strong. However, I feel awful guilt already over forcing them to live with me the way that I am and it has noticeably caused them a lot of anguish over the years. I know they would say my death would be worse than anything, but I can&amp;#39;t really fathom how it could be much worse than what they&amp;#39;ve seen me become. &lt;/p&gt;\n\n&lt;p&gt;My incredibly bleak outlook and my suicidal thoughts are not some kind of sudden occurrence; I believe that I come to the desire to kill myself as rationally as possible. My mind became darker and bleaker over time and it has now been so long that it has calcified to the point where I can no longer think any other way; I see everything as negatively as can be. I have gone to plenty of therapy, taken plenty of medications, and none of it has made a difference in how I think or feel. I don&amp;#39;t think I have the energy, focus, attitude, motivation, or ability to get out there and live an active life and try to turn things around, nor do I see a &amp;quot;normal, successful&amp;quot; life as being worth the effort required. &lt;/p&gt;\n\n&lt;p&gt;I have made it clear to my parents over and over again that I wish I was dead and that I am always thinking about suicide, but I don&amp;#39;t know how do to it and I don&amp;#39;t know if I&amp;#39;ll ever be able to actually go through with it. I think I have finally hit a wall where something has to give. I can&amp;#39;t take the way things are going any longer. I do not want to be one of those people who makes a half-hearted suicide attempt. If I ever attempt to kill myself, I want it to be successful. I just don&amp;#39;t know any feasible way to make that happen. I know no one here is going to help me figure out the best way to kill myself, but maybe you could at least tell me why some of the common ways are a bad idea due to the physical pain or how difficult it is to succeed? &lt;/p&gt;\n\n&lt;p&gt;So basically, I want to die, I don&amp;#39;t particularly want anyone to offer me encouragement or to try to change my mind (I&amp;#39;ve heard it all before and it&amp;#39;s never gotten through to me), I don&amp;#39;t know how to go about killing myself but I really wish I had some simple solution that would end my life. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am in my mid-20's, I've been depressed for a decade. I gave up on myself and my life years ago and have just dug a bigger and bigger hole for myself. I've lived with my parents during this time and they allowed me to flounder like this because they didn't know what else to do and they feared that if they kicked me out, I wouldn't do what it takes to survive and would instead try to kill myself. Obviously, living at home like a hermit and refusing to engage with the world has done nothing to improve my mood or my prospects in life. I do not want to go on living like this and I also have no desire or motivation to do what is required to fix my life. I think life is meaningless, I think I am a total failure, I don't think I even have a potential pathway to forging any kind of \"successful\" life, I don't believe I can ever recover to a point where I either enjoy life or don't feel like a complete fuck up. \n\nI haven't tried to kill myself before for two reasons: one is that I've done my research, and I'm aware that it isn't that easy to successfully kill yourself...second, the guilt over what it would do to my parents is very strong. However, I feel awful guilt already over forcing them to live with me the way that I am and it has noticeably caused them a lot of anguish over the years. I know they would say my death would be worse than anything, but I can't really fathom how it could be much worse than what they've seen me become. \n\nMy incredibly bleak outlook and my suicidal thoughts are not some kind of sudden occurrence; I believe that I come to the desire to kill myself as rationally as possible. My mind became darker and bleaker over time and it has now been so long that it has calcified to the point where I can no longer think any other way; I see everything as negatively as can be. I have gone to plenty of therapy, taken plenty of medications, and none of it has made a difference in how I think or feel. I don't think I have the energy, focus, attitude, motivation, or ability to get out there and live an active life and try to turn things around, nor do I see a \"normal, successful\" life as being worth the effort required. \n\nI have made it clear to my parents over and over again that I wish I was dead and that I am always thinking about suicide, but I don't know how do to it and I don't know if I'll ever be able to actually go through with it. I think I have finally hit a wall where something has to give. I can't take the way things are going any longer. I do not want to be one of those people who makes a half-hearted suicide attempt. If I ever attempt to kill myself, I want it to be successful. I just don't know any feasible way to make that happen. I know no one here is going to help me figure out the best way to kill myself, but maybe you could at least tell me why some of the common ways are a bad idea due to the physical pain or how difficult it is to succeed? \n\nSo basically, I want to die, I don't particularly want anyone to offer me encouragement or to try to change my mind (I've heard it all before and it's never gotten through to me), I don't know how to go about killing myself but I really wish I had some simple solution that would end my life. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "252ubw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "randomname236", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/252ubw/stuck_and_out_of_ideas/", "name": "t3_252ubw", "created": 1399615713.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/252ubw/stuck_and_out_of_ideas/", "author_flair_text": null, "title": "Stuck and out of ideas", "created_utc": 1399586913.0, "ups": 9, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd5noa", "gilded": 0, "author": "blueitbrownitgreenit", "parent_id": "t3_252ubw", "approved_by": null, "body": "I don't have anything marvelous to say... just that I hear you, and I'm so, so sorry for the pain you have and are experiencing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have anything marvelous to say... just that I hear you, and I&amp;#39;m so, so sorry for the pain you have and are experiencing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ubw", "score_hidden": false, "name": "t1_chd5noa", "created": 1399620332.0, "author_flair_text": null, "created_utc": 1399591532.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdbgr0", "gilded": 0, "author": "ohkamanda", "parent_id": "t3_252ubw", "approved_by": null, "body": "Edit: Never mind, sorry. I don't feel comfortable posting all this here.\n\nBut you could ask your doctor about these things... ketamine treatments, tramadol, kratom, or suboxone for depression, and most importantly, drink enough water, eat healthy foods and get exercise. Life might still suck, but you can make it suck a lot less by doing those.\n\nAnd maybe try watching some positive youtube videos, like this one\nhttp://www.youtube.com/watch?v=41C8hGQQqHA", "edited": 1399614021.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Never mind, sorry. I don&amp;#39;t feel comfortable posting all this here.&lt;/p&gt;\n\n&lt;p&gt;But you could ask your doctor about these things... ketamine treatments, tramadol, kratom, or suboxone for depression, and most importantly, drink enough water, eat healthy foods and get exercise. Life might still suck, but you can make it suck a lot less by doing those.&lt;/p&gt;\n\n&lt;p&gt;And maybe try watching some positive youtube videos, like this one\n&lt;a href=\"http://www.youtube.com/watch?v=41C8hGQQqHA\"&gt;http://www.youtube.com/watch?v=41C8hGQQqHA&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ubw", "score_hidden": false, "name": "t1_chdbgr0", "created": 1399631951.0, "author_flair_text": null, "created_utc": 1399603151.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd7jk4", "gilded": 0, "author": "randomname236", "parent_id": "t1_chd50cl", "approved_by": null, "body": "You don't sound like an asshole, but I can't say that going to war sounds like it would be beneficial to anybody. \n\nAnd I have been living with opinions like this for a very long time and over time my mindset has only gotten worse and more negative. I'm fairly confident that continuing to live is not going to result in any grand epiphany where my outlook on things completely reverses. I think it would take a shitload of work and dedication to slowly better myself over time to the point where things seem not so bad, and frankly I just don't have the energy or willpower to make that kind of positive change. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t sound like an asshole, but I can&amp;#39;t say that going to war sounds like it would be beneficial to anybody. &lt;/p&gt;\n\n&lt;p&gt;And I have been living with opinions like this for a very long time and over time my mindset has only gotten worse and more negative. I&amp;#39;m fairly confident that continuing to live is not going to result in any grand epiphany where my outlook on things completely reverses. I think it would take a shitload of work and dedication to slowly better myself over time to the point where things seem not so bad, and frankly I just don&amp;#39;t have the energy or willpower to make that kind of positive change. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ubw", "score_hidden": false, "name": "t1_chd7jk4", "created": 1399624367.0, "author_flair_text": null, "created_utc": 1399595567.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chd50cl", "gilded": 0, "author": "Boopno", "parent_id": "t3_252ubw", "approved_by": null, "body": "Hanging:People sometimes can do it incorrectly and end up hanging there slowly suffocating.\n\nMeds: They might not do it right, resulting in violently puking or other things, but still living.\n\nGun: Think of the people that would have to clean up brains\n\nThat's all I can think of right now, but I really hope you decide to live. Just a question,if you've really decided to end it, why don't you do it in a way that would be beneficial to others, like going to war? If you did in fact live your opinion on things may change. I'm sorry if I sound like a total asshole.  ", "edited": 1399591901.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hanging:People sometimes can do it incorrectly and end up hanging there slowly suffocating.&lt;/p&gt;\n\n&lt;p&gt;Meds: They might not do it right, resulting in violently puking or other things, but still living.&lt;/p&gt;\n\n&lt;p&gt;Gun: Think of the people that would have to clean up brains&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all I can think of right now, but I really hope you decide to live. Just a question,if you&amp;#39;ve really decided to end it, why don&amp;#39;t you do it in a way that would be beneficial to others, like going to war? If you did in fact live your opinion on things may change. I&amp;#39;m sorry if I sound like a total asshole.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_252ubw", "score_hidden": false, "name": "t1_chd50cl", "created": 1399618847.0, "author_flair_text": null, "created_utc": 1399590047.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]