[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m spiraling out of control. Everything is falling even more apart.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t stand living with my ex. I hate this fucking lease that we&amp;#39;re on, and our relationship is filled with vitriol and constant backhanded comments. He absolutely deplores the sight of me, and I am annoyed with seeing him. We had a terrible break-up and things between us will never be rectified. I will make dinner and make some extra for him and yet, he&amp;#39;ll still act coldly towards me and make me feel like gum on the bottom of his shoe. &lt;/p&gt;\n\n&lt;p&gt;Then again, while I absolutely abhor living with him, I still am somewhat dependent on him. Living with him is a security blanket because I don&amp;#39;t have any other friends so once this lease is up, I don&amp;#39;t know where I&amp;#39;m living and it also makes nights a little less lonely. Sure, he looks at me with contempt but if I get too lonely at night, I can just pop my head into his room and linger around until I retreat back into the living room. &lt;/p&gt;\n\n&lt;p&gt;My family situation is ineffable. I try to avoid them as much as possibly, mostly because I resent them but also because I am ashamed of showing myself to them. Even though they were the ones who gave me the foundation of being messed up, they still remain painfully and conveniently oblivious to what they have done so we put on a facade of being a family. &lt;/p&gt;\n\n&lt;p&gt;Everyday I&amp;#39;m at my job, I feel even more depersonalized and not alive. It&amp;#39;s hard to work when I feel constantly feel like I&amp;#39;m in a different dimension. I wouldn&amp;#39;t be surprised if I get fired tomorrow.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I can imagine myself realistically ending my life soon, but it&amp;#39;s such a decadent fantasy that in a strange way, comforts me when I&amp;#39;m feeling particularly down. It&amp;#39;s nice to know there&amp;#39;s always an outlet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm spiraling out of control. Everything is falling even more apart.\n\nI can't stand living with my ex. I hate this fucking lease that we're on, and our relationship is filled with vitriol and constant backhanded comments. He absolutely deplores the sight of me, and I am annoyed with seeing him. We had a terrible break-up and things between us will never be rectified. I will make dinner and make some extra for him and yet, he'll still act coldly towards me and make me feel like gum on the bottom of his shoe. \n\nThen again, while I absolutely abhor living with him, I still am somewhat dependent on him. Living with him is a security blanket because I don't have any other friends so once this lease is up, I don't know where I'm living and it also makes nights a little less lonely. Sure, he looks at me with contempt but if I get too lonely at night, I can just pop my head into his room and linger around until I retreat back into the living room. \n\nMy family situation is ineffable. I try to avoid them as much as possibly, mostly because I resent them but also because I am ashamed of showing myself to them. Even though they were the ones who gave me the foundation of being messed up, they still remain painfully and conveniently oblivious to what they have done so we put on a facade of being a family. \n\nEveryday I'm at my job, I feel even more depersonalized and not alive. It's hard to work when I feel constantly feel like I'm in a different dimension. I wouldn't be surprised if I get fired tomorrow.\n\nI don't think I can imagine myself realistically ending my life soon, but it's such a decadent fantasy that in a strange way, comforts me when I'm feeling particularly down. It's nice to know there's always an outlet.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25283y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "silverwhisperx", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25283y/suicide_is_becoming_more_and_more_of_a_reasonable/", "name": "t3_25283y", "created": 1399602458.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25283y/suicide_is_becoming_more_and_more_of_a_reasonable/", "author_flair_text": null, "title": "Suicide is becoming more and more of a reasonable option.", "created_utc": 1399573658.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdik6c", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_25283y", "approved_by": null, "body": "Do you have any children with him?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any children with him?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25283y", "score_hidden": false, "name": "t1_chdik6c", "created": 1399657648.0, "author_flair_text": null, "created_utc": 1399628848.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]