[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In July I was kicked out of my work place of 6 years over a failed background check. They didn&amp;#39;t even let me defend myself and wouldn&amp;#39;t listen to the fact that I have to pass a police background check every year as part of my employment. I had just gotten married to one of their staff, just bought a house, and just traded my Nissan 350z with less than 47k miles for a family car. I nearly lost it all because of my removal.&lt;/p&gt;\n\n&lt;p&gt;I tried to make the best of it, but I couldn&amp;#39;t. I started classes but due to my removal from my job I crashed and burned. I attempted to go back again but a variety of fuck ups and fuck overs is causing me to crash on these classes again. I&amp;#39;m likely going to be kicked out of school at this point due to failing classes a second time. I have no degree, but I&amp;#39;m already in around $55,000 in student loan debt.&lt;/p&gt;\n\n&lt;p&gt;Every time a chance comes along to better myself, something always happens that&amp;#39;s outside my control that ruins everything. For instance, I was ready to start a $70k per year job when the company went under due to the economic collapse. &lt;/p&gt;\n\n&lt;p&gt;There is much going on in my head to describe since I&amp;#39;m on my phone. I&amp;#39;m at a point where I have my suicide all planned out for late June. The only reason I haven&amp;#39;t done it yet is my wife, but I&amp;#39;ve come to the conclusion that she is better off without me, that I&amp;#39;m only weighing her down and ruining her life.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t seem to get ahead, and I can&amp;#39;t finish anything I started because of both outside factors and my crippling depression/anxiety.&lt;/p&gt;\n\n&lt;p&gt;I feel like I can&amp;#39;t talk to my friends or family about any of this. I feel like I can&amp;#39;t talk to my counselor or psychiatrist about it. I find nothing pleasurable, I used to have a very strong ability to manage depression, but all my support is gone. None of my hobbies are enjoyable, and I can&amp;#39;t even enjoy watching TV or browsing reddit.&lt;/p&gt;\n\n&lt;p&gt;I just need someone I can talk to, maybe someone I can vent? I don&amp;#39;t know. I feel like no matter what I&amp;#39;m killing myself in the end, but I still want to have someone who I can tell of my pain before I do. Does that make any sense?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In July I was kicked out of my work place of 6 years over a failed background check. They didn't even let me defend myself and wouldn't listen to the fact that I have to pass a police background check every year as part of my employment. I had just gotten married to one of their staff, just bought a house, and just traded my Nissan 350z with less than 47k miles for a family car. I nearly lost it all because of my removal.\n\nI tried to make the best of it, but I couldn't. I started classes but due to my removal from my job I crashed and burned. I attempted to go back again but a variety of fuck ups and fuck overs is causing me to crash on these classes again. I'm likely going to be kicked out of school at this point due to failing classes a second time. I have no degree, but I'm already in around $55,000 in student loan debt.\n\nEvery time a chance comes along to better myself, something always happens that's outside my control that ruins everything. For instance, I was ready to start a $70k per year job when the company went under due to the economic collapse. \n\nThere is much going on in my head to describe since I'm on my phone. I'm at a point where I have my suicide all planned out for late June. The only reason I haven't done it yet is my wife, but I've come to the conclusion that she is better off without me, that I'm only weighing her down and ruining her life.\n\nI can't seem to get ahead, and I can't finish anything I started because of both outside factors and my crippling depression/anxiety.\n\nI feel like I can't talk to my friends or family about any of this. I feel like I can't talk to my counselor or psychiatrist about it. I find nothing pleasurable, I used to have a very strong ability to manage depression, but all my support is gone. None of my hobbies are enjoyable, and I can't even enjoy watching TV or browsing reddit.\n\nI just need someone I can talk to, maybe someone I can vent? I don't know. I feel like no matter what I'm killing myself in the end, but I still want to have someone who I can tell of my pain before I do. Does that make any sense?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zv4q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Hurtingforhelp", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zv4q/suicidal_and_in_desperate_need_to_talk_to_someone/", "name": "t3_23zv4q", "created": 1398500567.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zv4q/suicidal_and_in_desperate_need_to_talk_to_someone/", "author_flair_text": null, "title": "Suicidal and in desperate need to talk to someone without judgement", "created_utc": 1398471767.0, "ups": 2, "num_comments": 30, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch2as81", "children": ["ch2b1rr"], "name": "t1_ch2b1rr", "id": "ch2b1rr"}}], "after": null, "before": null}}, "saved": false, "id": "ch2as81", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch2al0i", "approved_by": null, "body": "It's hard not to compare yourself to others when others compare you to them anyway.\n\nI don't get the news paper, so I wouldn't know what's being wanted. I keep up on monster.com and other websites and I don't necessarily stick with IT related stuff (only that's the one I want to get into). Sadly, my choices are stuck with either low paying jobs that have no rewarding careers or get a degree/job in an entry position like IT, which I've been trying without success for years now.\n\nI've tried blogging, tried photographic, tried recycling, still doing some computer repairs on the side, but nothing worth mentioning. For a year I worked another job in addition to my full time job, while doing computer repairs, as well as side jobs for friends and family (such as yard work or recycling) but in the end I couldn't keep up, nor was it enough money to even touch student loans.\n\nI've used forbearance in the past, they only allow so much time before they tell you too bad. I'm at that limit already.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard not to compare yourself to others when others compare you to them anyway.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t get the news paper, so I wouldn&amp;#39;t know what&amp;#39;s being wanted. I keep up on monster.com and other websites and I don&amp;#39;t necessarily stick with IT related stuff (only that&amp;#39;s the one I want to get into). Sadly, my choices are stuck with either low paying jobs that have no rewarding careers or get a degree/job in an entry position like IT, which I&amp;#39;ve been trying without success for years now.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried blogging, tried photographic, tried recycling, still doing some computer repairs on the side, but nothing worth mentioning. For a year I worked another job in addition to my full time job, while doing computer repairs, as well as side jobs for friends and family (such as yard work or recycling) but in the end I couldn&amp;#39;t keep up, nor was it enough money to even touch student loans.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve used forbearance in the past, they only allow so much time before they tell you too bad. I&amp;#39;m at that limit already.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2as81", "created": 1398510078.0, "author_flair_text": null, "created_utc": 1398481278.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2al0i", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch2a4q8", "approved_by": null, "body": "Sorry hope it's doesn't make you upset but notice you comparing yourself to others, that's a bad road to go down, we all have our own pluses and minuses so it's the old apples and oranges thing. No I wasn't saying you should, or shouldn't go back on meds just mention that it does affect the thought process so have to be careful about decisions made when in that window. Yea IT has to be a difficult field to break into, lots of competition there, do you have any other interest that you might exploit for income?  What field has the most want ads in the papers in your area?  As for the student loans I know I had mine kinda suspended for awhile when I was unable to pay on them without to much adverse affect, might want to look into that just to get some breathing room.  Sounds like you are doing what you can so don't be too hard on yourself, just need things to fall on the good side for a change huh?\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry hope it&amp;#39;s doesn&amp;#39;t make you upset but notice you comparing yourself to others, that&amp;#39;s a bad road to go down, we all have our own pluses and minuses so it&amp;#39;s the old apples and oranges thing. No I wasn&amp;#39;t saying you should, or shouldn&amp;#39;t go back on meds just mention that it does affect the thought process so have to be careful about decisions made when in that window. Yea IT has to be a difficult field to break into, lots of competition there, do you have any other interest that you might exploit for income?  What field has the most want ads in the papers in your area?  As for the student loans I know I had mine kinda suspended for awhile when I was unable to pay on them without to much adverse affect, might want to look into that just to get some breathing room.  Sounds like you are doing what you can so don&amp;#39;t be too hard on yourself, just need things to fall on the good side for a change huh?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2al0i", "created": 1398509564.0, "author_flair_text": null, "created_utc": 1398480764.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2a4q8", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch29zp9", "approved_by": null, "body": "Job market on our area is rough but escaped much of the turmoil the rest of the country had. Problem is with no degree I'm not getting anywhere. And it's not like I'm not trying - I've pursued volunteer positions that will give me a chance to build my resume in my career choice, I've started my own computer repair business on the side (which brought its own problems), I've applied for internships, I've applied for every job I could find that's entry level for IT (even geek squad at best buy). But still nothing.\n\nThe big problem right now is school and everything that comes with it. The debt, the work load, my inability to keep up due to having to work to pay bills. Even more so, the fact that other people manage to do it with less time and while raising kids than I can- I'm such a failure that I can't even keep up with people who have it rougher than I do.\n\nYes I am aware I need to go back on my meds, but the problem I'm seeing is that it may fix how I feel, but it doesn't fix that I'm a failure who will never succeed.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Job market on our area is rough but escaped much of the turmoil the rest of the country had. Problem is with no degree I&amp;#39;m not getting anywhere. And it&amp;#39;s not like I&amp;#39;m not trying - I&amp;#39;ve pursued volunteer positions that will give me a chance to build my resume in my career choice, I&amp;#39;ve started my own computer repair business on the side (which brought its own problems), I&amp;#39;ve applied for internships, I&amp;#39;ve applied for every job I could find that&amp;#39;s entry level for IT (even geek squad at best buy). But still nothing.&lt;/p&gt;\n\n&lt;p&gt;The big problem right now is school and everything that comes with it. The debt, the work load, my inability to keep up due to having to work to pay bills. Even more so, the fact that other people manage to do it with less time and while raising kids than I can- I&amp;#39;m such a failure that I can&amp;#39;t even keep up with people who have it rougher than I do.&lt;/p&gt;\n\n&lt;p&gt;Yes I am aware I need to go back on my meds, but the problem I&amp;#39;m seeing is that it may fix how I feel, but it doesn&amp;#39;t fix that I&amp;#39;m a failure who will never succeed.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2a4q8", "created": 1398508415.0, "author_flair_text": null, "created_utc": 1398479615.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch29zp9", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch29mdo", "approved_by": null, "body": "That is tough, so is there any job market at all in your area, or is like most of the country with 10000 people showing up to apply for 100 jobs?  So if you had to pick the \"Big\" problem right now what would it be?  I saw on other post where you had to stop meds, you do know that there is lots of evidence that people have problems when both starting and stopping them. Closest I ever came was last time I tried using medication for my depression (by the way I have been battling it since age 15) one of the real bummers is that even with 40 yrs of experience with it still don't have any answers for helping others. All I know is it seems to be differnt things work for different people, and even those can be different at different times. Frustrating as H$%L!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is tough, so is there any job market at all in your area, or is like most of the country with 10000 people showing up to apply for 100 jobs?  So if you had to pick the &amp;quot;Big&amp;quot; problem right now what would it be?  I saw on other post where you had to stop meds, you do know that there is lots of evidence that people have problems when both starting and stopping them. Closest I ever came was last time I tried using medication for my depression (by the way I have been battling it since age 15) one of the real bummers is that even with 40 yrs of experience with it still don&amp;#39;t have any answers for helping others. All I know is it seems to be differnt things work for different people, and even those can be different at different times. Frustrating as H$%L!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch29zp9", "created": 1398508054.0, "author_flair_text": null, "created_utc": 1398479254.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch29mdo", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch28djs", "approved_by": null, "body": "Initially I did talk to her, but she herself is struggling with her own depression, which is taxing enough on me in my own condition as it is (I push my stuff aside to support her). Plus she panics far too easy and will just blow up about how we could afford to pay on our student loans.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Initially I did talk to her, but she herself is struggling with her own depression, which is taxing enough on me in my own condition as it is (I push my stuff aside to support her). Plus she panics far too easy and will just blow up about how we could afford to pay on our student loans.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch29mdo", "created": 1398507112.0, "author_flair_text": null, "created_utc": 1398478312.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch28djs", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch2878i", "approved_by": null, "body": "I can understand, I have 10 more credit hrs than needed for an AA, but could not find and english instructor that would just let me take a simple 101 class,( I use to be pretty good at writing) tryed 3 times and failed all of them thought i should be a writer so held me to higher standards than other students, finally gave up, no degree and 25,000 in student loans!  Have a pretty low opinion of \"higher education\" in this country.  Do you talk about any of this with wife?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand, I have 10 more credit hrs than needed for an AA, but could not find and english instructor that would just let me take a simple 101 class,( I use to be pretty good at writing) tryed 3 times and failed all of them thought i should be a writer so held me to higher standards than other students, finally gave up, no degree and 25,000 in student loans!  Have a pretty low opinion of &amp;quot;higher education&amp;quot; in this country.  Do you talk about any of this with wife?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch28djs", "created": 1398503985.0, "author_flair_text": null, "created_utc": 1398475185.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2878i", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch27yi9", "approved_by": null, "body": "I was working on my BA. I've been attending college for years, since summer of 2007. My GPA was 3.4, and I did well despite taking years to get half my credits. But that university was too expensive and I had trouble getting my schedule to match up and to stay on top of classes working full time (and the fact that my sister got her degree working 50+ hours and being a single mom makes me feel that much more pathetic).\n\nSo I switched to my AA at a community college, but their classes don't match up with my schedule, so I did online, which didn't take long to fall behind on despite my best efforts initially. This last go round the school screwed me over resulting in me falling behind (it's a long story).", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was working on my BA. I&amp;#39;ve been attending college for years, since summer of 2007. My GPA was 3.4, and I did well despite taking years to get half my credits. But that university was too expensive and I had trouble getting my schedule to match up and to stay on top of classes working full time (and the fact that my sister got her degree working 50+ hours and being a single mom makes me feel that much more pathetic).&lt;/p&gt;\n\n&lt;p&gt;So I switched to my AA at a community college, but their classes don&amp;#39;t match up with my schedule, so I did online, which didn&amp;#39;t take long to fall behind on despite my best efforts initially. This last go round the school screwed me over resulting in me falling behind (it&amp;#39;s a long story).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2878i", "created": 1398503533.0, "author_flair_text": null, "created_utc": 1398474733.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch27yi9", "gilded": 0, "author": "shallpass2u", "parent_id": "t1_ch27u8o", "approved_by": null, "body": "Sometimes it doesn't take much when the load is already heavy. You working toward a AA or BA?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes it doesn&amp;#39;t take much when the load is already heavy. You working toward a AA or BA?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch27yi9", "created": 1398502913.0, "author_flair_text": null, "created_utc": 1398474113.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch27u8o", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch27agt", "approved_by": null, "body": "School piled on, lots of little things that normally I could handle but now I can't, so I get buried deeper and deeper.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;School piled on, lots of little things that normally I could handle but now I can&amp;#39;t, so I get buried deeper and deeper.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch27u8o", "created": 1398502620.0, "author_flair_text": null, "created_utc": 1398473820.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch27agt", "gilded": 0, "author": "shallpass2u", "parent_id": "t3_23zv4q", "approved_by": null, "body": "Hey man I can relate somewhat, and I'm pretty good at listening. Let it out if you want, I do kinda have a bad habit of trying to fix things so if I start to doing that, instead of listening just tell me to hush. Has something new piled on or just reached that point where you want to scream?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man I can relate somewhat, and I&amp;#39;m pretty good at listening. Let it out if you want, I do kinda have a bad habit of trying to fix things so if I start to doing that, instead of listening just tell me to hush. Has something new piled on or just reached that point where you want to scream?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch27agt", "created": 1398501258.0, "author_flair_text": null, "created_utc": 1398472458.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more", "data": {"count": 0, "parent_id": "t1_ch2c3if", "children": ["ch2c6lw"], "name": "t1_ch2c6lw", "id": "ch2c6lw"}}], "after": null, "before": null}}, "saved": false, "id": "ch2c3if", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch2br81", "approved_by": null, "body": "Sorry, I probably should have mentioned in bi-polar with psychosis. Also been diagnosed with ADD and turrets syndrome", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I probably should have mentioned in bi-polar with psychosis. Also been diagnosed with ADD and turrets syndrome&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2c3if", "created": 1398488302.0, "author_flair_text": null, "created_utc": 1398484702.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2br81", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2alev", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2br81", "created": 1398487380.0, "author_flair_text": null, "created_utc": 1398483780.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2alev", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch2ag19", "approved_by": null, "body": "I'm sorry, but it he idea of finding a better job with better pay is overly optimistic for me. The job I'm in now is the same line of work I've been doing since 2007, but pay hasn't gone up almost at all. Doesn't matter which company it is. The only way to do better is to switch to a new career, whether it be IT like I want or something else. I've even considered work in oil fields until I found that they want years of experience already and even then the pay is laughable ($12 an hour).\n\nI'll call Monday for the prescriptions, I'll promise that much. But still not seeing how it'll help my hopelessness. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, but it he idea of finding a better job with better pay is overly optimistic for me. The job I&amp;#39;m in now is the same line of work I&amp;#39;ve been doing since 2007, but pay hasn&amp;#39;t gone up almost at all. Doesn&amp;#39;t matter which company it is. The only way to do better is to switch to a new career, whether it be IT like I want or something else. I&amp;#39;ve even considered work in oil fields until I found that they want years of experience already and even then the pay is laughable ($12 an hour).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll call Monday for the prescriptions, I&amp;#39;ll promise that much. But still not seeing how it&amp;#39;ll help my hopelessness. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2alev", "created": 1398484393.0, "author_flair_text": null, "created_utc": 1398480793.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch2ag19", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch29zoz", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2ag19", "created": 1398484020.0, "author_flair_text": null, "created_utc": 1398480420.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch29zoz", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch28a7t", "approved_by": null, "body": "Well it wasn't an easy road to finding medication that works. I can't even begin to count the various medications I've tried over the past 15 years.\n\nThe point of the economy though, I'm feeling that no matter how good the economy is I'll never make it. No degree is basically a economic suicide. Getting a degree is a financial suicide. I can't see how I can win, and I'm feeling that I'll never be able to get my degree.\n\nI don't have much faith in legislation or laws about anything. I've been through the court system and my case was hailed as a success case for the justice system. I'm not even joking, the judge said that as well as some defense attorneys. My case was dismissed and the record expunged. Yet I still lost my job over it, especially when they called the police department and the police department broke the law by giving out my case history and then lied about the details (saying I was guilty and so on) when I wasn't.\n\nI have employment now, but the pay is less than I was making before.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it wasn&amp;#39;t an easy road to finding medication that works. I can&amp;#39;t even begin to count the various medications I&amp;#39;ve tried over the past 15 years.&lt;/p&gt;\n\n&lt;p&gt;The point of the economy though, I&amp;#39;m feeling that no matter how good the economy is I&amp;#39;ll never make it. No degree is basically a economic suicide. Getting a degree is a financial suicide. I can&amp;#39;t see how I can win, and I&amp;#39;m feeling that I&amp;#39;ll never be able to get my degree.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have much faith in legislation or laws about anything. I&amp;#39;ve been through the court system and my case was hailed as a success case for the justice system. I&amp;#39;m not even joking, the judge said that as well as some defense attorneys. My case was dismissed and the record expunged. Yet I still lost my job over it, especially when they called the police department and the police department broke the law by giving out my case history and then lied about the details (saying I was guilty and so on) when I wasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I have employment now, but the pay is less than I was making before.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch29zoz", "created": 1398482853.0, "author_flair_text": null, "created_utc": 1398479253.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch28a7t", "gilded": 0, "author": "EightAsterisk", "parent_id": "t1_ch284am", "approved_by": null, "body": "Anxiety can make it tough to get to an appointment, especially driving, that's for sure.  You say that your medication is effective when you take it, and that's fantastic.  It's a really good sign that you've responded to any medication at all--sometimes people don't.  I know that sometimes, when a medication is working and a psychiatrist/mental health professional can call a prescription in to your pharmacy.  It might be worth a call Monday to find out if this is possible.  When you call, you can also talk to her about ways to cut down the costs even more--a lot of mental health professionals have tons of samples and coupons given to them by the drug companies.  You just have to be upfront and honest and explain that you're having trouble affording it.  \nThe economy has been super rough on us all--I know I'm not living the life I expected due to it.  But the economy cycles, and things will get better economically, which will open up a lot of new positions at higher salaries.  There's also more hope than you think with student loan debt--there's more pressure on legislatures now more than ever regarding reducing student debt, so I'm actually very optimistic about debt loads improving through legislation.  It's tough, though, in the meantime, I'll give you that.  Have you applied for your unemployment insurance yet?", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anxiety can make it tough to get to an appointment, especially driving, that&amp;#39;s for sure.  You say that your medication is effective when you take it, and that&amp;#39;s fantastic.  It&amp;#39;s a really good sign that you&amp;#39;ve responded to any medication at all--sometimes people don&amp;#39;t.  I know that sometimes, when a medication is working and a psychiatrist/mental health professional can call a prescription in to your pharmacy.  It might be worth a call Monday to find out if this is possible.  When you call, you can also talk to her about ways to cut down the costs even more--a lot of mental health professionals have tons of samples and coupons given to them by the drug companies.  You just have to be upfront and honest and explain that you&amp;#39;re having trouble affording it.&lt;br/&gt;\nThe economy has been super rough on us all--I know I&amp;#39;m not living the life I expected due to it.  But the economy cycles, and things will get better economically, which will open up a lot of new positions at higher salaries.  There&amp;#39;s also more hope than you think with student loan debt--there&amp;#39;s more pressure on legislatures now more than ever regarding reducing student debt, so I&amp;#39;m actually very optimistic about debt loads improving through legislation.  It&amp;#39;s tough, though, in the meantime, I&amp;#39;ll give you that.  Have you applied for your unemployment insurance yet?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch28a7t", "created": 1398478548.0, "author_flair_text": null, "created_utc": 1398474948.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch284am", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch27yjd", "approved_by": null, "body": "The problem I think is that the medication does work, I just haven't been taking them due to cost, inability to get in to see her to get new scripts for refills (and now that I have the ability the anxiety of doing it makes it difficult to make the appointment). The other problem, is I honestly feel that I have failed at life, that I will never be able to get out of student debt, that I'll never get a good paying job, that it's only a matter of time before we lose it all. With no chance of success, why bother anymore? Why stay living if there is nothing for me in the future? I'm dragging my wife down with me, and that's not fair. It was never my intention for any of this to happen, but it's been one failure after another since I lost my job position in July of last year.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem I think is that the medication does work, I just haven&amp;#39;t been taking them due to cost, inability to get in to see her to get new scripts for refills (and now that I have the ability the anxiety of doing it makes it difficult to make the appointment). The other problem, is I honestly feel that I have failed at life, that I will never be able to get out of student debt, that I&amp;#39;ll never get a good paying job, that it&amp;#39;s only a matter of time before we lose it all. With no chance of success, why bother anymore? Why stay living if there is nothing for me in the future? I&amp;#39;m dragging my wife down with me, and that&amp;#39;s not fair. It was never my intention for any of this to happen, but it&amp;#39;s been one failure after another since I lost my job position in July of last year.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch284am", "created": 1398478125.0, "author_flair_text": null, "created_utc": 1398474525.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch27yjd", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch27tkz", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch27yjd", "created": 1398477716.0, "author_flair_text": null, "created_utc": 1398474116.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch27tkz", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch275yy", "approved_by": null, "body": "Thank you, really. I feel I can't speak with them because I'm tired of my medication being switched up. Even with having one of the best insurance plans I've ever seen my medication is still $40 a month. Which is awesome since without insurance it's about $1,000 or more, but we feel that $40 considering I make less at my current job than I did at the other. Of course it's not just medication, I haven't been taking it because I ran out and I feel embarrassed about that and don't want to deal with any lectures.\n\nIn a way I also don't want them to try to fix it, or force me into the hospital because we can't afford that. Other things buried in my mind....", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, really. I feel I can&amp;#39;t speak with them because I&amp;#39;m tired of my medication being switched up. Even with having one of the best insurance plans I&amp;#39;ve ever seen my medication is still $40 a month. Which is awesome since without insurance it&amp;#39;s about $1,000 or more, but we feel that $40 considering I make less at my current job than I did at the other. Of course it&amp;#39;s not just medication, I haven&amp;#39;t been taking it because I ran out and I feel embarrassed about that and don&amp;#39;t want to deal with any lectures.&lt;/p&gt;\n\n&lt;p&gt;In a way I also don&amp;#39;t want them to try to fix it, or force me into the hospital because we can&amp;#39;t afford that. Other things buried in my mind....&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch27tkz", "created": 1398477371.0, "author_flair_text": null, "created_utc": 1398473771.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2dd6n", "gilded": 0, "author": "Hurtingforhelp", "parent_id": "t1_ch275yy", "approved_by": null, "body": "I'm sorry you are getting voted. I really don't know why. I appreciate what you've contributed - I asked for people to let me talk and vent and you are doing just that. Unless I'm missing something?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you are getting voted. I really don&amp;#39;t know why. I appreciate what you&amp;#39;ve contributed - I asked for people to let me talk and vent and you are doing just that. Unless I&amp;#39;m missing something?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch2dd6n", "created": 1398492014.0, "author_flair_text": null, "created_utc": 1398488414.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch275yy", "gilded": 0, "author": "EightAsterisk", "parent_id": "t3_23zv4q", "approved_by": null, "body": "I'm a social worker by profession and I'd be happy to hear you vent.  It sounds like you're going through an extremely rough time and dealing with anxiety and depression, which are two really difficult mental illnesses to manage. I'm curious, why do you feel you can't speak with your counselor or psychiatrist about this?", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a social worker by profession and I&amp;#39;d be happy to hear you vent.  It sounds like you&amp;#39;re going through an extremely rough time and dealing with anxiety and depression, which are two really difficult mental illnesses to manage. I&amp;#39;m curious, why do you feel you can&amp;#39;t speak with your counselor or psychiatrist about this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zv4q", "score_hidden": false, "name": "t1_ch275yy", "created": 1398475746.0, "author_flair_text": null, "created_utc": 1398472146.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}]