[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what to do. I was dating a guy long distance for about six months. He lives in Australia, I live in the US. I broke up with him recently, even though I&amp;#39;m still in love with him, because I felt like our relationship was unrealistic and it was too hard for me to continue pursuing. He mentioned once when we first started dating that he thought he might have bipolar disorder because his father did, but for the rest of the relationship he covered up all of his episodes because he didn&amp;#39;t want to &amp;quot;burden me&amp;quot; with it. Now that we have broken up, he doesn&amp;#39;t see a reason to live anymore. He tried committing suicide recently and failed, and his friend (the only friend of his that I can contact) took him to the hospital. He&amp;#39;s now on meds and will start seeing a therapist soon, but he still wants to kill himself. He hasn&amp;#39;t waited to see if the meds will stabilize him (takes a few weeks), or if therapy will help. He doesn&amp;#39;t want to wait. On one hand, he tells me that i wasn&amp;#39;t his only source of happiness and that he had a lot of goals beyond our relationship, but then he says things that completely nullify that. He asked me when school was over for me so he could kill himself without me worrying about it during my final exams. He told me he didn&amp;#39;t see a reason to go on without me, and that he felt like I was the only thing that made life worth it. He&amp;#39;s told me that I&amp;#39;m the only person that makes him happy. When I told him that I couldn&amp;#39;t tell him I loved him anymore, because I felt like it was stringing him along and that it was making things worse, he started making more threats of suicide. I&amp;#39;m not sure what to do. I think, as an ex and someone he is still in love with, being friends with him is only making him more attached and making it harder for him to move on. On the other hand, I can&amp;#39;t force him to get help because I&amp;#39;m very far away. His friend is doing the best she can to help, but she can&amp;#39;t be with him day and night. Every time we speak, we end up arguing about why we broke up because he doesn&amp;#39;t think my reasons are good enough, and even though I repeatedly told him that its unhealthy to have expectations and rely on someone so much in a relationship, he doesn&amp;#39;t agree with me. He doesn&amp;#39;t see anything wrong with it, and he doesn&amp;#39;t see why he should find happiness somewhere else because he thinks its impossible. Is urging him to seek help continuously a good course of action, or should I leave him alone to avoid making matters worse?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not sure what to do. I was dating a guy long distance for about six months. He lives in Australia, I live in the US. I broke up with him recently, even though I'm still in love with him, because I felt like our relationship was unrealistic and it was too hard for me to continue pursuing. He mentioned once when we first started dating that he thought he might have bipolar disorder because his father did, but for the rest of the relationship he covered up all of his episodes because he didn't want to \"burden me\" with it. Now that we have broken up, he doesn't see a reason to live anymore. He tried committing suicide recently and failed, and his friend (the only friend of his that I can contact) took him to the hospital. He's now on meds and will start seeing a therapist soon, but he still wants to kill himself. He hasn't waited to see if the meds will stabilize him (takes a few weeks), or if therapy will help. He doesn't want to wait. On one hand, he tells me that i wasn't his only source of happiness and that he had a lot of goals beyond our relationship, but then he says things that completely nullify that. He asked me when school was over for me so he could kill himself without me worrying about it during my final exams. He told me he didn't see a reason to go on without me, and that he felt like I was the only thing that made life worth it. He's told me that I'm the only person that makes him happy. When I told him that I couldn't tell him I loved him anymore, because I felt like it was stringing him along and that it was making things worse, he started making more threats of suicide. I'm not sure what to do. I think, as an ex and someone he is still in love with, being friends with him is only making him more attached and making it harder for him to move on. On the other hand, I can't force him to get help because I'm very far away. His friend is doing the best she can to help, but she can't be with him day and night. Every time we speak, we end up arguing about why we broke up because he doesn't think my reasons are good enough, and even though I repeatedly told him that its unhealthy to have expectations and rely on someone so much in a relationship, he doesn't agree with me. He doesn't see anything wrong with it, and he doesn't see why he should find happiness somewhere else because he thinks its impossible. Is urging him to seek help continuously a good course of action, or should I leave him alone to avoid making matters worse?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250tyv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "queenhecate", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250tyv/suicidal_ex_lives_out_of_country/", "name": "t3_250tyv", "created": 1399560140.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250tyv/suicidal_ex_lives_out_of_country/", "author_flair_text": null, "title": "Suicidal ex lives out of country", "created_utc": 1399531340.0, "ups": 5, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd2ul4", "gilded": 0, "author": "reverienoire", "parent_id": "t1_chcvfva", "approved_by": null, "body": "i totally understand where you're coming from and i think pressuring him to reach out to others in his life is a good idea, especially professionals. the more people you can get involved, the better, because he'd probably get more stable as a result. or at the very least he'd have others looking out for him, who are more equipped to do so than you are.\n\nit's very understandable that you would get emotional during this time. it's a high stress situation and you both love each other but you're at an impasse (you want to go, he wants you to stay). blow ups are bound to happen.\n\nhow do you spend your time together? how do you usually communicate? \n\ni think you could try being friends (in the sense that \"friends\" means  you are supporting him to get help until he's stable enough) but some changes should occur. you need more boundaries. for example, if you typically skype together (voice and video) you could take away the video and just call. ideally you could just text chat to each other, because that would be easier (for me, anyway, ymmv) to keep emotions in check. do you play games together? (i ask because i know a lot of long distance relationships occur through gaming.) if you do, then i would limit or eliminate the game playing. if you end up talking a lot, set a specific time period and communicate that to him (like, \"we'll talk on skype every night for an hour at this time, but no longer that that, and all other communication will have to happen through email\") than that. try to stick to it as much as you're able, try to be strict about it. if he's being unconsciously manipulative then he will try to get you to fudge the boundaries as much as possible. \n\nin general, i would create boundaries and try to stick to them as much as possible and, over time, as he gets more help, you could distance yourself further until you're perhaps only communicating by email. \n\ngood luck with everything. i'm sorry you're in such a difficult situation. i hope the best  for the both of you.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i totally understand where you&amp;#39;re coming from and i think pressuring him to reach out to others in his life is a good idea, especially professionals. the more people you can get involved, the better, because he&amp;#39;d probably get more stable as a result. or at the very least he&amp;#39;d have others looking out for him, who are more equipped to do so than you are.&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s very understandable that you would get emotional during this time. it&amp;#39;s a high stress situation and you both love each other but you&amp;#39;re at an impasse (you want to go, he wants you to stay). blow ups are bound to happen.&lt;/p&gt;\n\n&lt;p&gt;how do you spend your time together? how do you usually communicate? &lt;/p&gt;\n\n&lt;p&gt;i think you could try being friends (in the sense that &amp;quot;friends&amp;quot; means  you are supporting him to get help until he&amp;#39;s stable enough) but some changes should occur. you need more boundaries. for example, if you typically skype together (voice and video) you could take away the video and just call. ideally you could just text chat to each other, because that would be easier (for me, anyway, ymmv) to keep emotions in check. do you play games together? (i ask because i know a lot of long distance relationships occur through gaming.) if you do, then i would limit or eliminate the game playing. if you end up talking a lot, set a specific time period and communicate that to him (like, &amp;quot;we&amp;#39;ll talk on skype every night for an hour at this time, but no longer that that, and all other communication will have to happen through email&amp;quot;) than that. try to stick to it as much as you&amp;#39;re able, try to be strict about it. if he&amp;#39;s being unconsciously manipulative then he will try to get you to fudge the boundaries as much as possible. &lt;/p&gt;\n\n&lt;p&gt;in general, i would create boundaries and try to stick to them as much as possible and, over time, as he gets more help, you could distance yourself further until you&amp;#39;re perhaps only communicating by email. &lt;/p&gt;\n\n&lt;p&gt;good luck with everything. i&amp;#39;m sorry you&amp;#39;re in such a difficult situation. i hope the best  for the both of you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chd2ul4", "created": 1399614086.0, "author_flair_text": null, "created_utc": 1399585286.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chcvfva", "gilded": 0, "author": "queenhecate", "parent_id": "t1_chck2gy", "approved_by": null, "body": "Thank you for responding. First attempt was definitely just that…an attempt. He wanted to die. He threatened after that but I think mostly those threats were a cry for help. His family doesn't know, but he's going to tell them today (he did not kill himself like I thought he would, but he went out and got drunk and lost instead. Which is better than killing yourself, but still….) His parents…they just don't really care about him. I told him if he didn't tell his parents very soon that I would. He says that he has barely any relationship with his parents, and I told them that being honest about something so important was a good place to start a relationship. His dad was really messed up when he was younger but I think after he got treatment for bipolar he's become a better father so I keep urging him to talk to him because I think he could help. Besides that, I keep getting emotional which makes it really hard for me to handle it fairly, sometimes I get so upset I tell him things out of spite or anger that you shouldn't say to a suicidal or depressed person. I've read things that say that it's good to be there and support a suicidal person, but this is harder because A) i'm nowhere near him and B) we're exes so our feelings can get in the way. I THINK we might try being friends with no mention of romance or relationships at all, and no talk about the breakup. Do you think, from what you know, that that would be possible? Or beneficial at all? Would that be better than just abandoning him?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding. First attempt was definitely just that…an attempt. He wanted to die. He threatened after that but I think mostly those threats were a cry for help. His family doesn&amp;#39;t know, but he&amp;#39;s going to tell them today (he did not kill himself like I thought he would, but he went out and got drunk and lost instead. Which is better than killing yourself, but still….) His parents…they just don&amp;#39;t really care about him. I told him if he didn&amp;#39;t tell his parents very soon that I would. He says that he has barely any relationship with his parents, and I told them that being honest about something so important was a good place to start a relationship. His dad was really messed up when he was younger but I think after he got treatment for bipolar he&amp;#39;s become a better father so I keep urging him to talk to him because I think he could help. Besides that, I keep getting emotional which makes it really hard for me to handle it fairly, sometimes I get so upset I tell him things out of spite or anger that you shouldn&amp;#39;t say to a suicidal or depressed person. I&amp;#39;ve read things that say that it&amp;#39;s good to be there and support a suicidal person, but this is harder because A) i&amp;#39;m nowhere near him and B) we&amp;#39;re exes so our feelings can get in the way. I THINK we might try being friends with no mention of romance or relationships at all, and no talk about the breakup. Do you think, from what you know, that that would be possible? Or beneficial at all? Would that be better than just abandoning him?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chcvfva", "created": 1399599509.0, "author_flair_text": null, "created_utc": 1399570709.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chck2gy", "gilded": 0, "author": "reverienoire", "parent_id": "t3_250tyv", "approved_by": null, "body": "oh wow, what a difficult situation. you're in a very tough predicament.\n\nwhat were the circumstances regarding his suicide attempt? was he planning to legit check out or was it more of a cry for help? \n\nif i were in your situation, i would try to get him in the hands of professionals as often as possible. i would learn what i could about the australian mental health system in his area. i would find out what the laws are. i assume you know where he lives?  if he threatens suicide again find a way to contact law enforcement or emergency services (call over skype if possible?). this might not be a feasible option like it is in america so find out beforehand. \n\nwhat is his family situation like? are they aware of what's going on?\n\nyour reasons for breaking up sound very fair and valid, but it's probably useless to argue with him about them because he is not in a state of mind where he can process them. \n\ngosh, i don't know. maybe it is better to cut contact, but given the fact he's already attempted and failed once, i would second guess that action myself. no one wants to have the spectre of a loved one's suicide hanging over their head.\n\ni'm so sorry for all the stress you must be feeling right now.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh wow, what a difficult situation. you&amp;#39;re in a very tough predicament.&lt;/p&gt;\n\n&lt;p&gt;what were the circumstances regarding his suicide attempt? was he planning to legit check out or was it more of a cry for help? &lt;/p&gt;\n\n&lt;p&gt;if i were in your situation, i would try to get him in the hands of professionals as often as possible. i would learn what i could about the australian mental health system in his area. i would find out what the laws are. i assume you know where he lives?  if he threatens suicide again find a way to contact law enforcement or emergency services (call over skype if possible?). this might not be a feasible option like it is in america so find out beforehand. &lt;/p&gt;\n\n&lt;p&gt;what is his family situation like? are they aware of what&amp;#39;s going on?&lt;/p&gt;\n\n&lt;p&gt;your reasons for breaking up sound very fair and valid, but it&amp;#39;s probably useless to argue with him about them because he is not in a state of mind where he can process them. &lt;/p&gt;\n\n&lt;p&gt;gosh, i don&amp;#39;t know. maybe it is better to cut contact, but given the fact he&amp;#39;s already attempted and failed once, i would second guess that action myself. no one wants to have the spectre of a loved one&amp;#39;s suicide hanging over their head.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m so sorry for all the stress you must be feeling right now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chck2gy", "created": 1399562041.0, "author_flair_text": null, "created_utc": 1399533241.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcwp1a", "gilded": 0, "author": "TangentialThreat", "parent_id": "t1_chcw3x6", "approved_by": null, "body": "I understand your decision. What people want is often a complicated multileveled thing. Good luck. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your decision. What people want is often a complicated multileveled thing. Good luck. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chcwp1a", "created": 1399601986.0, "author_flair_text": null, "created_utc": 1399573186.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chcw3x6", "gilded": 0, "author": "queenhecate", "parent_id": "t1_chck9n6", "approved_by": null, "body": "Thanks for responding. I can see what you're saying, and I appreciate it because it's a very objective viewpoint (which is what I needed). Maybe the logical part of my brain agrees with you, but this is also someone I love very much who also loves me very much (despite manipulative behaviors indicating otherwise). He does have a chemical imbalance. The entire time we dated and even beyond that and before that, he has never tried to manipulate me or hurt me in any way, so it's really confusing and conflicting with who he is to me. What i'm worried about is if I cut off contact with him I think that he will legitimately kill himself or seriously try to. Friends who have been depressed in the past have told me that often when suicidal people tell other people about wanting to kill themselves, that it's a cry for help (which we should take seriously!) but that when people really want to die, they won't tell anyone so no one will stop them. I think that he will do it. I think he relies on me for support so i'm afraid if i take out a support system from under him it will be the last thing he can handle. I know it isn't my fault if he does end up killing himself, but I really don't want him to die. I'm just afraid that i'll either cut him off and the result will be his death, or I will keep supporting him and he will keep emotionally affecting me.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for responding. I can see what you&amp;#39;re saying, and I appreciate it because it&amp;#39;s a very objective viewpoint (which is what I needed). Maybe the logical part of my brain agrees with you, but this is also someone I love very much who also loves me very much (despite manipulative behaviors indicating otherwise). He does have a chemical imbalance. The entire time we dated and even beyond that and before that, he has never tried to manipulate me or hurt me in any way, so it&amp;#39;s really confusing and conflicting with who he is to me. What i&amp;#39;m worried about is if I cut off contact with him I think that he will legitimately kill himself or seriously try to. Friends who have been depressed in the past have told me that often when suicidal people tell other people about wanting to kill themselves, that it&amp;#39;s a cry for help (which we should take seriously!) but that when people really want to die, they won&amp;#39;t tell anyone so no one will stop them. I think that he will do it. I think he relies on me for support so i&amp;#39;m afraid if i take out a support system from under him it will be the last thing he can handle. I know it isn&amp;#39;t my fault if he does end up killing himself, but I really don&amp;#39;t want him to die. I&amp;#39;m just afraid that i&amp;#39;ll either cut him off and the result will be his death, or I will keep supporting him and he will keep emotionally affecting me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chcw3x6", "created": 1399600803.0, "author_flair_text": null, "created_utc": 1399572003.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chck9n6", "gilded": 0, "author": "TangentialThreat", "parent_id": "t3_250tyv", "approved_by": null, "body": "&gt;He asked me when school was over for me so he could kill himself without me worrying about it during my final exams.\n\nRed flag: manipulation, presentation of implausible scenarios designed to cause psychological harm. \n\n&gt;When I told him that I couldn't tell him I loved him anymore, because I felt like it was stringing him along and that it was making things worse, he started making more threats of suicide.\n\nMore red flags.\n\nRight, so he's probably in a lot of pain but he's also using this to control you. \n\n&gt;Is urging him to seek help continuously a good course of action, or should I leave him alone to avoid making matters worse?\n\nYou are being made to feel bad for him. Fuck him. Fuck everything about him. Technically he's chemically unbalanced and might change once the medication kicks in, but for right now you should stop all contact.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He asked me when school was over for me so he could kill himself without me worrying about it during my final exams.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Red flag: manipulation, presentation of implausible scenarios designed to cause psychological harm. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When I told him that I couldn&amp;#39;t tell him I loved him anymore, because I felt like it was stringing him along and that it was making things worse, he started making more threats of suicide.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;More red flags.&lt;/p&gt;\n\n&lt;p&gt;Right, so he&amp;#39;s probably in a lot of pain but he&amp;#39;s also using this to control you. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is urging him to seek help continuously a good course of action, or should I leave him alone to avoid making matters worse?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are being made to feel bad for him. Fuck him. Fuck everything about him. Technically he&amp;#39;s chemically unbalanced and might change once the medication kicks in, but for right now you should stop all contact.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250tyv", "score_hidden": false, "name": "t1_chck9n6", "created": 1399563067.0, "author_flair_text": null, "created_utc": 1399534267.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]