[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was locked out of the house as, but I realized I had a key. &lt;/p&gt;\n\n&lt;p&gt;I’m sorry mom and dad I failed what both of you sacrificed to get me to where I am today physically. I am a piece of shit who meets no moral standards. I cant stand the pressure of being an adult. I&amp;#39;m sorry that ate that fruit bar as I am too embarrassed to admit to fucking up again by accidently eating something of yours again. Dad I really did not steal your marijuana as you are already being an amazingly and supportive dad that has been through this before. I wish I was nicer to you and mom. I exploit you two a lot. I want my pathetic life to end and what you guys wanted as a son to be reborn. I have failed not only on the concept of being human. I am deeply sorry for any and a;; struggle of shit my existence has been. I[m and asshole, worthless, male who just happens to have parents who would do such and for me to act this is terrible. I hope its not too late to redeem myself. I love you very much dearly and I am too scared of being weak anymore as I don’t want to seem weak. I don’t know why I haven’t realized this sooner.&lt;/p&gt;\n\n&lt;p&gt;I’m Sorry&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I was locked out of the house as, but I realized I had a key. \n\nI’m sorry mom and dad I failed what both of you sacrificed to get me to where I am today physically. I am a piece of shit who meets no moral standards. I cant stand the pressure of being an adult. I'm sorry that ate that fruit bar as I am too embarrassed to admit to fucking up again by accidently eating something of yours again. Dad I really did not steal your marijuana as you are already being an amazingly and supportive dad that has been through this before. I wish I was nicer to you and mom. I exploit you two a lot. I want my pathetic life to end and what you guys wanted as a son to be reborn. I have failed not only on the concept of being human. I am deeply sorry for any and a;; struggle of shit my existence has been. I[m and asshole, worthless, male who just happens to have parents who would do such and for me to act this is terrible. I hope its not too late to redeem myself. I love you very much dearly and I am too scared of being weak anymore as I don’t want to seem weak. I don’t know why I haven’t realized this sooner.\n\nI’m Sorry\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249bys", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwawakey", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249bys/suicide_note/", "name": "t3_249bys", "created": 1398783108.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249bys/suicide_note/", "author_flair_text": null, "title": "Suicide Note", "created_utc": 1398754308.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4w77f", "gilded": 0, "author": "reaching-out", "parent_id": "t3_249bys", "approved_by": null, "body": "Hey. I feel similar to you a lot of the time...I have awesome parents (which when you listen to others, actually seems quite rare) but still consistently 'fail' and feel like I let them down. When I hit rock bottom, I speak to them. You may feel awkward, it may hurt, but they'll be able to offer you a perspective on your existence that isn't clouded by depression. See what they have to say. I doubt they think you're a failure or morally corrupt, you're just finding your way in life like they once had to do themselves. Good luck, I'll be thinking of you. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey. I feel similar to you a lot of the time...I have awesome parents (which when you listen to others, actually seems quite rare) but still consistently &amp;#39;fail&amp;#39; and feel like I let them down. When I hit rock bottom, I speak to them. You may feel awkward, it may hurt, but they&amp;#39;ll be able to offer you a perspective on your existence that isn&amp;#39;t clouded by depression. See what they have to say. I doubt they think you&amp;#39;re a failure or morally corrupt, you&amp;#39;re just finding your way in life like they once had to do themselves. Good luck, I&amp;#39;ll be thinking of you. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249bys", "score_hidden": false, "name": "t1_ch4w77f", "created": 1398787075.0, "author_flair_text": null, "created_utc": 1398758275.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]