[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am losing my health insurance at a time when I really, really need it to treat chronic conditions, and maybe even get surgery.&lt;/p&gt;\n\n&lt;p&gt;I am living with family that is ready to kick me out on the street and slowly driving me crazy. &lt;/p&gt;\n\n&lt;p&gt;All the stupid things I&amp;#39;ve done and need help defeating--unemployed, no chance of health insurance unless my family allows it (and my mother refuses it), unwittingly drawing my mother&amp;#39;s rage--is harming my father, too, and he is my biggest support. I wish I weren&amp;#39;t a burden on him. I am, more so than ever. &lt;/p&gt;\n\n&lt;p&gt;Each setback is really eight setbacks, because the negative energy and lack of control preoccupies and sucks dry everything else. I feel it from my skull to my ankles--I know what I look like even when I&amp;#39;m smiling and trying to wear a neutral facial expression. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t really hide how I feel about myself and the anxiety/fury/dread/grief eats all the leftover energy that&amp;#39;s meant to be spent on things I need to take care of NOW, enjoy NOW, work on NOW. I can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;I lie awake and think of all the horrible possibilities for the future, my own anger, the amount of effort it takes to just get through an exchange with my mother without feeling like I&amp;#39;m going to jump out the window, literally. &lt;/p&gt;\n\n&lt;p&gt;I started here four years ago and I am more easily humiliated, disempowered, and sucked dry with each mistake, because what&amp;#39;s concurrent with panic attacks talking to family members and alienating friends and torturous moments of psychoses I reflect on when I come to my senses--horrified--is that failure to build up personal resources. There is no support network to fall back on, no resilience, no coping strategy, nowhere else to go if I need to go someplace other than my house (my parents&amp;#39;, really) to lie down, compose myself, and then try to spend the rest of the day being productive and planning on getting through the next six months of learning to manage myself. &lt;/p&gt;\n\n&lt;p&gt;I am mentally and physically at the mercy of a person that hates me, has every reason to, and have fucked myself up so much--continue to--that I am beyond any real ability of a psychiatrist or family to help me. &lt;/p&gt;\n\n&lt;p&gt;I have hurt her; but I also think she&amp;#39;s crazy, spiteful and limited as parent, even when I was &amp;quot;normal&amp;quot;, but each year brings new lows to my relationship with the person who knows I&amp;#39;m dependent on her because I am a fucking miserable, lazy, deficient loser. &lt;/p&gt;\n\n&lt;p&gt;Each mistake makes it harder to get away from her. I&amp;#39;ve made four years of them and still do, but I&amp;#39;m dragging family down with me. I am an open wound of paranoia and just...idiocy, hurtling through space, pissing off friends, too ashamed to ask for help because I know I&amp;#39;ll fuck up.&lt;/p&gt;\n\n&lt;p&gt;I also messed up my face recently in a fit of psychosis in ways I won&amp;#39;t describe in a year when what I wanted more than anything was feel comfortable in my own skin so I could start engaging people as an adult without it feeling like shouldering boulders up a hill. I failed there too.&lt;/p&gt;\n\n&lt;p&gt;I honestly feel like if there&amp;#39;s a God, he&amp;#39;s punishing me, and there&amp;#39;s no bottom to it. I had three hopes for two years--find a treatment plan to make the depression/acne manageable, find a job after getting kicked out of grad school and leaving a different program I wasted the last of my energy in, slowly make enough money to find a roommate in another year of two, and experience two days of happiness with the first person I fell in love with, who has no real money to travel extensively. (And he doesn&amp;#39;t care about me as much as I do him; he&amp;#39;s better than me. It still would have meant everything to have two days last year, like getting to catch a breath after being underwater for ten.&lt;/p&gt;\n\n&lt;p&gt;I failed every single small, small desire to stop coming back here, and try to go forward, all because of extraordinary changes in depression. I have never escaped that pattern between numb/huffing and puffing along, being disorganized, and then explosive frenzy.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to talk to my own friends anymore--I can&amp;#39;t really tell them what preoccupies all my days and nights, which is managing depression and anxiety that has changed in horrible ways I never could have planned for, even on meds. I can&amp;#39;t tell them there is a 50% chance I will be homeless sooner than later, and I&amp;#39;d rather cut my losses on a miserable, ugly life, because being able to sleep in my own bed is the last happiness I have left. I squandered and failed to plan on keeping the rest.)&lt;/p&gt;\n\n&lt;p&gt;I pissed away two years in grad school, four years of insurance, and the opportunity to experience real happiness after five incredibly painful, isolating years. I had a small support system and I wasted it. &lt;/p&gt;\n\n&lt;p&gt;I am no longer someone I think can really make use of help, not based on just how bad, pounding, devouring the bad days are, the negative feelings towards other people. The jealousy, the irritation, the sense that they can smell what a fucking loser I am, no matter how kind I try to be, or positive. &lt;/p&gt;\n\n&lt;p&gt;I am either responsible for the anger I meet and that roils in me, or else, I am powerless over it--I burnt through all my second, third chances for redemption. &lt;/p&gt;\n\n&lt;p&gt;My family and fear of fucking up are the only things keeping me going. &lt;/p&gt;\n\n&lt;p&gt;There is not a day in the last four years and with the increasing panic attacks that I don&amp;#39;t wish one of them would evolve into a fatal stroke, an aneurysm, something to release me so I didn&amp;#39;t have to keep fighting with myself.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m sorry, because I&amp;#39;ve posted a lot on Reddit in the last year. It helped. I marvel at the amount of people suffering out there through no fault of their own--already homeless, sexually assaulted, abused, living with chronic pain I can&amp;#39;t imagine. I know have it pretty easy; what I did to myself is at least half mine. But at this point, what I am to blame for and what befell me is indistinguishable. I can only tell you how I feel in my own skin and how much work it takes to try to delude myself into feigning normalcy in sickening, burning moments when I&amp;#39;d just as soon shoot myself. &lt;/p&gt;\n\n&lt;p&gt;I am not going to outlive the fear or guilt. I am not going to outlive my fucking stupidity, weakness, jealousy, shame. &lt;/p&gt;\n\n&lt;p&gt;I am caught in between for now, though, trying to just through 24 hours, meeting familiar challenges that feel new and horrible each time, and it continues to get worse and worse.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am losing my health insurance at a time when I really, really need it to treat chronic conditions, and maybe even get surgery.\n\nI am living with family that is ready to kick me out on the street and slowly driving me crazy. \n\nAll the stupid things I've done and need help defeating--unemployed, no chance of health insurance unless my family allows it (and my mother refuses it), unwittingly drawing my mother's rage--is harming my father, too, and he is my biggest support. I wish I weren't a burden on him. I am, more so than ever. \n\nEach setback is really eight setbacks, because the negative energy and lack of control preoccupies and sucks dry everything else. I feel it from my skull to my ankles--I know what I look like even when I'm smiling and trying to wear a neutral facial expression. \n\nI can't really hide how I feel about myself and the anxiety/fury/dread/grief eats all the leftover energy that's meant to be spent on things I need to take care of NOW, enjoy NOW, work on NOW. I can't. \n\nI lie awake and think of all the horrible possibilities for the future, my own anger, the amount of effort it takes to just get through an exchange with my mother without feeling like I'm going to jump out the window, literally. \n\nI started here four years ago and I am more easily humiliated, disempowered, and sucked dry with each mistake, because what's concurrent with panic attacks talking to family members and alienating friends and torturous moments of psychoses I reflect on when I come to my senses--horrified--is that failure to build up personal resources. There is no support network to fall back on, no resilience, no coping strategy, nowhere else to go if I need to go someplace other than my house (my parents', really) to lie down, compose myself, and then try to spend the rest of the day being productive and planning on getting through the next six months of learning to manage myself. \n\nI am mentally and physically at the mercy of a person that hates me, has every reason to, and have fucked myself up so much--continue to--that I am beyond any real ability of a psychiatrist or family to help me. \n\nI have hurt her; but I also think she's crazy, spiteful and limited as parent, even when I was \"normal\", but each year brings new lows to my relationship with the person who knows I'm dependent on her because I am a fucking miserable, lazy, deficient loser. \n\nEach mistake makes it harder to get away from her. I've made four years of them and still do, but I'm dragging family down with me. I am an open wound of paranoia and just...idiocy, hurtling through space, pissing off friends, too ashamed to ask for help because I know I'll fuck up.\n\nI also messed up my face recently in a fit of psychosis in ways I won't describe in a year when what I wanted more than anything was feel comfortable in my own skin so I could start engaging people as an adult without it feeling like shouldering boulders up a hill. I failed there too.\n\nI honestly feel like if there's a God, he's punishing me, and there's no bottom to it. I had three hopes for two years--find a treatment plan to make the depression/acne manageable, find a job after getting kicked out of grad school and leaving a different program I wasted the last of my energy in, slowly make enough money to find a roommate in another year of two, and experience two days of happiness with the first person I fell in love with, who has no real money to travel extensively. (And he doesn't care about me as much as I do him; he's better than me. It still would have meant everything to have two days last year, like getting to catch a breath after being underwater for ten.\n\nI failed every single small, small desire to stop coming back here, and try to go forward, all because of extraordinary changes in depression. I have never escaped that pattern between numb/huffing and puffing along, being disorganized, and then explosive frenzy.\n\n I don't know how to talk to my own friends anymore--I can't really tell them what preoccupies all my days and nights, which is managing depression and anxiety that has changed in horrible ways I never could have planned for, even on meds. I can't tell them there is a 50% chance I will be homeless sooner than later, and I'd rather cut my losses on a miserable, ugly life, because being able to sleep in my own bed is the last happiness I have left. I squandered and failed to plan on keeping the rest.)\n\nI pissed away two years in grad school, four years of insurance, and the opportunity to experience real happiness after five incredibly painful, isolating years. I had a small support system and I wasted it. \n\nI am no longer someone I think can really make use of help, not based on just how bad, pounding, devouring the bad days are, the negative feelings towards other people. The jealousy, the irritation, the sense that they can smell what a fucking loser I am, no matter how kind I try to be, or positive. \n\nI am either responsible for the anger I meet and that roils in me, or else, I am powerless over it--I burnt through all my second, third chances for redemption. \n\nMy family and fear of fucking up are the only things keeping me going. \n\nThere is not a day in the last four years and with the increasing panic attacks that I don't wish one of them would evolve into a fatal stroke, an aneurysm, something to release me so I didn't have to keep fighting with myself.\n\nAnd I'm sorry, because I've posted a lot on Reddit in the last year. It helped. I marvel at the amount of people suffering out there through no fault of their own--already homeless, sexually assaulted, abused, living with chronic pain I can't imagine. I know have it pretty easy; what I did to myself is at least half mine. But at this point, what I am to blame for and what befell me is indistinguishable. I can only tell you how I feel in my own skin and how much work it takes to try to delude myself into feigning normalcy in sickening, burning moments when I'd just as soon shoot myself. \n\nI am not going to outlive the fear or guilt. I am not going to outlive my fucking stupidity, weakness, jealousy, shame. \n\nI am caught in between for now, though, trying to just through 24 hours, meeting familiar challenges that feel new and horrible each time, and it continues to get worse and worse.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24foij", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "iredditi", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398960812.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24foij/the_fear_is_unbearable_a_well_thats_never/", "name": "t3_24foij", "created": 1398951380.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24foij/the_fear_is_unbearable_a_well_thats_never/", "author_flair_text": null, "title": "The fear is unbearable, a well that's never quenched, even as the pathways out and forward disappear", "created_utc": 1398922580.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6ot1g", "gilded": 0, "author": "HesAFlopper", "parent_id": "t3_24foij", "approved_by": null, "body": "What was your major in grad school? While this may not be the best effort, I feel you have a great writing talent, I thought that as soon as I read the first paragraph. Have you tried a job in writing? I think you would do a great job in descriptive writing.\nAnyway... You are not alone. There are many out there like myself who feel overwhelmed as you do. My special talent is mathematics, but I assure you we connect on a more special level then simple school subjects.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What was your major in grad school? While this may not be the best effort, I feel you have a great writing talent, I thought that as soon as I read the first paragraph. Have you tried a job in writing? I think you would do a great job in descriptive writing.\nAnyway... You are not alone. There are many out there like myself who feel overwhelmed as you do. My special talent is mathematics, but I assure you we connect on a more special level then simple school subjects.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24foij", "score_hidden": false, "name": "t1_ch6ot1g", "created": 1398953486.0, "author_flair_text": null, "created_utc": 1398924686.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]