[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, everyone. I made an account on Reddit specifically for this occasion. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had a rough go of it, lately. I woke up yesterday morning with a girlfriend and a job. I now have neither. While I know that that&amp;#39;s far from the worst thing that can happen to a person- hell, it&amp;#39;s not the worst thing that&amp;#39;s happened to &lt;em&gt;me&lt;/em&gt;- it really drags up the depression I&amp;#39;ve been experiencing for quite a long time.&lt;/p&gt;\n\n&lt;p&gt;I know that I&amp;#39;ll feel better, you know? I know that, eventually, I&amp;#39;ll be at a totally different level of experience (the mountaintop to this valley, so to speak) and think, &amp;quot;Well, shit, I&amp;#39;m sure glad I didn&amp;#39;t die!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The thing is, though, that there will &lt;em&gt;absolutely&lt;/em&gt; be another valley just like this one. I&amp;#39;ll then think, &amp;quot;Well, shit, why the FUCK did I ever want to live?&amp;quot; I often wonder why it&amp;#39;s more valid to chase the highs rather than to just avoid the lows (other than obvious things like social ties and the like- more on that in a second).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been involved pretty heavily involved in drugs and alcohol for a long time. At first, it was when some seriously fucked up shit was going on (I&amp;#39;d prefer not to get into it) and I was honestly, legitimately feeling suicidal for the first time. I was thirteen. I guess I thought it would numb me from how awful I felt. I mean... heroin does, and booze kind of does, and weed&amp;#39;s better than being sober, but all the rest didn&amp;#39;t do a hell of a lot for my outlook, even temporarily. Also, it goes without saying that upon coming down, things got even worse than before.&lt;/p&gt;\n\n&lt;p&gt;All that said, sobering up completely didn&amp;#39;t help at all, either. That was worse, I think, since there was no relief to be found at all.&lt;/p&gt;\n\n&lt;p&gt;Then I started having a lot of sex, you know? I&amp;#39;m from a pretty small town, and am bisexual, so queer men were kind of hard to come by. I was popular, and that, too, served to hold it off for a while. That ended up making me feel filthier than heroin or meth ever could, and besides sex is so, so seldom ever &amp;quot;just&amp;quot; sex.&lt;/p&gt;\n\n&lt;p&gt;So then romance was my next option. That was the most effective, I think, but the comedown is always far, FAR worse than any drug&amp;#39;s would be. Plus, there&amp;#39;s the simple fact (please note that I really really REALLY don&amp;#39;t want to sound insensitive here; I&amp;#39;m just trying to be as blunt and forward as possible) that, at least in my experience, fucked up people attract fucked up people, and relationships between BPD/bipolar suicidal people are incredibly volatile. It&amp;#39;s resulted in some really harsh breakups. Honestly, I don&amp;#39;t even know if my very recently ex-girlfriend is even alive. I haven&amp;#39;t heard from her at all, and all I could really do was call the police and her parents and friends. It sucks being so powerless.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a little off-topic, though. I also tried things like therapy and mantras and religion and all of those things, and I do have creative outlets and everything else. It&amp;#39;s cool, but it&amp;#39;s a band-aid like everything else (again, in my experience).&lt;/p&gt;\n\n&lt;p&gt;I just really don&amp;#39;t want to do this anymore. I haven&amp;#39;t for a long, long time. I&amp;#39;ve had a plan and a note ready since I was sixteen. &lt;em&gt;Sixteen!&lt;/em&gt; I hate the futility of living. I hate how ineffectual my efforts to permanently change anything are. I hate how I repeatedly, repeatedly fuck up again and again and again (went through two jobs THIS MONTH), to the point that when circumstances actually improve that I don&amp;#39;t &amp;quot;deserve&amp;quot; it, somehow. I hate being a burden on the people that either don&amp;#39;t feel this way or are just far, far stronger than me.&lt;/p&gt;\n\n&lt;p&gt;To me, it seems perfectly reasonable to just leave this game. I don&amp;#39;t want to be a part of it anymore. I just don&amp;#39;t want to hurt anybody.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know what I&amp;#39;m saying at this point. Thanks for reading to this point.&lt;/p&gt;\n\n&lt;p&gt;Fuck.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt; Relapsed on heroin. Feel fantastic. no real reason to care about anything or feel anything except warm itchiness&lt;/p&gt;\n\n&lt;p&gt;but i&amp;#39;ll wanna die again in the morning&lt;/p&gt;\n\n&lt;p&gt;yay life&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, everyone. I made an account on Reddit specifically for this occasion. \n\nI've had a rough go of it, lately. I woke up yesterday morning with a girlfriend and a job. I now have neither. While I know that that's far from the worst thing that can happen to a person- hell, it's not the worst thing that's happened to *me*- it really drags up the depression I've been experiencing for quite a long time.\n\nI know that I'll feel better, you know? I know that, eventually, I'll be at a totally different level of experience (the mountaintop to this valley, so to speak) and think, \"Well, shit, I'm sure glad I didn't die!\"\n\nThe thing is, though, that there will *absolutely* be another valley just like this one. I'll then think, \"Well, shit, why the FUCK did I ever want to live?\" I often wonder why it's more valid to chase the highs rather than to just avoid the lows (other than obvious things like social ties and the like- more on that in a second).\n\nI've been involved pretty heavily involved in drugs and alcohol for a long time. At first, it was when some seriously fucked up shit was going on (I'd prefer not to get into it) and I was honestly, legitimately feeling suicidal for the first time. I was thirteen. I guess I thought it would numb me from how awful I felt. I mean... heroin does, and booze kind of does, and weed's better than being sober, but all the rest didn't do a hell of a lot for my outlook, even temporarily. Also, it goes without saying that upon coming down, things got even worse than before.\n\nAll that said, sobering up completely didn't help at all, either. That was worse, I think, since there was no relief to be found at all.\n\nThen I started having a lot of sex, you know? I'm from a pretty small town, and am bisexual, so queer men were kind of hard to come by. I was popular, and that, too, served to hold it off for a while. That ended up making me feel filthier than heroin or meth ever could, and besides sex is so, so seldom ever \"just\" sex.\n\nSo then romance was my next option. That was the most effective, I think, but the comedown is always far, FAR worse than any drug's would be. Plus, there's the simple fact (please note that I really really REALLY don't want to sound insensitive here; I'm just trying to be as blunt and forward as possible) that, at least in my experience, fucked up people attract fucked up people, and relationships between BPD/bipolar suicidal people are incredibly volatile. It's resulted in some really harsh breakups. Honestly, I don't even know if my very recently ex-girlfriend is even alive. I haven't heard from her at all, and all I could really do was call the police and her parents and friends. It sucks being so powerless.\n\nI'm a little off-topic, though. I also tried things like therapy and mantras and religion and all of those things, and I do have creative outlets and everything else. It's cool, but it's a band-aid like everything else (again, in my experience).\n\nI just really don't want to do this anymore. I haven't for a long, long time. I've had a plan and a note ready since I was sixteen. *Sixteen!* I hate the futility of living. I hate how ineffectual my efforts to permanently change anything are. I hate how I repeatedly, repeatedly fuck up again and again and again (went through two jobs THIS MONTH), to the point that when circumstances actually improve that I don't \"deserve\" it, somehow. I hate being a burden on the people that either don't feel this way or are just far, far stronger than me.\n\nTo me, it seems perfectly reasonable to just leave this game. I don't want to be a part of it anymore. I just don't want to hurt anybody.\n\nI don't even know what I'm saying at this point. Thanks for reading to this point.\n\nFuck.\n\n**EDIT:** Relapsed on heroin. Feel fantastic. no real reason to care about anything or feel anything except warm itchiness\n\nbut i'll wanna die again in the morning\n\nyay life", "likes": null, "secure_media": null, "link_flair_text": null, "id": "251jzq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "maxwellanderson", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399592216.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/251jzq/the_validity_of_getting_better/", "name": "t3_251jzq", "created": 1399587818.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/251jzq/the_validity_of_getting_better/", "author_flair_text": null, "title": "The Validity of Getting Better", "created_utc": 1399559018.0, "ups": 6, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcscb4", "gilded": 0, "author": "taufish", "parent_id": "t3_251jzq", "approved_by": null, "body": "Hey maxwellanderson,\n\nFirst of all, I commend your ability to articulate your situation so thoroughly and openly. It sounds like you have been broadsided recently. Strange as it is to say, I am glad to hear that you have been through things like this before. It means that you understand that feelings and struggles are not static and automatically permanent. \n\nYou are very wise to notice that volatile people attract each other and then react to each other, oftentimes violently (physically or otherwise). You have a great deal of clarity about your situation, which is good to see when someone is desperate, as it gives you better tools to address the problems. \n\nWhen was the last time you tried talking to a therapist or counselor, if I may ask? Also, have you ever been on any meds?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey maxwellanderson,&lt;/p&gt;\n\n&lt;p&gt;First of all, I commend your ability to articulate your situation so thoroughly and openly. It sounds like you have been broadsided recently. Strange as it is to say, I am glad to hear that you have been through things like this before. It means that you understand that feelings and struggles are not static and automatically permanent. &lt;/p&gt;\n\n&lt;p&gt;You are very wise to notice that volatile people attract each other and then react to each other, oftentimes violently (physically or otherwise). You have a great deal of clarity about your situation, which is good to see when someone is desperate, as it gives you better tools to address the problems. &lt;/p&gt;\n\n&lt;p&gt;When was the last time you tried talking to a therapist or counselor, if I may ask? Also, have you ever been on any meds?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chcscb4", "created": 1399593307.0, "author_flair_text": null, "created_utc": 1399564507.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chd8wc3", "gilded": 0, "author": "billyup", "parent_id": "t1_chd59zw", "approved_by": null, "body": "(i'm assuming you're about 20-25) \n\nthere are things out there in life you don't like, right? well, what if in a couple years those things you don't like you started liking? as in types of music or types of people etc. yeah, i know now you might not see that as possible. that's one of those little unexpected things.\n\nthere is a hell of a lot more out there than sex, drugs, and romance. those things just aren't as dramatic as being high, being in love, or having an orgasm. learning to appreciate that is one more of those things you don't expect to happen.\n\n\n\ni feel like i'm just talking out my ass, but i'm on enough medication to realize i shouldn't trust what i feel.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(i&amp;#39;m assuming you&amp;#39;re about 20-25) &lt;/p&gt;\n\n&lt;p&gt;there are things out there in life you don&amp;#39;t like, right? well, what if in a couple years those things you don&amp;#39;t like you started liking? as in types of music or types of people etc. yeah, i know now you might not see that as possible. that&amp;#39;s one of those little unexpected things.&lt;/p&gt;\n\n&lt;p&gt;there is a hell of a lot more out there than sex, drugs, and romance. those things just aren&amp;#39;t as dramatic as being high, being in love, or having an orgasm. learning to appreciate that is one more of those things you don&amp;#39;t expect to happen.&lt;/p&gt;\n\n&lt;p&gt;i feel like i&amp;#39;m just talking out my ass, but i&amp;#39;m on enough medication to realize i shouldn&amp;#39;t trust what i feel.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chd8wc3", "created": 1399626980.0, "author_flair_text": null, "created_utc": 1399598180.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chd59zw", "gilded": 0, "author": "maxwellanderson", "parent_id": "t1_chd4hbs", "approved_by": null, "body": "You take it on faith; you take it to the heart...\n\nWhat do you mean? I'd enjoy hearing your perspective on what you mean by the fact that there's something... novel. Something that a human doesn't experience more or less within their first two decades of life. At the risk of sounding redundant, I just feel as if it's just stagnant.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You take it on faith; you take it to the heart...&lt;/p&gt;\n\n&lt;p&gt;What do you mean? I&amp;#39;d enjoy hearing your perspective on what you mean by the fact that there&amp;#39;s something... novel. Something that a human doesn&amp;#39;t experience more or less within their first two decades of life. At the risk of sounding redundant, I just feel as if it&amp;#39;s just stagnant.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chd59zw", "created": 1399619466.0, "author_flair_text": null, "created_utc": 1399590666.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd4hbs", "gilded": 0, "author": "billyup", "parent_id": "t1_chcvytr", "approved_by": null, "body": "it made sense. and i can appreciate how you feel. Please remember though, that there is something new. the problem is we just don't realize it until it happens. waiting sucks though, right?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it made sense. and i can appreciate how you feel. Please remember though, that there is something new. the problem is we just don&amp;#39;t realize it until it happens. waiting sucks though, right?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chd4hbs", "created": 1399617672.0, "author_flair_text": null, "created_utc": 1399588872.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chcvytr", "gilded": 0, "author": "maxwellanderson", "parent_id": "t3_251jzq", "approved_by": null, "body": "Thank you both for caring, first of all. I probably should have addressed that in my original post.\n\nTaufish, Monday. I still attend therapy regularly (formerly, admittedly, at the behest of my girlfriend). I was on a few anti-depressants, sure, but there's not a lot they can do for BPD... that's part of what turned me off of the whole thing, to be sure. Thank you very much for the kind words!\n\nBillyup, I see what you're saying and there is without a doubt validity in it. My problem, though... it's not just the highs and lows that I'm sick of. I'm sick of walking. While this has all been very interesting, I feel no real attachment to life anymore. I don't fear death. I don't care, anymore, whether I wake up in the morning or not. It feels like everything I see is just a variation on what I've seen- *nihil novi sub sole,* you know? It's not only misery, it's bland misery. Am I making sense? Anyway, even if not, thanks for taking an interest.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you both for caring, first of all. I probably should have addressed that in my original post.&lt;/p&gt;\n\n&lt;p&gt;Taufish, Monday. I still attend therapy regularly (formerly, admittedly, at the behest of my girlfriend). I was on a few anti-depressants, sure, but there&amp;#39;s not a lot they can do for BPD... that&amp;#39;s part of what turned me off of the whole thing, to be sure. Thank you very much for the kind words!&lt;/p&gt;\n\n&lt;p&gt;Billyup, I see what you&amp;#39;re saying and there is without a doubt validity in it. My problem, though... it&amp;#39;s not just the highs and lows that I&amp;#39;m sick of. I&amp;#39;m sick of walking. While this has all been very interesting, I feel no real attachment to life anymore. I don&amp;#39;t fear death. I don&amp;#39;t care, anymore, whether I wake up in the morning or not. It feels like everything I see is just a variation on what I&amp;#39;ve seen- &lt;em&gt;nihil novi sub sole,&lt;/em&gt; you know? It&amp;#39;s not only misery, it&amp;#39;s bland misery. Am I making sense? Anyway, even if not, thanks for taking an interest.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chcvytr", "created": 1399600525.0, "author_flair_text": null, "created_utc": 1399571725.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcua3z", "gilded": 0, "author": "billyup", "parent_id": "t3_251jzq", "approved_by": null, "body": "I've felt all of this before, i've also been composing a new letter every couple years for 15 years. I've come to a conclusion that at times keeps me going. the climb is the best part. \n\n\nthe trick is to not care what got you to where you are or where you're going whether you're in a good place or bad one. just look at your feet, keep them moving. are they covered in mud? clean them off. are they shackled together? break those fucking chains. they'll never be completely clean, and the marks on your ankles with always be there. but all the dirt and the scars in the world can't stop you from walking.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve felt all of this before, i&amp;#39;ve also been composing a new letter every couple years for 15 years. I&amp;#39;ve come to a conclusion that at times keeps me going. the climb is the best part. &lt;/p&gt;\n\n&lt;p&gt;the trick is to not care what got you to where you are or where you&amp;#39;re going whether you&amp;#39;re in a good place or bad one. just look at your feet, keep them moving. are they covered in mud? clean them off. are they shackled together? break those fucking chains. they&amp;#39;ll never be completely clean, and the marks on your ankles with always be there. but all the dirt and the scars in the world can&amp;#39;t stop you from walking.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_251jzq", "score_hidden": false, "name": "t1_chcua3z", "created": 1399597264.0, "author_flair_text": null, "created_utc": 1399568464.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]