[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve come to the realization that no matter what I do that my family will never be satisfied with who I am. Surprisingly that&amp;#39;s not the case for my big sister who is perfect. Everything I do and fail at is compared to her. It&amp;#39;s really futile for me to try to claim any respect. The only time my parents comment on me is when I have screwed up somehow or when they want to rip on me by pointedly asking why I haven&amp;#39;t accomplished some life milestone. Sometimes it doesn&amp;#39;t even make sense. Like my mum complains about my ugly mug and asks why I don&amp;#39;t just wash it more with soap. But she was in the bloody doctor&amp;#39;s office when he said that washing more than twice a day can be damaging by drying out the skin and ironically leading to more acne.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been feeling kind of weird all week. Just today I got sick of sitting alone at lunch. So I walked out to the corner, and found some stairs. I walked up them absent-mindedly until I finally got to a door labeled, &amp;quot;ROOF.&amp;quot; It was locked. I turned around, and the the empty air on my floor was continuous with the void that extended many floors down. I looked down and I thought to myself, &amp;quot;What would happen if I jumped?&amp;quot; &amp;quot;Would it be like &amp;#39;splat!&amp;#39; or &amp;#39;crunch!&amp;#39;?&amp;quot; &amp;quot;Would it hurt?&amp;quot; I got dizzy and lost my balance, falling into the railing, bruising my knee. As I walked down I wondered if anyone would miss me if I were gone.&lt;/p&gt;\n\n&lt;p&gt;Most of my time is spent aimlessly browsing Tumblr any running with my dog. But I&amp;#39;ve gotten the feeling that he&amp;#39;s gotten bored with me. And I keep browsing even though I get bored. It&amp;#39;s kind of sad actually. There&amp;#39;s nothing new or really meaningful to see, but I keep clicking next even though I hate it. It&amp;#39;s like a mind numbing activity, not unlike watching TV or getting sloshed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've come to the realization that no matter what I do that my family will never be satisfied with who I am. Surprisingly that's not the case for my big sister who is perfect. Everything I do and fail at is compared to her. It's really futile for me to try to claim any respect. The only time my parents comment on me is when I have screwed up somehow or when they want to rip on me by pointedly asking why I haven't accomplished some life milestone. Sometimes it doesn't even make sense. Like my mum complains about my ugly mug and asks why I don't just wash it more with soap. But she was in the bloody doctor's office when he said that washing more than twice a day can be damaging by drying out the skin and ironically leading to more acne.\n\nI've been feeling kind of weird all week. Just today I got sick of sitting alone at lunch. So I walked out to the corner, and found some stairs. I walked up them absent-mindedly until I finally got to a door labeled, \"ROOF.\" It was locked. I turned around, and the the empty air on my floor was continuous with the void that extended many floors down. I looked down and I thought to myself, \"What would happen if I jumped?\" \"Would it be like 'splat!' or 'crunch!'?\" \"Would it hurt?\" I got dizzy and lost my balance, falling into the railing, bruising my knee. As I walked down I wondered if anyone would miss me if I were gone.\n\nMost of my time is spent aimlessly browsing Tumblr any running with my dog. But I've gotten the feeling that he's gotten bored with me. And I keep browsing even though I get bored. It's kind of sad actually. There's nothing new or really meaningful to see, but I keep clicking next even though I hate it. It's like a mind numbing activity, not unlike watching TV or getting sloshed.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23zt7y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "wwwwwwwwwwx", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23zt7y/theres_got_to_be_more_to_life_but_i_cant_see_it/", "name": "t3_23zt7y", "created": 1398499038.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23zt7y/theres_got_to_be_more_to_life_but_i_cant_see_it/", "author_flair_text": null, "title": "There's got to be more to life, but I can't see it", "created_utc": 1398470238.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch27mu2", "gilded": 0, "author": "shallpass2u", "parent_id": "t3_23zt7y", "approved_by": null, "body": "There is more to life but I understand it can be hard to see at times. Can offer a sympathetic ear if you want to talk for awhile. Been any changes this week that might account for the weirdness?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is more to life but I understand it can be hard to see at times. Can offer a sympathetic ear if you want to talk for awhile. Been any changes this week that might account for the weirdness?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23zt7y", "score_hidden": false, "name": "t1_ch27mu2", "created": 1398502106.0, "author_flair_text": null, "created_utc": 1398473306.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]