[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She likened it to &amp;quot;ripping off a Band-Aid&amp;quot;.  Like it wasn&amp;#39;t real, like it was just a crutch or something.  Like it would somehow be better for both of us.&lt;/p&gt;\n\n&lt;p&gt;The other three live across the Pacific Ocean; two are my parents who are basically required by natural law to love me, and the last (my brother) doesn&amp;#39;t talk to me anymore.  I think he was able to get beyond the blood-bias and see how worthless and pathetic I really am.&lt;/p&gt;\n\n&lt;p&gt;I feel like the dirty Band-Aid.  Covered in crusted puss.  Disgusting trash.  Nobody wants to touch it or come near it.  I might infect them all my unfounded misery, like I did to my girlfriend.  Toss it and let it rot away to nothing.&lt;/p&gt;\n\n&lt;p&gt;Everybody dies.  I suppose we&amp;#39;re all sadists, in that we &lt;em&gt;want&lt;/em&gt; people to be sad when we die.  Otherwise, we never meant anything.  Why postpone it until the only people who still care about me are gone too?&lt;/p&gt;\n\n&lt;p&gt;I feel like just driving up the mountain and getting out and walking until I can&amp;#39;t walk anymore.  I&amp;#39;d give it a couple weeks until someone even noticed I was gone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "She likened it to \"ripping off a Band-Aid\".  Like it wasn't real, like it was just a crutch or something.  Like it would somehow be better for both of us.\n\nThe other three live across the Pacific Ocean; two are my parents who are basically required by natural law to love me, and the last (my brother) doesn't talk to me anymore.  I think he was able to get beyond the blood-bias and see how worthless and pathetic I really am.\n\nI feel like the dirty Band-Aid.  Covered in crusted puss.  Disgusting trash.  Nobody wants to touch it or come near it.  I might infect them all my unfounded misery, like I did to my girlfriend.  Toss it and let it rot away to nothing.\n\nEverybody dies.  I suppose we're all sadists, in that we *want* people to be sad when we die.  Otherwise, we never meant anything.  Why postpone it until the only people who still care about me are gone too?\n\nI feel like just driving up the mountain and getting out and walking until I can't walk anymore.  I'd give it a couple weeks until someone even noticed I was gone.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "253q84", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "muelboy", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/253q84/there_are_four_people_in_my_life_who_have_been/", "name": "t3_253q84", "created": 1399637596.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/253q84/there_are_four_people_in_my_life_who_have_been/", "author_flair_text": null, "title": "There are four people in my life who have been the only things keeping me from killing myself for the last year. One of those people just broke up with me after being together for 4 years.", "created_utc": 1399608796.0, "ups": 3, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chez9p3", "gilded": 0, "author": "tazer84", "parent_id": "t1_chdy94n", "approved_by": null, "body": "They told me in AA that only an alcoholic can talk to another alcoholic. I'm not saying you're one (hell you might not even drink), but if two people can relate to each other on one thing they probably have more in common than just that one feels. PM me if you want to talk some more.", "edited": 1399785364.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They told me in AA that only an alcoholic can talk to another alcoholic. I&amp;#39;m not saying you&amp;#39;re one (hell you might not even drink), but if two people can relate to each other on one thing they probably have more in common than just that one feels. PM me if you want to talk some more.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chez9p3", "created": 1399813165.0, "author_flair_text": null, "created_utc": 1399784365.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdy94n", "gilded": 0, "author": "muelboy", "parent_id": "t1_chdnews", "approved_by": null, "body": "thank you for putting this in perspective this is exactly how i feel", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you for putting this in perspective this is exactly how i feel&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chdy94n", "created": 1399698024.0, "author_flair_text": null, "created_utc": 1399669224.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chezgu2", "gilded": 0, "author": "tazer84", "parent_id": "t1_chesv6w", "approved_by": null, "body": "You're very welcome. Thanks for letting me share :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re very welcome. Thanks for letting me share :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chezgu2", "created": 1399813825.0, "author_flair_text": null, "created_utc": 1399785025.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chesv6w", "gilded": 0, "author": "DaddyPleaseNo", "parent_id": "t1_chdnews", "approved_by": null, "body": "One of the best things I have ever read. I'm not suicidal, came here to help others actually. But I have been sad for a long time about an ex and just...wow. Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the best things I have ever read. I&amp;#39;m not suicidal, came here to help others actually. But I have been sad for a long time about an ex and just...wow. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chesv6w", "created": 1399795547.0, "author_flair_text": null, "created_utc": 1399766747.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdnews", "gilded": 0, "author": "tazer84", "parent_id": "t3_253q84", "approved_by": null, "body": "I don't know your story, but I would like to tell you some of mine. For me, it was never about the girls. When I think about them, I would have done anything for them and yet they still left. But it wasn't really them I missed. When things ended, what crushed me wasn't the leaving, it was them leaving with my life. With the *feelings* I had of being wanted, of being loved, of having a purpose. I needed meaning and companionship and a shoulder and when I found it, I clenched it like a mad man. Finally, I feel good. Finally, I feel better. This woman, she'll save me. And I in turn will make my life about nothing but keeping her happy. And she'll spend time with me, forever. Goodbye loneliness and hello my angel.\n\nBut I didn't love them. Not really. I cared about them as human beings in the sense I don't want bad things to happen to them. But what I was enraptured by was that they made me feel not so shitty about myself. Even now, even after their faces have faded from memory, its not them that I miss. Its the memory of the feelings that I lost that haunts me.\n\nI thought I was worthless. Of course they didn't stay, I'm not a \"catch\". But that wasn't true. The truth was I am ill. It is an illness of the head. I didn't put it there, but it got in and grew and rotted me from the inside out. I am not a piece of shit. I am a good man who is very, *very* sick. My friends didn't leave because I was bad, they left because it hurt too much to see me so sick. The women didn't leave because they didn't care, they left because they didn't know how to deal with how sick I was. Can you see why she might have called it \"ripping of a band-aid\"? All these girls I knew, they covered up the bleeding for a time, but they never really fixed why I was bleeding in the first place.\n\nWhen your body gets sick, you find a doctor to treat it. No matter how strong I am, a cold can still kill me without a doctor to help. So I did what any other sick person would do, I found a doctor. This one just happens to be of the mind. And by being totally honest with her about how I felt, just a like any other doctor, she diagnosed the disease I had and we began the process of treating it. She's helping heal what those band-aids never did.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know your story, but I would like to tell you some of mine. For me, it was never about the girls. When I think about them, I would have done anything for them and yet they still left. But it wasn&amp;#39;t really them I missed. When things ended, what crushed me wasn&amp;#39;t the leaving, it was them leaving with my life. With the &lt;em&gt;feelings&lt;/em&gt; I had of being wanted, of being loved, of having a purpose. I needed meaning and companionship and a shoulder and when I found it, I clenched it like a mad man. Finally, I feel good. Finally, I feel better. This woman, she&amp;#39;ll save me. And I in turn will make my life about nothing but keeping her happy. And she&amp;#39;ll spend time with me, forever. Goodbye loneliness and hello my angel.&lt;/p&gt;\n\n&lt;p&gt;But I didn&amp;#39;t love them. Not really. I cared about them as human beings in the sense I don&amp;#39;t want bad things to happen to them. But what I was enraptured by was that they made me feel not so shitty about myself. Even now, even after their faces have faded from memory, its not them that I miss. Its the memory of the feelings that I lost that haunts me.&lt;/p&gt;\n\n&lt;p&gt;I thought I was worthless. Of course they didn&amp;#39;t stay, I&amp;#39;m not a &amp;quot;catch&amp;quot;. But that wasn&amp;#39;t true. The truth was I am ill. It is an illness of the head. I didn&amp;#39;t put it there, but it got in and grew and rotted me from the inside out. I am not a piece of shit. I am a good man who is very, &lt;em&gt;very&lt;/em&gt; sick. My friends didn&amp;#39;t leave because I was bad, they left because it hurt too much to see me so sick. The women didn&amp;#39;t leave because they didn&amp;#39;t care, they left because they didn&amp;#39;t know how to deal with how sick I was. Can you see why she might have called it &amp;quot;ripping of a band-aid&amp;quot;? All these girls I knew, they covered up the bleeding for a time, but they never really fixed why I was bleeding in the first place.&lt;/p&gt;\n\n&lt;p&gt;When your body gets sick, you find a doctor to treat it. No matter how strong I am, a cold can still kill me without a doctor to help. So I did what any other sick person would do, I found a doctor. This one just happens to be of the mind. And by being totally honest with her about how I felt, just a like any other doctor, she diagnosed the disease I had and we began the process of treating it. She&amp;#39;s helping heal what those band-aids never did.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chdnews", "created": 1399675299.0, "author_flair_text": null, "created_utc": 1399646499.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chde303", "gilded": 0, "author": "Travask", "parent_id": "t3_253q84", "approved_by": null, "body": "You are wrong to say you are what you are, you are here for a reason, you just gotta find it and keep going, the drive is necessary and killing ones self is just the easy way that a strong person such as yourself shouldn't even consider, try talking to your family, think about how good of a human being you are to be able to keep a relationship for 4 years, I know dirt bags who can even keep one up for 4 days, you are a good spirit and you will always be needed when your life opens up to you!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are wrong to say you are what you are, you are here for a reason, you just gotta find it and keep going, the drive is necessary and killing ones self is just the easy way that a strong person such as yourself shouldn&amp;#39;t even consider, try talking to your family, think about how good of a human being you are to be able to keep a relationship for 4 years, I know dirt bags who can even keep one up for 4 days, you are a good spirit and you will always be needed when your life opens up to you!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chde303", "created": 1399638117.0, "author_flair_text": null, "created_utc": 1399609317.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chde3hm", "gilded": 0, "author": "MinigunsAndEagles", "parent_id": "t3_253q84", "approved_by": null, "body": "I know that it feels hard right now, but you have to keep going. You're not pathetic. I promise. Just go out and make something of yourself. I'm here to talk if you need to.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that it feels hard right now, but you have to keep going. You&amp;#39;re not pathetic. I promise. Just go out and make something of yourself. I&amp;#39;m here to talk if you need to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_253q84", "score_hidden": false, "name": "t1_chde3hm", "created": 1399638152.0, "author_flair_text": null, "created_utc": 1399609352.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]