[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently in my first year of university doing a couple classes I failed/dropped during the semester and my parents are understandably disappointed, and they pretty much told me my best isn&amp;#39;t good enough. I admit not all of my grades have been the best, but with what they keep telling it seems like they think I&amp;#39;m just a piece of shit with no motivation and I just enjoy being a complete failure. Even when I have done well in school they still weren&amp;#39;t satisfied, really no matter what I&amp;#39;m just not good enough. They say I should be doing it for myself and I am, and I&amp;#39;m truly trying my hardest and I&amp;#39;m trying to figure things out but they keep treating me like I&amp;#39;m a complete idiot and it was a waste to ever allow me to go to university in the first place. I&amp;#39;m just really tired of feeling like such a disappointment, and even though the courses I&amp;#39;m in right now are actually going pretty well so far, my parents give me the impression I should just give up cause clearly I can&amp;#39;t do it in their eyes. I really don&amp;#39;t feel like I have anything to offer to anyone as I&amp;#39;m not good at anything, and therefore just not the worth the effort to tolerate. It seems like things would be a lot better off if I just ceased to live. I feel bad at the thought of how sad my friends would be about it, since they clearly care about me and when I&amp;#39;m with them I feel like dying by my own hand wouldn&amp;#39;t be worth it and maybe I&amp;#39;m not as bad as I think, but I can&amp;#39;t stand to feel so worthless in pretty much everyone else&amp;#39;s. I&amp;#39;m just not worth it to have around. Everything I do ends in failure, so why even try, when the end result is the same no matter what?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm currently in my first year of university doing a couple classes I failed/dropped during the semester and my parents are understandably disappointed, and they pretty much told me my best isn't good enough. I admit not all of my grades have been the best, but with what they keep telling it seems like they think I'm just a piece of shit with no motivation and I just enjoy being a complete failure. Even when I have done well in school they still weren't satisfied, really no matter what I'm just not good enough. They say I should be doing it for myself and I am, and I'm truly trying my hardest and I'm trying to figure things out but they keep treating me like I'm a complete idiot and it was a waste to ever allow me to go to university in the first place. I'm just really tired of feeling like such a disappointment, and even though the courses I'm in right now are actually going pretty well so far, my parents give me the impression I should just give up cause clearly I can't do it in their eyes. I really don't feel like I have anything to offer to anyone as I'm not good at anything, and therefore just not the worth the effort to tolerate. It seems like things would be a lot better off if I just ceased to live. I feel bad at the thought of how sad my friends would be about it, since they clearly care about me and when I'm with them I feel like dying by my own hand wouldn't be worth it and maybe I'm not as bad as I think, but I can't stand to feel so worthless in pretty much everyone else's. I'm just not worth it to have around. Everything I do ends in failure, so why even try, when the end result is the same no matter what?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250afn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "This_Is_My_Tigersuit", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250afn/theres_no_point/", "name": "t3_250afn", "created": 1399544335.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250afn/theres_no_point/", "author_flair_text": null, "title": "there's no point", "created_utc": 1399515535.0, "ups": 6, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcefny", "gilded": 0, "author": "Killsranq", "parent_id": "t3_250afn", "approved_by": null, "body": "High school here. Dad told me at the beginning of high school that maybe he shouldnt have sent me to school in the first place because of bad performance in middle school\n\nmade me feel like shit\n\nlike everything i did my whole life was just as shit as i was.\n\nbut let me tell you one thing. There is nothing more worth it. Nothing better than proving his ass wrong. Nothing has felt better.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;High school here. Dad told me at the beginning of high school that maybe he shouldnt have sent me to school in the first place because of bad performance in middle school&lt;/p&gt;\n\n&lt;p&gt;made me feel like shit&lt;/p&gt;\n\n&lt;p&gt;like everything i did my whole life was just as shit as i was.&lt;/p&gt;\n\n&lt;p&gt;but let me tell you one thing. There is nothing more worth it. Nothing better than proving his ass wrong. Nothing has felt better.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250afn", "score_hidden": false, "name": "t1_chcefny", "created": 1399544876.0, "author_flair_text": null, "created_utc": 1399516076.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcgauf", "gilded": 0, "author": "Schrodingerist", "parent_id": "t3_250afn", "approved_by": null, "body": "I feel for you. I'm another college student, and my parents have high expectations for me too, and it's hard juggling and balancing expectations and efforts.\n\nFailure is inevitable in life, but that doesn't mean your life itself is a failure. Opportunities are everywhere, and even if a wind blows one door shut, another one opens. College might not fit for you, but plenty of people have found happiness through other revenues of success.\n\nStay strong.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel for you. I&amp;#39;m another college student, and my parents have high expectations for me too, and it&amp;#39;s hard juggling and balancing expectations and efforts.&lt;/p&gt;\n\n&lt;p&gt;Failure is inevitable in life, but that doesn&amp;#39;t mean your life itself is a failure. Opportunities are everywhere, and even if a wind blows one door shut, another one opens. College might not fit for you, but plenty of people have found happiness through other revenues of success.&lt;/p&gt;\n\n&lt;p&gt;Stay strong.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250afn", "score_hidden": false, "name": "t1_chcgauf", "created": 1399549349.0, "author_flair_text": null, "created_utc": 1399520549.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcgh5m", "gilded": 0, "author": "MattColt", "parent_id": "t3_250afn", "approved_by": null, "body": "I'm currently in highschool, so I can't pretend to understand how hard it is to do well in college. What I can understand is the grades and your constantly disappointed parents. I'm in the same boat where no matter what I do there is something I am doing wrong, whenever I reach the end of the race and I feel like I deserve a prize I find out that the fucking race has been extended. I truly dislike everyone in my family, so for me the thought of grieving family has never held me back from thoughts of suicide. The only thing that has really helped me succeed, is thinking about one thing. The future me. I feel like I need to work through the pain  even if there is a chance that there is some great happiness I can have in the future. Also stop feeling like you owe your family anything, it seems counter intuitive but you really have to stop giving a fuck in order to find out what you truly care about. I've always had a hard time with grades, and I've always thought most of the subjects I study are boring or stupid if there is no chance of me wanting to pursue a career in them. And I could run away tonight from everything around me and live in the woods and live off the earth. But what if in five years I decide \"oh shit\" I do actually want to work as lawyer or something like that. \n\nTLDR: Shit sucks. Your family is not being the best that they can be. Fuck them, worry about providing for your future self, and forget the past. You be you, and remember that me and a bunch of other people who don't get this shit are here fucked up with you.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently in highschool, so I can&amp;#39;t pretend to understand how hard it is to do well in college. What I can understand is the grades and your constantly disappointed parents. I&amp;#39;m in the same boat where no matter what I do there is something I am doing wrong, whenever I reach the end of the race and I feel like I deserve a prize I find out that the fucking race has been extended. I truly dislike everyone in my family, so for me the thought of grieving family has never held me back from thoughts of suicide. The only thing that has really helped me succeed, is thinking about one thing. The future me. I feel like I need to work through the pain  even if there is a chance that there is some great happiness I can have in the future. Also stop feeling like you owe your family anything, it seems counter intuitive but you really have to stop giving a fuck in order to find out what you truly care about. I&amp;#39;ve always had a hard time with grades, and I&amp;#39;ve always thought most of the subjects I study are boring or stupid if there is no chance of me wanting to pursue a career in them. And I could run away tonight from everything around me and live in the woods and live off the earth. But what if in five years I decide &amp;quot;oh shit&amp;quot; I do actually want to work as lawyer or something like that. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Shit sucks. Your family is not being the best that they can be. Fuck them, worry about providing for your future self, and forget the past. You be you, and remember that me and a bunch of other people who don&amp;#39;t get this shit are here fucked up with you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250afn", "score_hidden": false, "name": "t1_chcgh5m", "created": 1399549800.0, "author_flair_text": null, "created_utc": 1399521000.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chchslx", "gilded": 0, "author": "jennylikestorres", "parent_id": "t3_250afn", "approved_by": null, "body": "I know its a typical cliche thing to say, but you are young. Now I am not saying that in a \"oh your too young to know what your saying\" type of way. What I mean is that youth is a rare and short moment in your life. Literally you are considered young for like less than a 1/4 of your life, so there is still so much you need to see and experience in order to truly understand how awesome you are and can be.\n\nI know exactly what you are going through. I'm a community college student (yay) and I have too many withdrawals on my transcript. I can remember every time I decided to drop a class, I would just start crying. Just like you, I would fall down an ugly slope of hate and regret and doubt; just nasty negative thoughts continually growing in my head. After many dropped classes, I realized that it is OK to feel a little bad when you do bad in a class, because it is guilt. I knew that I was capable of doing well in these classes, I just chose not to. There are two types of smart people; those who are just naturally intelligent and those are who recognize their faults and work twice as hard to keep up with the intelligent. I lost focus of what I wanted in life, what the point of me being in college was and lost my motivation. Your not going to be good at everything, nobody, NOBODY IS. But you can be good at one thing. And it will take time for you to explore and find out what that thing is.\nIf you say you are pursuing your education for yourself, then all those mean things your parents are saying shouldn't faze you. Yes; it is okay for you to care what your parents think, but they're your parents. Seeing their kid struggle in classes or at anything causes them to worry and panic that you will lose opportunities for success. I'm sure you know that they love you and they only want you to have a future ten times better then them. Sometimes, people don't know how to react to worry and instead say mean things. Just focus on yourself and your school and eventually those mean things they say will go away and hey, maybe turn into really nice things.\nIf you feel bad about leaving your friends, that pretty much shows how cool of a friend you are and how your loss would be A LOSS. TO PEOPLE. PEOPLE WHO CARE ABOUT WHO YOU ARE AND NOT WHAT YOU HAVE OR YOUR MONEY OR WHAT YOU OFFER THEM.\nYou say you don't have anything to offer anyone? Not good at anything? That's okay! Most people aren't! But they want to be! \nThink about homeless people, who day by day sit in streets alone, and what their reasons to live are. Think about how many people own instruments they don't even play. It sits and collects dust but it is a motivation to pursue an interest, so maybe one day they will pick it up.\n But you my friend are young. You've heard of the saying \"Youth is wasted on the young\"? Think about that quote.  I think about it everyday to help motivate me to get things going in my life, to pick up that guitar, to talk to that girl/boy. Because you only got one life and you might as well make it count.", "edited": 1399525264.0, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know its a typical cliche thing to say, but you are young. Now I am not saying that in a &amp;quot;oh your too young to know what your saying&amp;quot; type of way. What I mean is that youth is a rare and short moment in your life. Literally you are considered young for like less than a 1/4 of your life, so there is still so much you need to see and experience in order to truly understand how awesome you are and can be.&lt;/p&gt;\n\n&lt;p&gt;I know exactly what you are going through. I&amp;#39;m a community college student (yay) and I have too many withdrawals on my transcript. I can remember every time I decided to drop a class, I would just start crying. Just like you, I would fall down an ugly slope of hate and regret and doubt; just nasty negative thoughts continually growing in my head. After many dropped classes, I realized that it is OK to feel a little bad when you do bad in a class, because it is guilt. I knew that I was capable of doing well in these classes, I just chose not to. There are two types of smart people; those who are just naturally intelligent and those are who recognize their faults and work twice as hard to keep up with the intelligent. I lost focus of what I wanted in life, what the point of me being in college was and lost my motivation. Your not going to be good at everything, nobody, NOBODY IS. But you can be good at one thing. And it will take time for you to explore and find out what that thing is.\nIf you say you are pursuing your education for yourself, then all those mean things your parents are saying shouldn&amp;#39;t faze you. Yes; it is okay for you to care what your parents think, but they&amp;#39;re your parents. Seeing their kid struggle in classes or at anything causes them to worry and panic that you will lose opportunities for success. I&amp;#39;m sure you know that they love you and they only want you to have a future ten times better then them. Sometimes, people don&amp;#39;t know how to react to worry and instead say mean things. Just focus on yourself and your school and eventually those mean things they say will go away and hey, maybe turn into really nice things.\nIf you feel bad about leaving your friends, that pretty much shows how cool of a friend you are and how your loss would be A LOSS. TO PEOPLE. PEOPLE WHO CARE ABOUT WHO YOU ARE AND NOT WHAT YOU HAVE OR YOUR MONEY OR WHAT YOU OFFER THEM.\nYou say you don&amp;#39;t have anything to offer anyone? Not good at anything? That&amp;#39;s okay! Most people aren&amp;#39;t! But they want to be! \nThink about homeless people, who day by day sit in streets alone, and what their reasons to live are. Think about how many people own instruments they don&amp;#39;t even play. It sits and collects dust but it is a motivation to pursue an interest, so maybe one day they will pick it up.\n But you my friend are young. You&amp;#39;ve heard of the saying &amp;quot;Youth is wasted on the young&amp;quot;? Think about that quote.  I think about it everyday to help motivate me to get things going in my life, to pick up that guitar, to talk to that girl/boy. Because you only got one life and you might as well make it count.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250afn", "score_hidden": false, "name": "t1_chchslx", "created": 1399528210.0, "author_flair_text": null, "created_utc": 1399524610.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]