[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am tired of suffering from my mental issues, financial issues and the fact that my life is fucked. I was abused as a child, stolen from as a teen and disregarded as a loser as an adult. I hate myself for everything. For not being able to do better, for treating myself like shit, for fucking everything. I have wanted to kill myself for years. Why am I still alive. because I care about other people way to fucking much. I hide my true self from my little sister(she is 18 i am 22). I act like this stable high and mighty guy that has it all figured out and that I am this problem solver that will always be there for her to fix her problems. Her life is getting really good, she is getting help and is over coming her childhood abuse and starting on a very promising career. She is fucking 18 and has been asked to perform a speech because she is doing that good. If I kill myself what will happen to her. But what about me? No one will EVER love me for who I am, I am too far gone and too fucked up in the head. I will always be in mental and physical pain. People at work think I am great because I work until my hands bleed and I pass out from exhaustion. I WORK AS A STOCKER AND CASHIER!! You have to go days until you bleed and pass out. I work off the clock at night. Bitches don&amp;#39;t know I am doing it to distract myself from killing myself. But fuck it. I want to die. It is hell living knowing that you have never been loved by anyone who really knows you and that you will NEVER be loved. I act fake, act like somebody I am not for the sake of another. Is it too much to ask to suffer just a little less. I guess it is. Thank you for reading. Night.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am tired of suffering from my mental issues, financial issues and the fact that my life is fucked. I was abused as a child, stolen from as a teen and disregarded as a loser as an adult. I hate myself for everything. For not being able to do better, for treating myself like shit, for fucking everything. I have wanted to kill myself for years. Why am I still alive. because I care about other people way to fucking much. I hide my true self from my little sister(she is 18 i am 22). I act like this stable high and mighty guy that has it all figured out and that I am this problem solver that will always be there for her to fix her problems. Her life is getting really good, she is getting help and is over coming her childhood abuse and starting on a very promising career. She is fucking 18 and has been asked to perform a speech because she is doing that good. If I kill myself what will happen to her. But what about me? No one will EVER love me for who I am, I am too far gone and too fucked up in the head. I will always be in mental and physical pain. People at work think I am great because I work until my hands bleed and I pass out from exhaustion. I WORK AS A STOCKER AND CASHIER!! You have to go days until you bleed and pass out. I work off the clock at night. Bitches don't know I am doing it to distract myself from killing myself. But fuck it. I want to die. It is hell living knowing that you have never been loved by anyone who really knows you and that you will NEVER be loved. I act fake, act like somebody I am not for the sake of another. Is it too much to ask to suffer just a little less. I guess it is. Thank you for reading. Night.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240o1h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "deadto", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240o1h/there_is_nothing_more_that_i_want/", "name": "t3_240o1h", "created": 1398527735.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240o1h/there_is_nothing_more_that_i_want/", "author_flair_text": null, "title": "There is nothing more that I want", "created_utc": 1398498935.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2gb2w", "gilded": 0, "author": "LightAbsol", "parent_id": "t3_240o1h", "approved_by": null, "body": "It greatly saddens me to see you in such physical and mental distress. Your work sounds brutal; I understand you said that it helps keep your mind off of negative thoughts, but it sounds very painful physically. Do you have any other outlets? As for you and your sister, well...I don't think she'll think any less of you. She's your family. You support her and maybe now it can be her turn to support you :) You won't lose any manly points, promise! If not, is there any other family that you can talk to?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It greatly saddens me to see you in such physical and mental distress. Your work sounds brutal; I understand you said that it helps keep your mind off of negative thoughts, but it sounds very painful physically. Do you have any other outlets? As for you and your sister, well...I don&amp;#39;t think she&amp;#39;ll think any less of you. She&amp;#39;s your family. You support her and maybe now it can be her turn to support you :) You won&amp;#39;t lose any manly points, promise! If not, is there any other family that you can talk to?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240o1h", "score_hidden": false, "name": "t1_ch2gb2w", "created": 1398504433.0, "author_flair_text": null, "created_utc": 1398500833.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]