[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Holding on to the idea of dissapearing one day, is the only thing keeping me from commiting the act. I lack the constitution to go through with the act, part of me thinks its programming, another procrastination on my part. I am shit at life, shit at what my ancestors have provided for me. Ambition, direction and purpose have never meant anything great for me. It&amp;#39;s my mothers birthday soon, so I think I&amp;#39;ll dissapear after that. People will miss me but they have their own lives to lead. I&amp;#39;m not going to bring anyone down with my problems. There&amp;#39;s no reason for continuing this farce. There&amp;#39;s none at all. The reasons we do come up with there just to keep the great machine of humanity ticking. Oh how I wish someone would kill me. \nThe book I&amp;#39;ve ordered has come in, so I&amp;#39;ll go grab that and Johnny red and lull myself into some false pretension of state. Excuse the pathetic attitude, there&amp;#39;s just no more give.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Holding on to the idea of dissapearing one day, is the only thing keeping me from commiting the act. I lack the constitution to go through with the act, part of me thinks its programming, another procrastination on my part. I am shit at life, shit at what my ancestors have provided for me. Ambition, direction and purpose have never meant anything great for me. It's my mothers birthday soon, so I think I'll dissapear after that. People will miss me but they have their own lives to lead. I'm not going to bring anyone down with my problems. There's no reason for continuing this farce. There's none at all. The reasons we do come up with there just to keep the great machine of humanity ticking. Oh how I wish someone would kill me. \nThe book I've ordered has come in, so I'll go grab that and Johnny red and lull myself into some false pretension of state. Excuse the pathetic attitude, there's just no more give.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xgq2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "JohnnyMNU", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398409153.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xgq2/there_are_no_reasons/", "name": "t3_23xgq2", "created": 1398432467.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xgq2/there_are_no_reasons/", "author_flair_text": null, "title": "There are no reasons.", "created_utc": 1398403667.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1jkym", "gilded": 0, "author": "remington259", "parent_id": "t3_23xgq2", "approved_by": null, "body": "First off, let me tell you that you write exceedingly well. I wish I were reading this in a novel though and not on a self-help subreddit. You have literary talent and I hope when I'm done saying my piece, you'll consider another, less terminal route.\n\nThere are times when we all need to escape. Our lives are rarely so full or complete that we find ourselves wanting for nothing. We get tied down sometimes. Stuck in a never-ending tedium of work and non-work. Days, months, and years may go by without being able to enjoy the fruits of life. The flavors of happiness.\n\nIt's often of our own doings though.\n\nYou say purpose hasn't ever meant much to you but surely you've had dreams. Goals in your life no matter how astronomically absurd. The impossible or improbable future that you've always hoped to call your own?\n\nI'd like to believe that you haven't found your place yet. I haven't found mine either. I know what I want...but getting there is a battle only time can reveal the victor. The reward may be the journey itself even if I never reach my desired destination.\n\nI read some of your other posts to try and get a feel for who you are and I think (and I could be wrong) but I think what you're looking for is a challenge. Something to work against and strive for. Possibly a good woman or maybe just some accomplishment that has eluded you. Maybe you don't know what it is yet. \n\nYou make a lot of good points and being a realist, I agree that society has created a lot of issues that contravene the underlying needs of happiness and fulfillment for the average individual. It needlessly creates struggles where there honestly don't have to be any.\n\nBut there are other sides to life.  Other areas to explore both within and outside of society. There are games yet to be played. Places yet to be seen. Loves not yet loved. A world of things that have yet to experienced. Between your own free will and the unquantifiable variables that go into shaping each day of existence on this planet, I believe you can find happiness.\n\nAnd if you don't already write in a serious capacity...you really should. Write a novel or a collection of short stories. People will buy it. I would. Whether they be fictional introspective musings or a full-blown slice-of-life tale, you really should consider it. You have good diction which, as I said earlier, makes your writing a pleasure to read. I know my snotty bibliophile ex would agree on this particular point.\n\nI hope you'll try to embark on a new path of some kind. If you must disappear...do it figuratively as you go off on a new adventure. I sincerely hope you do.\n\nAnd P.S. Always good to find another Stargate fan out in the ether. Truly an excellent sci-fi show.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, let me tell you that you write exceedingly well. I wish I were reading this in a novel though and not on a self-help subreddit. You have literary talent and I hope when I&amp;#39;m done saying my piece, you&amp;#39;ll consider another, less terminal route.&lt;/p&gt;\n\n&lt;p&gt;There are times when we all need to escape. Our lives are rarely so full or complete that we find ourselves wanting for nothing. We get tied down sometimes. Stuck in a never-ending tedium of work and non-work. Days, months, and years may go by without being able to enjoy the fruits of life. The flavors of happiness.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s often of our own doings though.&lt;/p&gt;\n\n&lt;p&gt;You say purpose hasn&amp;#39;t ever meant much to you but surely you&amp;#39;ve had dreams. Goals in your life no matter how astronomically absurd. The impossible or improbable future that you&amp;#39;ve always hoped to call your own?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to believe that you haven&amp;#39;t found your place yet. I haven&amp;#39;t found mine either. I know what I want...but getting there is a battle only time can reveal the victor. The reward may be the journey itself even if I never reach my desired destination.&lt;/p&gt;\n\n&lt;p&gt;I read some of your other posts to try and get a feel for who you are and I think (and I could be wrong) but I think what you&amp;#39;re looking for is a challenge. Something to work against and strive for. Possibly a good woman or maybe just some accomplishment that has eluded you. Maybe you don&amp;#39;t know what it is yet. &lt;/p&gt;\n\n&lt;p&gt;You make a lot of good points and being a realist, I agree that society has created a lot of issues that contravene the underlying needs of happiness and fulfillment for the average individual. It needlessly creates struggles where there honestly don&amp;#39;t have to be any.&lt;/p&gt;\n\n&lt;p&gt;But there are other sides to life.  Other areas to explore both within and outside of society. There are games yet to be played. Places yet to be seen. Loves not yet loved. A world of things that have yet to experienced. Between your own free will and the unquantifiable variables that go into shaping each day of existence on this planet, I believe you can find happiness.&lt;/p&gt;\n\n&lt;p&gt;And if you don&amp;#39;t already write in a serious capacity...you really should. Write a novel or a collection of short stories. People will buy it. I would. Whether they be fictional introspective musings or a full-blown slice-of-life tale, you really should consider it. You have good diction which, as I said earlier, makes your writing a pleasure to read. I know my snotty bibliophile ex would agree on this particular point.&lt;/p&gt;\n\n&lt;p&gt;I hope you&amp;#39;ll try to embark on a new path of some kind. If you must disappear...do it figuratively as you go off on a new adventure. I sincerely hope you do.&lt;/p&gt;\n\n&lt;p&gt;And P.S. Always good to find another Stargate fan out in the ether. Truly an excellent sci-fi show.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xgq2", "score_hidden": false, "name": "t1_ch1jkym", "created": 1398410422.0, "author_flair_text": null, "created_utc": 1398406822.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1wmvp", "gilded": 0, "author": "Neuronomicon", "parent_id": "t1_ch1jswh", "approved_by": null, "body": "dude, I'm right there with you. I'm pretty much all of those things. The best thing to do is do a little at a time. All of the successful people out there didn't become that way all at once, they built off their previous successes a little at a time. If you have time I suggest you read the [top comment to this post](http://www.reddit.com/r/getdisciplined/comments/1q96b5/i_just_dont_care_about_myself/). It's helped me a lot.\n\nThe comment also spinned off it's own subreddit because it became so popular. /r/nonzeroday\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude, I&amp;#39;m right there with you. I&amp;#39;m pretty much all of those things. The best thing to do is do a little at a time. All of the successful people out there didn&amp;#39;t become that way all at once, they built off their previous successes a little at a time. If you have time I suggest you read the &lt;a href=\"http://www.reddit.com/r/getdisciplined/comments/1q96b5/i_just_dont_care_about_myself/\"&gt;top comment to this post&lt;/a&gt;. It&amp;#39;s helped me a lot.&lt;/p&gt;\n\n&lt;p&gt;The comment also spinned off it&amp;#39;s own subreddit because it became so popular. &lt;a href=\"/r/nonzeroday\"&gt;/r/nonzeroday&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xgq2", "score_hidden": false, "name": "t1_ch1wmvp", "created": 1398452363.0, "author_flair_text": null, "created_utc": 1398448763.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1jswh", "gilded": 0, "author": "JohnnyMNU", "parent_id": "t1_ch1jhxy", "approved_by": null, "body": "I like your user name.\nVarious issues, comparison to my friends and others that actually acheive things. I just drink, smoke and read, stagnating in my own inadequacy. Too damn lazy to live or survive, lost in the current of my own mood swings. I'm a liar, I'm undependable and regret far too much. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like your user name.\nVarious issues, comparison to my friends and others that actually acheive things. I just drink, smoke and read, stagnating in my own inadequacy. Too damn lazy to live or survive, lost in the current of my own mood swings. I&amp;#39;m a liar, I&amp;#39;m undependable and regret far too much. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xgq2", "score_hidden": false, "name": "t1_ch1jswh", "created": 1398436481.0, "author_flair_text": null, "created_utc": 1398407681.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1jhxy", "gilded": 0, "author": "Neuronomicon", "parent_id": "t3_23xgq2", "approved_by": null, "body": "For what it's worth you're a very creative writer. Sometimes I feel like my purpose is just to be a cog in humanity, not really meant to enjoy things myself. I also suffer from depression, it's hard to find meaning but maybe it's out there, and if you kill yourself you won't ever find out if it gets better.\n\nMay I ask why you think you're shit at life?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For what it&amp;#39;s worth you&amp;#39;re a very creative writer. Sometimes I feel like my purpose is just to be a cog in humanity, not really meant to enjoy things myself. I also suffer from depression, it&amp;#39;s hard to find meaning but maybe it&amp;#39;s out there, and if you kill yourself you won&amp;#39;t ever find out if it gets better.&lt;/p&gt;\n\n&lt;p&gt;May I ask why you think you&amp;#39;re shit at life?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xgq2", "score_hidden": false, "name": "t1_ch1jhxy", "created": 1398435292.0, "author_flair_text": null, "created_utc": 1398406492.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]