[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 15 y/o male for clarification. I&amp;#39;ve had suicidal thoughts before, and I&amp;#39;m kind of ashamed of it, but I&amp;#39;ve tried killing myself via carbon monoxide poisoning before. I had sleeping pills, a ton of aspirin, a blade, and little starter logs. As I was about to go through with what would have been a moderately painless but messy death, I broke down and cried myself into the next day and pretended nothing had happened.\nWhat started my descent into this hellish reality was a nasty breakup. I know, if I would be reading this i would probably facepalm, but it is what it is. After nearly coming up to a year together, she had written me a short note basically saying she cared about me but we should head of in our sperate paths. Our relationship was more than a typical high school relationship. We had spent hours together each day. Even the stupidest little things we did together were special to me. The days after were some of the worst. We see each other daily, and that isn&amp;#39;t really a good thing. It&amp;#39;s like a scab you refuse to let heal because you keep picking at it.\nThe 29th of this month will be 8 months without her. They were the worst months of my life. At one point, I had stooped to self mutilation, but I ended that 2 months after I started. Just recently, though, did that start up again due to something comparable to the breakup. My best female friend really screwed stuff up. We started to become more than friends, and then things got mildly intimate. I latched onto her like a lost, cold puppy finding loving arms. She took me out of my hateful, suicidal mindset, and she made shit seem worth putting up with. However, today... She spontaneously retracted everything. She isn&amp;#39;t the best person with words, so it was easy to see through what she was saying, so fuck me.\nOn top of female issues, there&amp;#39;s always a shitty family life to lift my self esteem. My father is always retorting me with irrational arguments, my mother being a deluded bitch, my younger brother constantly pretending as if he&amp;#39;s somehow intimidating, and my sister just keeps to her egocentric self. One of these days, I&amp;#39;m scared I&amp;#39;ll snap and I&amp;#39;ll be in more shit than had I&amp;#39;ve just killed myself in the first place. Suicide is a solution, 100% effective every time, it&amp;#39;s just not the best option... \nMy social life has disintegrated completely. I don&amp;#39;t talk to anyone, and I go to my room in my spare time to just cry and attempt to fall into a sleep-like trance. Every person who tried to take me under their wing ended up ditching me for someone else. Makes me feel good to know that I&amp;#39;m seemingly infinitely replaceable. I&amp;#39;m failing the majority of my classes at school, my teachers attempt showing some sort of sympathy, but it&amp;#39;s comparable to...I don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know where I was going with this. There&amp;#39;s so much I forgot to mention in this cluttered brick of text. I have no real friends anymore, and I need somebody. This looks like a dead end road, I don&amp;#39;t know how much longer I can do this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a 15 y/o male for clarification. I've had suicidal thoughts before, and I'm kind of ashamed of it, but I've tried killing myself via carbon monoxide poisoning before. I had sleeping pills, a ton of aspirin, a blade, and little starter logs. As I was about to go through with what would have been a moderately painless but messy death, I broke down and cried myself into the next day and pretended nothing had happened.\nWhat started my descent into this hellish reality was a nasty breakup. I know, if I would be reading this i would probably facepalm, but it is what it is. After nearly coming up to a year together, she had written me a short note basically saying she cared about me but we should head of in our sperate paths. Our relationship was more than a typical high school relationship. We had spent hours together each day. Even the stupidest little things we did together were special to me. The days after were some of the worst. We see each other daily, and that isn't really a good thing. It's like a scab you refuse to let heal because you keep picking at it.\nThe 29th of this month will be 8 months without her. They were the worst months of my life. At one point, I had stooped to self mutilation, but I ended that 2 months after I started. Just recently, though, did that start up again due to something comparable to the breakup. My best female friend really screwed stuff up. We started to become more than friends, and then things got mildly intimate. I latched onto her like a lost, cold puppy finding loving arms. She took me out of my hateful, suicidal mindset, and she made shit seem worth putting up with. However, today... She spontaneously retracted everything. She isn't the best person with words, so it was easy to see through what she was saying, so fuck me.\nOn top of female issues, there's always a shitty family life to lift my self esteem. My father is always retorting me with irrational arguments, my mother being a deluded bitch, my younger brother constantly pretending as if he's somehow intimidating, and my sister just keeps to her egocentric self. One of these days, I'm scared I'll snap and I'll be in more shit than had I've just killed myself in the first place. Suicide is a solution, 100% effective every time, it's just not the best option... \nMy social life has disintegrated completely. I don't talk to anyone, and I go to my room in my spare time to just cry and attempt to fall into a sleep-like trance. Every person who tried to take me under their wing ended up ditching me for someone else. Makes me feel good to know that I'm seemingly infinitely replaceable. I'm failing the majority of my classes at school, my teachers attempt showing some sort of sympathy, but it's comparable to...I don't know.\n\nI don't know where I was going with this. There's so much I forgot to mention in this cluttered brick of text. I have no real friends anymore, and I need somebody. This looks like a dead end road, I don't know how much longer I can do this.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23thmg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "TheRoosterDog", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23thmg/theres_no_point_the_past_is_just_going_to_repeat/", "name": "t3_23thmg", "created": 1398329809.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23thmg/theres_no_point_the_past_is_just_going_to_repeat/", "author_flair_text": null, "title": "There's no point. The past is just going to repeat itself, as it has for so long.", "created_utc": 1398301009.0, "ups": 6, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0oh7l", "gilded": 0, "author": "Louderr", "parent_id": "t3_23thmg", "approved_by": null, "body": "Hey man I know exactly how you feel.  I'm 17 and went through almost the same thing this year. \n\nI centered my entire life around a girl, and when she left after a year I had nothing. And honestly it's hard to look at all this, especially in our situation. We have so much ahead of us... It's kind of a blessing and a curse. \n\nSomething I learned is that teachers are willing to help. If you are worried about school (which I can honestly get if you aren't) just giving them a short explanation. Teachers are people too, and they really want the best for you. \n\nIt's cheesy af but I heard this in one of my school classes. Every day think of 3 things that you are thankful for. In the beginning it's hard af. But as weeks go by, you start to see yourself grow and notice things more. It sounds like some weird ass self help shit because.... Well it kind of is. But this shit made me view things in a different way. Which can be really important. \n\nPeople suck and high school is even worse. But the real world is nothing like this. So if you need anyone to talk too I'm here man. PM me or anything at all. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man I know exactly how you feel.  I&amp;#39;m 17 and went through almost the same thing this year. &lt;/p&gt;\n\n&lt;p&gt;I centered my entire life around a girl, and when she left after a year I had nothing. And honestly it&amp;#39;s hard to look at all this, especially in our situation. We have so much ahead of us... It&amp;#39;s kind of a blessing and a curse. &lt;/p&gt;\n\n&lt;p&gt;Something I learned is that teachers are willing to help. If you are worried about school (which I can honestly get if you aren&amp;#39;t) just giving them a short explanation. Teachers are people too, and they really want the best for you. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s cheesy af but I heard this in one of my school classes. Every day think of 3 things that you are thankful for. In the beginning it&amp;#39;s hard af. But as weeks go by, you start to see yourself grow and notice things more. It sounds like some weird ass self help shit because.... Well it kind of is. But this shit made me view things in a different way. Which can be really important. &lt;/p&gt;\n\n&lt;p&gt;People suck and high school is even worse. But the real world is nothing like this. So if you need anyone to talk too I&amp;#39;m here man. PM me or anything at all. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23thmg", "score_hidden": false, "name": "t1_ch0oh7l", "created": 1398356913.0, "author_flair_text": null, "created_utc": 1398328113.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0jc23", "gilded": 0, "author": "Italipinoy95", "parent_id": "t1_ch0j7yo", "approved_by": null, "body": "It's no problem.  I'm glad I could help out.  Like I said earlier, I'm willing to listen and help out if that's what you would like.  I'm way too addicted to this website for my own good so I'll be around if you ever find a way to mention anything else you wanted to say in your previous post. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s no problem.  I&amp;#39;m glad I could help out.  Like I said earlier, I&amp;#39;m willing to listen and help out if that&amp;#39;s what you would like.  I&amp;#39;m way too addicted to this website for my own good so I&amp;#39;ll be around if you ever find a way to mention anything else you wanted to say in your previous post. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23thmg", "score_hidden": false, "name": "t1_ch0jc23", "created": 1398338925.0, "author_flair_text": null, "created_utc": 1398310125.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch0t3f2", "gilded": 0, "author": "Italipinoy95", "parent_id": "t1_ch0j7yo", "approved_by": null, "body": "Oh, one thing I do want to mention is this:  there's always hope.  That sentence alone is really vague so I'm going to explain why.  There's always hope because though things do seem like a dead end right now, there are ways to climb out of it.  But most of it depends on you and what you do to overcome it - and a lot of it involves moving forward with your life as well as letting go of the past.  And it's incredibly difficult to do, but you can accomplish it if you truly work for it.  Keep in mind that it's very easy to think about what others would want you to do, or even have your mind on others in general because you don't want to look at yourself.  But, when do you things for yourself, you will learn to slowly start loving yourself, and then appreciate life more.  Hope this little bit helps as well and I hope you find your happiness.  Like I said before, still here to listen.  Just this last little bit came into my head this morning and I thought I should share it. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, one thing I do want to mention is this:  there&amp;#39;s always hope.  That sentence alone is really vague so I&amp;#39;m going to explain why.  There&amp;#39;s always hope because though things do seem like a dead end right now, there are ways to climb out of it.  But most of it depends on you and what you do to overcome it - and a lot of it involves moving forward with your life as well as letting go of the past.  And it&amp;#39;s incredibly difficult to do, but you can accomplish it if you truly work for it.  Keep in mind that it&amp;#39;s very easy to think about what others would want you to do, or even have your mind on others in general because you don&amp;#39;t want to look at yourself.  But, when do you things for yourself, you will learn to slowly start loving yourself, and then appreciate life more.  Hope this little bit helps as well and I hope you find your happiness.  Like I said before, still here to listen.  Just this last little bit came into my head this morning and I thought I should share it. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23thmg", "score_hidden": false, "name": "t1_ch0t3f2", "created": 1398377551.0, "author_flair_text": null, "created_utc": 1398348751.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch0j7yo", "gilded": 0, "author": "TheRoosterDog", "parent_id": "t1_ch0ih6h", "approved_by": null, "body": "I just typed a whole thing up and accidentally hit cancel. God damnit.\n\nYou've gone father than anyone else who has tried to counsel me on any level. I'm so terribly confused over everything and this means a lot. Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just typed a whole thing up and accidentally hit cancel. God damnit.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve gone father than anyone else who has tried to counsel me on any level. I&amp;#39;m so terribly confused over everything and this means a lot. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23thmg", "score_hidden": false, "name": "t1_ch0j7yo", "created": 1398338666.0, "author_flair_text": null, "created_utc": 1398309866.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch0ih6h", "gilded": 0, "author": "Italipinoy95", "parent_id": "t3_23thmg", "approved_by": null, "body": "I feel your pain about breaking up after a good relationship.  That's happened to me twice before and it's one of the hardest things to deal with because it sucks how you can be someone's everything and you reciprocate that, and then suddenly it becomes nothing.  Like they just walk into your life, impact it so much, and leave.  It's not easy to cope with at all.  I can also understand feeling like you have no real friends, plus having a hard family life.  It's overwhelming and you seem lost - which is perfectly understandable.  \n\nBut, I do agree that suicide is not the best option.  You do have a full life ahead of you and life can most definitely be a huge bitch.  That's for sure.  But, there are ways to cope with it and keep going.  Now, I'm not going to be cliche and say \"It gets better\" because that's just really vague.  What I will say is that it gets easier when you find something to focus on and appreciate.  Normally, hearing that, it's easy to starting thinking about trying to get a close friend or a significant other.  Not going to lie, that's very difficult to find in high school.  You have a much better chance of finding more people to relate with in college.  That I know from experience. \n\nWhat I would personally recommend based on my personal experience is to focus on something that either makes you happy or can help you out in the long run, or both.  Whatever works for you.  What I did was focus most of my energy on school work because I enjoyed learning and acquiring knowledge, but I also focused on hobbies like writing or art.  On top of that, I would watch shows, movies, or Youtube videos that would make me laugh or generally distract me from the situation because it helped me forget about it and I could start focusing on other things.  But that's just me.  Everyone is different and everyone has their own sense of what makes them happy.  Which is okay, because we're only human.  We're all imperfect beings who can't always make sense of things and we all fall at some point.  But there's always a way to get back up.  Just don't give up.  You have a lot ahead of you, some good some bad.  But if you quit now, you'll never know what may come out.  Could it be what you predict where you end up in a worse situation?  It's a possibility.  But could you also end up finding happiness and move on from this?  That's also another possibility.  The choice, truly, is yours to make.  The past, generally, doesn't repeat itself unless you make it happen by focusing on it too much.  However, if you learn to let go and start anew, you'll be surprised how things can change.  Of course, you can't completely forget the past either because then you'll definitely end up repeating it.  \n\nWhat does help is taking the negative points of life and turning them into something for the better.  For instance, you can take the hardships you have between you and your parents and convey that to where later in life, you'll know to be there for your children and be better than how your parents were.  You can also take the sadness from the broken relationships and use it to appreciate a good relationship down the line.  A lot of girls end up in very similar situations where they too are heartbroken and yearn to find someone who won't hurt them.  You can be that person who understands their pain and will actually care for and support them the way they need to.  Like I said, it's whatever works with you.  Those are simply my suggestions because that's what helps me.  \n\nYou did mention there's things you forgot to mention in your text which is totally fine.  It's pretty hard to let it all out at once when you've been keeping it in for so long.  I'm glad I could listen and I hope this helped even a little.  I'm still open to listen to more of what you have to say because I can relate.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel your pain about breaking up after a good relationship.  That&amp;#39;s happened to me twice before and it&amp;#39;s one of the hardest things to deal with because it sucks how you can be someone&amp;#39;s everything and you reciprocate that, and then suddenly it becomes nothing.  Like they just walk into your life, impact it so much, and leave.  It&amp;#39;s not easy to cope with at all.  I can also understand feeling like you have no real friends, plus having a hard family life.  It&amp;#39;s overwhelming and you seem lost - which is perfectly understandable.  &lt;/p&gt;\n\n&lt;p&gt;But, I do agree that suicide is not the best option.  You do have a full life ahead of you and life can most definitely be a huge bitch.  That&amp;#39;s for sure.  But, there are ways to cope with it and keep going.  Now, I&amp;#39;m not going to be cliche and say &amp;quot;It gets better&amp;quot; because that&amp;#39;s just really vague.  What I will say is that it gets easier when you find something to focus on and appreciate.  Normally, hearing that, it&amp;#39;s easy to starting thinking about trying to get a close friend or a significant other.  Not going to lie, that&amp;#39;s very difficult to find in high school.  You have a much better chance of finding more people to relate with in college.  That I know from experience. &lt;/p&gt;\n\n&lt;p&gt;What I would personally recommend based on my personal experience is to focus on something that either makes you happy or can help you out in the long run, or both.  Whatever works for you.  What I did was focus most of my energy on school work because I enjoyed learning and acquiring knowledge, but I also focused on hobbies like writing or art.  On top of that, I would watch shows, movies, or Youtube videos that would make me laugh or generally distract me from the situation because it helped me forget about it and I could start focusing on other things.  But that&amp;#39;s just me.  Everyone is different and everyone has their own sense of what makes them happy.  Which is okay, because we&amp;#39;re only human.  We&amp;#39;re all imperfect beings who can&amp;#39;t always make sense of things and we all fall at some point.  But there&amp;#39;s always a way to get back up.  Just don&amp;#39;t give up.  You have a lot ahead of you, some good some bad.  But if you quit now, you&amp;#39;ll never know what may come out.  Could it be what you predict where you end up in a worse situation?  It&amp;#39;s a possibility.  But could you also end up finding happiness and move on from this?  That&amp;#39;s also another possibility.  The choice, truly, is yours to make.  The past, generally, doesn&amp;#39;t repeat itself unless you make it happen by focusing on it too much.  However, if you learn to let go and start anew, you&amp;#39;ll be surprised how things can change.  Of course, you can&amp;#39;t completely forget the past either because then you&amp;#39;ll definitely end up repeating it.  &lt;/p&gt;\n\n&lt;p&gt;What does help is taking the negative points of life and turning them into something for the better.  For instance, you can take the hardships you have between you and your parents and convey that to where later in life, you&amp;#39;ll know to be there for your children and be better than how your parents were.  You can also take the sadness from the broken relationships and use it to appreciate a good relationship down the line.  A lot of girls end up in very similar situations where they too are heartbroken and yearn to find someone who won&amp;#39;t hurt them.  You can be that person who understands their pain and will actually care for and support them the way they need to.  Like I said, it&amp;#39;s whatever works with you.  Those are simply my suggestions because that&amp;#39;s what helps me.  &lt;/p&gt;\n\n&lt;p&gt;You did mention there&amp;#39;s things you forgot to mention in your text which is totally fine.  It&amp;#39;s pretty hard to let it all out at once when you&amp;#39;ve been keeping it in for so long.  I&amp;#39;m glad I could listen and I hope this helped even a little.  I&amp;#39;m still open to listen to more of what you have to say because I can relate.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23thmg", "score_hidden": false, "name": "t1_ch0ih6h", "created": 1398311826.0, "author_flair_text": null, "created_utc": 1398308226.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]