[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hear that so fucking much. &amp;quot;No matter what you can know it gets better&amp;quot; - everyone I&amp;#39;ve ever talked to. Fuck you no it doesn&amp;#39;t. How long does it take? Can I get a fucking estimate or something? no, they can never tell me . Why? because I&amp;#39;m so fucked up in the head I&amp;#39;ll never get over this. They said it got better years ago when I first started seeing a counselor. Years later they still say that. After mental hospitals and jail they still say that. And I believe them. Because each time I really do see a chance and then I get my hopes up and it doesn&amp;#39;t take But a week or so and some shit happens and I feel worse and worse each time. When will I finally get the balls to kill myself? or will I just feel like this until I&amp;#39;m old and die. First it was depression and cutting. Then it was suicidal thoughts. Now I&amp;#39;m talking to myself, I&amp;#39;m paraniod, I can&amp;#39;t even talk to people correctly anymore without stuttering or something. I honestly feel I&amp;#39;m going into some form of insanity. If I told anyone that they&amp;#39;d say &amp;quot;you need help from a professional &amp;quot; I&amp;#39;ve seen plenty of people and I don&amp;#39;t have time for it. Why? because I still have a life apparently. My parents still see a chance. But they only see that because they don&amp;#39;t see me as me. Sure I&amp;#39;ve tried to open up. They don&amp;#39;t have time or money for my problems and even if they did they don&amp;#39;t know how to deal with me. And at the end of each day I look back, see all my struggles and problems and think - if I were dead none of it would matter. All the pain, the guilt, the sadness, the anger, the rejection, the loneliness, the fear, the crying, the weakness, the hate, the tears, the screaming, the beating, the cutting, the bleeding, the burning, the gnashing, the gnawing, the biting, the whispering, the whimpering, the thinking, the fucking thoughts that I have to live with because I&amp;#39;m so fucked up I can&amp;#39;t fucking get over any of it and I never will because there&amp;#39;s something fucking wrong with me. But people would miss me, people would feel bad, what about the good and the friends and what if you meet a girl one day and have kids and what if you actually got better tomorrow. It wouldn&amp;#39;t matter either. Because if I&amp;#39;m dead, then it wouldn&amp;#39;t matter. But there&amp;#39;s a whole community out there of people just like you. Websites, blogs, chat rooms full of bleeding hearts and artists, all ready to tall and share with you and really really care and help. No. It can&amp;#39;t really help. It can&amp;#39;t. This soliloquy may be the last thought any other person understands. It could the the first of a whole book. Regardless. I feel like this. And I want out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hear that so fucking much. \"No matter what you can know it gets better\" - everyone I've ever talked to. Fuck you no it doesn't. How long does it take? Can I get a fucking estimate or something? no, they can never tell me . Why? because I'm so fucked up in the head I'll never get over this. They said it got better years ago when I first started seeing a counselor. Years later they still say that. After mental hospitals and jail they still say that. And I believe them. Because each time I really do see a chance and then I get my hopes up and it doesn't take But a week or so and some shit happens and I feel worse and worse each time. When will I finally get the balls to kill myself? or will I just feel like this until I'm old and die. First it was depression and cutting. Then it was suicidal thoughts. Now I'm talking to myself, I'm paraniod, I can't even talk to people correctly anymore without stuttering or something. I honestly feel I'm going into some form of insanity. If I told anyone that they'd say \"you need help from a professional \" I've seen plenty of people and I don't have time for it. Why? because I still have a life apparently. My parents still see a chance. But they only see that because they don't see me as me. Sure I've tried to open up. They don't have time or money for my problems and even if they did they don't know how to deal with me. And at the end of each day I look back, see all my struggles and problems and think - if I were dead none of it would matter. All the pain, the guilt, the sadness, the anger, the rejection, the loneliness, the fear, the crying, the weakness, the hate, the tears, the screaming, the beating, the cutting, the bleeding, the burning, the gnashing, the gnawing, the biting, the whispering, the whimpering, the thinking, the fucking thoughts that I have to live with because I'm so fucked up I can't fucking get over any of it and I never will because there's something fucking wrong with me. But people would miss me, people would feel bad, what about the good and the friends and what if you meet a girl one day and have kids and what if you actually got better tomorrow. It wouldn't matter either. Because if I'm dead, then it wouldn't matter. But there's a whole community out there of people just like you. Websites, blogs, chat rooms full of bleeding hearts and artists, all ready to tall and share with you and really really care and help. No. It can't really help. It can't. This soliloquy may be the last thought any other person understands. It could the the first of a whole book. Regardless. I feel like this. And I want out.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bo6q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Life_of_dieing", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bo6q/they_say_it_gets_better/", "name": "t3_25bo6q", "created": 1399887035.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bo6q/they_say_it_gets_better/", "author_flair_text": null, "title": "They say it gets better...", "created_utc": 1399858235.0, "ups": 3, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chflhf2", "gilded": 0, "author": "goodtwitch", "parent_id": "t3_25bo6q", "approved_by": null, "body": "You might want to check out [Feeling Good](http://www.amazon.com/Feeling-Good-The-Mood-Therapy/dp/0380810336), a book on cognitive therapy. It didn't cure my chronic depression, but it does help me sometimes get some distance from my depression.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might want to check out &lt;a href=\"http://www.amazon.com/Feeling-Good-The-Mood-Therapy/dp/0380810336\"&gt;Feeling Good&lt;/a&gt;, a book on cognitive therapy. It didn&amp;#39;t cure my chronic depression, but it does help me sometimes get some distance from my depression.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chflhf2", "created": 1399887532.0, "author_flair_text": null, "created_utc": 1399858732.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfo5yn", "gilded": 0, "author": "Life_of_dieing", "parent_id": "t1_chfnznx", "approved_by": null, "body": "I can't. 1. I don't let myself do medication or stuff like that. 2. My family wouldn't do it. They don't have time or money to.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t. 1. I don&amp;#39;t let myself do medication or stuff like that. 2. My family wouldn&amp;#39;t do it. They don&amp;#39;t have time or money to.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chfo5yn", "created": 1399893776.0, "author_flair_text": null, "created_utc": 1399864976.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfnznx", "gilded": 0, "author": "Audubonbaby", "parent_id": "t1_chfm8po", "approved_by": null, "body": "Have you ever had an MRI? I'm just curious because you mention how you're changing and it sounds sudden... I'm curious if you've ever been physiologically analyzed. I've read about people who have biological anomalies that cause their depression or hallucinations. It's worth reaching out to a university or research group to see if they would accept you for researching. You could be on the forefront of medicine to help other people and yourself. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever had an MRI? I&amp;#39;m just curious because you mention how you&amp;#39;re changing and it sounds sudden... I&amp;#39;m curious if you&amp;#39;ve ever been physiologically analyzed. I&amp;#39;ve read about people who have biological anomalies that cause their depression or hallucinations. It&amp;#39;s worth reaching out to a university or research group to see if they would accept you for researching. You could be on the forefront of medicine to help other people and yourself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chfnznx", "created": 1399893339.0, "author_flair_text": null, "created_utc": 1399864539.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfm8po", "gilded": 0, "author": "Life_of_dieing", "parent_id": "t1_chflnl6", "approved_by": null, "body": "Ya. But if I could just get past that. Other people have. If I could just break my fear and do it. It wouldn't matter. Nothing would. And I would be free. I just need to take myself out before I go totally crazy... something's changing in me and I can't let it happen.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ya. But if I could just get past that. Other people have. If I could just break my fear and do it. It wouldn&amp;#39;t matter. Nothing would. And I would be free. I just need to take myself out before I go totally crazy... something&amp;#39;s changing in me and I can&amp;#39;t let it happen.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chfm8po", "created": 1399889321.0, "author_flair_text": null, "created_utc": 1399860521.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chflnl6", "gilded": 0, "author": "Audubonbaby", "parent_id": "t3_25bo6q", "approved_by": null, "body": "I get it. I do. You and me each have this thread that's holding us to life. There's this one thing that's holding you here: fear. You're afraid of dying. I'm afraid of hurting my husband. Fear is really powerful, isn't it? \n\nPeople always associate fear negatively, but here I think it's more about protection. We are biologically wired to try to protect life... Our own, the lives of the ones we love. It's how life made it past primordial ooze, because it valued the span of time given on earth. As time and evolution took place we got to be more complex and now you and me are here on reddit with amazingly complex minds that are overriding that drive to live.\n\nYou've fought a lot of battles to live. I can see why you would be tired. It's okay to be tired, you know? It's okay to feel like this is overwhelming and pointless. Your feelings are not invalid because of your illness. My hope for you is that you find something more to bind you to live. I'm fortunate enough to have my husband who understands my pain. I hope you find someone or something that helps you manage the pain. Some people find music is good therapy... Others find a pet helps bring comfort. I hope you find something to ease your heart. \n\nI just want you to know you're not alone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get it. I do. You and me each have this thread that&amp;#39;s holding us to life. There&amp;#39;s this one thing that&amp;#39;s holding you here: fear. You&amp;#39;re afraid of dying. I&amp;#39;m afraid of hurting my husband. Fear is really powerful, isn&amp;#39;t it? &lt;/p&gt;\n\n&lt;p&gt;People always associate fear negatively, but here I think it&amp;#39;s more about protection. We are biologically wired to try to protect life... Our own, the lives of the ones we love. It&amp;#39;s how life made it past primordial ooze, because it valued the span of time given on earth. As time and evolution took place we got to be more complex and now you and me are here on reddit with amazingly complex minds that are overriding that drive to live.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve fought a lot of battles to live. I can see why you would be tired. It&amp;#39;s okay to be tired, you know? It&amp;#39;s okay to feel like this is overwhelming and pointless. Your feelings are not invalid because of your illness. My hope for you is that you find something more to bind you to live. I&amp;#39;m fortunate enough to have my husband who understands my pain. I hope you find someone or something that helps you manage the pain. Some people find music is good therapy... Others find a pet helps bring comfort. I hope you find something to ease your heart. &lt;/p&gt;\n\n&lt;p&gt;I just want you to know you&amp;#39;re not alone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chflnl6", "created": 1399887951.0, "author_flair_text": null, "created_utc": 1399859151.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfmjss", "gilded": 0, "author": "Life_of_dieing", "parent_id": "t1_chflmzs", "approved_by": null, "body": "I wish I could. But no one put there  could love me. Maybe they once could but now. I'm too far gone. My physce is so destroyed I can barely socialize face to face.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could. But no one put there  could love me. Maybe they once could but now. I&amp;#39;m too far gone. My physce is so destroyed I can barely socialize face to face.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chfmjss", "created": 1399890025.0, "author_flair_text": null, "created_utc": 1399861225.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chflmzs", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25bo6q", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bo6q", "score_hidden": false, "name": "t1_chflmzs", "created": 1399887910.0, "author_flair_text": null, "created_utc": 1399859110.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]