[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The past 6 months have been hell for me. The girl I loved, the girl I thought I was going to marry broke up with me 6 months ago. I am still young but I can say that I have yet to meet a girl with that combination of brains, looks, and personality. Now she is on the market and is being hit on every time I unfortunately run into her. Me on the other hand, well I haven&amp;#39;t had a sexual encounter since. I haven&amp;#39;t had the opportunity either. I tried to get back together with, because I truly, truly love her, and there is not way I can rationalize with that, but those attempts have failed, and I am pretty sure she has moved on. I wish with all my heart that those feelings could just disappear but they don&amp;#39;t. I try to avoid seeing her but I go to a very small college and it is basically impossible. Sometimes I do feel like I am getting better and then I will just see her beautiful face and it will send me back down into the spiral of depression. Meanwhile the rest of my life has gone to shit. I have no internship and no job this summer, meaning that I have to survive off of my meager savings for the summer. Worse than that is that I am stuck at my college, 2,000 miles away from home, if I don&amp;#39;t get a job or internship. My parents have told me that I can not come home without one. I have applied to about 25, and have only gotten 2 interviews, neither of which have panned out. My depression and the pressure to get an internship have had a very negative effect on my studies. I have lost all motivation to do work. I drag myself to the library but all I do is force myself to read whatever I am supposed to, but I can&amp;#39;t actually do it. It is as if the words or going in to me brain and coming right out. There is a haze of depression and sadness that just surrounds me all the time and I can&amp;#39;t produce decent work while doing that. So my grades have suffered and my parents will grill me about that. I have no idea where I want to go in life, it seems like everyone surrounding me is doing all this things, holding all these leadership positions and doing important internships and jobs and here I am just sitting at my computer. I have tried to remain optimistic and proactive. For the beginning of my depression I was able to do all my work and get good grades, I was able to apply to a bunch of internships. But as time goes on none of it has really improved my life. Things are still just as horrible as ever. I have tried CBT and more traditional therapy, and I was on anti-depressants but none of those things did any good. I exercise 6 days a week and that hasn&amp;#39;t changed things either. I have already tried to kill myself, it was a half hearted attempt with pills when i was drunk, and all it did was make me feel awful the next morning. But honestly I don&amp;#39;t know how much longer I can go on like this. I want with all my heart for things to get better, but I have lost the motivation to try. I tried already and it did no good. I can&amp;#39;t keep going on if I don&amp;#39;t get any results to keep me moving forward. I won&amp;#39;t kill myself tonight or in the next week, I still have to work up the courage to do that. But I am afraid, I am getting regular thoughts of suicide and that is a start. I don&amp;#39;t know what to do, nothing feels worth living for if things don&amp;#39;t change or get better.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The past 6 months have been hell for me. The girl I loved, the girl I thought I was going to marry broke up with me 6 months ago. I am still young but I can say that I have yet to meet a girl with that combination of brains, looks, and personality. Now she is on the market and is being hit on every time I unfortunately run into her. Me on the other hand, well I haven't had a sexual encounter since. I haven't had the opportunity either. I tried to get back together with, because I truly, truly love her, and there is not way I can rationalize with that, but those attempts have failed, and I am pretty sure she has moved on. I wish with all my heart that those feelings could just disappear but they don't. I try to avoid seeing her but I go to a very small college and it is basically impossible. Sometimes I do feel like I am getting better and then I will just see her beautiful face and it will send me back down into the spiral of depression. Meanwhile the rest of my life has gone to shit. I have no internship and no job this summer, meaning that I have to survive off of my meager savings for the summer. Worse than that is that I am stuck at my college, 2,000 miles away from home, if I don't get a job or internship. My parents have told me that I can not come home without one. I have applied to about 25, and have only gotten 2 interviews, neither of which have panned out. My depression and the pressure to get an internship have had a very negative effect on my studies. I have lost all motivation to do work. I drag myself to the library but all I do is force myself to read whatever I am supposed to, but I can't actually do it. It is as if the words or going in to me brain and coming right out. There is a haze of depression and sadness that just surrounds me all the time and I can't produce decent work while doing that. So my grades have suffered and my parents will grill me about that. I have no idea where I want to go in life, it seems like everyone surrounding me is doing all this things, holding all these leadership positions and doing important internships and jobs and here I am just sitting at my computer. I have tried to remain optimistic and proactive. For the beginning of my depression I was able to do all my work and get good grades, I was able to apply to a bunch of internships. But as time goes on none of it has really improved my life. Things are still just as horrible as ever. I have tried CBT and more traditional therapy, and I was on anti-depressants but none of those things did any good. I exercise 6 days a week and that hasn't changed things either. I have already tried to kill myself, it was a half hearted attempt with pills when i was drunk, and all it did was make me feel awful the next morning. But honestly I don't know how much longer I can go on like this. I want with all my heart for things to get better, but I have lost the motivation to try. I tried already and it did no good. I can't keep going on if I don't get any results to keep me moving forward. I won't kill myself tonight or in the next week, I still have to work up the courage to do that. But I am afraid, I am getting regular thoughts of suicide and that is a start. I don't know what to do, nothing feels worth living for if things don't change or get better.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250ei8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "lostit12", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/250ei8/things_just_arent_getting_better/", "name": "t3_250ei8", "created": 1399547049.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/250ei8/things_just_arent_getting_better/", "author_flair_text": null, "title": "Things just aren't getting better.", "created_utc": 1399518249.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chcgscs", "gilded": 0, "author": "Schrodingerist", "parent_id": "t3_250ei8", "approved_by": null, "body": "Moving on is always very difficult. And as cold as it may sound, it happens if it happens. All your problems stem off from this event, and your first step should be trying to detach yourself from her.\n\nHere's an exercise. Make a list of all the negative aspects of your ex-girlfriend, and whenever you're having painful nostalgia, just read down this list.\n\nDo things that make you happy. Don't exercise because you heard it makes you happier. Hang out with friends, read books.\n\nThere's multiple reasons for committing suicide, but ending a life so young for a girl you knew for half a year is not worth it.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Moving on is always very difficult. And as cold as it may sound, it happens if it happens. All your problems stem off from this event, and your first step should be trying to detach yourself from her.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s an exercise. Make a list of all the negative aspects of your ex-girlfriend, and whenever you&amp;#39;re having painful nostalgia, just read down this list.&lt;/p&gt;\n\n&lt;p&gt;Do things that make you happy. Don&amp;#39;t exercise because you heard it makes you happier. Hang out with friends, read books.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s multiple reasons for committing suicide, but ending a life so young for a girl you knew for half a year is not worth it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_250ei8", "score_hidden": false, "name": "t1_chcgscs", "created": 1399550609.0, "author_flair_text": null, "created_utc": 1399521809.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]