[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how to make things better. I&amp;#39;ve always had anxiety but it&amp;#39;s been so strong the last while... I&amp;#39;ve been working as a receptionist/administrator since January and I keep making mistakes, am so anxious around my co-workers, it&amp;#39;s hard to even do normal things like say good morning when I come in. It&amp;#39;s exactly the kind of job that I went to university to avoid doing. But before that, I spent a year unemployed - I just can&amp;#39;t make it through an interview without making an ass of myself, so how am I supposed to ever get out of this job I hate and do something worthwhile? \nI spent hundreds of dollars on therapy a few years ago and it obviously got me nowhere. Tried meds, didn&amp;#39;t help much, thought maybe I could get along without them but that&amp;#39;s not working either.\nI feel like my life is a waste and I&amp;#39;m defective as a person. I don&amp;#39;t know how to make things better. I&amp;#39;m not sure how long I can keep trying.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know how to make things better. I've always had anxiety but it's been so strong the last while... I've been working as a receptionist/administrator since January and I keep making mistakes, am so anxious around my co-workers, it's hard to even do normal things like say good morning when I come in. It's exactly the kind of job that I went to university to avoid doing. But before that, I spent a year unemployed - I just can't make it through an interview without making an ass of myself, so how am I supposed to ever get out of this job I hate and do something worthwhile? \nI spent hundreds of dollars on therapy a few years ago and it obviously got me nowhere. Tried meds, didn't help much, thought maybe I could get along without them but that's not working either.\nI feel like my life is a waste and I'm defective as a person. I don't know how to make things better. I'm not sure how long I can keep trying.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240p4z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "idontevenknow123456", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240p4z/this_isnt_working/", "name": "t3_240p4z", "created": 1398529477.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240p4z/this_isnt_working/", "author_flair_text": null, "title": "this isn't working", "created_utc": 1398500677.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2gmwf", "gilded": 0, "author": "marvinGPP", "parent_id": "t3_240p4z", "approved_by": null, "body": "I struggle with feelings of constant failure and I often feel defective, broken, and like I'm not a whole person or a real person- they're such horrible feelings. I feel like I have \"FAILURE\" tattooed on my forehead sometimes. \n\nI have screwed up almost every relationship I have- I have no friends. I over analyze most interpersonal interactions with people and I feel embarrassed and depressed about those interactions, even when I suspect the other person had no problem with it. \n\nI understand your frustration with your job and university. I owe $60k in student loans, I have a great education and I am unemployed. I was fired from a job I loved for a very confusing reason about seven years ago, and I still struggle with trying to understand what happened. And because of that, I can't apply for a job because I am too afraid to give references or list my job history. \n\nAnd to be perfectly honest, I think I resent all of my old friends who are normal, successful, functioning people. I probably sabotaged my relationships so that I didn't have to talk to people about how much of a failure I am.\n\nI wish I could tell you how to make it better, but the best I can do is say that you're not alone. I don't know if that's comforting. I can't tell if it makes me feel better to know that other people experience these feelings  because I feel less freakish, or if it makes me feel worse to know how many other people are suffering with similar feelings. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I struggle with feelings of constant failure and I often feel defective, broken, and like I&amp;#39;m not a whole person or a real person- they&amp;#39;re such horrible feelings. I feel like I have &amp;quot;FAILURE&amp;quot; tattooed on my forehead sometimes. &lt;/p&gt;\n\n&lt;p&gt;I have screwed up almost every relationship I have- I have no friends. I over analyze most interpersonal interactions with people and I feel embarrassed and depressed about those interactions, even when I suspect the other person had no problem with it. &lt;/p&gt;\n\n&lt;p&gt;I understand your frustration with your job and university. I owe $60k in student loans, I have a great education and I am unemployed. I was fired from a job I loved for a very confusing reason about seven years ago, and I still struggle with trying to understand what happened. And because of that, I can&amp;#39;t apply for a job because I am too afraid to give references or list my job history. &lt;/p&gt;\n\n&lt;p&gt;And to be perfectly honest, I think I resent all of my old friends who are normal, successful, functioning people. I probably sabotaged my relationships so that I didn&amp;#39;t have to talk to people about how much of a failure I am.&lt;/p&gt;\n\n&lt;p&gt;I wish I could tell you how to make it better, but the best I can do is say that you&amp;#39;re not alone. I don&amp;#39;t know if that&amp;#39;s comforting. I can&amp;#39;t tell if it makes me feel better to know that other people experience these feelings  because I feel less freakish, or if it makes me feel worse to know how many other people are suffering with similar feelings. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240p4z", "score_hidden": false, "name": "t1_ch2gmwf", "created": 1398506578.0, "author_flair_text": null, "created_utc": 1398502978.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]