[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m at the end of my patience. This may not be me being suicidal, but I hope that anyone can help me restrain myself from beating up my father. I have a thorough hate for him, and every weekend he is at home, he only yells at me. I want this to stop, but all I know is that if I do anything, I&amp;#39;ll screw up everything. &lt;/p&gt;\n\n&lt;p&gt;I know this is r/suicidewatch, but I hope someone can help me on something else.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm at the end of my patience. This may not be me being suicidal, but I hope that anyone can help me restrain myself from beating up my father. I have a thorough hate for him, and every weekend he is at home, he only yells at me. I want this to stop, but all I know is that if I do anything, I'll screw up everything. \n\nI know this is r/suicidewatch, but I hope someone can help me on something else.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241g5r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Monocow", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241g5r/this_is_going_straight_to_hel/", "name": "t3_241g5r", "created": 1398559845.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241g5r/this_is_going_straight_to_hel/", "author_flair_text": null, "title": "This is going straight to hel", "created_utc": 1398531045.0, "ups": 6, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ticx", "gilded": 0, "author": "-TheFinalEpisode-", "parent_id": "t3_241g5r", "approved_by": null, "body": "You've gotta find a way to let it out without hurting him - it's not worth compromsing your life or allowing him to make things worse.\n\nI know how incredibly difficult to be around people who put pressure on you, I feel that a lot and it's very difficult. Metal music has helped me a lot, and writing and drawing. One of my favorite things is lots of black crayon.\n\nIt helps to get out the emotions in private because it makes things just a little bit easier the next time you actually see him in person. Don't let him take away your future from you, it may make things much harder for you if you get arrested or something like that for violence.\n\nI know that the feelings are completely overwhelming sometimes, I know how absolutely crazy that can be. It can help so much to talk about it.\n\nI've heard very good things about this reddit\n\n/r/raisedbynarcissists/\n\nIt may not 100% be the same situation, but talking about what's going on *helps*.\n\nYou won't always be in this situation, and making life goals and focusing on making them happen, moving out, what kind of career you'll have etc, can help. Getting the little details down while listening to music and getting a bit of exercise (it's probably a good idea to go outside in some way, skateboarding, biking, running.\n\n\nCoping with stress with stuff like deep breathing along with the metal music and some form of exercise can help a lot, pushups, pullups, you name it. It'll just help you get that out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve gotta find a way to let it out without hurting him - it&amp;#39;s not worth compromsing your life or allowing him to make things worse.&lt;/p&gt;\n\n&lt;p&gt;I know how incredibly difficult to be around people who put pressure on you, I feel that a lot and it&amp;#39;s very difficult. Metal music has helped me a lot, and writing and drawing. One of my favorite things is lots of black crayon.&lt;/p&gt;\n\n&lt;p&gt;It helps to get out the emotions in private because it makes things just a little bit easier the next time you actually see him in person. Don&amp;#39;t let him take away your future from you, it may make things much harder for you if you get arrested or something like that for violence.&lt;/p&gt;\n\n&lt;p&gt;I know that the feelings are completely overwhelming sometimes, I know how absolutely crazy that can be. It can help so much to talk about it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve heard very good things about this reddit&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/r/raisedbynarcissists/\"&gt;/r/raisedbynarcissists/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It may not 100% be the same situation, but talking about what&amp;#39;s going on &lt;em&gt;helps&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;You won&amp;#39;t always be in this situation, and making life goals and focusing on making them happen, moving out, what kind of career you&amp;#39;ll have etc, can help. Getting the little details down while listening to music and getting a bit of exercise (it&amp;#39;s probably a good idea to go outside in some way, skateboarding, biking, running.&lt;/p&gt;\n\n&lt;p&gt;Coping with stress with stuff like deep breathing along with the metal music and some form of exercise can help a lot, pushups, pullups, you name it. It&amp;#39;ll just help you get that out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241g5r", "score_hidden": false, "name": "t1_ch2ticx", "created": 1398550923.0, "author_flair_text": null, "created_utc": 1398547323.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]