[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a young 20&amp;#39;s year old male. I am nearly done with college. I have a fiancée that I am increasingly bored with; however my boredom is primarily a product of my mind distorting my interest in her,  making her appear boring when we are not together. I have a dog that I love dearly. I have many close friends,  and I value our relationships. I am on good terms with my immediate family. I am in no way proclaiming that I have a bad life. I know that I am fortunate to have what I do. Regardless,  I am at a point where I no longer want to engage in the mundane and pointless activities that are my life on earth. &lt;/p&gt;\n\n&lt;p&gt;Tonight I wrote in my &amp;#39;suicide journal&amp;#39; for the first time in four years,  because I have finally come to an emotional breaking point. I simply no longer wish to live. Here is that entry: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;4/25: Here I am again lying in bed contemplating life. What is the point of anything? We are nothing but an evolutionary byproduct of billions of years of gradual change. We are not special as a species. Our interactions are just as inherently pedantic as the social interactions of ants. Every single thing we feel, ranging from the extacies of romance to the depths of depression (you are here!),  is nothing but a chemical reaction going off in our neurotic heads. Everything is premeditated. I think that&amp;#39;s why I love alcohol and drugs so much. They give me the ability to act under the guise of subconsciousness. Everything we do on earth is meaningless. Nothing is truly altruistic. Every single decision we make on earth is to evoke some feeling,  some chemical reaction, in order to make our selves feel some sort of self importance. Tonight I opened my drawer with my gun in it,  simply to see what it felt like. To have the end that close was envigorating. Every single day for the past two months I think about, no,  I long for the inevitable peace that death will bring. The only things keeping me here are my friends and family. I am content with my story,  the story of Andrew Shelton ending right now. Even if it went on for another century,  the resul would be only fractionally less meaningless than what it is currently. This vacuum of time and space that is our universe is truly a cruel place. I am reminded of the Epicurean quote &amp;quot;I was not,  then I came to be; now I am dead,  and I do not care.&amp;quot; I long so dearly to no longer care. To have that last fringe of superficially emotional, truly chemical, sliver of care removed from me. I do not wish to die because I am unhappy. I wish to die because death is happiness,  because happiness is not existing. This is so radically different than my melodramatic high-school suicide attempt. I couldn&amp;#39;t take the struggles of life then,  and while I may not be able to now either,  I long for death for completely different reasons. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does anyone else here have such a nihilistic view of life? And if so,  how do you cope with it? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am a young 20's year old male. I am nearly done with college. I have a fiancée that I am increasingly bored with; however my boredom is primarily a product of my mind distorting my interest in her,  making her appear boring when we are not together. I have a dog that I love dearly. I have many close friends,  and I value our relationships. I am on good terms with my immediate family. I am in no way proclaiming that I have a bad life. I know that I am fortunate to have what I do. Regardless,  I am at a point where I no longer want to engage in the mundane and pointless activities that are my life on earth. \n\n\nTonight I wrote in my 'suicide journal' for the first time in four years,  because I have finally come to an emotional breaking point. I simply no longer wish to live. Here is that entry: \n\n\n&gt;4/25: Here I am again lying in bed contemplating life. What is the point of anything? We are nothing but an evolutionary byproduct of billions of years of gradual change. We are not special as a species. Our interactions are just as inherently pedantic as the social interactions of ants. Every single thing we feel, ranging from the extacies of romance to the depths of depression (you are here!),  is nothing but a chemical reaction going off in our neurotic heads. Everything is premeditated. I think that's why I love alcohol and drugs so much. They give me the ability to act under the guise of subconsciousness. Everything we do on earth is meaningless. Nothing is truly altruistic. Every single decision we make on earth is to evoke some feeling,  some chemical reaction, in order to make our selves feel some sort of self importance. Tonight I opened my drawer with my gun in it,  simply to see what it felt like. To have the end that close was envigorating. Every single day for the past two months I think about, no,  I long for the inevitable peace that death will bring. The only things keeping me here are my friends and family. I am content with my story,  the story of Andrew Shelton ending right now. Even if it went on for another century,  the resul would be only fractionally less meaningless than what it is currently. This vacuum of time and space that is our universe is truly a cruel place. I am reminded of the Epicurean quote \"I was not,  then I came to be; now I am dead,  and I do not care.\" I long so dearly to no longer care. To have that last fringe of superficially emotional, truly chemical, sliver of care removed from me. I do not wish to die because I am unhappy. I wish to die because death is happiness,  because happiness is not existing. This is so radically different than my melodramatic high-school suicide attempt. I couldn't take the struggles of life then,  and while I may not be able to now either,  I long for death for completely different reasons. \n\n\nDoes anyone else here have such a nihilistic view of life? And if so,  how do you cope with it? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23xtek", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Fragmentofpeace", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23xtek/this_time_i_want_truly_want_death/", "name": "t3_23xtek", "created": 1398447509.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23xtek/this_time_i_want_truly_want_death/", "author_flair_text": null, "title": "This time I want truly want death.", "created_utc": 1398418709.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1m0wh", "gilded": 0, "author": "magmagmagmag", "parent_id": "t3_23xtek", "approved_by": null, "body": "The concept of causality used to scare me a bit, because according to this theory, all our choices are just consequences of chemicals and electric reactions in our body. I also think that everything is premeditated (even if this word isn't the right one).\n\nWith time I separated my thoughts in two parts : practical reality and reality. My \"practical reality\" mindset is : what works is what is probably the best answer. My \"reality\" mindset is : what make sense is probably the best answer.\n\nI think a big deal in my life was to put things in perspective. It helped me being happy about myself. Self acceptance was also very important, I don't like socializing and it's so fucking totally 100% OK and screw everyfuckingbody that criticize and try to force me.\n\nI hope this gives you some leads for your thoughts. Take care.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The concept of causality used to scare me a bit, because according to this theory, all our choices are just consequences of chemicals and electric reactions in our body. I also think that everything is premeditated (even if this word isn&amp;#39;t the right one).&lt;/p&gt;\n\n&lt;p&gt;With time I separated my thoughts in two parts : practical reality and reality. My &amp;quot;practical reality&amp;quot; mindset is : what works is what is probably the best answer. My &amp;quot;reality&amp;quot; mindset is : what make sense is probably the best answer.&lt;/p&gt;\n\n&lt;p&gt;I think a big deal in my life was to put things in perspective. It helped me being happy about myself. Self acceptance was also very important, I don&amp;#39;t like socializing and it&amp;#39;s so fucking totally 100% OK and screw everyfuckingbody that criticize and try to force me.&lt;/p&gt;\n\n&lt;p&gt;I hope this gives you some leads for your thoughts. Take care.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23xtek", "score_hidden": false, "name": "t1_ch1m0wh", "created": 1398423209.0, "author_flair_text": null, "created_utc": 1398419609.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]