[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve decided, I don&amp;#39;t want to live anymore, I don&amp;#39;t want to exist anymore, I hate this life, but I don&amp;#39;t have the money to leave it behind and I&amp;#39;m only 17 anyway so that leaves me with one option.\nI don&amp;#39;t want to be found. I don&amp;#39;t want anybody to know the truth about me.\nSo I&amp;#39;ll leave a note, telling my parents how I don&amp;#39;t agree with what they wanted me to be, how I wanted to leave, how I didn&amp;#39;t want them to follow me as it was my own choice in life. They won&amp;#39;t follow.\nThen, I&amp;#39;ll go as far away as I can, and die. \nAnd the world will continue on.\nWhy am I telling you this if I don&amp;#39;t want anyone to know? Nobody will know anyway. So why not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've decided, I don't want to live anymore, I don't want to exist anymore, I hate this life, but I don't have the money to leave it behind and I'm only 17 anyway so that leaves me with one option.\nI don't want to be found. I don't want anybody to know the truth about me.\nSo I'll leave a note, telling my parents how I don't agree with what they wanted me to be, how I wanted to leave, how I didn't want them to follow me as it was my own choice in life. They won't follow.\nThen, I'll go as far away as I can, and die. \nAnd the world will continue on.\nWhy am I telling you this if I don't want anyone to know? Nobody will know anyway. So why not?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "244jfr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwaway_22409", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/244jfr/this_is_how_i_will_disappear/", "name": "t3_244jfr", "created": 1398656301.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/244jfr/this_is_how_i_will_disappear/", "author_flair_text": null, "title": "This is how I will disappear.", "created_utc": 1398627501.0, "ups": 6, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3k1bc", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3jxwg", "approved_by": null, "body": "It's nothing they haven't dealt with before though. I hope you'll be in good hands with them. It's understandable if you don't want to talk about suicide with them, but please do get help from someone if your thoughts about it get this way again. Either your counselor or your parents or this subreddit. You can even message me and I'll do what I can to help.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s nothing they haven&amp;#39;t dealt with before though. I hope you&amp;#39;ll be in good hands with them. It&amp;#39;s understandable if you don&amp;#39;t want to talk about suicide with them, but please do get help from someone if your thoughts about it get this way again. Either your counselor or your parents or this subreddit. You can even message me and I&amp;#39;ll do what I can to help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3k1bc", "created": 1398635084.0, "author_flair_text": null, "created_utc": 1398631484.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch3jxwg", "gilded": 0, "author": "Throwaway_22409", "parent_id": "t1_ch3jno4", "approved_by": null, "body": "Explaining to the school counsellor how I don't want to go to school will be odd, but, I guess it's the only option for me, before I do end it.\n\nAlthough if I do talk to the counsellor, I can't mention suicide. I remember now that it's a trigger for parent involvement. \n\nThank you for helping, even if in the end it doesn't work out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Explaining to the school counsellor how I don&amp;#39;t want to go to school will be odd, but, I guess it&amp;#39;s the only option for me, before I do end it.&lt;/p&gt;\n\n&lt;p&gt;Although if I do talk to the counsellor, I can&amp;#39;t mention suicide. I remember now that it&amp;#39;s a trigger for parent involvement. &lt;/p&gt;\n\n&lt;p&gt;Thank you for helping, even if in the end it doesn&amp;#39;t work out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3jxwg", "created": 1398634870.0, "author_flair_text": null, "created_utc": 1398631270.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3jno4", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3jjim", "approved_by": null, "body": "It sounds to me like your parents do want the best for you though, so if you can explain this to them I hope they'll try to understand that what you want is different from what they want for you. Maybe if you cant see a therapist your school may have a counselor or something like that you can talk to. You'll need to check with them, but I don't think that they can tell your parents you went to them for help without your permission, so that may be an option.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like your parents do want the best for you though, so if you can explain this to them I hope they&amp;#39;ll try to understand that what you want is different from what they want for you. Maybe if you cant see a therapist your school may have a counselor or something like that you can talk to. You&amp;#39;ll need to check with them, but I don&amp;#39;t think that they can tell your parents you went to them for help without your permission, so that may be an option.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3jno4", "created": 1398634232.0, "author_flair_text": null, "created_utc": 1398630632.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3jjim", "gilded": 0, "author": "Throwaway_22409", "parent_id": "t1_ch3j60g", "approved_by": null, "body": "I know my parents, they'll use every single available thing to avert the point: T.V. Computer. Phone. Pressure. Outside influences. Money. Laziness. They will try everything in the book to convince me that I really do want to be academic. No matter how much I say differently.\n\n&gt; it would help them too to understand what you're going through.\n\nDo you mean tell them I'm depressed? No. No. No. I vowed I would never tell anyone again of my depression after the last person I ever uttered the word to never spoke to me again. And seeing a therapist would almost certainly result in my parents finding out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know my parents, they&amp;#39;ll use every single available thing to avert the point: T.V. Computer. Phone. Pressure. Outside influences. Money. Laziness. They will try everything in the book to convince me that I really do want to be academic. No matter how much I say differently.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;it would help them too to understand what you&amp;#39;re going through.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you mean tell them I&amp;#39;m depressed? No. No. No. I vowed I would never tell anyone again of my depression after the last person I ever uttered the word to never spoke to me again. And seeing a therapist would almost certainly result in my parents finding out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3jjim", "created": 1398633974.0, "author_flair_text": null, "created_utc": 1398630374.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3j60g", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch3iz5o", "approved_by": null, "body": "When you're depressed it can be impossible to find motivation to do anything and this can have massive negative consequences on everything you do, but it doesn't always have to be this way. Seeing a therapist really can help things and it's always an option.\n\nI don't know how your parents will react to it, but honestly talking to them about this stuff may be good for all of you. You can let them know that you're not happy with the way things are and you want to change things, and it would help them too to understand what you're going through.\n\nI don't know if this is really advice I can give because I've been feeling the same as you, feeling depressed, under pressure, and having suicidal thoughts for a long time now and I've never seen a therapist of talked to my family about it, so I know it can feel impossible to make that first step, but I hop you can be stronger than me.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you&amp;#39;re depressed it can be impossible to find motivation to do anything and this can have massive negative consequences on everything you do, but it doesn&amp;#39;t always have to be this way. Seeing a therapist really can help things and it&amp;#39;s always an option.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how your parents will react to it, but honestly talking to them about this stuff may be good for all of you. You can let them know that you&amp;#39;re not happy with the way things are and you want to change things, and it would help them too to understand what you&amp;#39;re going through.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if this is really advice I can give because I&amp;#39;ve been feeling the same as you, feeling depressed, under pressure, and having suicidal thoughts for a long time now and I&amp;#39;ve never seen a therapist of talked to my family about it, so I know it can feel impossible to make that first step, but I hop you can be stronger than me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3j60g", "created": 1398633126.0, "author_flair_text": null, "created_utc": 1398629526.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3iz5o", "gilded": 0, "author": "Throwaway_22409", "parent_id": "t1_ch3ify8", "approved_by": null, "body": "What other way out is there? My parents keep pushing me to what they want me to be. They want me to be academic, smart and successful, but I just can't be that, I can't, I'm not good enough. I don't work hard enough and I can't get motivated. I hate that they picture me as this highly intelligent, thing they can mold into their 'perfect' son. It isn't what I want to do in life. I want to leave school, I want to move away, somewhere where nobody knows me, so I can start a new life. I can't tell them that though, they'd see me as a failure, look at me with thoughts of 'what could have been?' and I don't have the money to leave on my own!\nThere are other things too, but this is one of the biggest thing pulling me down, their expectation is weighing like an anchor on me.\n\nEdit: Should add I'm 17 nearly 18", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What other way out is there? My parents keep pushing me to what they want me to be. They want me to be academic, smart and successful, but I just can&amp;#39;t be that, I can&amp;#39;t, I&amp;#39;m not good enough. I don&amp;#39;t work hard enough and I can&amp;#39;t get motivated. I hate that they picture me as this highly intelligent, thing they can mold into their &amp;#39;perfect&amp;#39; son. It isn&amp;#39;t what I want to do in life. I want to leave school, I want to move away, somewhere where nobody knows me, so I can start a new life. I can&amp;#39;t tell them that though, they&amp;#39;d see me as a failure, look at me with thoughts of &amp;#39;what could have been?&amp;#39; and I don&amp;#39;t have the money to leave on my own!\nThere are other things too, but this is one of the biggest thing pulling me down, their expectation is weighing like an anchor on me.&lt;/p&gt;\n\n&lt;p&gt;Edit: Should add I&amp;#39;m 17 nearly 18&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3iz5o", "created": 1398632688.0, "author_flair_text": null, "created_utc": 1398629088.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch3ify8", "gilded": 0, "author": "[deleted]", "parent_id": "t3_244jfr", "approved_by": null, "body": "You wouldn't be posting this here if you weren't looking for another way out. And I know when you're feeling like this it isn't at all easy to see another way out, I've been in that position myself, but I can promise you there is. Could you please tell me about what has been making you feel this way?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You wouldn&amp;#39;t be posting this here if you weren&amp;#39;t looking for another way out. And I know when you&amp;#39;re feeling like this it isn&amp;#39;t at all easy to see another way out, I&amp;#39;ve been in that position myself, but I can promise you there is. Could you please tell me about what has been making you feel this way?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244jfr", "score_hidden": false, "name": "t1_ch3ify8", "created": 1398631507.0, "author_flair_text": null, "created_utc": 1398627907.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]