[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how to describe it? Lethargy? Apathy? Basically, I get in a certain mindset of &amp;quot;I wouldn&amp;#39;t care if I just died right now.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think about my preferred method of dying. I don&amp;#39;t really act out on it though. It&amp;#39;s almost as if I&amp;#39;m so pathetic that getting up to start a car in the garage is just too much effort.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been having a surge of these types of days more frequently. I guess I should go to a little backstory.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been with my boyfriend for over 3 years now. In the course of this relationship, I had committed infidelity twice. Once was a kind of one night stand thing, and then other was with another guy that lasted about the course of two weeks. We had sex 4 times during that ordeal.&lt;/p&gt;\n\n&lt;p&gt;I did the right thing, well, as right as you can make infidelity, and confessed to these. I confessed to the first the night of, and then the second incident I stuffed inside until 2 years later when I couldn&amp;#39;t take it anymore. I had nightmares about the stuff, waking up crying from shame and guilt about it, I just had to confess.&lt;/p&gt;\n\n&lt;p&gt;I confessed to this around September of 2013. After that, it seems that my life has been for the worse. My boyfriend is hurt; extremely and rightfully so. I made it my mission to rectify what I&amp;#39;ve done to the best of my abilities. I joined a support forum focused on infidelity, I sought therapy, read up resources about infidelity and what to do about it. There is of course the obvious steps, such as no contact with the affair partner, accepting 100% of the fault, etc. &lt;/p&gt;\n\n&lt;p&gt;But now it just seems my life is about walking on eggshells and hoping not to upset my boyfriend. You could say after all this, he&amp;#39;s become very abusive towards me. Anything and everything can flare up an incident.&lt;/p&gt;\n\n&lt;p&gt;For example, once we were making tacos, but we couldn&amp;#39;t find the soft shells. We looked everywhere, until I checked the freezer. Turns out, when I put the pizza in the fridge, the tortillas were in the bag and got thrown in by mistake. I approached him, laughing at myself, and told him about it.&lt;/p&gt;\n\n&lt;p&gt;This caused him to flip out about it, going on a tyrant about how he doesn&amp;#39;t want to eat hard shells, and that I&amp;#39;m a disappointment, just like when I had sex with two other guys.&lt;/p&gt;\n\n&lt;p&gt;This makes me scared all the time. I&amp;#39;m already very self-conscious about mistakes. I don&amp;#39;t want to upset him, but at the same time I blame myself for all of this. If I had just stayed within the relationship, he&amp;#39;d have 0 reasons to be angry at me. I feel if I complain about my problems, it makes me selfish when he&amp;#39;s in so much pain dealing with the betrayal.&lt;/p&gt;\n\n&lt;p&gt;After these incidents, I get very suicidal, but it only seems to piss him off. &amp;quot;Why do you always turn it into this?&amp;quot; it seems to be what I get. But...I can&amp;#39;t just turn my suicidal thoughts off. Eventually, something in him clicks and he stops being mean. He apologizes, gives me hugs, says he wants to be with me, etc. &lt;/p&gt;\n\n&lt;p&gt;But lately, even without these incidents, I&amp;#39;ve just felt very apathetic towards my life. I can&amp;#39;t get over the hurdle of acceptance for what I&amp;#39;ve done. I look at my body in the mirror and become sick at what I see. I feel weird about being touched, because I feel so repulsed in myself. Any time I&amp;#39;ve felt a little better, just even a bit, the rug is ripped out from under me, and I&amp;#39;m reminded I&amp;#39;m nothing but a cheating whore and I deserve what&amp;#39;s coming to me.&lt;/p&gt;\n\n&lt;p&gt;Maybe I don&amp;#39;t wish to kill myself, maybe I do. I just want out of this body. It&amp;#39;s dirty and tainted. I&amp;#39;ve had thoughts of mutilating my body, specifically my breasts and genitals. If I made myself so horrible and deformed, no man would want me and then I couldn&amp;#39;t be a cheater ever again.&lt;/p&gt;\n\n&lt;p&gt;I avoid people and places unless it&amp;#39;s necessary to interact with them, such as at my job. I don&amp;#39;t have any friends, and I&amp;#39;d rather not deal with the rightful judgement if I talk about my infidelity. I don&amp;#39;t want to talk to my boyfriend about how I feel, because I don&amp;#39;t want to trigger him with my problems.&lt;/p&gt;\n\n&lt;p&gt;I just feel so alone. I wish at the least, he left me so I wouldn&amp;#39;t have a reason to stay alive. I lack the courage to just break it off myself, and a part of me stops myself because I love him. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m told the only way of redeeming myself is going back in time and stopping it from ever happening. I know this is said sarcastically when he&amp;#39;s upset, but it just makes me want to die even more. I realize this is a mistake, albeit a huge life-changing one. But there&amp;#39;s no way to ever make it go away, or even more bareable. I can&amp;#39;t live with myself anymore. There&amp;#39;s a reason why they stoned adulterers, and I&amp;#39;m a living example of why. I just ruined any happiness in my life, ruined my boyfriend&amp;#39;s life, and it was all for nothing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know how to describe it? Lethargy? Apathy? Basically, I get in a certain mindset of \"I wouldn't care if I just died right now.\"\n\nI think about my preferred method of dying. I don't really act out on it though. It's almost as if I'm so pathetic that getting up to start a car in the garage is just too much effort.\n\nI've been having a surge of these types of days more frequently. I guess I should go to a little backstory.\n\nI've been with my boyfriend for over 3 years now. In the course of this relationship, I had committed infidelity twice. Once was a kind of one night stand thing, and then other was with another guy that lasted about the course of two weeks. We had sex 4 times during that ordeal.\n\nI did the right thing, well, as right as you can make infidelity, and confessed to these. I confessed to the first the night of, and then the second incident I stuffed inside until 2 years later when I couldn't take it anymore. I had nightmares about the stuff, waking up crying from shame and guilt about it, I just had to confess.\n\nI confessed to this around September of 2013. After that, it seems that my life has been for the worse. My boyfriend is hurt; extremely and rightfully so. I made it my mission to rectify what I've done to the best of my abilities. I joined a support forum focused on infidelity, I sought therapy, read up resources about infidelity and what to do about it. There is of course the obvious steps, such as no contact with the affair partner, accepting 100% of the fault, etc. \n\nBut now it just seems my life is about walking on eggshells and hoping not to upset my boyfriend. You could say after all this, he's become very abusive towards me. Anything and everything can flare up an incident.\n\nFor example, once we were making tacos, but we couldn't find the soft shells. We looked everywhere, until I checked the freezer. Turns out, when I put the pizza in the fridge, the tortillas were in the bag and got thrown in by mistake. I approached him, laughing at myself, and told him about it.\n\nThis caused him to flip out about it, going on a tyrant about how he doesn't want to eat hard shells, and that I'm a disappointment, just like when I had sex with two other guys.\n\nThis makes me scared all the time. I'm already very self-conscious about mistakes. I don't want to upset him, but at the same time I blame myself for all of this. If I had just stayed within the relationship, he'd have 0 reasons to be angry at me. I feel if I complain about my problems, it makes me selfish when he's in so much pain dealing with the betrayal.\n\nAfter these incidents, I get very suicidal, but it only seems to piss him off. \"Why do you always turn it into this?\" it seems to be what I get. But...I can't just turn my suicidal thoughts off. Eventually, something in him clicks and he stops being mean. He apologizes, gives me hugs, says he wants to be with me, etc. \n\nBut lately, even without these incidents, I've just felt very apathetic towards my life. I can't get over the hurdle of acceptance for what I've done. I look at my body in the mirror and become sick at what I see. I feel weird about being touched, because I feel so repulsed in myself. Any time I've felt a little better, just even a bit, the rug is ripped out from under me, and I'm reminded I'm nothing but a cheating whore and I deserve what's coming to me.\n\nMaybe I don't wish to kill myself, maybe I do. I just want out of this body. It's dirty and tainted. I've had thoughts of mutilating my body, specifically my breasts and genitals. If I made myself so horrible and deformed, no man would want me and then I couldn't be a cheater ever again.\n\nI avoid people and places unless it's necessary to interact with them, such as at my job. I don't have any friends, and I'd rather not deal with the rightful judgement if I talk about my infidelity. I don't want to talk to my boyfriend about how I feel, because I don't want to trigger him with my problems.\n\nI just feel so alone. I wish at the least, he left me so I wouldn't have a reason to stay alive. I lack the courage to just break it off myself, and a part of me stops myself because I love him. \n\nI'm told the only way of redeeming myself is going back in time and stopping it from ever happening. I know this is said sarcastically when he's upset, but it just makes me want to die even more. I realize this is a mistake, albeit a huge life-changing one. But there's no way to ever make it go away, or even more bareable. I can't live with myself anymore. There's a reason why they stoned adulterers, and I'm a living example of why. I just ruined any happiness in my life, ruined my boyfriend's life, and it was all for nothing.\n\n ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2408c4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwmeawayimnothing", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2408c4/this_feeling_i_get_it_honestly_scares_me_and_i/", "name": "t3_2408c4", "created": 1398511061.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2408c4/this_feeling_i_get_it_honestly_scares_me_and_i/", "author_flair_text": null, "title": "This feeling I get. It honestly scares me and I don't know what to do.", "created_utc": 1398482261.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2dcdd", "gilded": 0, "author": "LightAbsol", "parent_id": "t1_ch2czk5", "approved_by": null, "body": "I see. :/ I was in an abusive relationship myself a few years back. You're definitely not alone when it comes to recognizing that feeling. The thing is, even if that truly was a catalyst to his behavior, you definitely would've seen it arise at some point during the relationship, if not then. It's like finding out his \"true colors\" for lack of better terminology. That's definitely something that he needs to work on himself as a person.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see. :/ I was in an abusive relationship myself a few years back. You&amp;#39;re definitely not alone when it comes to recognizing that feeling. The thing is, even if that truly was a catalyst to his behavior, you definitely would&amp;#39;ve seen it arise at some point during the relationship, if not then. It&amp;#39;s like finding out his &amp;quot;true colors&amp;quot; for lack of better terminology. That&amp;#39;s definitely something that he needs to work on himself as a person.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2408c4", "score_hidden": false, "name": "t1_ch2dcdd", "created": 1398491945.0, "author_flair_text": null, "created_utc": 1398488345.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2czk5", "gilded": 0, "author": "throwmeawayimnothing", "parent_id": "t1_ch2cnf6", "approved_by": null, "body": "Well, it's difficult, because nothing was inherently wrong with my relationship prior to my affairs. It seems that the abusive behavior only occurred after the fallout of that. \n\nI think what gets me is I know he can express his anger without resorting to abusive (verbal or physical) behavior. It's like we both recognize this, it's just that for whatever reason, it's not applied when it's needed.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, it&amp;#39;s difficult, because nothing was inherently wrong with my relationship prior to my affairs. It seems that the abusive behavior only occurred after the fallout of that. &lt;/p&gt;\n\n&lt;p&gt;I think what gets me is I know he can express his anger without resorting to abusive (verbal or physical) behavior. It&amp;#39;s like we both recognize this, it&amp;#39;s just that for whatever reason, it&amp;#39;s not applied when it&amp;#39;s needed.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2408c4", "score_hidden": false, "name": "t1_ch2czk5", "created": 1398490863.0, "author_flair_text": null, "created_utc": 1398487263.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2cnf6", "gilded": 0, "author": "LightAbsol", "parent_id": "t1_ch2c9z0", "approved_by": null, "body": "It's totally OK to feel that way. He should be very fortunate to be with someone that really cares about him (you really do!) and maybe the root of this problem is more ingrained into the relationship itself more than just something you did--because from what you said, it sounds like he's at fault with some issues as well. Do you think he's abusive the way he treats you, or is there a way you can sort things out, together?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s totally OK to feel that way. He should be very fortunate to be with someone that really cares about him (you really do!) and maybe the root of this problem is more ingrained into the relationship itself more than just something you did--because from what you said, it sounds like he&amp;#39;s at fault with some issues as well. Do you think he&amp;#39;s abusive the way he treats you, or is there a way you can sort things out, together?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2408c4", "score_hidden": false, "name": "t1_ch2cnf6", "created": 1398489862.0, "author_flair_text": null, "created_utc": 1398486262.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2c9z0", "gilded": 0, "author": "throwmeawayimnothing", "parent_id": "t1_ch2bnia", "approved_by": null, "body": "Thanks for responding. I suppose I do get the whole \"you should love yourself\" thing, but it's just really hard when my past is constantly lingering in my mind. There's always this voice in my head that tells me, \"Hey, remember that shitty thing you did? Well, I'm going to remind you of that and all the stupid shit you've done as well!\"\n\nOn one hand, I love him a lot and don't want to leave. On the other hand, I don't think I deserve to leave. Why do I, the adulterer, get a chance at a happier life, to be able to start on a clean slate while the betrayed is left, forever scarred and with trust issues? It doesn't seem fair to me, I deserve that punishment, not him.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for responding. I suppose I do get the whole &amp;quot;you should love yourself&amp;quot; thing, but it&amp;#39;s just really hard when my past is constantly lingering in my mind. There&amp;#39;s always this voice in my head that tells me, &amp;quot;Hey, remember that shitty thing you did? Well, I&amp;#39;m going to remind you of that and all the stupid shit you&amp;#39;ve done as well!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;On one hand, I love him a lot and don&amp;#39;t want to leave. On the other hand, I don&amp;#39;t think I deserve to leave. Why do I, the adulterer, get a chance at a happier life, to be able to start on a clean slate while the betrayed is left, forever scarred and with trust issues? It doesn&amp;#39;t seem fair to me, I deserve that punishment, not him.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2408c4", "score_hidden": false, "name": "t1_ch2c9z0", "created": 1398488795.0, "author_flair_text": null, "created_utc": 1398485195.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2bnia", "gilded": 0, "author": "LightAbsol", "parent_id": "t3_2408c4", "approved_by": null, "body": "Personally I think you're very brave for admitting to what you did and staying truthful to him about it, but it breaks my heart that he treats you badly in return. Being a stranger here on the internet, I have no place whether to tell you or not to stay with him, but I do think that you should start focusing on the awesome things that make you, you. You deserve to be surrounded by people who can help you realize the positive aspects about yourself and not around someone who keeps bashing you because of your past. What's done is done, and now it's time to focus on a happier future, where you don't have to be alone anymore. I'm here for you and so is anyone else reading this. The love you have for him right now is just as important as the love you should have for yourself. If that makes sense to you, do let me know, otherwise stay around and please talk to the other people around here. There's a lot more I want to say but only so much I can type in one blurb.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I think you&amp;#39;re very brave for admitting to what you did and staying truthful to him about it, but it breaks my heart that he treats you badly in return. Being a stranger here on the internet, I have no place whether to tell you or not to stay with him, but I do think that you should start focusing on the awesome things that make you, you. You deserve to be surrounded by people who can help you realize the positive aspects about yourself and not around someone who keeps bashing you because of your past. What&amp;#39;s done is done, and now it&amp;#39;s time to focus on a happier future, where you don&amp;#39;t have to be alone anymore. I&amp;#39;m here for you and so is anyone else reading this. The love you have for him right now is just as important as the love you should have for yourself. If that makes sense to you, do let me know, otherwise stay around and please talk to the other people around here. There&amp;#39;s a lot more I want to say but only so much I can type in one blurb.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2408c4", "score_hidden": false, "name": "t1_ch2bnia", "created": 1398487097.0, "author_flair_text": null, "created_utc": 1398483497.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]