[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;OK so I&amp;#39;ve flirted with the idea of suicide for a long time, have often planned it, but now the planning is getting serious and I don&amp;#39;t know how to stop it. I think my main concern is that I keep putting myself in situations in which a single snap decision could end it; I don&amp;#39;t trust myself in these situations.&lt;/p&gt;\n\n&lt;p&gt;This is a throwaway, you can read my previous comments for a bit of history. Essentially I&amp;#39;m an alcoholic and have been for some time. I am objectively a bad person - if you want more details I can give you more details. This isn&amp;#39;t a case of &amp;quot;oh, he thinks he&amp;#39;s a bad person but deep down he&amp;#39;s lovely&amp;quot;. I am rotten to the core. I have done things that any self-respecting individual would find repulsive and, to be honest, evil. Oh and do you want to know the absolute killer line (pun intended)? Do you want to know how absolutely self-inflicted this is? &lt;strong&gt;I decided to become an alcoholic.&lt;/strong&gt; I made a conscious decision. I was perhaps 14 or 15, and I wanted pity. I was then, as I am now, self-obsessed, and I was attracted to the morbid glamour of alcoholism. I thought it suited me. Oh how right I was. &lt;/p&gt;\n\n&lt;p&gt;I have few friends left (the worst kind of problems are self-inflicted problems). The reason I haven&amp;#39;t killed myself is that I know how unfair it would be on my family - there are 3 people that I know love me, and I couldn&amp;#39;t do it to them. But recently I&amp;#39;ve started to realise (or started to think) that actually, on the balance of things, the world would be better without me. I definitely have a net negative effect on the world, even if you include my family in the equation. I desperately want to change this, but I no longer think I am capable. I am almost certain. So yeah, while I don&amp;#39;t want to cause my family distress, I don&amp;#39;t want to continue having a negative effect on the world. It&amp;#39;s not fair on the people around me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what I aim to get from this. It&amp;#39;s almost definitely a somewhat pathetic cry for attention. I probably will never go through with it. I&amp;#39;m just worried.&lt;/p&gt;\n\n&lt;p&gt;Oh, and if you haven&amp;#39;t gathered by now, I&amp;#39;m rather self-obsessed. I&amp;#39;m more than willing to talk. Please help me. I don&amp;#39;t have a support structure, I don&amp;#39;t have anywhere else to turn than to this bloody website.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "OK so I've flirted with the idea of suicide for a long time, have often planned it, but now the planning is getting serious and I don't know how to stop it. I think my main concern is that I keep putting myself in situations in which a single snap decision could end it; I don't trust myself in these situations.\n\nThis is a throwaway, you can read my previous comments for a bit of history. Essentially I'm an alcoholic and have been for some time. I am objectively a bad person - if you want more details I can give you more details. This isn't a case of \"oh, he thinks he's a bad person but deep down he's lovely\". I am rotten to the core. I have done things that any self-respecting individual would find repulsive and, to be honest, evil. Oh and do you want to know the absolute killer line (pun intended)? Do you want to know how absolutely self-inflicted this is? **I decided to become an alcoholic.** I made a conscious decision. I was perhaps 14 or 15, and I wanted pity. I was then, as I am now, self-obsessed, and I was attracted to the morbid glamour of alcoholism. I thought it suited me. Oh how right I was. \n\nI have few friends left (the worst kind of problems are self-inflicted problems). The reason I haven't killed myself is that I know how unfair it would be on my family - there are 3 people that I know love me, and I couldn't do it to them. But recently I've started to realise (or started to think) that actually, on the balance of things, the world would be better without me. I definitely have a net negative effect on the world, even if you include my family in the equation. I desperately want to change this, but I no longer think I am capable. I am almost certain. So yeah, while I don't want to cause my family distress, I don't want to continue having a negative effect on the world. It's not fair on the people around me. \n\nI'm not sure what I aim to get from this. It's almost definitely a somewhat pathetic cry for attention. I probably will never go through with it. I'm just worried.\n\nOh, and if you haven't gathered by now, I'm rather self-obsessed. I'm more than willing to talk. Please help me. I don't have a support structure, I don't have anywhere else to turn than to this bloody website.  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wmtv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Frowawyy", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wmtv/this_is_your_standard_story/", "name": "t3_24wmtv", "created": 1399447025.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wmtv/this_is_your_standard_story/", "author_flair_text": null, "title": "This is your standard story", "created_utc": 1399418225.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbhxal", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24wmtv", "approved_by": null, "body": "Have you tried getting help for the alcoholism or talking to family?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried getting help for the alcoholism or talking to family?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wmtv", "score_hidden": false, "name": "t1_chbhxal", "created": 1399432436.0, "author_flair_text": null, "created_utc": 1399428836.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chby8k8", "gilded": 0, "author": "JohnMalkovitchLover", "parent_id": "t3_24wmtv", "approved_by": null, "body": "I used to be an alcoholic and a Heroin addict. I'm sober now. Life is still hard but it's better than it was living in the hell of addiction. I too have done absolutely deplorable things and felt like I was truly evil, no way to get out of that. Well, it turns out that like you I am certainly a bit self-obsessed and no doubt have an addictive personality but I'm not total pond scum and neither are you. Alcohol is a depressant my friend. It makes your brain go haywire and wrecks your body. There are a few ways out. If you want my e-mail just PM me and we can talk about it. I won't go all cheerleader on you and preach or tell you what to do. I just want you to know that it's not a hundred percent YOU feeling this way and no matter what you've done in the past, today is a new day. You're ok. I promise it can get much much better. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to be an alcoholic and a Heroin addict. I&amp;#39;m sober now. Life is still hard but it&amp;#39;s better than it was living in the hell of addiction. I too have done absolutely deplorable things and felt like I was truly evil, no way to get out of that. Well, it turns out that like you I am certainly a bit self-obsessed and no doubt have an addictive personality but I&amp;#39;m not total pond scum and neither are you. Alcohol is a depressant my friend. It makes your brain go haywire and wrecks your body. There are a few ways out. If you want my e-mail just PM me and we can talk about it. I won&amp;#39;t go all cheerleader on you and preach or tell you what to do. I just want you to know that it&amp;#39;s not a hundred percent YOU feeling this way and no matter what you&amp;#39;ve done in the past, today is a new day. You&amp;#39;re ok. I promise it can get much much better. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wmtv", "score_hidden": false, "name": "t1_chby8k8", "created": 1399485701.0, "author_flair_text": null, "created_utc": 1399482101.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]