[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I will provide more details if requested, though it may not be as interesting as the title may make it look.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Additional info&lt;/strong&gt;: First of all, like I said before, it may not be the story you are expecting, and some may even make fun of me, but the whole point of doing this was to have some sort of outlet since I can&amp;#39;t really talk to anyone given the circumstances.\nBasically, I screwed up. Big time. I mean in my education. I&amp;#39;m almost at my third year of college and I have nothing to show for it, only failure and disappointment. My parents have been kind enough to support me after letting them down these past 2 years, and they don&amp;#39;t even know the whole story because I&amp;#39;ve been lying to them. Before this semester started, I was warned by my dad that this was my last chance, and that if I failed again, that would be it between us and that I&amp;#39;d be on my own. Tomorrow starts my last week of school, and I know I&amp;#39;m failing all my classes and grades will be posted by the end of the week and hell will break loose that day. And that is why I&amp;#39;ve decided that the best course of action is to avoid that altogether and, as cliche as it sounds, commit suicide before then. As for the reasons of my failure, that&amp;#39;s something I have a hard time talking about because it&amp;#39;s really complicated and it has to do with my mental health, which has been in shit condition for a long time now. So there you go! Do your worst, I&amp;#39;m prepared.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Midnight Update&lt;/strong&gt; Sorry I haven&amp;#39;t actively participating in my own post. I was trying to get my mind off of this thing for a while so I was playing Minecraft with a friend.\nI do feel a little better after not thinking about my problems, at least for a while (one of the reasons I love videogames), and I&amp;#39;ll be back tomorrow morning to try and let you in on my perspective on all this. Again, I apologize, but I gotta say, I was really surprised by many of the replies I got. I found myself smiling as I read them, which is something I haven&amp;#39;t done in a while. &lt;em&gt;Thank you&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Important Update&lt;/strong&gt;\nThank you everyone for your concern and advice. It really means a lot to me. I think I may have somewhat changed my mind. I&amp;#39;m not sure yet. But I am sure that you guys helped me see that it&amp;#39;s not quite over yet, and as long as I&amp;#39;m still alive, there are great things to look forward to, no matter how grim your situation is. I&amp;#39;m not saying I decided to confront my parents and prepare for the worst. But I do have one idea in mind, as a alternative to... well.. you know. Thank you everyone, and I&amp;#39;ll keep you posted.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Good news?&lt;/strong&gt;\nOk... so I&amp;#39;ve decided not to do it. I WILL be moving out of where I currently live though. I just feel like I have to be on my own for a while. It just feels right. I will take some time off college, probably the rest of the year. I&amp;#39;m currently scouring housing websites and even craigslist to find a place to live. I&amp;#39;ve never done this before so I&amp;#39;m not sure where the right place to look is, but I&amp;#39;ll figure it out somehow! It&amp;#39;s time for me to make my own decisions. I know this may sound weird but, if I fail or succeed in this, it will be on me. I made the decision, and I will deal with whatever comes next. Once I get settled and I feel somewhat stable, I&amp;#39;ll start looking for help regarding my mental health. This will be hard, but it&amp;#39;s something I have to do.\nThank you everyone for your support! You really lifted my spirit. &lt;strong&gt;Also&lt;/strong&gt;, if anyone has any experience looking for a cheap place to live, even if it&amp;#39;s only a room, please let me know. As I said, I don&amp;#39;t know where the best place to look is, so any help is welcome!\nThanks again! and contact me if you want yo know how it&amp;#39;s going!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I will provide more details if requested, though it may not be as interesting as the title may make it look.\n\n**Additional info**: First of all, like I said before, it may not be the story you are expecting, and some may even make fun of me, but the whole point of doing this was to have some sort of outlet since I can't really talk to anyone given the circumstances.\nBasically, I screwed up. Big time. I mean in my education. I'm almost at my third year of college and I have nothing to show for it, only failure and disappointment. My parents have been kind enough to support me after letting them down these past 2 years, and they don't even know the whole story because I've been lying to them. Before this semester started, I was warned by my dad that this was my last chance, and that if I failed again, that would be it between us and that I'd be on my own. Tomorrow starts my last week of school, and I know I'm failing all my classes and grades will be posted by the end of the week and hell will break loose that day. And that is why I've decided that the best course of action is to avoid that altogether and, as cliche as it sounds, commit suicide before then. As for the reasons of my failure, that's something I have a hard time talking about because it's really complicated and it has to do with my mental health, which has been in shit condition for a long time now. So there you go! Do your worst, I'm prepared.\n\n**Midnight Update** Sorry I haven't actively participating in my own post. I was trying to get my mind off of this thing for a while so I was playing Minecraft with a friend.\nI do feel a little better after not thinking about my problems, at least for a while (one of the reasons I love videogames), and I'll be back tomorrow morning to try and let you in on my perspective on all this. Again, I apologize, but I gotta say, I was really surprised by many of the replies I got. I found myself smiling as I read them, which is something I haven't done in a while. *Thank you*.\n\n**Important Update**\nThank you everyone for your concern and advice. It really means a lot to me. I think I may have somewhat changed my mind. I'm not sure yet. But I am sure that you guys helped me see that it's not quite over yet, and as long as I'm still alive, there are great things to look forward to, no matter how grim your situation is. I'm not saying I decided to confront my parents and prepare for the worst. But I do have one idea in mind, as a alternative to... well.. you know. Thank you everyone, and I'll keep you posted.\n\n**Good news?**\nOk... so I've decided not to do it. I WILL be moving out of where I currently live though. I just feel like I have to be on my own for a while. It just feels right. I will take some time off college, probably the rest of the year. I'm currently scouring housing websites and even craigslist to find a place to live. I've never done this before so I'm not sure where the right place to look is, but I'll figure it out somehow! It's time for me to make my own decisions. I know this may sound weird but, if I fail or succeed in this, it will be on me. I made the decision, and I will deal with whatever comes next. Once I get settled and I feel somewhat stable, I'll start looking for help regarding my mental health. This will be hard, but it's something I have to do.\nThank you everyone for your support! You really lifted my spirit. **Also**, if anyone has any experience looking for a cheap place to live, even if it's only a room, please let me know. As I said, I don't know where the best place to look is, so any help is welcome!\nThanks again! and contact me if you want yo know how it's going!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2457x3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "maze_of_mind", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398949991.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2457x3/tomorrow_is_the_first_day_of_my_last_week_on/", "name": "t3_2457x3", "created": 1398672480.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2457x3/tomorrow_is_the_first_day_of_my_last_week_on/", "author_flair_text": null, "title": "Tomorrow is the first day of my last week on Earth. Any tips in how to make the most out of it?", "created_utc": 1398643680.0, "ups": 11, "num_comments": 10, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3pvkq", "gilded": 0, "author": "TheTurretCube", "parent_id": "t3_2457x3", "approved_by": null, "body": "Failing college is no reason to commit suicide buddy, it's ok. There are so many other options out there for everyone, I'm certain you'll find your calling", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Failing college is no reason to commit suicide buddy, it&amp;#39;s ok. There are so many other options out there for everyone, I&amp;#39;m certain you&amp;#39;ll find your calling&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch3pvkq", "created": 1398648456.0, "author_flair_text": null, "created_utc": 1398644856.0, "distinguished": null, "num_reports": null, "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4qetb", "gilded": 0, "author": "EpicXY", "parent_id": "t1_ch4p3fw", "approved_by": null, "body": "That's the problem. Stop feeling so negative. Everyone is unique and everyone helps society in their own way. Some people may give smaller help than others, but it's still help. Stop focusing on the bad qualities and focus on the good qualities. If the bad ones are bring you down, improve them. \n\nTell me your bad qualities. I think you're taking this too fast. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the problem. Stop feeling so negative. Everyone is unique and everyone helps society in their own way. Some people may give smaller help than others, but it&amp;#39;s still help. Stop focusing on the bad qualities and focus on the good qualities. If the bad ones are bring you down, improve them. &lt;/p&gt;\n\n&lt;p&gt;Tell me your bad qualities. I think you&amp;#39;re taking this too fast. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch4qetb", "created": 1398769086.0, "author_flair_text": null, "created_utc": 1398740286.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4p3fw", "gilded": 0, "author": "maze_of_mind", "parent_id": "t1_ch3vz6t", "approved_by": null, "body": "You're right! You're the only who actually answered what I asked.\nThose are great suggestions, thanks.\nI have actually done some of them, but others are harder because time is running short and I don't have that much freedom over me.\n\nI really want to believe that I can come back from this and move on, but it's just that I've screwed up so much already, and I've been lying about, that's the worst part. Honestly, I just can't stand myself anymore. A person with such bad qualities can only be detrimental to society, so why stick around?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right! You&amp;#39;re the only who actually answered what I asked.\nThose are great suggestions, thanks.\nI have actually done some of them, but others are harder because time is running short and I don&amp;#39;t have that much freedom over me.&lt;/p&gt;\n\n&lt;p&gt;I really want to believe that I can come back from this and move on, but it&amp;#39;s just that I&amp;#39;ve screwed up so much already, and I&amp;#39;ve been lying about, that&amp;#39;s the worst part. Honestly, I just can&amp;#39;t stand myself anymore. A person with such bad qualities can only be detrimental to society, so why stick around?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch4p3fw", "created": 1398766475.0, "author_flair_text": null, "created_utc": 1398737675.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3vz6t", "gilded": 0, "author": "EpicXY", "parent_id": "t3_2457x3", "approved_by": null, "body": "Everyone here is trying to stop you from committing suicide, but I'm going to actually answer your question.\n\n1. Take a bike ride/ walk on the beach.\n\n2. Meditate in a relaxing environment.\n\n3. Read very good books.\n\n4. Spend this time with your true loved ones. (Family, friends, anyone you considered \"loved ones\")\n\n5. Explore more. Go to places you have never been. \n\n6. Write down what kept you going till this day. \n\n7. Give advice to others so they don't go through the pain you're in right now.\n\n8. Sleep more.\n\n9. Appreciate the small things people assume to be insignificant.\n\n10. Finish things that were incomplete till today. \n\n\nI'm going to say this now: avoid suicide. I'm being a complete hypocrite right now, but please try to find another solution to your problems. Most problems can be fixed/helped. So please don't end your life like this.\n\nBut if you choose too and you are really set on doing this, then I can't stop you. I've learned people with determination cannot be stopped. I may be a mere stranger, but I'm pleading you not to go. However, I've have given you 10 things you can do to make the most out of this week before you go. Just remember. There are people like you, so don't feel alone. Plenty of people can't go through college like you did. You're a smart person and you should feel that way. \n\nPlease reconsider and talk to me if you feel you need to do so. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone here is trying to stop you from committing suicide, but I&amp;#39;m going to actually answer your question.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Take a bike ride/ walk on the beach.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Meditate in a relaxing environment.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Read very good books.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Spend this time with your true loved ones. (Family, friends, anyone you considered &amp;quot;loved ones&amp;quot;)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Explore more. Go to places you have never been. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Write down what kept you going till this day. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Give advice to others so they don&amp;#39;t go through the pain you&amp;#39;re in right now.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sleep more.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appreciate the small things people assume to be insignificant.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finish things that were incomplete till today. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I&amp;#39;m going to say this now: avoid suicide. I&amp;#39;m being a complete hypocrite right now, but please try to find another solution to your problems. Most problems can be fixed/helped. So please don&amp;#39;t end your life like this.&lt;/p&gt;\n\n&lt;p&gt;But if you choose too and you are really set on doing this, then I can&amp;#39;t stop you. I&amp;#39;ve learned people with determination cannot be stopped. I may be a mere stranger, but I&amp;#39;m pleading you not to go. However, I&amp;#39;ve have given you 10 things you can do to make the most out of this week before you go. Just remember. There are people like you, so don&amp;#39;t feel alone. Plenty of people can&amp;#39;t go through college like you did. You&amp;#39;re a smart person and you should feel that way. &lt;/p&gt;\n\n&lt;p&gt;Please reconsider and talk to me if you feel you need to do so. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch3vz6t", "created": 1398687629.0, "author_flair_text": null, "created_utc": 1398658829.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3pzkq", "gilded": 0, "author": "MusteredCourage", "parent_id": "t3_2457x3", "approved_by": null, "body": "Please please please do not go through with this! You're so young with a long life ahead of you with so much potential! I can relate to you're situation, I hid barely made it through high school because I was struggling with major depression and the whole time I was letting my parents down. I faced my fears and I suffered the consequences of my poor decisions and actions. After that, I talked to my parents about the reasons behind my depression and the cause for my horrible school performance. If you do the same it will allow them to help you like mine helped me. They will at least have some closure on the matter and they can work with you towards a more positive outcome in your life. I know your scared, LIFE and the realities that we must face on a daily basis are sometimes horrifying. BUT we are humans and we adapt, we push on. All of us here on /r/SuicideWatch and your parents as well need you to do this. The best option.... and im sure you know this deep inside. Is to face the heat. I promise you it will get better, Hope is something that makes us human, and that is what you need to do. Hope, and act towards a better future for yourself. I hope this changes your mind, or at least makes you consider for the remainder of the week. ... From a random stranger who cares :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please please please do not go through with this! You&amp;#39;re so young with a long life ahead of you with so much potential! I can relate to you&amp;#39;re situation, I hid barely made it through high school because I was struggling with major depression and the whole time I was letting my parents down. I faced my fears and I suffered the consequences of my poor decisions and actions. After that, I talked to my parents about the reasons behind my depression and the cause for my horrible school performance. If you do the same it will allow them to help you like mine helped me. They will at least have some closure on the matter and they can work with you towards a more positive outcome in your life. I know your scared, LIFE and the realities that we must face on a daily basis are sometimes horrifying. BUT we are humans and we adapt, we push on. All of us here on &lt;a href=\"/r/SuicideWatch\"&gt;/r/SuicideWatch&lt;/a&gt; and your parents as well need you to do this. The best option.... and im sure you know this deep inside. Is to face the heat. I promise you it will get better, Hope is something that makes us human, and that is what you need to do. Hope, and act towards a better future for yourself. I hope this changes your mind, or at least makes you consider for the remainder of the week. ... From a random stranger who cares :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch3pzkq", "created": 1398648714.0, "author_flair_text": null, "created_utc": 1398645114.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yfsd", "gilded": 0, "author": "samshepard", "parent_id": "t1_ch3yf49", "approved_by": null, "body": "not trying to say college is stupid.. but im in my 5th year, i've been miserable for most of the time, and i wish i had gotten straight to work right out of highschool, and now im in debt. just my perspective.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;not trying to say college is stupid.. but im in my 5th year, i&amp;#39;ve been miserable for most of the time, and i wish i had gotten straight to work right out of highschool, and now im in debt. just my perspective.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch3yfsd", "created": 1398695269.0, "author_flair_text": null, "created_utc": 1398666469.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3yf49", "gilded": 0, "author": "samshepard", "parent_id": "t3_2457x3", "approved_by": null, "body": "it's just college, and it's not for everyone anyways. also, it's not your whole life. some people are better suited for starting at low-on-the-pole positions or internships in the fields they want. you have options!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s just college, and it&amp;#39;s not for everyone anyways. also, it&amp;#39;s not your whole life. some people are better suited for starting at low-on-the-pole positions or internships in the fields they want. you have options!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2457x3", "score_hidden": false, "name": "t1_ch3yf49", "created": 1398695190.0, "author_flair_text": null, "created_utc": 1398666390.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]