[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 14 years old and was sexually abused by my father as a child. I here voices, believe the government is watching and am being followed by shadows. I&amp;#39;m writing this not so someone can stop me, no one can, but so that my family will find my account and will know that I&amp;#39;m sorry. &lt;/p&gt;\n\n&lt;p&gt;Mum, I know you&amp;#39;ve already lost a child and I&amp;#39;m sorry you have to bury another. None of this was your fault you couldn&amp;#39;t have stopped Dad and you weren&amp;#39;t to know what was happening. Know now I&amp;#39;m in a better place. I&amp;#39;m no longer in pain. I&amp;#39;m free. &lt;/p&gt;\n\n&lt;p&gt;To my step dad, you&amp;#39;ve been more of a father to me in the 6 years I&amp;#39;ve known you then my dad was in my whole life. You make my mum happy and for that I&amp;#39;d like to thank you. Be strong for her and please take good care of my brother and sister. &lt;/p&gt;\n\n&lt;p&gt;My beautiful sister, you couldn&amp;#39;t have done anything. I know you will blame yourself but I promise you that you couldn&amp;#39;t have done anything. Please be all you want to be and know I am with you. I have so much more I could say but it&amp;#39;s useless. Stay strong gorgeous.&lt;/p&gt;\n\n&lt;p&gt;Hey brother, right now you probably don&amp;#39;t understand completely why I did this. I guess you&amp;#39;re only 10. I did this because the pain inside was too much for me to deal with anymore. You have a whole future ahead of you and I don&amp;#39;t want this to stop you from being whatever you want to be. I&amp;#39;m happy now and I&amp;#39;ll be watching over you I promise. &lt;/p&gt;\n\n&lt;p&gt;And last but not least my wonderful boyfriend. You&amp;#39;ve been my rock ever since I met you. You&amp;#39;re perfect and I know you&amp;#39;ll find someone else who will make you  happier. You&amp;#39;re better off without me. It may not seem like it but you are. Don&amp;#39;t stop being usual optimistic self and remember I love you. &lt;/p&gt;\n\n&lt;p&gt;I want everyone who cares about me to remember you were my first thought when I woke up this morning and will be my last thought as I fall asleep for the last time. &lt;/p&gt;\n\n&lt;p&gt;I love you all, \nGoodbye xx&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 14 years old and was sexually abused by my father as a child. I here voices, believe the government is watching and am being followed by shadows. I'm writing this not so someone can stop me, no one can, but so that my family will find my account and will know that I'm sorry. \n\nMum, I know you've already lost a child and I'm sorry you have to bury another. None of this was your fault you couldn't have stopped Dad and you weren't to know what was happening. Know now I'm in a better place. I'm no longer in pain. I'm free. \n\nTo my step dad, you've been more of a father to me in the 6 years I've known you then my dad was in my whole life. You make my mum happy and for that I'd like to thank you. Be strong for her and please take good care of my brother and sister. \n\nMy beautiful sister, you couldn't have done anything. I know you will blame yourself but I promise you that you couldn't have done anything. Please be all you want to be and know I am with you. I have so much more I could say but it's useless. Stay strong gorgeous.\n\nHey brother, right now you probably don't understand completely why I did this. I guess you're only 10. I did this because the pain inside was too much for me to deal with anymore. You have a whole future ahead of you and I don't want this to stop you from being whatever you want to be. I'm happy now and I'll be watching over you I promise. \n\nAnd last but not least my wonderful boyfriend. You've been my rock ever since I met you. You're perfect and I know you'll find someone else who will make you  happier. You're better off without me. It may not seem like it but you are. Don't stop being usual optimistic self and remember I love you. \n\nI want everyone who cares about me to remember you were my first thought when I woke up this morning and will be my last thought as I fall asleep for the last time. \n\nI love you all, \nGoodbye xx", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24fl0w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "xlivox", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24fl0w/tonight_is_it/", "name": "t3_24fl0w", "created": 1398948346.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24fl0w/tonight_is_it/", "author_flair_text": null, "title": "Tonight is it...", "created_utc": 1398919546.0, "ups": 4, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6pvn7", "gilded": 0, "author": "Hugs4Zeds", "parent_id": "t3_24fl0w", "approved_by": null, "body": "Please still be here. PM me, I'd love to chat.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please still be here. PM me, I&amp;#39;d love to chat.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24fl0w", "score_hidden": false, "name": "t1_ch6pvn7", "created": 1398933119.0, "author_flair_text": null, "created_utc": 1398929519.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch6yuxu", "gilded": 0, "author": "Metalhead4026", "parent_id": "t3_24fl0w", "approved_by": null, "body": "Come on man, don't do anything yet. I'm 15 so I'm around your age if you'd like to PM me. I'm here to listen, please be here.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Come on man, don&amp;#39;t do anything yet. I&amp;#39;m 15 so I&amp;#39;m around your age if you&amp;#39;d like to PM me. I&amp;#39;m here to listen, please be here.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24fl0w", "score_hidden": false, "name": "t1_ch6yuxu", "created": 1398991273.0, "author_flair_text": null, "created_utc": 1398962473.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]