[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently I have had both of my grandmothers pass away. One was in her sleep, and the other went after years of struggling and pain from emphysema and multiple major back surgeries gone awry.  During this time of grieving work has given me a lot of (paid) time off.  I find myself sitting at home dwelling on things that have happened in my life and how much I miss my grandmothers.  I was and always shall be very close to them both.  I find myself dwelling on the many mistakes in my life and thinking of how I would start-over if I can.&lt;/p&gt;\n\n&lt;p&gt;I have been depressed off and on for the battery part of my life.  I have spent a lot of time in college trying to learn to cope with it and, until recently, I have been rather successful.  I used to, in my teenage years, have issues where I would visualize myself, dead, staring at myself as I laid down going to sleep.  I can mentally picture myself, hanging from the ceiling.  Those mental images over time subsided and I have not been plagued by them for a long time now. Until recently.  I cannot get those images out of my head and I cannot stop thinking of death.  I believe in the afterlife and rebirth and this brings me to want to kill myself, to give myself the relief of starting over and being free of these mental images of terror, and free of the many physical issues that I have as well.  I just don&amp;#39;t know what to do anymore.  Thank you for being a place I can get these thoughts down and out somewhat publicly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Recently I have had both of my grandmothers pass away. One was in her sleep, and the other went after years of struggling and pain from emphysema and multiple major back surgeries gone awry.  During this time of grieving work has given me a lot of (paid) time off.  I find myself sitting at home dwelling on things that have happened in my life and how much I miss my grandmothers.  I was and always shall be very close to them both.  I find myself dwelling on the many mistakes in my life and thinking of how I would start-over if I can.\n\nI have been depressed off and on for the battery part of my life.  I have spent a lot of time in college trying to learn to cope with it and, until recently, I have been rather successful.  I used to, in my teenage years, have issues where I would visualize myself, dead, staring at myself as I laid down going to sleep.  I can mentally picture myself, hanging from the ceiling.  Those mental images over time subsided and I have not been plagued by them for a long time now. Until recently.  I cannot get those images out of my head and I cannot stop thinking of death.  I believe in the afterlife and rebirth and this brings me to want to kill myself, to give myself the relief of starting over and being free of these mental images of terror, and free of the many physical issues that I have as well.  I just don't know what to do anymore.  Thank you for being a place I can get these thoughts down and out somewhat publicly.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25fc42", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stupidthrowawayppl", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25fc42/too_much_time_to_dwell/", "name": "t3_25fc42", "created": 1399986239.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25fc42/too_much_time_to_dwell/", "author_flair_text": null, "title": "too much time to dwell", "created_utc": 1399957439.0, "ups": 1, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chgmx0r", "gilded": 0, "author": "ILLITERATE_HOBO", "parent_id": "t3_25fc42", "approved_by": null, "body": "That's really interesting and pretty unique, how are you feeling now?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really interesting and pretty unique, how are you feeling now?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25fc42", "score_hidden": false, "name": "t1_chgmx0r", "created": 1399988438.0, "author_flair_text": null, "created_utc": 1399959638.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]