[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have depression. I don&amp;#39;t have anxiety. And most of all, in the grand scheme of things, my life feels like a cakewalk compared to most people&amp;#39;s. Despite all this I find myself struggling to keep going. More and more though suicide seems like the favorable route here. The past few years I guess I faked myself into being &amp;quot;content&amp;quot; with my life but it&amp;#39;s worn off now. Every day I want to be dead, but I don&amp;#39;t want to die. Maybe I&amp;#39;m just waiting for something actually bad enough to happen to give me a logical reason to end it. &lt;/p&gt;\n\n&lt;p&gt;I guess some background info would help. I&amp;#39;m 17, do mediocre but not terrible in school. Throughout all of my schooling, I have only ever had 1 actual friend, and I only knew him for 2 years before I moved away. And since then, I suppose I&amp;#39;ve been spiraling down the path of loserdom. I try to be outgoing, know that I&amp;#39;m fairly friendly, but I just AM a boring person plain and simple. I&amp;#39;m not funny, have few hobbies that I&amp;#39;m not great at, have no passion for anything. Not that I try to avoid making friends, but I don&amp;#39;t fit in with anyone, not even the &amp;quot;misfits.&amp;quot; Typical High School BS, I know.&lt;/p&gt;\n\n&lt;p&gt;Anyways... A year ago I would think I would think I would be crazy for uttering the word suicide. But my self harm addiction has resurfaced. It&amp;#39;s been a habit since the start if Middle School, the occasional cutting, but mostly striking myself in the face. From Freshman to Junior year I forced myself into a state of complacency with myself and &amp;quot;the world&amp;quot; as a High Schooler sees it. But I&amp;#39;ve finally given in to the urges and began cutting and striking myself again. And now, with the pain-high still coursing through my body, I can&amp;#39;t help but wonder why I shouldn&amp;#39;t end it. It might get better, but I won&amp;#39;t. I will always be the boring person that people tolerate, the observer who never has anything important to say. And god forbid if I ever get that far, the husband who&amp;#39;s wife settled for financial stability, or the father who never does anything fun with their kid. That isn&amp;#39;t a life I want to live, and thinking about it makes death seem even more pleasant.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't have depression. I don't have anxiety. And most of all, in the grand scheme of things, my life feels like a cakewalk compared to most people's. Despite all this I find myself struggling to keep going. More and more though suicide seems like the favorable route here. The past few years I guess I faked myself into being \"content\" with my life but it's worn off now. Every day I want to be dead, but I don't want to die. Maybe I'm just waiting for something actually bad enough to happen to give me a logical reason to end it. \n\nI guess some background info would help. I'm 17, do mediocre but not terrible in school. Throughout all of my schooling, I have only ever had 1 actual friend, and I only knew him for 2 years before I moved away. And since then, I suppose I've been spiraling down the path of loserdom. I try to be outgoing, know that I'm fairly friendly, but I just AM a boring person plain and simple. I'm not funny, have few hobbies that I'm not great at, have no passion for anything. Not that I try to avoid making friends, but I don't fit in with anyone, not even the \"misfits.\" Typical High School BS, I know.\n\nAnyways... A year ago I would think I would think I would be crazy for uttering the word suicide. But my self harm addiction has resurfaced. It's been a habit since the start if Middle School, the occasional cutting, but mostly striking myself in the face. From Freshman to Junior year I forced myself into a state of complacency with myself and \"the world\" as a High Schooler sees it. But I've finally given in to the urges and began cutting and striking myself again. And now, with the pain-high still coursing through my body, I can't help but wonder why I shouldn't end it. It might get better, but I won't. I will always be the boring person that people tolerate, the observer who never has anything important to say. And god forbid if I ever get that far, the husband who's wife settled for financial stability, or the father who never does anything fun with their kid. That isn't a life I want to live, and thinking about it makes death seem even more pleasant.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c7kf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Jimbo-McBimbo", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c7kf/ugh/", "name": "t3_24c7kf", "created": 1398857227.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c7kf/ugh/", "author_flair_text": null, "title": "Ugh.", "created_utc": 1398828427.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5ozm4", "gilded": 0, "author": "thoverlord", "parent_id": "t3_24c7kf", "approved_by": null, "body": "Ur in highschool and your young there is time for adventure. Grades are important but there not everything. I'm just a few years ahead of you and finacily I'm ahead of my friends. You said you have hobbies many look into something you can do socially. I had issues with self harm when I was ur age I know its hard to kick but its not worth ur life. Good luck my friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ur in highschool and your young there is time for adventure. Grades are important but there not everything. I&amp;#39;m just a few years ahead of you and finacily I&amp;#39;m ahead of my friends. You said you have hobbies many look into something you can do socially. I had issues with self harm when I was ur age I know its hard to kick but its not worth ur life. Good luck my friend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c7kf", "score_hidden": false, "name": "t1_ch5ozm4", "created": 1398858465.0, "author_flair_text": null, "created_utc": 1398829665.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5py0h", "gilded": 0, "author": "sexiquebecbabe69", "parent_id": "t3_24c7kf", "approved_by": null, "body": "I'm sorry you are feeling like this, truly. I'm the same age as you and I often feel the same. I guess what keeps me going is knowing that one day I will be able to follow my dreams. I'm not quite sure what my dreams are even and often tell people sarcastically that I'm becoming an astronaut. I know you say you don't have any passions but in time I'm sure you discover them. Adventure and travel and see more of the world before you decide this is not the place for you. You do not have to live a life that you do not want. High school, as you said, is bullshit and really it will end and you will not be subjected to the same mundane schedule every day. There is still so much to see out there and aren't alone in the way you feel. Best of luck, I hope everything gets better. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you are feeling like this, truly. I&amp;#39;m the same age as you and I often feel the same. I guess what keeps me going is knowing that one day I will be able to follow my dreams. I&amp;#39;m not quite sure what my dreams are even and often tell people sarcastically that I&amp;#39;m becoming an astronaut. I know you say you don&amp;#39;t have any passions but in time I&amp;#39;m sure you discover them. Adventure and travel and see more of the world before you decide this is not the place for you. You do not have to live a life that you do not want. High school, as you said, is bullshit and really it will end and you will not be subjected to the same mundane schedule every day. There is still so much to see out there and aren&amp;#39;t alone in the way you feel. Best of luck, I hope everything gets better. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c7kf", "score_hidden": false, "name": "t1_ch5py0h", "created": 1398835477.0, "author_flair_text": null, "created_utc": 1398831877.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]