[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve posted here once before and I felt like it helped calm me down at the time so I figured that while I&amp;#39;m having what feels like a manic episode I would post here again for some support.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m feeling a massive sense of self-loathing that I really just can&amp;#39;t shake and all I can think about is either how much I hate myself right now or how I want to kill myself. I don&amp;#39;t know if I could ever actually do it but right now it is constantly on my mind and I can&amp;#39;t get over the thought that it really is my best option right not, I know it isn&amp;#39;t, but every time I try and tell myself that it isn&amp;#39;t the only reason I can think that it wouldn&amp;#39;t be my best option is because of my family and friends.&lt;/p&gt;\n\n&lt;p&gt;My hatred of myself is becoming unbearable where it&amp;#39;s affecting my ability to do my uni work because I can&amp;#39;t look at a page long enough to read what the words are saying before I just feel ridiculously pent up. I&amp;#39;ve fallen behind on my uni work so far this year because I problems with anxiety earlier on in the year meaning I was allowed some deferrals on my exams but I don&amp;#39;t think its help except to prolong the inevitable breakdown I have when an exam approaches.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t even feel like a constant feeling, I can feel fine for an entire day but then one thing will remind me of how much work I have to do or some other minor detail in my life that will just send me into a spiral where I can&amp;#39;t get the suicidal thoughts out of my head until I calm myself down a few hours later.&lt;/p&gt;\n\n&lt;p&gt;Right now I just don&amp;#39;t know where I&amp;#39;m going any more I don&amp;#39;t think I can handle hating myself this much any more let alone how much it is bound to increase over the next few weeks. I hate that the only reason I feel like I&amp;#39;m alive is because of people close to me, I want to be alone so I just end all this anxiety and stress but I can&amp;#39;t even bring myself to push the people I care about away which just makes me hate myself even more. Even though I still have these people around me I don&amp;#39;t even really feel like I could turn to them for this kind of support.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not quite sure what I hope to gain from this post but it helped me last time. I guess I would appreciate advice if you think you know what could help but honestly I don&amp;#39;t know how likely I am to follow through with most advice.&lt;/p&gt;\n\n&lt;p&gt;This is kind of tagged onto the end here but it&amp;#39;s another thought that I kind of want to express &amp;quot;out loud&amp;quot; since I&amp;#39;ve only thought about it a LOT in my head. I keep coming back to the idea that I&amp;#39;m suffering a mental illness of some sort such as depression or bipolar but every time I arrive at that thought I just get mad at myself for thinking of my &amp;quot;episode&amp;quot; as worthy of an official diagnosis. It seems like I arrive at the conclusion that I&amp;#39;m depressed but immediately just say to myself to stop being so dramatic because It&amp;#39;s not a permanent feeling and I get it into my head that I&amp;#39;m making light of such a serious illness which contributes so much more to my self-hatred.&lt;/p&gt;\n\n&lt;p&gt;Again I really don&amp;#39;t know whats to gain from saying this but I feel like I reaching a tipping point and I&amp;#39;m scared really. I&amp;#39;m scared because right now the main thing I want is to be exist and I&amp;#39;m sacred that at some point I might actually go through with it.&lt;/p&gt;\n\n&lt;p&gt;I really hope someone reads through this entire thing and I don&amp;#39;t even  know why.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've posted here once before and I felt like it helped calm me down at the time so I figured that while I'm having what feels like a manic episode I would post here again for some support.\n\nI'm feeling a massive sense of self-loathing that I really just can't shake and all I can think about is either how much I hate myself right now or how I want to kill myself. I don't know if I could ever actually do it but right now it is constantly on my mind and I can't get over the thought that it really is my best option right not, I know it isn't, but every time I try and tell myself that it isn't the only reason I can think that it wouldn't be my best option is because of my family and friends.\n\nMy hatred of myself is becoming unbearable where it's affecting my ability to do my uni work because I can't look at a page long enough to read what the words are saying before I just feel ridiculously pent up. I've fallen behind on my uni work so far this year because I problems with anxiety earlier on in the year meaning I was allowed some deferrals on my exams but I don't think its help except to prolong the inevitable breakdown I have when an exam approaches.\n\nIt doesn't even feel like a constant feeling, I can feel fine for an entire day but then one thing will remind me of how much work I have to do or some other minor detail in my life that will just send me into a spiral where I can't get the suicidal thoughts out of my head until I calm myself down a few hours later.\n\nRight now I just don't know where I'm going any more I don't think I can handle hating myself this much any more let alone how much it is bound to increase over the next few weeks. I hate that the only reason I feel like I'm alive is because of people close to me, I want to be alone so I just end all this anxiety and stress but I can't even bring myself to push the people I care about away which just makes me hate myself even more. Even though I still have these people around me I don't even really feel like I could turn to them for this kind of support.\n\nI'm not quite sure what I hope to gain from this post but it helped me last time. I guess I would appreciate advice if you think you know what could help but honestly I don't know how likely I am to follow through with most advice.\n\nThis is kind of tagged onto the end here but it's another thought that I kind of want to express \"out loud\" since I've only thought about it a LOT in my head. I keep coming back to the idea that I'm suffering a mental illness of some sort such as depression or bipolar but every time I arrive at that thought I just get mad at myself for thinking of my \"episode\" as worthy of an official diagnosis. It seems like I arrive at the conclusion that I'm depressed but immediately just say to myself to stop being so dramatic because It's not a permanent feeling and I get it into my head that I'm making light of such a serious illness which contributes so much more to my self-hatred.\n\nAgain I really don't know whats to gain from saying this but I feel like I reaching a tipping point and I'm scared really. I'm scared because right now the main thing I want is to be exist and I'm sacred that at some point I might actually go through with it.\n\nI really hope someone reads through this entire thing and I don't even  know why.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "241hss", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "halfcookedhero", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/241hss/unloading_about_my_growing_selfloathing/", "name": "t3_241hss", "created": 1398561014.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/241hss/unloading_about_my_growing_selfloathing/", "author_flair_text": null, "title": "Unloading about my growing self-loathing", "created_utc": 1398532214.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2ody4", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2o98p", "approved_by": null, "body": "I wish I could help more, I totally understand not wanting to talk it through with her yet. I guess it's allergy season, so you can always blame it on that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could help more, I totally understand not wanting to talk it through with her yet. I guess it&amp;#39;s allergy season, so you can always blame it on that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241hss", "score_hidden": false, "name": "t1_ch2ody4", "created": 1398537868.0, "author_flair_text": null, "created_utc": 1398534268.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2o98p", "gilded": 0, "author": "halfcookedhero", "parent_id": "t1_ch2o62m", "approved_by": null, "body": "Honestly I had like a 5 minute cry it helped a bit. Kinda opened the flood gates though and I can't stop being all tearey and shit, need to sort it out before my girlfriend gets here, don't quite know her well enough to offload all this shit on her yet.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I had like a 5 minute cry it helped a bit. Kinda opened the flood gates though and I can&amp;#39;t stop being all tearey and shit, need to sort it out before my girlfriend gets here, don&amp;#39;t quite know her well enough to offload all this shit on her yet.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241hss", "score_hidden": false, "name": "t1_ch2o98p", "created": 1398537527.0, "author_flair_text": null, "created_utc": 1398533927.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2o62m", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch2o395", "approved_by": null, "body": "Yeah, I'll hopefully be around whenever. Try just going and getting a glass of water, always helps to calm me down a little, but I get that may not work for you. I hope we can sort things out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I&amp;#39;ll hopefully be around whenever. Try just going and getting a glass of water, always helps to calm me down a little, but I get that may not work for you. I hope we can sort things out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241hss", "score_hidden": false, "name": "t1_ch2o62m", "created": 1398537302.0, "author_flair_text": null, "created_utc": 1398533702.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2o395", "gilded": 0, "author": "halfcookedhero", "parent_id": "t1_ch2nuo6", "approved_by": null, "body": "I'm not really able to talk to anyone right now plus I think I should calm down before I talk too much about it. I might actually appreciate having someone to who understands to talk to if you don't mind me coming back here later and PMing you? I might never follow you up on it but right now it feels like something that might help if you were actually being serious?\n\nEven if I don't ever get back to you I do really appreciate that you took the time to offer and even just replying to the post.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not really able to talk to anyone right now plus I think I should calm down before I talk too much about it. I might actually appreciate having someone to who understands to talk to if you don&amp;#39;t mind me coming back here later and PMing you? I might never follow you up on it but right now it feels like something that might help if you were actually being serious?&lt;/p&gt;\n\n&lt;p&gt;Even if I don&amp;#39;t ever get back to you I do really appreciate that you took the time to offer and even just replying to the post.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241hss", "score_hidden": false, "name": "t1_ch2o395", "created": 1398537096.0, "author_flair_text": null, "created_utc": 1398533496.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2nuo6", "gilded": 0, "author": "[deleted]", "parent_id": "t3_241hss", "approved_by": null, "body": "Almost everything you've written here feels like something I could have written, I think our situations aren't too dissimilar. I don't know if that means I'm going to be able to help or if i'm too close to this to work things out, but if you're after someone to talk to, I can listen and i'll do my best with everything else. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Almost everything you&amp;#39;ve written here feels like something I could have written, I think our situations aren&amp;#39;t too dissimilar. I don&amp;#39;t know if that means I&amp;#39;m going to be able to help or if i&amp;#39;m too close to this to work things out, but if you&amp;#39;re after someone to talk to, I can listen and i&amp;#39;ll do my best with everything else. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_241hss", "score_hidden": false, "name": "t1_ch2nuo6", "created": 1398536467.0, "author_flair_text": null, "created_utc": 1398532867.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]