[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what happened. If I had a relapse or if it&amp;#39;s bi-polar.&lt;/p&gt;\n\n&lt;p&gt;I am definitely overwhelmed right now with my life. I have to obtain insurance and they&amp;#39;re all over 100 dollars. ( New driver.) I don&amp;#39;t have my own car. I might have to get two jobs. I want to go to college. Working on getting my certificates in networking might be harder than I previously thought. I actually do need a new pair of dress cowboy boots, don&amp;#39;t have any dress shoes at all as well as suit. I also have to make sure my phone bill does not surpass $170 this month. It&amp;#39;s at $140.00 right now.&lt;/p&gt;\n\n&lt;p&gt;I broke down and cried and the suicide thoughts came back for a bit and thought if someone took my life, I&amp;#39;d be ok with it.&lt;/p&gt;\n\n&lt;p&gt;During the relapse I wondered why an old friend never bothered to contact me again. I am still astonished that he hasn&amp;#39;t blocked my e-mail from his. Thought maybe I&amp;#39;d say hi and ask him if he could help out with classes I should take but I can&amp;#39;t do that. I shouldn&amp;#39;t do that.&lt;/p&gt;\n\n&lt;p&gt;It really negatively affects me not having someone close.&lt;/p&gt;\n\n&lt;p&gt;Ended up going and driving for two hours. It definitely distracted me and I enjoyed it but returning home I essentially returned to the state I was in.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just I definitely think I have a case of depression. Non-dangerous but it&amp;#39;s been going for months now. Chances are it&amp;#39;s bi-polar. The work day was good but once I got home, I just hit the ground.&lt;/p&gt;\n\n&lt;p&gt;No one in my real life knows about my suicide thoughts or periods of depression other than one friend. We barely speak though and everyone feels distant. At the same time I don&amp;#39;t understand this relapse.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still a bit down but feeling a bit better. Nothing&amp;#39;s out of order but being overwhelmed and not having a good friend to talk to really hurts. Don&amp;#39;t really need advice, I&amp;#39;ve been here before and given advice. I know the advice. I just want someone to read my words.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know what happened. If I had a relapse or if it's bi-polar.\n\n\nI am definitely overwhelmed right now with my life. I have to obtain insurance and they're all over 100 dollars. ( New driver.) I don't have my own car. I might have to get two jobs. I want to go to college. Working on getting my certificates in networking might be harder than I previously thought. I actually do need a new pair of dress cowboy boots, don't have any dress shoes at all as well as suit. I also have to make sure my phone bill does not surpass $170 this month. It's at $140.00 right now.\n\n\nI broke down and cried and the suicide thoughts came back for a bit and thought if someone took my life, I'd be ok with it.\n\nDuring the relapse I wondered why an old friend never bothered to contact me again. I am still astonished that he hasn't blocked my e-mail from his. Thought maybe I'd say hi and ask him if he could help out with classes I should take but I can't do that. I shouldn't do that.\n\nIt really negatively affects me not having someone close.\n\nEnded up going and driving for two hours. It definitely distracted me and I enjoyed it but returning home I essentially returned to the state I was in.\n\nIt's just I definitely think I have a case of depression. Non-dangerous but it's been going for months now. Chances are it's bi-polar. The work day was good but once I got home, I just hit the ground.\n\nNo one in my real life knows about my suicide thoughts or periods of depression other than one friend. We barely speak though and everyone feels distant. At the same time I don't understand this relapse.\n\nI'm still a bit down but feeling a bit better. Nothing's out of order but being overwhelmed and not having a good friend to talk to really hurts. Don't really need advice, I've been here before and given advice. I know the advice. I just want someone to read my words.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24udm0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Bashship", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399356404.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24udm0/venting_for_some_reason_i_managed_to_relapse_today/", "name": "t3_24udm0", "created": 1399384784.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24udm0/venting_for_some_reason_i_managed_to_relapse_today/", "author_flair_text": null, "title": "[Venting] For some reason I managed to relapse today.", "created_utc": 1399355984.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chblg95", "gilded": 0, "author": "Bashship", "parent_id": "t1_chatnet", "approved_by": null, "body": "Either play Pokemon or go walking. Those are the most feasible things I can do right now in my position.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Either play Pokemon or go walking. Those are the most feasible things I can do right now in my position.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24udm0", "score_hidden": false, "name": "t1_chblg95", "created": 1399466052.0, "author_flair_text": null, "created_utc": 1399437252.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chatnet", "gilded": 0, "author": "ghostfox1_gfaqs", "parent_id": "t3_24udm0", "approved_by": null, "body": "It sounds like you're pretty stressed out, and that makes your thoughts go nuts. I'm the same way. What do you do for fun? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re pretty stressed out, and that makes your thoughts go nuts. I&amp;#39;m the same way. What do you do for fun? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24udm0", "score_hidden": false, "name": "t1_chatnet", "created": 1399396807.0, "author_flair_text": null, "created_utc": 1399368007.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chblq3i", "gilded": 0, "author": "Bashship", "parent_id": "t1_chauihs", "approved_by": null, "body": "Today wasn't as bad in terms of breaking down but I still had a hurting head and suicide thoughts going.\n\nThere's things I need and things I want.\n\nI have to get my insurance first which will happen this weekend. I need to get my resume done to start applying to places. I do need a new pair of dress boots because the ones I have. It's leather sole has compromised as well as they're too damaged to look well in interviews. A pair of kacky and a nice dress to go along. The phone bill must stay as long as it can.\n\n\n\nCollege has to wait. The new car has to wait until I am making the financial point where I can afford one.\n\nFirst is first. Resume, insurance and start learning to obtain a CCNA. After that are the dress and applying the jobs.\n\n---\n\nI genuinely do not know what caused this relapse to get so bad. I suppose above all else it was just everything looked so overwhelmed. It is but it's not coming down to hard.\n\nMy biggest wild card though is my mother who isn't helping my mind be at ease with this whole car thing. I'm using her car and she knew I had a plan. Yet she wants me to go, go, go. On one side I get her yet on the other side I am not ok. I don't talk to her about any of my problems both physically and mentally.\n\nI don't trust her.\n\nMy old friend, who I still consider a friend. I just wanted to message help to just bring me to ease. Though after all that has happened between us I just couldn't bear to write him anything. Nore should I. I do miss him. A lot and I am a bit lost still.\n\nI don't know how I'll feel tomorrow but right now I'm at ease.\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Today wasn&amp;#39;t as bad in terms of breaking down but I still had a hurting head and suicide thoughts going.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s things I need and things I want.&lt;/p&gt;\n\n&lt;p&gt;I have to get my insurance first which will happen this weekend. I need to get my resume done to start applying to places. I do need a new pair of dress boots because the ones I have. It&amp;#39;s leather sole has compromised as well as they&amp;#39;re too damaged to look well in interviews. A pair of kacky and a nice dress to go along. The phone bill must stay as long as it can.&lt;/p&gt;\n\n&lt;p&gt;College has to wait. The new car has to wait until I am making the financial point where I can afford one.&lt;/p&gt;\n\n&lt;p&gt;First is first. Resume, insurance and start learning to obtain a CCNA. After that are the dress and applying the jobs.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I genuinely do not know what caused this relapse to get so bad. I suppose above all else it was just everything looked so overwhelmed. It is but it&amp;#39;s not coming down to hard.&lt;/p&gt;\n\n&lt;p&gt;My biggest wild card though is my mother who isn&amp;#39;t helping my mind be at ease with this whole car thing. I&amp;#39;m using her car and she knew I had a plan. Yet she wants me to go, go, go. On one side I get her yet on the other side I am not ok. I don&amp;#39;t talk to her about any of my problems both physically and mentally.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t trust her.&lt;/p&gt;\n\n&lt;p&gt;My old friend, who I still consider a friend. I just wanted to message help to just bring me to ease. Though after all that has happened between us I just couldn&amp;#39;t bear to write him anything. Nore should I. I do miss him. A lot and I am a bit lost still.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how I&amp;#39;ll feel tomorrow but right now I&amp;#39;m at ease.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24udm0", "score_hidden": false, "name": "t1_chblq3i", "created": 1399466845.0, "author_flair_text": null, "created_utc": 1399438045.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chauihs", "gilded": 0, "author": "boobmuncher", "parent_id": "t3_24udm0", "approved_by": null, "body": "Read your words, OP, and very well written words they were too :-) For all it counts, I hope that things go superbly for you! That feeling when you start to get low/crash is a real case of cheesy ball sack, been there before and it's the worst. \n\nNot having somebody around to talk to can feel really shitty. Feel free to PM me if you need somebody to talk to. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read your words, OP, and very well written words they were too :-) For all it counts, I hope that things go superbly for you! That feeling when you start to get low/crash is a real case of cheesy ball sack, been there before and it&amp;#39;s the worst. &lt;/p&gt;\n\n&lt;p&gt;Not having somebody around to talk to can feel really shitty. Feel free to PM me if you need somebody to talk to. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24udm0", "score_hidden": false, "name": "t1_chauihs", "created": 1399402569.0, "author_flair_text": null, "created_utc": 1399373769.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]