[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So here I am, age 20. Sitting in front of a computer screen. A future I don&amp;#39;t see coming to fruition blowing away in the breeze that is the failure I sought not to be. Haunted by my past, afraid of the present and with no belief in the future, I don&amp;#39;t know how to cope with each day. Each day gets harder and harder, harder to pretend that everything is okay and that I&amp;#39;m not about to fall apart.&lt;/p&gt;\n\n&lt;p&gt;Rewind back to age 10, my family relocates from an affluent region in the United Kingdom to Australia, I don&amp;#39;t fit in and everything is Alien. Within 3 months of arriving, I am diagnosed with a life-threatening tumor in my Left inner ear, after multiple operations and a lot of hospital time, everything seems like it&amp;#39;s going to be okay. But I just felt more ostracised after that. &lt;/p&gt;\n\n&lt;p&gt;Age 11, my family life is falling apart, my parents have had another child, Im no longer the only one, but my parents marriage is on it&amp;#39;s teetering last steps. An argument ensues, and my mother ends up on the floor after my father hits her, he then takes me outside and threatens to hang me from a noose he&amp;#39;s strung up in the tree outside. I guess I can pinpoint the pivotal moment my world fell apart and was never the same right then. That was the moment all colour faded out of my life. It didn&amp;#39;t matter that the police and the ambulance turned up then and took him away, that I wouldn&amp;#39;t seem him for months and that he would be supposedly better when I next saw him. It changed me and I dont think I can ever change back.&lt;/p&gt;\n\n&lt;p&gt;I lost my ability to trust people, I lost my belief in the human ability for unconditional love, the ability to intrinsically care about other people. If a parent who is supposed to love you unconditionally, is supposed to care can do that to you. How can anyone else care? How can they? &lt;/p&gt;\n\n&lt;p&gt;And those thoughts shaped the rest of my life until now, I&amp;#39;ve kept to myself, had a few relationships, all of which I invest myself too much in and end up hurting more and more. I dont know if i even believe in Love anymore. It&amp;#39;s just another human construct we make to tell ourselves we aren&amp;#39;t all selfish creatures, that we actually care about other people. But I don&amp;#39;t know how to believe in it all anymore. &lt;/p&gt;\n\n&lt;p&gt;After the events with my father my mother returned to her families religion, and tried to convince me to become a devout Christian. I didn&amp;#39;t believe in love, and I sure didn&amp;#39;t believe in religion, another Human construction, but I pretended, it made my life easier.&lt;/p&gt;\n\n&lt;p&gt;So I passed through primary school to high school, an outsider, alone mostly, with the odd passing friendship, nothing lasting. I changed schools. And things became a little easier, I could recreate myself, pretend i was something I was not, these people hadn&amp;#39;t seen me change from a wide-eyed innocent Brit to the sullen close-mouthed person I had become. I learned to fake the smile, fake the human interaction while going home to cut myself every night, for 3 years that went on, my one positive trait as a competitive swimmer enabling me to make friends outside of classes where I spoke to no one. I studied hard, and graduated with honours. But I wasn&amp;#39;t happy, I am at university studying what I always wanted but all I can think of each day is starting the car engine with a hose through the window. And each day is becomes more appealing, because I dont live a real life, none of it is real. And I can&amp;#39;t pretend anymore.&lt;/p&gt;\n\n&lt;p&gt;I dont know how to keep going, I just want to end it all, I have one meaningful person in my life and she says she cares, and if i could love anyone, if love is real, I&amp;#39;d love her, with everything I could muster, I&amp;#39;d love her. And she&amp;#39;s why Im here, because I can&amp;#39;t hurt her, but she&amp;#39;s drifting out of my life no matter how I try and hold on, she&amp;#39;s become just text on my phone screen and it hurts and I dont know how long I can hang around for text on a phone screen, it&amp;#39;s all so hard. It all hurts so much. I know my problems probably arent that bad compared to other people, but my world collapsed and I dont know how to be a person anymore. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So here I am, age 20. Sitting in front of a computer screen. A future I don't see coming to fruition blowing away in the breeze that is the failure I sought not to be. Haunted by my past, afraid of the present and with no belief in the future, I don't know how to cope with each day. Each day gets harder and harder, harder to pretend that everything is okay and that I'm not about to fall apart.\n\nRewind back to age 10, my family relocates from an affluent region in the United Kingdom to Australia, I don't fit in and everything is Alien. Within 3 months of arriving, I am diagnosed with a life-threatening tumor in my Left inner ear, after multiple operations and a lot of hospital time, everything seems like it's going to be okay. But I just felt more ostracised after that. \n\nAge 11, my family life is falling apart, my parents have had another child, Im no longer the only one, but my parents marriage is on it's teetering last steps. An argument ensues, and my mother ends up on the floor after my father hits her, he then takes me outside and threatens to hang me from a noose he's strung up in the tree outside. I guess I can pinpoint the pivotal moment my world fell apart and was never the same right then. That was the moment all colour faded out of my life. It didn't matter that the police and the ambulance turned up then and took him away, that I wouldn't seem him for months and that he would be supposedly better when I next saw him. It changed me and I dont think I can ever change back.\n\nI lost my ability to trust people, I lost my belief in the human ability for unconditional love, the ability to intrinsically care about other people. If a parent who is supposed to love you unconditionally, is supposed to care can do that to you. How can anyone else care? How can they? \n\nAnd those thoughts shaped the rest of my life until now, I've kept to myself, had a few relationships, all of which I invest myself too much in and end up hurting more and more. I dont know if i even believe in Love anymore. It's just another human construct we make to tell ourselves we aren't all selfish creatures, that we actually care about other people. But I don't know how to believe in it all anymore. \n\nAfter the events with my father my mother returned to her families religion, and tried to convince me to become a devout Christian. I didn't believe in love, and I sure didn't believe in religion, another Human construction, but I pretended, it made my life easier.\n\nSo I passed through primary school to high school, an outsider, alone mostly, with the odd passing friendship, nothing lasting. I changed schools. And things became a little easier, I could recreate myself, pretend i was something I was not, these people hadn't seen me change from a wide-eyed innocent Brit to the sullen close-mouthed person I had become. I learned to fake the smile, fake the human interaction while going home to cut myself every night, for 3 years that went on, my one positive trait as a competitive swimmer enabling me to make friends outside of classes where I spoke to no one. I studied hard, and graduated with honours. But I wasn't happy, I am at university studying what I always wanted but all I can think of each day is starting the car engine with a hose through the window. And each day is becomes more appealing, because I dont live a real life, none of it is real. And I can't pretend anymore.\n\nI dont know how to keep going, I just want to end it all, I have one meaningful person in my life and she says she cares, and if i could love anyone, if love is real, I'd love her, with everything I could muster, I'd love her. And she's why Im here, because I can't hurt her, but she's drifting out of my life no matter how I try and hold on, she's become just text on my phone screen and it hurts and I dont know how long I can hang around for text on a phone screen, it's all so hard. It all hurts so much. I know my problems probably arent that bad compared to other people, but my world collapsed and I dont know how to be a person anymore. \n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24j7ej", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "SeekingTheSunglight", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24j7ej/vital_signs_pulse_92/", "name": "t3_24j7ej", "created": 1399057444.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24j7ej/vital_signs_pulse_92/", "author_flair_text": null, "title": "Vital Signs. Pulse 92.", "created_utc": 1399028644.0, "ups": 5, "num_comments": 9, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7nqas", "gilded": 0, "author": "beardownbeardown", "parent_id": "t1_ch7nku6", "approved_by": null, "body": "That makes complete sense.  It sounds like you used to be pretty active, but spend a lot of time alone on the computer.  What about joining a gym?  I have always been a pretty lonely person too and sometimes just getting out among people helps me feel less of an outcast to society.  That combined with some exercise might make you feel better about yourself?  Thoughts?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That makes complete sense.  It sounds like you used to be pretty active, but spend a lot of time alone on the computer.  What about joining a gym?  I have always been a pretty lonely person too and sometimes just getting out among people helps me feel less of an outcast to society.  That combined with some exercise might make you feel better about yourself?  Thoughts?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7nqas", "created": 1399060816.0, "author_flair_text": null, "created_utc": 1399032016.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7nku6", "gilded": 0, "author": "SeekingTheSunglight", "parent_id": "t1_ch7n6pe", "approved_by": null, "body": "Im still here... It's the build up of just negative after negative thing over many years. I could handle one rock on my shoulders, but news ones just keep getting added all the time\nThats what makes me unhappy.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im still here... It&amp;#39;s the build up of just negative after negative thing over many years. I could handle one rock on my shoulders, but news ones just keep getting added all the time\nThats what makes me unhappy.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7nku6", "created": 1399060117.0, "author_flair_text": null, "created_utc": 1399031317.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7n6pe", "gilded": 0, "author": "beardownbeardown", "parent_id": "t3_24j7ej", "approved_by": null, "body": "You still online?  I don't know if I can offer you any good advice, but I feel for you.  Are you unhappy because of one particular thing or is it a culmination of all of it?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You still online?  I don&amp;#39;t know if I can offer you any good advice, but I feel for you.  Are you unhappy because of one particular thing or is it a culmination of all of it?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7n6pe", "created": 1399058150.0, "author_flair_text": null, "created_utc": 1399029350.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7pqar", "gilded": 0, "author": "SeekingTheSunglight", "parent_id": "t1_ch7p17z", "approved_by": null, "body": "I do enjoy looking at the stars, I live in a rural area so you can generally see a lot of stars, just once you're back inside the stars are gone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do enjoy looking at the stars, I live in a rural area so you can generally see a lot of stars, just once you&amp;#39;re back inside the stars are gone.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7pqar", "created": 1399067660.0, "author_flair_text": null, "created_utc": 1399038860.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7p17z", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch7ov2y", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7p17z", "created": 1399065655.0, "author_flair_text": null, "created_utc": 1399036855.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7ov2y", "gilded": 0, "author": "SeekingTheSunglight", "parent_id": "t1_ch7o5d9", "approved_by": null, "body": "It's late at night here, and pretty cold, swimming would be good I've tried runs, but I just get down over how unfit I am now. I did try web design for a while, but I haven't the motivation to learn coding languages, or the patience, Im a pretty restless and aggro person atm I guess.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s late at night here, and pretty cold, swimming would be good I&amp;#39;ve tried runs, but I just get down over how unfit I am now. I did try web design for a while, but I haven&amp;#39;t the motivation to learn coding languages, or the patience, Im a pretty restless and aggro person atm I guess.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7ov2y", "created": 1399065104.0, "author_flair_text": null, "created_utc": 1399036304.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7o5d9", "gilded": 0, "author": "oldandgreat", "parent_id": "t1_ch7nmpt", "approved_by": null, "body": "Could you go swimming right now? I would be really looking forward how you gonna feel afterwards! Or a little run? You ever considered coding or something like that if you can handle a computer so good? ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you go swimming right now? I would be really looking forward how you gonna feel afterwards! Or a little run? You ever considered coding or something like that if you can handle a computer so good? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7o5d9", "created": 1399062554.0, "author_flair_text": null, "created_utc": 1399033754.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch7nmpt", "gilded": 0, "author": "SeekingTheSunglight", "parent_id": "t1_ch7nkl5", "approved_by": null, "body": "I spend my days infront of a computer, either designing houses or playing games. Thats the extent of my hobbies. Im not really good at anything anymore, I used to be good at swimming, but i gave that up, so I've put on weight and dont even feel I have that as a positive anymore. I just dont know what to do..", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spend my days infront of a computer, either designing houses or playing games. Thats the extent of my hobbies. Im not really good at anything anymore, I used to be good at swimming, but i gave that up, so I&amp;#39;ve put on weight and dont even feel I have that as a positive anymore. I just dont know what to do..&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7nmpt", "created": 1399060359.0, "author_flair_text": null, "created_utc": 1399031559.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch7nkl5", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24j7ej", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24j7ej", "score_hidden": false, "name": "t1_ch7nkl5", "created": 1399060082.0, "author_flair_text": null, "created_utc": 1399031282.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]