[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I couldnt begin to tell you how much pain I&amp;#39;ve been in this past week 1 week ago yesterday I returned from a week stay at a psych ward now on 150mg of effexor I&amp;#39;ve already attempted suicide 3x by overdose of sleeping pills but I just wake up in more pain and my mother and grandfather are worried I just cause more pain for the people around me and cant even hold a job to support myself. I wish I could just wish myself out of existance all I do is sit on my computer and play games afraid to even go outside now I sit here and I suppose I&amp;#39;m just waiting until I can buy a gun and end this will a pull of a trigger in an instant eternal rest no more pain I so long for it I dream of it and when I wake up its my first thought. I wish I had a way out now though waiting in a shell which feels so empty no life in it anymore it just waits until it can finally shutdown.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I couldnt begin to tell you how much pain I've been in this past week 1 week ago yesterday I returned from a week stay at a psych ward now on 150mg of effexor I've already attempted suicide 3x by overdose of sleeping pills but I just wake up in more pain and my mother and grandfather are worried I just cause more pain for the people around me and cant even hold a job to support myself. I wish I could just wish myself out of existance all I do is sit on my computer and play games afraid to even go outside now I sit here and I suppose I'm just waiting until I can buy a gun and end this will a pull of a trigger in an instant eternal rest no more pain I so long for it I dream of it and when I wake up its my first thought. I wish I had a way out now though waiting in a shell which feels so empty no life in it anymore it just waits until it can finally shutdown.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "258iwp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "BruceDShark", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/258iwp/waiting_just_waiting/", "name": "t3_258iwp", "created": 1399787551.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/258iwp/waiting_just_waiting/", "author_flair_text": null, "title": "Waiting just waiting", "created_utc": 1399758751.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chetcz1", "gilded": 0, "author": "twinsfan68", "parent_id": "t3_258iwp", "approved_by": null, "body": "Hey, let's talk. It sounds like you're having a hell of a hard time right now, and I can't tell you how sorry I am you're having to go through this. I've been more or less in your situation before. It was a few years ago now, but every day was a tremendous struggle and it kept getting worse and worse. But you have to know that suicide isn't the answer. It's not the relief you are looking for - it's a denial of your future potential and all that you could become. When I was in a dark place and couldn't take it anymore, I reached out to those around me. It didn't matter how close they were, I just leaned on them. I found a good psychologist and boldly \"told on myself\" - I was completely and fearlessly honest with her and myself, and it scared the crap out of me to make myself that vulnerable. But it got easier - the more I talked, the more she listened and commented, the more I learned about myself and what was at the root of my anxiety and depression. Please, I urge you to do the same. Reach out, muster your courage, make yourself vulnerable. \n\nI'm here. Everyone in this forum is here for you. PM me if you need to, but whatever you do, don't give up. Fight back. Fight hard. You can do this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, let&amp;#39;s talk. It sounds like you&amp;#39;re having a hell of a hard time right now, and I can&amp;#39;t tell you how sorry I am you&amp;#39;re having to go through this. I&amp;#39;ve been more or less in your situation before. It was a few years ago now, but every day was a tremendous struggle and it kept getting worse and worse. But you have to know that suicide isn&amp;#39;t the answer. It&amp;#39;s not the relief you are looking for - it&amp;#39;s a denial of your future potential and all that you could become. When I was in a dark place and couldn&amp;#39;t take it anymore, I reached out to those around me. It didn&amp;#39;t matter how close they were, I just leaned on them. I found a good psychologist and boldly &amp;quot;told on myself&amp;quot; - I was completely and fearlessly honest with her and myself, and it scared the crap out of me to make myself that vulnerable. But it got easier - the more I talked, the more she listened and commented, the more I learned about myself and what was at the root of my anxiety and depression. Please, I urge you to do the same. Reach out, muster your courage, make yourself vulnerable. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m here. Everyone in this forum is here for you. PM me if you need to, but whatever you do, don&amp;#39;t give up. Fight back. Fight hard. You can do this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_258iwp", "score_hidden": false, "name": "t1_chetcz1", "created": 1399796859.0, "author_flair_text": null, "created_utc": 1399768059.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]