[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, I&amp;#39;ll start off by saying I&amp;#39;m in high school. I get decent grades I guess, but most everyone does. Doesn&amp;#39;t make me worth anything more. \nI suppose like most middle schoolers, I started to not get along with my parents around 8th grade. So far, after a few years of high school, I don&amp;#39;t talk to them very much. They&amp;#39;re busy a lot, usually working or sleeping. I have an older sister in college, so my mother needed a second job. I don&amp;#39;t see my father until around 6 pm most days either, and he&amp;#39;s wiped out from working so much anyway. \nThe first year of high school, I told my parents I disagreed with their religious views, so that put quite a burden on our relationship. They still get very bitter about it, didn&amp;#39;t really help the situation. &lt;/p&gt;\n\n&lt;p&gt;Around that same time, I went into a depressed phase I guess you&amp;#39;d call it. The troubles with parents, along with rejection and few friends really got to me. I don&amp;#39;t know why I ever bothered telling my parents how I felt, they tried taking me to a counselor. All I was told by the counselor was &amp;quot;he&amp;#39;s a hard read&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I started cutting myself around then, it really worked for a while as a stress outlet. It stopped working for me recently, and I vowed to myself not do it. Probably will break that vow today, but I digress. \nAs for my social life recently, I actually got a girlfriend this year. Me, a fucking girlfriend. She made me feel like I actually belonged somewhere. Like there was actually SOMEONE out there who gave a more than a shit about me, loved me even. God, I loved her so much. I&amp;#39;m usually a pretty level headed, calm guy. We&amp;#39;ve had our rough patches over the months like most relationships do, and she could overreact sometimes. I stayed level headed and we would work out the problems eventually.  Recently, I don&amp;#39;t want to go into detail, but we had an issue she couldn&amp;#39;t really get over. It wasn&amp;#39;t cheating or anything if you&amp;#39;re curious. But, She stopped loving me. At that point in a relationship, there&amp;#39;s really nothing you can do about it. It&amp;#39;s her life, she should leave if she doesn&amp;#39;t want to be with me. \nThat all said, knowing that there&amp;#39;s really no one who cares about you anymore besides your few friends who claim they do, but don&amp;#39;t really make an effort to talk or do anything makes life seem pointless. It&amp;#39;s funny, I even fucked it up with them too.\nSeeing as i joined the trap team again this year and we now have a shotgun in the house, I could end it in 5 minutes if I wanted to. I&amp;#39;m going to try to stay level headed, but life is just shit. The worst part is that half the time, I don&amp;#39;t really feel anything. Just like an echo of my old self. Numb and empty, phased out. People say time helps, but that&amp;#39;s bull shit to me. \nI know this all sounds like some melodramatic whiny teenager, I&amp;#39;m aware of that. &lt;/p&gt;\n\n&lt;p&gt;TL;DR- fuck up fuckwad of a teenager whines about life, don&amp;#39;t bother reading&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Well, I'll start off by saying I'm in high school. I get decent grades I guess, but most everyone does. Doesn't make me worth anything more. \nI suppose like most middle schoolers, I started to not get along with my parents around 8th grade. So far, after a few years of high school, I don't talk to them very much. They're busy a lot, usually working or sleeping. I have an older sister in college, so my mother needed a second job. I don't see my father until around 6 pm most days either, and he's wiped out from working so much anyway. \nThe first year of high school, I told my parents I disagreed with their religious views, so that put quite a burden on our relationship. They still get very bitter about it, didn't really help the situation. \n\nAround that same time, I went into a depressed phase I guess you'd call it. The troubles with parents, along with rejection and few friends really got to me. I don't know why I ever bothered telling my parents how I felt, they tried taking me to a counselor. All I was told by the counselor was \"he's a hard read\"\n\nI started cutting myself around then, it really worked for a while as a stress outlet. It stopped working for me recently, and I vowed to myself not do it. Probably will break that vow today, but I digress. \nAs for my social life recently, I actually got a girlfriend this year. Me, a fucking girlfriend. She made me feel like I actually belonged somewhere. Like there was actually SOMEONE out there who gave a more than a shit about me, loved me even. God, I loved her so much. I'm usually a pretty level headed, calm guy. We've had our rough patches over the months like most relationships do, and she could overreact sometimes. I stayed level headed and we would work out the problems eventually.  Recently, I don't want to go into detail, but we had an issue she couldn't really get over. It wasn't cheating or anything if you're curious. But, She stopped loving me. At that point in a relationship, there's really nothing you can do about it. It's her life, she should leave if she doesn't want to be with me. \nThat all said, knowing that there's really no one who cares about you anymore besides your few friends who claim they do, but don't really make an effort to talk or do anything makes life seem pointless. It's funny, I even fucked it up with them too.\nSeeing as i joined the trap team again this year and we now have a shotgun in the house, I could end it in 5 minutes if I wanted to. I'm going to try to stay level headed, but life is just shit. The worst part is that half the time, I don't really feel anything. Just like an echo of my old self. Numb and empty, phased out. People say time helps, but that's bull shit to me. \nI know this all sounds like some melodramatic whiny teenager, I'm aware of that. \n\nTL;DR- fuck up fuckwad of a teenager whines about life, don't bother reading", "likes": null, "secure_media": null, "link_flair_text": null, "id": "248qai", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Aussie300", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/248qai/weak_minded_and_worthless/", "name": "t3_248qai", "created": 1398765988.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/248qai/weak_minded_and_worthless/", "author_flair_text": null, "title": "Weak minded and worthless", "created_utc": 1398737188.0, "ups": 2, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4pts3", "gilded": 0, "author": "Madame_de_Cunt", "parent_id": "t1_ch4ph77", "approved_by": null, "body": "Because you acquire knowledge, friends (the more people you meet the more likely you are to find a good friend,) maturity, a lack of crazy hormonal mood swings, independence, and a thousand other things that help you cope.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because you acquire knowledge, friends (the more people you meet the more likely you are to find a good friend,) maturity, a lack of crazy hormonal mood swings, independence, and a thousand other things that help you cope.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248qai", "score_hidden": false, "name": "t1_ch4pts3", "created": 1398767916.0, "author_flair_text": null, "created_utc": 1398739116.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4ph77", "gilded": 0, "author": "Aussie300", "parent_id": "t1_ch4pcct", "approved_by": null, "body": "I've tried reaching out to them, really I have. It never really goes any where. \n\nAnd life is life, how is getting older just supposed to fix everything?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried reaching out to them, really I have. It never really goes any where. &lt;/p&gt;\n\n&lt;p&gt;And life is life, how is getting older just supposed to fix everything?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248qai", "score_hidden": false, "name": "t1_ch4ph77", "created": 1398767220.0, "author_flair_text": null, "created_utc": 1398738420.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4pcct", "gilded": 0, "author": "[deleted]", "parent_id": "t3_248qai", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_248qai", "score_hidden": false, "name": "t1_ch4pcct", "created": 1398766953.0, "author_flair_text": null, "created_utc": 1398738153.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]