[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up suicide was always this &amp;quot;out there&amp;quot; thing for me. Something you hear in the news, not something that would happen to my loved ones or friends, or god forbid, to myself.&lt;/p&gt;\n\n&lt;p&gt;Recently I&amp;#39;ve pondered suicide as an escape from my problems. It&amp;#39;s not a planned out process, just a mental acknowledgement of the fact that I could do it. Invariably I think about how my family would react. I go over a mental list of family members and try to predict their reaction. I wonder what my friends would say, and which ones I would leave messages to, and what I&amp;#39;d say. I think that if I were to do it, I would carry ID with me so I could be identified.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s the extent of my thoughts. One time I tried thinking out the whole process while falling asleep (get off my bed, walk to the roof, and jump) and ponder what it would take for me to follow through. Nothing will. I&amp;#39;m simply too lazy and I have too much (blind?) faith in myself to solve my problems.&lt;/p&gt;\n\n&lt;p&gt;Why do I keep entertaining these thoughts, and are they normal thoughts, or are they by definition suicidal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Growing up suicide was always this \"out there\" thing for me. Something you hear in the news, not something that would happen to my loved ones or friends, or god forbid, to myself.\n\nRecently I've pondered suicide as an escape from my problems. It's not a planned out process, just a mental acknowledgement of the fact that I could do it. Invariably I think about how my family would react. I go over a mental list of family members and try to predict their reaction. I wonder what my friends would say, and which ones I would leave messages to, and what I'd say. I think that if I were to do it, I would carry ID with me so I could be identified.\n\nBut that's the extent of my thoughts. One time I tried thinking out the whole process while falling asleep (get off my bed, walk to the roof, and jump) and ponder what it would take for me to follow through. Nothing will. I'm simply too lazy and I have too much (blind?) faith in myself to solve my problems.\n\nWhy do I keep entertaining these thoughts, and are they normal thoughts, or are they by definition suicidal?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "244bfs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Queef-Latinah", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/244bfs/what_constitutes_suicidal_thoughts/", "name": "t3_244bfs", "created": 1398651230.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/244bfs/what_constitutes_suicidal_thoughts/", "author_flair_text": null, "title": "What constitutes suicidal thoughts?", "created_utc": 1398622430.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3g6uc", "gilded": 0, "author": "[deleted]", "parent_id": "t3_244bfs", "approved_by": null, "body": "I'm told that usually a healthy brain shouldn't intend to terminate itself so it's entirely possible these aren't normal thoughts, but i'm glad to hear you have no plans or obvious intention of going through with it all. Obviously I don't know anything about your problems or what's causing you to think of this as an escape from your problems, but it's good to realise what's causing it at this point so you can prevent the possibility of it getting worse. I don't know if it will help to talk about these things but if you want someone to listen I'll do my best.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m told that usually a healthy brain shouldn&amp;#39;t intend to terminate itself so it&amp;#39;s entirely possible these aren&amp;#39;t normal thoughts, but i&amp;#39;m glad to hear you have no plans or obvious intention of going through with it all. Obviously I don&amp;#39;t know anything about your problems or what&amp;#39;s causing you to think of this as an escape from your problems, but it&amp;#39;s good to realise what&amp;#39;s causing it at this point so you can prevent the possibility of it getting worse. I don&amp;#39;t know if it will help to talk about these things but if you want someone to listen I&amp;#39;ll do my best.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244bfs", "score_hidden": false, "name": "t1_ch3g6uc", "created": 1398626367.0, "author_flair_text": null, "created_utc": 1398622767.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]