[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was 14 a year after my Dad died my Mom walked out on me. She had minimal contact because she was dating some guy. She later married him and didn&amp;#39;t come back until I was 19 at which point I was kicked out of the house and later he cheated on her and she lost the house because he had forged her name to loans he took out on the house and she couldn&amp;#39;t pay back.&lt;/p&gt;\n\n&lt;p&gt;My sister was a pill popping bitch. She was always angry and never was able to have the appropriate emotion with the right situation. No one seemed to care how bad of a junkie she was. She caused a lot of problems in our family and walked out when she was 15. She was 13 years older than me so I was bullied by her a lot when she did show up. Most of the time she was mean and just angry at almost anything. You couldn&amp;#39;t have any kind of civil conversation with her. Later on she just stole from me and when they wouldn&amp;#39;t work she would just beg for money. She ODed and killed herself shortly after our Mom died.&lt;/p&gt;\n\n&lt;p&gt;When I was young the girls in the neighborhood always bullied me. They were bigger and most of them older than me. They would tell everyone all kinds of mean lies about me. In middle school they hated me simply because I was white. They all wanted a black guy except for the girl across the street, she hated me because I was a teenage boy. Even though she was a year younger than me, she would only date guys that were around 18. I tried to talk to her one time in middle school but she got her boyfriend at the time to beat me up.&lt;/p&gt;\n\n&lt;p&gt;In high school girls mostly ignored me. Most of the girls in my neighborhood had dropped out of school by then and I have no idea where they ended up with the exception of the girl across the street. She was supposed to be our valedictorian but died in a car wreck. I tried to ask a couple of girls out to the prom but got smart ass replies. The lack of feed back of why I got the responses I got caused me to not learn anything so failure became a constant.&lt;/p&gt;\n\n&lt;p&gt;In my early 20&amp;#39;s I decided it was time to step up to the plate. I tried hard to meet girls through friends and coworkers. Most of the time it was a very negative experience. I was slapped one time by a girl and really I have no idea why. All I did was compliment her hair. Another time I was in the store and I kept seeing this cute girl every time I would go down an isle. She was always come up the other side. I said something about it when we both went down an isle that I had randomly chosen due to something interesting I wanted to see. She got a disgusting look on her face and called the manager over. I was kicked out of the store for &amp;quot;harassing&amp;quot; her.&lt;/p&gt;\n\n&lt;p&gt;I went to a party with a few friends. The common friend that took us to the party introduced us to a lot of his friends. The girl throwing the party shook all of their hands but mine. In front of everyone she looked me up and down and just said, &amp;quot;Gross...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I notice that my friends get treated like kings when we go out to places. Girls will come up out of nowhere and talk to them, they get phone numbers all the time without asking. If we go out for a night on the town it&amp;#39;s no problem for them to bring a girl back to their place or whatever.&lt;/p&gt;\n\n&lt;p&gt;I tried to help a woman that dropped something at the store one time. She sprayed me with mace. Caught me off guard, i ran to the bathroom never got the chance to ask her why.&lt;/p&gt;\n\n&lt;p&gt;I went on a date with a girl I met through a friend. She picked me up and we went to a restaurant. I thought it was going great until I stood up I passed out. I have a blood sugar problem. When I came to she had left me there. I had to walk 7 miles home feeling sick.&lt;/p&gt;\n\n&lt;p&gt;I had a girl tell me that I was not good looking enough to be nice to her.&lt;/p&gt;\n\n&lt;p&gt;I actually dated a girl for a little while. It ended on Valentine&amp;#39;s day 7 years ago when I took her out. She cost me almost $100 at the bar. I watched her sit in another guy&amp;#39;s lap and just ignore me most of the night. Upset I took her home. At her house she was very angry and mean to me. She told me that she wished I was her ex-boyfriend. She then proceeded to take her clothes off and then accuse me of attempting to rape her. She then cried like a 4 year old when she bumped her elbow. She called the police and I was arrested. I refused to talk to them until I got a lawyer. It took her awhile but she finally admitted that I didn&amp;#39;t try to rape her. That incident ruined my life. My mugshot was printed in a paper that has mugshots of people that&amp;#39;s been arrested with their names and the reason why they were arrested under they name in our town. People I&amp;#39;ve known for years stopped talking to me thinking I was a rapist. I had to move and I developed serious anxiety because of it. I can&amp;#39;t think about sex without getting upset. She ruined my ability to be in a relationship. &lt;/p&gt;\n\n&lt;p&gt;Since then I&amp;#39;ve lived in isolation. I interact with people at my job and barely do enough social interaction to get the job done. I don&amp;#39;t hang out with anyone anymore or go anywhere other than work and the store for food. People don&amp;#39;t like being around me and I don&amp;#39;t like being around them for the most part. &lt;/p&gt;\n\n&lt;p&gt;The damage is so bad most therapists just refer me to other therapists, they don&amp;#39;t even try to treat me. I clam up and can&amp;#39;t talk to people in person anyway anymore. I can&amp;#39;t afford it anymore either.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve shared these instances before but no one really seems to care either. People have an attitude that I&amp;#39;ve asked for this somehow. That it&amp;#39;s all my fault. Some people even seem pleased that this happens to me. Nobody here will probably finish reading what I&amp;#39;ve wrote or will have something smart ass to say about it. I&amp;#39;m kind of sick of life. It&amp;#39;s not fun, I can&amp;#39;t afford to do anything I want and I don&amp;#39;t like being around people. The people I cared the most about are dead and I see no reason in staying a live in a world that I just don&amp;#39;t want to be in anymore. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "When I was 14 a year after my Dad died my Mom walked out on me. She had minimal contact because she was dating some guy. She later married him and didn't come back until I was 19 at which point I was kicked out of the house and later he cheated on her and she lost the house because he had forged her name to loans he took out on the house and she couldn't pay back.\n\nMy sister was a pill popping bitch. She was always angry and never was able to have the appropriate emotion with the right situation. No one seemed to care how bad of a junkie she was. She caused a lot of problems in our family and walked out when she was 15. She was 13 years older than me so I was bullied by her a lot when she did show up. Most of the time she was mean and just angry at almost anything. You couldn't have any kind of civil conversation with her. Later on she just stole from me and when they wouldn't work she would just beg for money. She ODed and killed herself shortly after our Mom died.\n\nWhen I was young the girls in the neighborhood always bullied me. They were bigger and most of them older than me. They would tell everyone all kinds of mean lies about me. In middle school they hated me simply because I was white. They all wanted a black guy except for the girl across the street, she hated me because I was a teenage boy. Even though she was a year younger than me, she would only date guys that were around 18. I tried to talk to her one time in middle school but she got her boyfriend at the time to beat me up.\n\nIn high school girls mostly ignored me. Most of the girls in my neighborhood had dropped out of school by then and I have no idea where they ended up with the exception of the girl across the street. She was supposed to be our valedictorian but died in a car wreck. I tried to ask a couple of girls out to the prom but got smart ass replies. The lack of feed back of why I got the responses I got caused me to not learn anything so failure became a constant.\n\nIn my early 20's I decided it was time to step up to the plate. I tried hard to meet girls through friends and coworkers. Most of the time it was a very negative experience. I was slapped one time by a girl and really I have no idea why. All I did was compliment her hair. Another time I was in the store and I kept seeing this cute girl every time I would go down an isle. She was always come up the other side. I said something about it when we both went down an isle that I had randomly chosen due to something interesting I wanted to see. She got a disgusting look on her face and called the manager over. I was kicked out of the store for \"harassing\" her.\n\nI went to a party with a few friends. The common friend that took us to the party introduced us to a lot of his friends. The girl throwing the party shook all of their hands but mine. In front of everyone she looked me up and down and just said, \"Gross...\"\n\nI notice that my friends get treated like kings when we go out to places. Girls will come up out of nowhere and talk to them, they get phone numbers all the time without asking. If we go out for a night on the town it's no problem for them to bring a girl back to their place or whatever.\n\nI tried to help a woman that dropped something at the store one time. She sprayed me with mace. Caught me off guard, i ran to the bathroom never got the chance to ask her why.\n\nI went on a date with a girl I met through a friend. She picked me up and we went to a restaurant. I thought it was going great until I stood up I passed out. I have a blood sugar problem. When I came to she had left me there. I had to walk 7 miles home feeling sick.\n\nI had a girl tell me that I was not good looking enough to be nice to her.\n\nI actually dated a girl for a little while. It ended on Valentine's day 7 years ago when I took her out. She cost me almost $100 at the bar. I watched her sit in another guy's lap and just ignore me most of the night. Upset I took her home. At her house she was very angry and mean to me. She told me that she wished I was her ex-boyfriend. She then proceeded to take her clothes off and then accuse me of attempting to rape her. She then cried like a 4 year old when she bumped her elbow. She called the police and I was arrested. I refused to talk to them until I got a lawyer. It took her awhile but she finally admitted that I didn't try to rape her. That incident ruined my life. My mugshot was printed in a paper that has mugshots of people that's been arrested with their names and the reason why they were arrested under they name in our town. People I've known for years stopped talking to me thinking I was a rapist. I had to move and I developed serious anxiety because of it. I can't think about sex without getting upset. She ruined my ability to be in a relationship. \n\nSince then I've lived in isolation. I interact with people at my job and barely do enough social interaction to get the job done. I don't hang out with anyone anymore or go anywhere other than work and the store for food. People don't like being around me and I don't like being around them for the most part. \n\nThe damage is so bad most therapists just refer me to other therapists, they don't even try to treat me. I clam up and can't talk to people in person anyway anymore. I can't afford it anymore either.  \n\nI've shared these instances before but no one really seems to care either. People have an attitude that I've asked for this somehow. That it's all my fault. Some people even seem pleased that this happens to me. Nobody here will probably finish reading what I've wrote or will have something smart ass to say about it. I'm kind of sick of life. It's not fun, I can't afford to do anything I want and I don't like being around people. The people I cared the most about are dead and I see no reason in staying a live in a world that I just don't want to be in anymore. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24ts1i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "karvous", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24ts1i/what_do_you_do_when_everyone_left_alive_in_your/", "name": "t3_24ts1i", "created": 1399368528.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24ts1i/what_do_you_do_when_everyone_left_alive_in_your/", "author_flair_text": null, "title": "What do you do when everyone left alive in your life hates you?", "created_utc": 1399339728.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chame55", "gilded": 0, "author": "jdmj1991", "parent_id": "t3_24ts1i", "approved_by": null, "body": "Sorry about your troubles bud, I have also thought about ending it but I lack the constitution for suicide. Whatever you decided to do, I hope peace and happiness are able to find you. The girl I loved for many years cheated on me during our junior of college, and I've never really recovered. I've created a huge addiction problem for myself seeking that peace and happiness, I hope it doesn't go that way for you my friend. ", "edited": 1399343740.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry about your troubles bud, I have also thought about ending it but I lack the constitution for suicide. Whatever you decided to do, I hope peace and happiness are able to find you. The girl I loved for many years cheated on me during our junior of college, and I&amp;#39;ve never really recovered. I&amp;#39;ve created a huge addiction problem for myself seeking that peace and happiness, I hope it doesn&amp;#39;t go that way for you my friend. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24ts1i", "score_hidden": false, "name": "t1_chame55", "created": 1399371626.0, "author_flair_text": null, "created_utc": 1399342826.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]