[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dear r/SuicideWatch,&lt;/p&gt;\n\n&lt;p&gt;Admittedly this is a throwaway account, however this is actually my first ever post on Reddit, so please be gentle with me...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL:DR&lt;/strong&gt; – I am a chronic Ketamine addict which has led me into depression and debt. I have made two attempts at suicide in the past, and was close to another attempt on Monday 28th April. I was talked out of it by a work colleague, but considering my circumstances, I don&amp;#39;t feel like I want to live any longer and I don&amp;#39;t know what I can do.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit 1: Formatting&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;A little bit of background info about myself:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;(When I started typing this, I didn&amp;#39;t expect for my *&lt;/em&gt;little bit** of background info to be so large – sorry! Also please note my dates &amp;amp; time scales are definitely not exact.)*&lt;/p&gt;\n\n&lt;p&gt;I am a 22 year old male living in the UK, with two house mates, both male too. I have worked at a Housing Association in one of their Lettings teams for the past 3 years, and the year previous to that was spent in their Finance Department. I consider myself to be good at my job, and I am confident my colleagues would vouch for me on this. I&amp;#39;m sure this sounds all good and well, and if you happen to be reading this I imagine you are thinking “why is this guy posting here?”.&lt;/p&gt;\n\n&lt;p&gt;Well, there are other sides to me which some know about, others don&amp;#39;t, and some sides of me which nobody knows of (the latter will not be discussed in this post)... I have been a drug user since the ripe old age of 14, taking most substances spanning from cannabis to heavy psychedelics, uppers, downers, and far too many dissociatives for my own good. I have had 4 drug addictions during my years of usage, the biggest of which has been with the UK Class B substance Ketamine. Since I was 16 years old I have been a heavy user of this once amazing drug, and it has ruled my life and everything in it for the past 5 years in particular. As a result of my abuse of this substance, I have been hospitalised several times, done irreversible damage to my bladder and probably kidneys too. &lt;/p&gt;\n\n&lt;p&gt;Another product of my addiction has been debt. It started small with the odd Payday Loan being taken out on a monthly basis, and over the course of the next year or so this escalated into higher loan amounts, extended repayment periods, and of course ever increasing amounts of interest payable. Eventually I decided to take out a bank loan, to clear my overdraft, clear the £700 or so balance of my payday loans and essentially “start a fresh”. This worked out well for a few months, until I started slipping on Ketamine&amp;#39;s steep, slippery slope yet again. &lt;/p&gt;\n\n&lt;p&gt;Low and behold, I found myself back to square 1 of this financial cycle. I then did exactly what a person who is experiencing financial struggles should NOT do: Took out more credit. Repeatedly. To pay off other companies, and eventually keep up the cost of my Ketamine addiction. I won&amp;#39;t delve into the specifics of what followed, but lets just say I now stand with approximately £10,000 debt spread across 6 or 7 companies. I enrolled onto a debt management plan in 2012, and that lasted for around a year until they discontinued the plan following two late of the monthly amount. I have not entered into another debt management plan since.&lt;/p&gt;\n\n&lt;p&gt;This addiction and debt problem has  led me into a state of depression which began about 2.5 years ago. Some of you may figure this is strange as you may have read about Ketamine&amp;#39;s use in several studies which found that it is successfully counter-effective against symptoms of depression. My only response to this is that our bodies and brains are all different, and that the subjects used in these studies were probably not heavy users of the drug before the studies began. &lt;/p&gt;\n\n&lt;p&gt;After a a while of coping with this suspected depression I began experiencing, I eventually decided I didn&amp;#39;t want to continue this life. I made an attempt at suicide which involved several plastic bags and lots of duck tape. A friend found me in the late stages of this process, quite embarrassing I know. &lt;/p&gt;\n\n&lt;p&gt;For the next couple of months I concentrated all of my will power on staying sober. Safe to say it worked quite well, especially considering that this sobriety happened to coincide with a huge drought of the substance I was trying to avoid. Talk about good timing! &lt;/p&gt;\n\n&lt;p&gt;Anyway, time passed and I began stumbling down Ketamine&amp;#39;s slopes yet again. I started taking more than ever before, resulting in me taking extended periods of time off work due to Ketamine related illness. At  first my management didn&amp;#39;t know the real cause, I used to come up with some crappy excuse like stomach bugs or migraines. My increasing level of absence eventually initiated the first stage of my employer&amp;#39;s Sickness &amp;amp; Absence procedure, which placed me under review. During my first absence related meeting I told them exactly what I was going through. They were very understanding of my situation, and after setting some absence targets I was advised to contact my local GP to discuss what options might be available.&lt;/p&gt;\n\n&lt;p&gt;I did exactly this, and shortly afterwards I began my first course of anti-depressants (Citalopram specifically). Nearly two months into this treatment I started going off the rails again, and due to another drought of Ketamine I resorted to other drugs including lots of Diazepam (Valium), Heroin (rarely) and (more) alcohol. None of the above mixed well with the Citalopram whatsoever. Once the began to properly kick in (I believe it was between the 4-6 week after starting them) I did not feel like I thought I should have. I felt like I was  experiencing life through a looking glass, and I felt far from right. After a few weeks of feeling this way, I told my GP I won&amp;#39;t continue to take the Citalopram, and I slowly reduced the dosage to non. &lt;/p&gt;\n\n&lt;p&gt;After the medication stopped, my Ketamine and other drug use kept on going at full speed. Now I&amp;#39;m sure you may be wondering why I haven&amp;#39;t mentioned any attempt at drugs counselling in the past. I can assure you I have tried and failed 3 times with the services available in the city I live in. &lt;/p&gt;\n\n&lt;p&gt;My Heroin use started to increased slightly, and yet again I started making myself ill through too much Ketamine, resulting in more time off which breached my absence target and started stage two out of three in my employer&amp;#39;s Sickness &amp;amp; Absence Procedure.&lt;/p&gt;\n\n&lt;p&gt;Cutting out many months of my life history so as to reduce further waste of your time, I eventually made an another attempt to take my life. This time involved a rucksack full of rocks and a nearby lake. Needless to say this attempt also failed as I was seen by a dog walker jumping into said lake... &lt;/p&gt;\n\n&lt;p&gt;I was kept in hospital for 2 days until I was fit to return home. I was also assigned to the NHS&amp;#39; Crisis Team and began twice-weekly meetings with two of their advisers for about 3 weeks. They seemed understanding at first, though the more time I spent with them the more I felt they didn&amp;#39;t give a damn about me, and felt they were quickly trying to”shrug me off” of their workload. This drastically reduced my faith in the NHS.&lt;/p&gt;\n\n&lt;p&gt;Following that incident, I spent two weeks at my Dad &amp;amp; Step-Mums house, and of course explained everything to them. They were great, and even lent me some money to clear some overdue bills (not debts, bills) so that I was up to date with the more important finances. We spoke a lot of anti-depressants because they had both been treated for depression in the past (my Step-Mum was still being treated, though she is a massive hypochondriac anyway and takes all sorts of medication). My Dad strongly recommended that I give them another go, and contrary to what the Crisis Team advised, I began a new course of treatment, this time with the anti-depressant Fluoxetine. &lt;/p&gt;\n\n&lt;p&gt;Once the first month-ish of the Fluoxetine had passed, I began to feel better, and after some more time had passed I was even feeling GOOD. I started to perform better in my job, my absence was well on target, my relationship with my family was good. &lt;/p&gt;\n\n&lt;p&gt;Everything was going dandy, better than I could have expected. However, I continued taking drugs, normally behind the backs of friends and family. I kept ignoring calls and letters from the companies which I was in debt with, though of course that didn&amp;#39;t stop their persistence. I began thinking this was all okay, that I had to concentrate on getting clean before sorting my finances out. I&amp;#39;ve no idea where this delusional thought came from, because I was doing quite the opposite from staying clean. Admittedly I wasn&amp;#39;t taking as many drugs, but the fact stands I was continuing to use the whole time thinking “it&amp;#39;ll be okay”. I don&amp;#39;t want to shift the blame onto the anti-depressants I was taking, though looking back I honestly think they were altering my mind in such a way as to think “Don&amp;#39;t worry, it&amp;#39;ll be okay”. &lt;/p&gt;\n\n&lt;p&gt;You are probably getting bored of reading this now. I honestly didn&amp;#39;t intend for this to be so lengthy, so I&amp;#39;ll cut to the chase.&lt;/p&gt;\n\n&lt;p&gt;For the past few months, thoughts of committing suicide have been there again. I simply don&amp;#39;t want to be here any more. And once again, I decided I was going to go through with it. Though this time would be different. This time wouldn&amp;#39;t be spur of the moment, I&amp;#39;ll do it properly. So I booked a well earned week off work, the first since the start of 2014 actually, and thankfully just after my payday. &lt;/p&gt;\n\n&lt;p&gt;During the last week, I made sure to visit my Mum, my friends, spend time with my dog, pay a few people back (not my Dad, for reasons unknown), and get well and truly FUCKED UP.  I had the idea in my head that at the end of this holiday I wouldn&amp;#39;t actually return to work, instead I would hang myself in my garage. The week was great, had a fantastic time, but the whole while this exhilarating thought of “it&amp;#39;ll all be over soon” was forever present in my head. It felt better than some of the drugs I have taken this past week.&lt;/p&gt;\n\n&lt;p&gt;So this leads me up to near the end of my story. I woke up yesterday morning, and began to read up on the different methods of hanging oneself. After spending my morning with my phone set to aeroplane mode to ignore contact from work, I sat and researched the most effective hanging methods available. I planned it all out. I would set up my slip-knot noose, hang it from the garage ceiling, make a wrap to keep my hands tied behind my back, and get drunk to help me take my final steps. I decided to aim for constriction of my Carotid Artery, hoping to induce the supposedly pain-free unconscious state for my final breaths. I was more than confident that if my Carotid Artery wasn&amp;#39;t constricted enough that I would be able persevere through the strangulation part of the process. I didn&amp;#39;t plan to leave a note.&lt;/p&gt;\n\n&lt;p&gt;All was going well, having a sing-along to Morrissey &amp;amp; Radiohead and drinking my favourite beer. By the time 3.30pm came, I entered the garage for what I thought would be the final time, stood on my stool, set the noose around my neck at the ready, drank the last of my beer, and had two practice runs. They didn&amp;#39;t go as well as I had hoped, but I was drunk enough to keep going. A little later, I put the hand wrap on, but then my phone rang. I figured I&amp;#39;d answer as nothing would matter in 30 minutes time. It was a close colleague from work. Naturally she was concerned about where I had been all day, so I told her exactly what I was doing at that moment in time. She began to plead for me to stop what I was doing, and tried to remind me that nothing can&amp;#39;t be fixed in life.&lt;/p&gt;\n\n&lt;p&gt;This response angered me because I began to feel guilty about what I was about to do. I hung up on her in a drunken rage and made the decision to take her advice for now. I went back inside my house, lay down in bed and broke into tears myself. What have I become? What is happening to me? I&amp;#39;ve become a selfish, lying coward who nearly hurt everyone who has only ever been good to me. &lt;/p&gt;\n\n&lt;p&gt;I did not go into work again today either because I was still in a state. I have had friends and family trying to contact me to check I am ok. My Mum even came to my door yesterday evening shortly after the incident, though I refused to let her in because I am too ashamed to tell her the truth. The manager of the department I work in also came knocking on my door this afternoon, but I didn&amp;#39;t let him in for the same reason.&lt;/p&gt;\n\n&lt;p&gt;So, my current circumstances are:  &lt;/p&gt;\n\n&lt;p&gt;*I want to commit suicide because I don&amp;#39;t feel like I want to live any more, but I couldn&amp;#39;t bring myself to actually do it when the time came. Maybe next time I should turn my phone off to avoid any distractions...&lt;br/&gt;\n*During what I thought would be my final few weeks I have not paid any bills, not even rent – my house mates do not know this. No payment to my Dad. Spent all of my money on drugs and beer (not any Ketamine though!).&lt;br/&gt;\n*I have been ignoring all of my friends and family who have tried to contact me&lt;br/&gt;\n*I am probably going to lose my job because these two days I have not been into work have pushed me through to stage 3 of the Sickness &amp;amp; Absence procedure I mentioned earlier, which is a final review and probable dismissal&lt;br/&gt;\n*I have debts amounting to approx. £10,000. From some letters I have bothered to open, they will soon be initiating legal action which will result in CCJs and a messed up credit file for the next like, 10 or 11 years (approx 5-6 years to pay off, then CCJs remain on credit file for 6 years)&lt;br/&gt;\n*Part of me wants to get better, but the other part of me wants it all to be over  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In the immortal words of Neil Morrissey &amp;amp; Johnny Marr:&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t feel bad for me,&lt;/strong&gt;&lt;br/&gt;\n&lt;strong&gt;I want you to know,&lt;/strong&gt;&lt;br/&gt;\n&lt;strong&gt;Deep in the cell of my heart,&lt;/strong&gt;&lt;br/&gt;\n&lt;strong&gt;I really want to go&lt;/strong&gt;  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Dear r/SuicideWatch,\n\nAdmittedly this is a throwaway account, however this is actually my first ever post on Reddit, so please be gentle with me...\n  \n  \n\n**TL:DR** – I am a chronic Ketamine addict which has led me into depression and debt. I have made two attempts at suicide in the past, and was close to another attempt on Monday 28th April. I was talked out of it by a work colleague, but considering my circumstances, I don't feel like I want to live any longer and I don't know what I can do.\n  \n**Edit 1: Formatting**  \n\nA little bit of background info about myself:\n  \n*(When I started typing this, I didn't expect for my **little bit** of background info to be so large – sorry! Also please note my dates &amp; time scales are definitely not exact.)*\n  \nI am a 22 year old male living in the UK, with two house mates, both male too. I have worked at a Housing Association in one of their Lettings teams for the past 3 years, and the year previous to that was spent in their Finance Department. I consider myself to be good at my job, and I am confident my colleagues would vouch for me on this. I'm sure this sounds all good and well, and if you happen to be reading this I imagine you are thinking “why is this guy posting here?”.\n  \nWell, there are other sides to me which some know about, others don't, and some sides of me which nobody knows of (the latter will not be discussed in this post)... I have been a drug user since the ripe old age of 14, taking most substances spanning from cannabis to heavy psychedelics, uppers, downers, and far too many dissociatives for my own good. I have had 4 drug addictions during my years of usage, the biggest of which has been with the UK Class B substance Ketamine. Since I was 16 years old I have been a heavy user of this once amazing drug, and it has ruled my life and everything in it for the past 5 years in particular. As a result of my abuse of this substance, I have been hospitalised several times, done irreversible damage to my bladder and probably kidneys too. \n\nAnother product of my addiction has been debt. It started small with the odd Payday Loan being taken out on a monthly basis, and over the course of the next year or so this escalated into higher loan amounts, extended repayment periods, and of course ever increasing amounts of interest payable. Eventually I decided to take out a bank loan, to clear my overdraft, clear the £700 or so balance of my payday loans and essentially “start a fresh”. This worked out well for a few months, until I started slipping on Ketamine's steep, slippery slope yet again. \n\nLow and behold, I found myself back to square 1 of this financial cycle. I then did exactly what a person who is experiencing financial struggles should NOT do: Took out more credit. Repeatedly. To pay off other companies, and eventually keep up the cost of my Ketamine addiction. I won't delve into the specifics of what followed, but lets just say I now stand with approximately £10,000 debt spread across 6 or 7 companies. I enrolled onto a debt management plan in 2012, and that lasted for around a year until they discontinued the plan following two late of the monthly amount. I have not entered into another debt management plan since.\n\n\n\nThis addiction and debt problem has  led me into a state of depression which began about 2.5 years ago. Some of you may figure this is strange as you may have read about Ketamine's use in several studies which found that it is successfully counter-effective against symptoms of depression. My only response to this is that our bodies and brains are all different, and that the subjects used in these studies were probably not heavy users of the drug before the studies began. \n\nAfter a a while of coping with this suspected depression I began experiencing, I eventually decided I didn't want to continue this life. I made an attempt at suicide which involved several plastic bags and lots of duck tape. A friend found me in the late stages of this process, quite embarrassing I know. \n\nFor the next couple of months I concentrated all of my will power on staying sober. Safe to say it worked quite well, especially considering that this sobriety happened to coincide with a huge drought of the substance I was trying to avoid. Talk about good timing! \n\nAnyway, time passed and I began stumbling down Ketamine's slopes yet again. I started taking more than ever before, resulting in me taking extended periods of time off work due to Ketamine related illness. At  first my management didn't know the real cause, I used to come up with some crappy excuse like stomach bugs or migraines. My increasing level of absence eventually initiated the first stage of my employer's Sickness &amp; Absence procedure, which placed me under review. During my first absence related meeting I told them exactly what I was going through. They were very understanding of my situation, and after setting some absence targets I was advised to contact my local GP to discuss what options might be available.\n\nI did exactly this, and shortly afterwards I began my first course of anti-depressants (Citalopram specifically). Nearly two months into this treatment I started going off the rails again, and due to another drought of Ketamine I resorted to other drugs including lots of Diazepam (Valium), Heroin (rarely) and (more) alcohol. None of the above mixed well with the Citalopram whatsoever. Once the began to properly kick in (I believe it was between the 4-6 week after starting them) I did not feel like I thought I should have. I felt like I was  experiencing life through a looking glass, and I felt far from right. After a few weeks of feeling this way, I told my GP I won't continue to take the Citalopram, and I slowly reduced the dosage to non. \n\nAfter the medication stopped, my Ketamine and other drug use kept on going at full speed. Now I'm sure you may be wondering why I haven't mentioned any attempt at drugs counselling in the past. I can assure you I have tried and failed 3 times with the services available in the city I live in. \n\nMy Heroin use started to increased slightly, and yet again I started making myself ill through too much Ketamine, resulting in more time off which breached my absence target and started stage two out of three in my employer's Sickness &amp; Absence Procedure.\n  \n  \nCutting out many months of my life history so as to reduce further waste of your time, I eventually made an another attempt to take my life. This time involved a rucksack full of rocks and a nearby lake. Needless to say this attempt also failed as I was seen by a dog walker jumping into said lake... \n\nI was kept in hospital for 2 days until I was fit to return home. I was also assigned to the NHS' Crisis Team and began twice-weekly meetings with two of their advisers for about 3 weeks. They seemed understanding at first, though the more time I spent with them the more I felt they didn't give a damn about me, and felt they were quickly trying to”shrug me off” of their workload. This drastically reduced my faith in the NHS.\n\nFollowing that incident, I spent two weeks at my Dad &amp; Step-Mums house, and of course explained everything to them. They were great, and even lent me some money to clear some overdue bills (not debts, bills) so that I was up to date with the more important finances. We spoke a lot of anti-depressants because they had both been treated for depression in the past (my Step-Mum was still being treated, though she is a massive hypochondriac anyway and takes all sorts of medication). My Dad strongly recommended that I give them another go, and contrary to what the Crisis Team advised, I began a new course of treatment, this time with the anti-depressant Fluoxetine. \n\nOnce the first month-ish of the Fluoxetine had passed, I began to feel better, and after some more time had passed I was even feeling GOOD. I started to perform better in my job, my absence was well on target, my relationship with my family was good. \n\nEverything was going dandy, better than I could have expected. However, I continued taking drugs, normally behind the backs of friends and family. I kept ignoring calls and letters from the companies which I was in debt with, though of course that didn't stop their persistence. I began thinking this was all okay, that I had to concentrate on getting clean before sorting my finances out. I've no idea where this delusional thought came from, because I was doing quite the opposite from staying clean. Admittedly I wasn't taking as many drugs, but the fact stands I was continuing to use the whole time thinking “it'll be okay”. I don't want to shift the blame onto the anti-depressants I was taking, though looking back I honestly think they were altering my mind in such a way as to think “Don't worry, it'll be okay”. \n\n  \nYou are probably getting bored of reading this now. I honestly didn't intend for this to be so lengthy, so I'll cut to the chase.\n\nFor the past few months, thoughts of committing suicide have been there again. I simply don't want to be here any more. And once again, I decided I was going to go through with it. Though this time would be different. This time wouldn't be spur of the moment, I'll do it properly. So I booked a well earned week off work, the first since the start of 2014 actually, and thankfully just after my payday. \n\nDuring the last week, I made sure to visit my Mum, my friends, spend time with my dog, pay a few people back (not my Dad, for reasons unknown), and get well and truly FUCKED UP.  I had the idea in my head that at the end of this holiday I wouldn't actually return to work, instead I would hang myself in my garage. The week was great, had a fantastic time, but the whole while this exhilarating thought of “it'll all be over soon” was forever present in my head. It felt better than some of the drugs I have taken this past week.\n\nSo this leads me up to near the end of my story. I woke up yesterday morning, and began to read up on the different methods of hanging oneself. After spending my morning with my phone set to aeroplane mode to ignore contact from work, I sat and researched the most effective hanging methods available. I planned it all out. I would set up my slip-knot noose, hang it from the garage ceiling, make a wrap to keep my hands tied behind my back, and get drunk to help me take my final steps. I decided to aim for constriction of my Carotid Artery, hoping to induce the supposedly pain-free unconscious state for my final breaths. I was more than confident that if my Carotid Artery wasn't constricted enough that I would be able persevere through the strangulation part of the process. I didn't plan to leave a note.\n\nAll was going well, having a sing-along to Morrissey &amp; Radiohead and drinking my favourite beer. By the time 3.30pm came, I entered the garage for what I thought would be the final time, stood on my stool, set the noose around my neck at the ready, drank the last of my beer, and had two practice runs. They didn't go as well as I had hoped, but I was drunk enough to keep going. A little later, I put the hand wrap on, but then my phone rang. I figured I'd answer as nothing would matter in 30 minutes time. It was a close colleague from work. Naturally she was concerned about where I had been all day, so I told her exactly what I was doing at that moment in time. She began to plead for me to stop what I was doing, and tried to remind me that nothing can't be fixed in life.\n\nThis response angered me because I began to feel guilty about what I was about to do. I hung up on her in a drunken rage and made the decision to take her advice for now. I went back inside my house, lay down in bed and broke into tears myself. What have I become? What is happening to me? I've become a selfish, lying coward who nearly hurt everyone who has only ever been good to me. \n\nI did not go into work again today either because I was still in a state. I have had friends and family trying to contact me to check I am ok. My Mum even came to my door yesterday evening shortly after the incident, though I refused to let her in because I am too ashamed to tell her the truth. The manager of the department I work in also came knocking on my door this afternoon, but I didn't let him in for the same reason.\n  \n  \nSo, my current circumstances are:  \n  \n*I want to commit suicide because I don't feel like I want to live any more, but I couldn't bring myself to actually do it when the time came. Maybe next time I should turn my phone off to avoid any distractions...  \n*During what I thought would be my final few weeks I have not paid any bills, not even rent – my house mates do not know this. No payment to my Dad. Spent all of my money on drugs and beer (not any Ketamine though!).  \n*I have been ignoring all of my friends and family who have tried to contact me  \n*I am probably going to lose my job because these two days I have not been into work have pushed me through to stage 3 of the Sickness &amp; Absence procedure I mentioned earlier, which is a final review and probable dismissal   \n*I have debts amounting to approx. £10,000. From some letters I have bothered to open, they will soon be initiating legal action which will result in CCJs and a messed up credit file for the next like, 10 or 11 years (approx 5-6 years to pay off, then CCJs remain on credit file for 6 years)  \n*Part of me wants to get better, but the other part of me wants it all to be over  \n  \n  \n  \n**In the immortal words of Neil Morrissey &amp; Johnny Marr:**  \n  \n**Don't feel bad for me,**  \n**I want you to know,**  \n**Deep in the cell of my heart,**  \n**I really want to go**  ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24b487", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "WhyBother21", "media": null, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398804439.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24b487/what_have_i_become/", "name": "t3_24b487", "created": 1398833030.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24b487/what_have_i_become/", "author_flair_text": null, "title": "What have I become?", "created_utc": 1398804230.0, "ups": 15, "num_comments": 13, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch67lsl", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch64kja", "approved_by": null, "body": "What did you do following your education? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What did you do following your education? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch67lsl", "created": 1398914382.0, "author_flair_text": null, "created_utc": 1398885582.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch64kja", "gilded": 0, "author": "maladie42", "parent_id": "t3_24b487", "approved_by": null, "body": "I've been in the same place as you, had been using since 14 and was about 21, in prison, nothing to show... and was able to get better and have a good chance at life. I tried settling down, reconciling my family, and getting an education. Now I'm 34 and I realize it's all just a shit show, I've done absolutely everything possible to improve my life and it still fucking sucks. But you should at least give it a chance. If it still sucks in like a decade after some honest sobriety and working at improving things, then go bye bye.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in the same place as you, had been using since 14 and was about 21, in prison, nothing to show... and was able to get better and have a good chance at life. I tried settling down, reconciling my family, and getting an education. Now I&amp;#39;m 34 and I realize it&amp;#39;s all just a shit show, I&amp;#39;ve done absolutely everything possible to improve my life and it still fucking sucks. But you should at least give it a chance. If it still sucks in like a decade after some honest sobriety and working at improving things, then go bye bye.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch64kja", "created": 1398908204.0, "author_flair_text": null, "created_utc": 1398879404.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8wib8", "gilded": 0, "author": "Steven_Stallone", "parent_id": "t3_24b487", "approved_by": null, "body": "Any Updates?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any Updates?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch8wib8", "created": 1399193102.0, "author_flair_text": null, "created_utc": 1399164302.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5kkp3", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch5kdot", "approved_by": null, "body": "Rehab could be an option, though I know I'd have to return to my home town at some point. Before, my parents might have taken me in but they definitely won't do now. \n\nIt would be great to start a new life somewhere else but it's just not a financially viable option.\n\n+1 for the reply and more Morrissey. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rehab could be an option, though I know I&amp;#39;d have to return to my home town at some point. Before, my parents might have taken me in but they definitely won&amp;#39;t do now. &lt;/p&gt;\n\n&lt;p&gt;It would be great to start a new life somewhere else but it&amp;#39;s just not a financially viable option.&lt;/p&gt;\n\n&lt;p&gt;+1 for the reply and more Morrissey. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5kkp3", "created": 1398849220.0, "author_flair_text": null, "created_utc": 1398820420.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5kdot", "gilded": 0, "author": "vedicvoyager", "parent_id": "t3_24b487", "approved_by": null, "body": "a faraway substance abuse rehab would do you lots of good.  a buyable safety net where you can detox and rebuild.  you might even be able to use that experience in a \"new\" life.  there are options if you are willing to commit to them.  pm me if you want to talk.\n\nmore morrissey &amp; marr:\n\"so please save your life\nbecause you've only got one\"", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a faraway substance abuse rehab would do you lots of good.  a buyable safety net where you can detox and rebuild.  you might even be able to use that experience in a &amp;quot;new&amp;quot; life.  there are options if you are willing to commit to them.  pm me if you want to talk.&lt;/p&gt;\n\n&lt;p&gt;more morrissey &amp;amp; marr:\n&amp;quot;so please save your life\nbecause you&amp;#39;ve only got one&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5kdot", "created": 1398848821.0, "author_flair_text": null, "created_utc": 1398820021.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5uozq", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch5qkbi", "approved_by": null, "body": "Edit: Thank you for your response, I appreciate your time spent.\n\n&gt;Would you be satisfied if you worked doing something physical, free of drugs, long hours, somewhere remote, no computer, don't speak to your parents, but good meaningful work?\n\nEach of those points in your question are the EXACT opposite of where I am at the moment. The biggest part of my life has been drugs, my job is the opposite of physical, I only do 35 hours per week, work is fairly local (15 minutes bus journey), and I am on computers all day. The work I guess is meaningful because we provide a service to people who need it. \n\nI have found it very difficult to try a comprehend what I might feel like in a life the total opposite of where I am at the moment :/\n\n&gt;What about another country, doing something with your English skills, involved in the culture, new friends, somewhere that it' very hard to come by drugs.\n\nThis is something which I honestly haven't considered before. It is a good idea, though getting into teaching would require money, same with travelling of course. I simply don't have the capacity to do that. I understand people have travelled to places with barely anything to their name, though I've been so indulged in this life of excess for so long I know I wouldn't be able to sustain it.\n\n&gt;If you haven't been able to recover so far, it's because, deep down, you knew your situation was better as it was. You didn't want those prizes of clean life over those benefits of doing drugs.\n\nHit the nail on the head. Totally.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Thank you for your response, I appreciate your time spent.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Would you be satisfied if you worked doing something physical, free of drugs, long hours, somewhere remote, no computer, don&amp;#39;t speak to your parents, but good meaningful work?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Each of those points in your question are the EXACT opposite of where I am at the moment. The biggest part of my life has been drugs, my job is the opposite of physical, I only do 35 hours per week, work is fairly local (15 minutes bus journey), and I am on computers all day. The work I guess is meaningful because we provide a service to people who need it. &lt;/p&gt;\n\n&lt;p&gt;I have found it very difficult to try a comprehend what I might feel like in a life the total opposite of where I am at the moment :/&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What about another country, doing something with your English skills, involved in the culture, new friends, somewhere that it&amp;#39; very hard to come by drugs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something which I honestly haven&amp;#39;t considered before. It is a good idea, though getting into teaching would require money, same with travelling of course. I simply don&amp;#39;t have the capacity to do that. I understand people have travelled to places with barely anything to their name, though I&amp;#39;ve been so indulged in this life of excess for so long I know I wouldn&amp;#39;t be able to sustain it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you haven&amp;#39;t been able to recover so far, it&amp;#39;s because, deep down, you knew your situation was better as it was. You didn&amp;#39;t want those prizes of clean life over those benefits of doing drugs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hit the nail on the head. Totally.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5uozq", "created": 1398880371.0, "author_flair_text": null, "created_utc": 1398851571.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5qkbi", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24b487", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5qkbi", "created": 1398837100.0, "author_flair_text": null, "created_utc": 1398833500.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5l161", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch5h8ju", "approved_by": null, "body": "Thanks for replying. \n\nI need to try to rebuild my relationship with my family but I don't know where to start tbh. Being brave is probably the only way to go about it... \n\nI agree with your point, there are certain friends of mine who still use other drugs on occasion, but nearly all of them have moved on from the Ket or Heroin. I don't really associate with the people who use them two any more, it's just me, quite sad I know. Even both of my housemates only smoke weed and drink. I've always ended up back where I started every time I have tried quitting. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for replying. &lt;/p&gt;\n\n&lt;p&gt;I need to try to rebuild my relationship with my family but I don&amp;#39;t know where to start tbh. Being brave is probably the only way to go about it... &lt;/p&gt;\n\n&lt;p&gt;I agree with your point, there are certain friends of mine who still use other drugs on occasion, but nearly all of them have moved on from the Ket or Heroin. I don&amp;#39;t really associate with the people who use them two any more, it&amp;#39;s just me, quite sad I know. Even both of my housemates only smoke weed and drink. I&amp;#39;ve always ended up back where I started every time I have tried quitting. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5l161", "created": 1398850162.0, "author_flair_text": null, "created_utc": 1398821362.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5h8ju", "gilded": 0, "author": "Bosseffs", "parent_id": "t3_24b487", "approved_by": null, "body": "I can say that everything is gonna be alright and you can be strong enough to survive this but I have never even in the slightest been depressed or addicted to any drug at all. So I can't really start to imagine what you have been through these past 8 years. What I do know that it wasn't only because of the phone that rang you stopped yourself to commit suicide. A part of you as you said wants to live and I believe if you can find the strength in that you can overcome this no matter how bad the odds are. \n\n&amp;nbsp;\n\nHowever the first step when it comes to things like this is that you have to be brave. You need to tell your family that you don't want to live but you are trying your best. Your family can help you and they will be there for you because in the end you are a part of them. \n\n&amp;nbsp;\n\nNow if you have old friends that's doing drugs aswell or even selling to you... You need to stop having any sort of contact with them. It needs to stop, it's hard I know some friends can be people who has always been at your side but you need to let go.\n\n&amp;nbsp;\n\nIf you feel like doing more talk just PM me.", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can say that everything is gonna be alright and you can be strong enough to survive this but I have never even in the slightest been depressed or addicted to any drug at all. So I can&amp;#39;t really start to imagine what you have been through these past 8 years. What I do know that it wasn&amp;#39;t only because of the phone that rang you stopped yourself to commit suicide. A part of you as you said wants to live and I believe if you can find the strength in that you can overcome this no matter how bad the odds are. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;However the first step when it comes to things like this is that you have to be brave. You need to tell your family that you don&amp;#39;t want to live but you are trying your best. Your family can help you and they will be there for you because in the end you are a part of them. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Now if you have old friends that&amp;#39;s doing drugs aswell or even selling to you... You need to stop having any sort of contact with them. It needs to stop, it&amp;#39;s hard I know some friends can be people who has always been at your side but you need to let go.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;If you feel like doing more talk just PM me.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5h8ju", "created": 1398842154.0, "author_flair_text": null, "created_utc": 1398813354.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5uz54", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch5nbsk", "approved_by": null, "body": "Thanks for your reply.\n\nThe suggestion of moving away was also made above by /u/midas_76. I have considered moving to another city in England before, though never to leave the country. Staying in the UK wouldn't let me escape from these debts, they would follow me no matter where I ended up. Moving abroad sounds like the more sensible option though this requires money, something which I really don't have a lot of.\n\nWhen I have spoken with my Dad in the past, he said very similar to you about aims and objectives. He once asked me to write a list about everything I should be doing, and then start doing it one by one. I never even wrote the damn list.\n\nI am currently awaiting to hear whether I still have my job. This will ultimately be the deciding factor on whether I will still be here by the end of this week. If I do keep my job, I'll seek advice from the NHS again as this would be required by my employer, though I guess I'll be told to take another anti-depressant and I honestly can only see myself ending up here again. I don't think they will work for me, the state of mind they produce sort of nullify the other problems I've caused in my life. \n\nAlso if my job is secure, I still then have to face the immediate issue of unpaid bills and the shameful truth that my house mates don't know about it - I was nominated for the lead role on finances when we moved in nearly 2 years ago, looking back I should totally have said no. I've no idea what their reaction could be. They have put up with my drug use in the past, but this is way worse. These bills include rent, as well as council tax which can be a jailable offence if unpaid for long enough. It probably wouldn't come to that stage, but still.  I looked into CCJ's a little more last night and was slightly reassured that, even if they aren't paid, all the creditor can do is apply for an attachment of earnings order or bailiff warrant. Don't think a Bailiff would be as much of an issue because I'm in a rented house and my house mates would definitely cover and pretend I don't live here, lol.\n  \n  \nI'm going to have a go at writing this list.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your reply.&lt;/p&gt;\n\n&lt;p&gt;The suggestion of moving away was also made above by &lt;a href=\"/u/midas_76\"&gt;/u/midas_76&lt;/a&gt;. I have considered moving to another city in England before, though never to leave the country. Staying in the UK wouldn&amp;#39;t let me escape from these debts, they would follow me no matter where I ended up. Moving abroad sounds like the more sensible option though this requires money, something which I really don&amp;#39;t have a lot of.&lt;/p&gt;\n\n&lt;p&gt;When I have spoken with my Dad in the past, he said very similar to you about aims and objectives. He once asked me to write a list about everything I should be doing, and then start doing it one by one. I never even wrote the damn list.&lt;/p&gt;\n\n&lt;p&gt;I am currently awaiting to hear whether I still have my job. This will ultimately be the deciding factor on whether I will still be here by the end of this week. If I do keep my job, I&amp;#39;ll seek advice from the NHS again as this would be required by my employer, though I guess I&amp;#39;ll be told to take another anti-depressant and I honestly can only see myself ending up here again. I don&amp;#39;t think they will work for me, the state of mind they produce sort of nullify the other problems I&amp;#39;ve caused in my life. &lt;/p&gt;\n\n&lt;p&gt;Also if my job is secure, I still then have to face the immediate issue of unpaid bills and the shameful truth that my house mates don&amp;#39;t know about it - I was nominated for the lead role on finances when we moved in nearly 2 years ago, looking back I should totally have said no. I&amp;#39;ve no idea what their reaction could be. They have put up with my drug use in the past, but this is way worse. These bills include rent, as well as council tax which can be a jailable offence if unpaid for long enough. It probably wouldn&amp;#39;t come to that stage, but still.  I looked into CCJ&amp;#39;s a little more last night and was slightly reassured that, even if they aren&amp;#39;t paid, all the creditor can do is apply for an attachment of earnings order or bailiff warrant. Don&amp;#39;t think a Bailiff would be as much of an issue because I&amp;#39;m in a rented house and my house mates would definitely cover and pretend I don&amp;#39;t live here, lol.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to have a go at writing this list.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5uz54", "created": 1398882179.0, "author_flair_text": null, "created_utc": 1398853379.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5nbsk", "gilded": 0, "author": "Steven_Stallone", "parent_id": "t1_ch5kp0d", "approved_by": null, "body": "I was hoping you would say you would like to move away but you didn't, however you mentioned above. Why don't you focus on moving away and just leave behind the debt.\n\nSet yourself the goal of leaving all the shit behind and move to a new country for a new start. Set the goal and keep it in sight. It is possible and you just have to focus on that.\n\nAims and objectives, You have to set yourself an over all aim and then set little objectives and each one brings you closer to your goal. So lets say your goal is to move away for a new start. Your objectives then would be to do everything that would help you achieve that goal. That is called discipline, you are aware of the patterns that brought you to this place, like the drugs. So it's bad discipline to take drugs because it takes you away from your goal, it hijacks your mind and you waste money which could be used as savings to leave.\n\nYou have to visualize a future for yourself and literally create it one step at a time. Of course the same applies to any goal you set.\n\nThe debt is a tricky one, I can say all I want to say about the banks and the debt but it's your situation. I would say to tell them fuck off or go into them and tell them that your addicted to drugs and you'll never get the money back but that could be bad advice if it's used against you in court if they sue you. In my opinion i wouldn't worry too much over debts and warning letters and even if it gets taken to court. Whats the worst that can happen, it's impossible to go to jail over it. Your history with drugs and loans is in your favor and you could use that as leverage to negotiate a set amount to repay with no interest because they will just be wasting their time pursuing you. This is their only option to get something back from you.\n\nFind yourself a goal, work towards it, tell your family what you plan to do, stick to your guns and cut anyone's head off (figuratively) who tries to dismiss your dreams", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was hoping you would say you would like to move away but you didn&amp;#39;t, however you mentioned above. Why don&amp;#39;t you focus on moving away and just leave behind the debt.&lt;/p&gt;\n\n&lt;p&gt;Set yourself the goal of leaving all the shit behind and move to a new country for a new start. Set the goal and keep it in sight. It is possible and you just have to focus on that.&lt;/p&gt;\n\n&lt;p&gt;Aims and objectives, You have to set yourself an over all aim and then set little objectives and each one brings you closer to your goal. So lets say your goal is to move away for a new start. Your objectives then would be to do everything that would help you achieve that goal. That is called discipline, you are aware of the patterns that brought you to this place, like the drugs. So it&amp;#39;s bad discipline to take drugs because it takes you away from your goal, it hijacks your mind and you waste money which could be used as savings to leave.&lt;/p&gt;\n\n&lt;p&gt;You have to visualize a future for yourself and literally create it one step at a time. Of course the same applies to any goal you set.&lt;/p&gt;\n\n&lt;p&gt;The debt is a tricky one, I can say all I want to say about the banks and the debt but it&amp;#39;s your situation. I would say to tell them fuck off or go into them and tell them that your addicted to drugs and you&amp;#39;ll never get the money back but that could be bad advice if it&amp;#39;s used against you in court if they sue you. In my opinion i wouldn&amp;#39;t worry too much over debts and warning letters and even if it gets taken to court. Whats the worst that can happen, it&amp;#39;s impossible to go to jail over it. Your history with drugs and loans is in your favor and you could use that as leverage to negotiate a set amount to repay with no interest because they will just be wasting their time pursuing you. This is their only option to get something back from you.&lt;/p&gt;\n\n&lt;p&gt;Find yourself a goal, work towards it, tell your family what you plan to do, stick to your guns and cut anyone&amp;#39;s head off (figuratively) who tries to dismiss your dreams&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5nbsk", "created": 1398854836.0, "author_flair_text": null, "created_utc": 1398826036.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5kp0d", "gilded": 0, "author": "WhyBother21", "parent_id": "t1_ch5j0nl", "approved_by": null, "body": "Learn to ride a motorbike for sure, or maybe book tickets to Silverstone this year. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Learn to ride a motorbike for sure, or maybe book tickets to Silverstone this year. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5kp0d", "created": 1398824267.0, "author_flair_text": null, "created_utc": 1398820667.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5j0nl", "gilded": 0, "author": "Steven_Stallone", "parent_id": "t3_24b487", "approved_by": null, "body": "If all the problems vanished tomorrow and you had a clean slate to do anything you want what would it be?", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If all the problems vanished tomorrow and you had a clean slate to do anything you want what would it be?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24b487", "score_hidden": false, "name": "t1_ch5j0nl", "created": 1398845992.0, "author_flair_text": null, "created_utc": 1398817192.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]