[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I tried calling the Suicide Hotline, and I was on hold for 8 minutes before hanging up. I need to get this off my chest, because I need to hear from someone who doesn&amp;#39;t know me and can tell me things will get better. My family and friends have told me the same thing, but it becomes a bad record, and you don&amp;#39;t believe in it anymore. I need to hear something, from someone that things will get truly better.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t like to live my life with regrets, but lately, I have been thinking about how much I could change the past. If I went to a different college, if I had a different major, if I put more effort into what I wanted and not what others thought of me, etc. But I am also proud of what I have accomplished as well.&lt;/p&gt;\n\n&lt;p&gt;I went to law school thinking it would help with employment, since I kept being rejected from jobs saying I needed more experience or that I needed a master&amp;#39;s degree. I later learned that I didn&amp;#39;t have the passion for law. I enjoyed it, but it wasn&amp;#39;t a true passion. I admit, I wasn&amp;#39;t a stellar student and got by, but I also made sure to make my law school worth it (or so it seemed) by getting experience through summer jobs, externships, etc. I graduated and took the bar last year. Failed it. I wasn&amp;#39;t completely surprised, because I&amp;#39;ve also been those two-time taker for standardized tests and such.&lt;/p&gt;\n\n&lt;p&gt;But I failed again today. And I am at a loss for words. I came away from that exam feeling content, because I had studied, what I thought, was much better than the first time. I know that putting x amount of hours doesn&amp;#39;t always mean you&amp;#39;ll ace it, but I devoted much more this time around. When I looked on my screen today, I felt that my life has no purpose.&lt;/p&gt;\n\n&lt;p&gt;I struggle, because I know the job market isn&amp;#39;t that great. But for months, I have been applying to all kinds of jobs. I was even rejected from a retail position because I was too overqualified. I&amp;#39;ve applied to 300 jobs since I graduated, and I&amp;#39;ve gotten dead ends. I&amp;#39;ve even showed my resume to recruiters, who have told me that admin/office assistant is low, and that I need to look elsewhere. But everywhere I go, they expect me to go into the legal field. I can&amp;#39;t even get my foot in the door for non-profit or public service work. And when I do apply for legal jobs, they are hesitant at hiring me. One firm told me that because they wanted me to focus on the bar, they would have the position open for me once I was done. When I called the day after the bar, they told me the position was filled.&lt;/p&gt;\n\n&lt;p&gt;My only source of income has been doing &lt;a href=\"/r/beermoney\"&gt;/r/beermoney&lt;/a&gt; work. Which, like it&amp;#39;s not income, but it&amp;#39;s something to do while I send out my resumes everyday. And while I love the thread (and I am SO grateful for it), I can&amp;#39;t help but feel terrible that I bring in a dozen or so dollars a week while I have classmates who bring in thousands. I know I shouldn&amp;#39;t compare, but law school reeks of people who love to flaunt their income (one girl actually posted how much she made on Facebook). I just want a job and to be happy.&lt;/p&gt;\n\n&lt;p&gt;And while loans are always a burden, I&amp;#39;ve come to terms that Income-Based Repayment is what I&amp;#39;ll end up. I can&amp;#39;t imagine paying off my loans in 25 years, and I worry about how much I&amp;#39;ll be taxed once it&amp;#39;s written off. &lt;/p&gt;\n\n&lt;p&gt;I feel like I have a degree I cannot use. I feel helpless, I feel like I don&amp;#39;t have a direction. Whatever goals I had (international journalism/human rights) seems farther than ever. I feel like there is no purpose, and I have wasted so much time and money (that could have been spent on other things like getting a certification or something). I feel like everything I&amp;#39;ve done to get this far has been nothing, voided of all value. If I could start over, I wish. I never want to regret my actions, but I feel like everything I&amp;#39;ve done has been regretful. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to kill myself, because I do have family and friends, and I know it wouldn&amp;#39;t be the answer. But I feel so empty, and I certainly don&amp;#39;t feel like I&amp;#39;m living at all.  &lt;/p&gt;\n\n&lt;p&gt;What can I do now?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I tried calling the Suicide Hotline, and I was on hold for 8 minutes before hanging up. I need to get this off my chest, because I need to hear from someone who doesn't know me and can tell me things will get better. My family and friends have told me the same thing, but it becomes a bad record, and you don't believe in it anymore. I need to hear something, from someone that things will get truly better.\n\nI don't like to live my life with regrets, but lately, I have been thinking about how much I could change the past. If I went to a different college, if I had a different major, if I put more effort into what I wanted and not what others thought of me, etc. But I am also proud of what I have accomplished as well.\n\nI went to law school thinking it would help with employment, since I kept being rejected from jobs saying I needed more experience or that I needed a master's degree. I later learned that I didn't have the passion for law. I enjoyed it, but it wasn't a true passion. I admit, I wasn't a stellar student and got by, but I also made sure to make my law school worth it (or so it seemed) by getting experience through summer jobs, externships, etc. I graduated and took the bar last year. Failed it. I wasn't completely surprised, because I've also been those two-time taker for standardized tests and such.\n\nBut I failed again today. And I am at a loss for words. I came away from that exam feeling content, because I had studied, what I thought, was much better than the first time. I know that putting x amount of hours doesn't always mean you'll ace it, but I devoted much more this time around. When I looked on my screen today, I felt that my life has no purpose.\n\nI struggle, because I know the job market isn't that great. But for months, I have been applying to all kinds of jobs. I was even rejected from a retail position because I was too overqualified. I've applied to 300 jobs since I graduated, and I've gotten dead ends. I've even showed my resume to recruiters, who have told me that admin/office assistant is low, and that I need to look elsewhere. But everywhere I go, they expect me to go into the legal field. I can't even get my foot in the door for non-profit or public service work. And when I do apply for legal jobs, they are hesitant at hiring me. One firm told me that because they wanted me to focus on the bar, they would have the position open for me once I was done. When I called the day after the bar, they told me the position was filled.\n\nMy only source of income has been doing /r/beermoney work. Which, like it's not income, but it's something to do while I send out my resumes everyday. And while I love the thread (and I am SO grateful for it), I can't help but feel terrible that I bring in a dozen or so dollars a week while I have classmates who bring in thousands. I know I shouldn't compare, but law school reeks of people who love to flaunt their income (one girl actually posted how much she made on Facebook). I just want a job and to be happy.\n\nAnd while loans are always a burden, I've come to terms that Income-Based Repayment is what I'll end up. I can't imagine paying off my loans in 25 years, and I worry about how much I'll be taxed once it's written off. \n\nI feel like I have a degree I cannot use. I feel helpless, I feel like I don't have a direction. Whatever goals I had (international journalism/human rights) seems farther than ever. I feel like there is no purpose, and I have wasted so much time and money (that could have been spent on other things like getting a certification or something). I feel like everything I've done to get this far has been nothing, voided of all value. If I could start over, I wish. I never want to regret my actions, but I feel like everything I've done has been regretful. \n\nI don't want to kill myself, because I do have family and friends, and I know it wouldn't be the answer. But I feel so empty, and I certainly don't feel like I'm living at all.  \n\nWhat can I do now?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23x7ik", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "keepcalmandtravelon", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/23x7ik/what_is_the_next_thing_to_do/", "name": "t3_23x7ik", "created": 1398424948.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/23x7ik/what_is_the_next_thing_to_do/", "author_flair_text": null, "title": "What is the next thing to do", "created_utc": 1398396148.0, "ups": 1, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3qrl4", "gilded": 0, "author": "srgkhdfsh", "parent_id": "t1_ch2a6t7", "approved_by": null, "body": "Ignore the law school people. The competitiveness of school brings that out in people during law school, but the profession is full of truly great people that want you to succeed.\n\nThe multiple retake thing was what scared the shit out of me. I didn't want that to define me (especially with my former classmates). But, this is not about them; it is about you. If you really want it, then you should try again. If the cost (both money and time) outweighs the benefit to you, just move on. Just make sure that your decision is entirely independent from the embarrassment that you may feel from not reaching your goal.\n\nI found the classes to be a complete waste of my time. The second time, I took my books and made my own outlines. I tried to break down each field into a list of questions to systematically work through (ie: secured transactions -- (1) was there attachment? (2) did anyone perfect their claim? (3) who has priority? ; commercial paper -- (1) what type of instrument? (2) was it negotiable? (3) is there a HIDC? (4) are there any claims or defenses?) (those are just off the top of my head, so they may not be reliable, but you get the idea.) Then, I wrote essay after essay after essay. It got to the point where the essays were extremely boring, because it was always the same. But, it reinforced the concepts. Ultimately, I spent 4 extra hours a day actually taking essays and learning as I went, rather than watching the boring videos.\n\nAnyway, best of luck with whichever decision you choose. If you choose to retake the exam, just keep pushing. The last hour of MBE questions, I could barely read. I hadn't slept in weeks. I had to close my eyes for minutes between each question. But, you just have to power through and believe in yourself. \n\nIf you fail a third time, it doesn't make you any less of a person:\n\n\"It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.\"", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ignore the law school people. The competitiveness of school brings that out in people during law school, but the profession is full of truly great people that want you to succeed.&lt;/p&gt;\n\n&lt;p&gt;The multiple retake thing was what scared the shit out of me. I didn&amp;#39;t want that to define me (especially with my former classmates). But, this is not about them; it is about you. If you really want it, then you should try again. If the cost (both money and time) outweighs the benefit to you, just move on. Just make sure that your decision is entirely independent from the embarrassment that you may feel from not reaching your goal.&lt;/p&gt;\n\n&lt;p&gt;I found the classes to be a complete waste of my time. The second time, I took my books and made my own outlines. I tried to break down each field into a list of questions to systematically work through (ie: secured transactions -- (1) was there attachment? (2) did anyone perfect their claim? (3) who has priority? ; commercial paper -- (1) what type of instrument? (2) was it negotiable? (3) is there a HIDC? (4) are there any claims or defenses?) (those are just off the top of my head, so they may not be reliable, but you get the idea.) Then, I wrote essay after essay after essay. It got to the point where the essays were extremely boring, because it was always the same. But, it reinforced the concepts. Ultimately, I spent 4 extra hours a day actually taking essays and learning as I went, rather than watching the boring videos.&lt;/p&gt;\n\n&lt;p&gt;Anyway, best of luck with whichever decision you choose. If you choose to retake the exam, just keep pushing. The last hour of MBE questions, I could barely read. I hadn&amp;#39;t slept in weeks. I had to close my eyes for minutes between each question. But, you just have to power through and believe in yourself. &lt;/p&gt;\n\n&lt;p&gt;If you fail a third time, it doesn&amp;#39;t make you any less of a person:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x7ik", "score_hidden": false, "name": "t1_ch3qrl4", "created": 1398650546.0, "author_flair_text": null, "created_utc": 1398646946.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch2a6t7", "gilded": 0, "author": "keepcalmandtravelon", "parent_id": "t1_ch1mnq7", "approved_by": null, "body": "I appreciate this. Thank you.\n\nI'm going to take some time if I want to try again. I told myself I'd like to see my scores (I was off by 10 points last time). If I barely made any improvements, I don't think I could study any better. This time around, I took a supplemental course on tackling the MBE. I'm just at a loss of words about how to even study differently when I felt okay with my efforts in February. \n\nAnd I definitely don't want to be one of those people who take it over and over again. I remember reading somewhere someone took the bar for the 5th time, and I wouldn't have the power, much less the money/time/devotion towards it. So I'm going to give myself some time to think about it before I want to commit.\n\nAnd thank you for not judging me. I've met people who say it's always hard, and it's okay to retake, but I also know some incredible douchebags and shitheads at my school who think that if you don't pass anything on the first time, you're just shit. I remember one time, I mentioned to a prospective student on our school's Facebook page about putting worth effort and balancing time management (I was being objective and fair, but not mean at all). A classmate of mine commented how I was making it too hard that you don't even need to read for cases. I felt that he undermined my comment. I just incredibly dislike and loathe people who make law school seem like it's a walk in the park (maybe for them).\n\nI'm hoping to find a creative way, but I keep coming back to jobs meant for college grads. It's like a Catch 22. I either made the mistake of getting a JD or I should just stick with legal positions. I'm trying, but the fact that I failed the bar this time around, I feel like I'm still stuck.\n\nI know people in this thread have dilemmas and problems more concerning, and I understand that. I know I am worrying about a job, but it's the fact that I haven't gotten any successful leads. It's all dead ends. What worries me the most is that what if I do a career change, say plumbing/electrician/nursing...it would mean that my entire law school was a waste, and I just don't want to think that.\n\nSorry, I'm just rambling, but it feels better that someone out there knows what it's like. Knows what the other side is like as well. So thank you for your comment. It means a lot.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate this. Thank you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to take some time if I want to try again. I told myself I&amp;#39;d like to see my scores (I was off by 10 points last time). If I barely made any improvements, I don&amp;#39;t think I could study any better. This time around, I took a supplemental course on tackling the MBE. I&amp;#39;m just at a loss of words about how to even study differently when I felt okay with my efforts in February. &lt;/p&gt;\n\n&lt;p&gt;And I definitely don&amp;#39;t want to be one of those people who take it over and over again. I remember reading somewhere someone took the bar for the 5th time, and I wouldn&amp;#39;t have the power, much less the money/time/devotion towards it. So I&amp;#39;m going to give myself some time to think about it before I want to commit.&lt;/p&gt;\n\n&lt;p&gt;And thank you for not judging me. I&amp;#39;ve met people who say it&amp;#39;s always hard, and it&amp;#39;s okay to retake, but I also know some incredible douchebags and shitheads at my school who think that if you don&amp;#39;t pass anything on the first time, you&amp;#39;re just shit. I remember one time, I mentioned to a prospective student on our school&amp;#39;s Facebook page about putting worth effort and balancing time management (I was being objective and fair, but not mean at all). A classmate of mine commented how I was making it too hard that you don&amp;#39;t even need to read for cases. I felt that he undermined my comment. I just incredibly dislike and loathe people who make law school seem like it&amp;#39;s a walk in the park (maybe for them).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m hoping to find a creative way, but I keep coming back to jobs meant for college grads. It&amp;#39;s like a Catch 22. I either made the mistake of getting a JD or I should just stick with legal positions. I&amp;#39;m trying, but the fact that I failed the bar this time around, I feel like I&amp;#39;m still stuck.&lt;/p&gt;\n\n&lt;p&gt;I know people in this thread have dilemmas and problems more concerning, and I understand that. I know I am worrying about a job, but it&amp;#39;s the fact that I haven&amp;#39;t gotten any successful leads. It&amp;#39;s all dead ends. What worries me the most is that what if I do a career change, say plumbing/electrician/nursing...it would mean that my entire law school was a waste, and I just don&amp;#39;t want to think that.&lt;/p&gt;\n\n&lt;p&gt;Sorry, I&amp;#39;m just rambling, but it feels better that someone out there knows what it&amp;#39;s like. Knows what the other side is like as well. So thank you for your comment. It means a lot.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x7ik", "score_hidden": false, "name": "t1_ch2a6t7", "created": 1398483365.0, "author_flair_text": null, "created_utc": 1398479765.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1mnq7", "gilded": 0, "author": "srgkhdfsh", "parent_id": "t3_23x7ik", "approved_by": null, "body": "Don't let the bar exam or your career define your life. There's so much more to live for, but attorneys tend to forget that due to the dedication that the field requires. Suck up the set-back and move on. Decide whether you want to take it again or do something else.\n\nIf you take it again, change your approach. The standard courses didn't work for me the first time, so I studied using my own method and passed the second time. I just kept motivating myself, using my previous failure as inspiration not to feel that way again. For me, the re-take was solely about finishing this 4 year process. After my re-take, I told myself that I wouldn't ever do it again. If I failed, I was moving on because I don't love the law, the job availability sucks, and I didn't want to feel like shit again.\n\nNo one should fault you for failing the bar, and you should be proud of your accomplishments to date. The bar exam sucks and it's a shitty way to evaluate your abilities as an attorney. No attorneys criticized me for failing the first time, and certainly people outside the legal profession weren't critical either.\n\nI passed and feel like I have a degree I cannot use. My friends passed before me and they still feel like they have degrees they cannot use. With the profession as flooded as it is, you need to find a creative way to use the degree (licensed attorney or not, whichever you decide). When you do let the rest of us in on the secret. :)\n\nAt the end of the day, you're just worrying about a job. And if that's the least of your worries, you are going to be okay.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t let the bar exam or your career define your life. There&amp;#39;s so much more to live for, but attorneys tend to forget that due to the dedication that the field requires. Suck up the set-back and move on. Decide whether you want to take it again or do something else.&lt;/p&gt;\n\n&lt;p&gt;If you take it again, change your approach. The standard courses didn&amp;#39;t work for me the first time, so I studied using my own method and passed the second time. I just kept motivating myself, using my previous failure as inspiration not to feel that way again. For me, the re-take was solely about finishing this 4 year process. After my re-take, I told myself that I wouldn&amp;#39;t ever do it again. If I failed, I was moving on because I don&amp;#39;t love the law, the job availability sucks, and I didn&amp;#39;t want to feel like shit again.&lt;/p&gt;\n\n&lt;p&gt;No one should fault you for failing the bar, and you should be proud of your accomplishments to date. The bar exam sucks and it&amp;#39;s a shitty way to evaluate your abilities as an attorney. No attorneys criticized me for failing the first time, and certainly people outside the legal profession weren&amp;#39;t critical either.&lt;/p&gt;\n\n&lt;p&gt;I passed and feel like I have a degree I cannot use. My friends passed before me and they still feel like they have degrees they cannot use. With the profession as flooded as it is, you need to find a creative way to use the degree (licensed attorney or not, whichever you decide). When you do let the rest of us in on the secret. :)&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, you&amp;#39;re just worrying about a job. And if that&amp;#39;s the least of your worries, you are going to be okay.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x7ik", "score_hidden": false, "name": "t1_ch1mnq7", "created": 1398427100.0, "author_flair_text": null, "created_utc": 1398423500.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch1hgak", "gilded": 0, "author": "keepcalmandtravelon", "parent_id": "t1_ch1gcmg", "approved_by": null, "body": "I'm taking each day as it comes. It's hard when it feels like you have nothing to show for it.\n\nI've always wanted to do something with my international studies (bachelor's) degree. I'm considering graduate school, but I fear I would make the same mistakes with law school. The only difference is that I would have more of an interest in the subject.\n\nI'm looking into seeing some old friends who have been in similar positions and if I can save some money, fly down for some Sisterhood Traveling Pants whatnot. They have jobs and their own lives, but they have offered to use their vacations to spend time with me (they think I need a break before finding a solution to this dilemma). I just miss them, because I'm so far away from them. I moved back home to my parents after I graduated.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m taking each day as it comes. It&amp;#39;s hard when it feels like you have nothing to show for it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always wanted to do something with my international studies (bachelor&amp;#39;s) degree. I&amp;#39;m considering graduate school, but I fear I would make the same mistakes with law school. The only difference is that I would have more of an interest in the subject.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m looking into seeing some old friends who have been in similar positions and if I can save some money, fly down for some Sisterhood Traveling Pants whatnot. They have jobs and their own lives, but they have offered to use their vacations to spend time with me (they think I need a break before finding a solution to this dilemma). I just miss them, because I&amp;#39;m so far away from them. I moved back home to my parents after I graduated.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x7ik", "score_hidden": false, "name": "t1_ch1hgak", "created": 1398403725.0, "author_flair_text": null, "created_utc": 1398400125.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch1gcmg", "gilded": 0, "author": "[deleted]", "parent_id": "t3_23x7ik", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23x7ik", "score_hidden": false, "name": "t1_ch1gcmg", "created": 1398400945.0, "author_flair_text": null, "created_utc": 1398397345.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]