[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On monday I&amp;#39;ll have my thirty second birthday. I don&amp;#39;t want it honestly.&lt;br/&gt;\nBack in August of 2012 I tried to take my life by ODing on medication. I wish I had more luck with it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not really mad or upset about to many things. I get angry don&amp;#39;t get me wrong, I get mad about silly things. But I understand it as a reaction to being empty inside. I&amp;#39;ve grown fond of sorrow and things that evoke emotion.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a nice person, I always work customer service jobs, because I guess they are safe, and because I do enjoy caring for others. Though people see a guarded sadness to me, few would actually think I&amp;#39;d be the sort to do what I&amp;#39;ve done and feel as I feel.&lt;/p&gt;\n\n&lt;p&gt;I go to a design school, I&amp;#39;m not upset about that choice because I made it, even in waiting so long to go to school. But I&amp;#39;m not an artist, and It&amp;#39;s not for a lack of understanding or even some measure of skill. I just don&amp;#39;t have the heart and passion others seem to express for it. Strangely enough my designs are arguably better then theirs at times. But the passion to grow and cultivate it is not there. I don&amp;#39;t love it, I was in school before trying to hurt my self.  At first I worked really hard and made straight A grades. The depression  set it, I saw no value to it and started to hate my self for it. &lt;/p&gt;\n\n&lt;p&gt;I have no children no girlfriend nothing that seems to give others meaning in life. I care to do no great work. I don&amp;#39;t think I&amp;#39;m attractive but ugly is a stretch to try to call me. At times I&amp;#39;m even verbally charming. But I understand that I have nothing to offer in the long term, no one wants to be with someone who has no money, goals, or sense of self worth. You can&amp;#39;t love someone when you don&amp;#39;t love your self. It&amp;#39;s selfish to think so and try. &lt;/p&gt;\n\n&lt;p&gt;As a little person I never wanted to grow up to be anything. I played a lot of video games and read a lot of books. I drew every now and then, maybe that&amp;#39;s where the design school stuff came from. But I never valued what I did. I never wanted to make games, be an artist, or really much of anything. I did want to fall in love. But that never happened in a lasting inspiring way.&lt;/p&gt;\n\n&lt;p&gt;I have so much homework, half design assignments, half crap about how to make resumes and other bullshit required courses. I&amp;#39;m having the easiest time with math because It so simple, its either right or wrong. The design work I just stare at a blank screen blocked by a disquiet mind. Even the resume I can&amp;#39;t do because I can&amp;#39;t talk up about my self. I know what ever I put down will end up in the rejection pile. So I guess I&amp;#39;m going to fail again this quarter as I did my last because I can&amp;#39;t get my self to work.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve started to become obsessed with death, more so with entropy. I don&amp;#39;t want to go to any fantasy land like heaven. I do believe in god in some grand sense of something. But I&amp;#39;m agnostic. I do believe we live life for a reason. But somethings not right with ME, what ever that means in a cosmic reincarnation-energy being self. I want to stop being in every sense of the word, I don&amp;#39;t even want the memories or emotions of this life or any other. I wish I could erase and never be. I fantasize about a deep slumber in a  blackness that can&amp;#39;t even be described as blackness, there is nothing. Even dreams and thoughts would make a thunderous racket here. How I wish to not be.&lt;/p&gt;\n\n&lt;p&gt;So what do I do? I&amp;#39;ve been to ASH a hospital for mental health,  I&amp;#39;ve done CBT. But My own mind continues to work against me. I just don&amp;#39;t want any of this anymore. Is it wrong to want out? All I&amp;#39;m doing is going into debt. All I&amp;#39;m doing is growing colder and more recluse as a person. I don&amp;#39;t enjoy the things I once did, and I&amp;#39;ve found nothing to replace them. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not even emotional anymore, more rational then anything else. Calm about the sorrow all the time. Calm with the idea of dying, wanting it. Selfishly I suppose, but I&amp;#39;m not what you would call a selfish person, can&amp;#39;t I have this one thing? I don&amp;#39;t want anything more in this life. &lt;/p&gt;\n\n&lt;p&gt;So what do I do now?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "On monday I'll have my thirty second birthday. I don't want it honestly.  \nBack in August of 2012 I tried to take my life by ODing on medication. I wish I had more luck with it. \n\nI'm not really mad or upset about to many things. I get angry don't get me wrong, I get mad about silly things. But I understand it as a reaction to being empty inside. I've grown fond of sorrow and things that evoke emotion.\n\nI'm a nice person, I always work customer service jobs, because I guess they are safe, and because I do enjoy caring for others. Though people see a guarded sadness to me, few would actually think I'd be the sort to do what I've done and feel as I feel.\n\nI go to a design school, I'm not upset about that choice because I made it, even in waiting so long to go to school. But I'm not an artist, and It's not for a lack of understanding or even some measure of skill. I just don't have the heart and passion others seem to express for it. Strangely enough my designs are arguably better then theirs at times. But the passion to grow and cultivate it is not there. I don't love it, I was in school before trying to hurt my self.  At first I worked really hard and made straight A grades. The depression  set it, I saw no value to it and started to hate my self for it. \n\nI have no children no girlfriend nothing that seems to give others meaning in life. I care to do no great work. I don't think I'm attractive but ugly is a stretch to try to call me. At times I'm even verbally charming. But I understand that I have nothing to offer in the long term, no one wants to be with someone who has no money, goals, or sense of self worth. You can't love someone when you don't love your self. It's selfish to think so and try. \n\nAs a little person I never wanted to grow up to be anything. I played a lot of video games and read a lot of books. I drew every now and then, maybe that's where the design school stuff came from. But I never valued what I did. I never wanted to make games, be an artist, or really much of anything. I did want to fall in love. But that never happened in a lasting inspiring way.\n\nI have so much homework, half design assignments, half crap about how to make resumes and other bullshit required courses. I'm having the easiest time with math because It so simple, its either right or wrong. The design work I just stare at a blank screen blocked by a disquiet mind. Even the resume I can't do because I can't talk up about my self. I know what ever I put down will end up in the rejection pile. So I guess I'm going to fail again this quarter as I did my last because I can't get my self to work.\n\nI've started to become obsessed with death, more so with entropy. I don't want to go to any fantasy land like heaven. I do believe in god in some grand sense of something. But I'm agnostic. I do believe we live life for a reason. But somethings not right with ME, what ever that means in a cosmic reincarnation-energy being self. I want to stop being in every sense of the word, I don't even want the memories or emotions of this life or any other. I wish I could erase and never be. I fantasize about a deep slumber in a  blackness that can't even be described as blackness, there is nothing. Even dreams and thoughts would make a thunderous racket here. How I wish to not be.\n\nSo what do I do? I've been to ASH a hospital for mental health,  I've done CBT. But My own mind continues to work against me. I just don't want any of this anymore. Is it wrong to want out? All I'm doing is going into debt. All I'm doing is growing colder and more recluse as a person. I don't enjoy the things I once did, and I've found nothing to replace them. \n\nI'm not even emotional anymore, more rational then anything else. Calm about the sorrow all the time. Calm with the idea of dying, wanting it. Selfishly I suppose, but I'm not what you would call a selfish person, can't I have this one thing? I don't want anything more in this life. \n\nSo what do I do now?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24k7oa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Whatodo222", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24k7oa/what_do_i_do/", "name": "t3_24k7oa", "created": 1399084129.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24k7oa/what_do_i_do/", "author_flair_text": null, "title": "What do I do", "created_utc": 1399055329.0, "ups": 6, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7y190", "gilded": 0, "author": "Whatodo222", "parent_id": "t1_ch7xq4c", "approved_by": null, "body": "I want to be unmade into nothing. I like the idea of the darkness. I know things are beautiful. But I no longer enjoy them. The last thing left to me is being sad. I love sorrow and sad music. But even that's losing it's edge. I don't feel much anymore. I don't imagine many of us are good at giving advice here, just sharing and relating. Thank you though, I wish you the best and promise to continue at my best for the longest I can. I just wish something would breath the passion of life into me. I don't seem to remember what that's like.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to be unmade into nothing. I like the idea of the darkness. I know things are beautiful. But I no longer enjoy them. The last thing left to me is being sad. I love sorrow and sad music. But even that&amp;#39;s losing it&amp;#39;s edge. I don&amp;#39;t feel much anymore. I don&amp;#39;t imagine many of us are good at giving advice here, just sharing and relating. Thank you though, I wish you the best and promise to continue at my best for the longest I can. I just wish something would breath the passion of life into me. I don&amp;#39;t seem to remember what that&amp;#39;s like.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24k7oa", "score_hidden": false, "name": "t1_ch7y190", "created": 1399085959.0, "author_flair_text": null, "created_utc": 1399057159.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "ch7xq4c", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24k7oa", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24k7oa", "score_hidden": false, "name": "t1_ch7xq4c", "created": 1399085316.0, "author_flair_text": null, "created_utc": 1399056516.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8f11k", "gilded": 0, "author": "Whatodo222", "parent_id": "t1_ch81cb2", "approved_by": null, "body": "I feel something important is being said about the things we know  here. Things other people can't understand because they just are not. I willing wear sorrow as a badge, how can we understand joy without sadness? It's hard being that it's a double edge sword. But I honestly think there is a certain wisdom to us easily over looked. I see it in the messages sent to me. Thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel something important is being said about the things we know  here. Things other people can&amp;#39;t understand because they just are not. I willing wear sorrow as a badge, how can we understand joy without sadness? It&amp;#39;s hard being that it&amp;#39;s a double edge sword. But I honestly think there is a certain wisdom to us easily over looked. I see it in the messages sent to me. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24k7oa", "score_hidden": false, "name": "t1_ch8f11k", "created": 1399135186.0, "author_flair_text": null, "created_utc": 1399106386.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch81cb2", "gilded": 0, "author": "darkupondark", "parent_id": "t3_24k7oa", "approved_by": null, "body": "For anyone else reading this, and who feels similar to OP, I feel like a major important piece of life is finding others who feel very similar to you. I think that there are many people who just separate themselves from us over time, and that it's the people who get lost below, who have all the crippling shame and terror and social anxiety and problems finding anything at all to live for\n\nI think that it's people like that you can actually stand to be around. The rest of them are just... hell to be close to (I've always thought it was me, but maybe not?.. Maybe it's not me? I don't know. Maybe we're just different. Irreconcilably different all the time. Just oil and water. \"Happy\" people and depression) And I think that it's possible to find people like this through Music/Art and like Anime and stuff. \n\nBut I think that's it, in a way, like that's a necessary piece of life, to find people who actually have felt or thought what you've thought. Had experiences like yours., Videogames etc. Maybe anime-cons and stuff like that.\n\nI think we need that to keep going, human relationships are strange in that we need them to grow, I think, we learn so much about ourselves when we can actually relate to someone, but it's so difficult these days, because so many people are so unrelatable, it's like we're getting left behind by all of these people who are going off into their own worlds.\n\n\nBut people who feel these thoughts and feelings? Maybe I can relate to someone like that. Maybe that person won't judge how fucked up I feel. ", "edited": 1399065246.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For anyone else reading this, and who feels similar to OP, I feel like a major important piece of life is finding others who feel very similar to you. I think that there are many people who just separate themselves from us over time, and that it&amp;#39;s the people who get lost below, who have all the crippling shame and terror and social anxiety and problems finding anything at all to live for&lt;/p&gt;\n\n&lt;p&gt;I think that it&amp;#39;s people like that you can actually stand to be around. The rest of them are just... hell to be close to (I&amp;#39;ve always thought it was me, but maybe not?.. Maybe it&amp;#39;s not me? I don&amp;#39;t know. Maybe we&amp;#39;re just different. Irreconcilably different all the time. Just oil and water. &amp;quot;Happy&amp;quot; people and depression) And I think that it&amp;#39;s possible to find people like this through Music/Art and like Anime and stuff. &lt;/p&gt;\n\n&lt;p&gt;But I think that&amp;#39;s it, in a way, like that&amp;#39;s a necessary piece of life, to find people who actually have felt or thought what you&amp;#39;ve thought. Had experiences like yours., Videogames etc. Maybe anime-cons and stuff like that.&lt;/p&gt;\n\n&lt;p&gt;I think we need that to keep going, human relationships are strange in that we need them to grow, I think, we learn so much about ourselves when we can actually relate to someone, but it&amp;#39;s so difficult these days, because so many people are so unrelatable, it&amp;#39;s like we&amp;#39;re getting left behind by all of these people who are going off into their own worlds.&lt;/p&gt;\n\n&lt;p&gt;But people who feel these thoughts and feelings? Maybe I can relate to someone like that. Maybe that person won&amp;#39;t judge how fucked up I feel. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24k7oa", "score_hidden": false, "name": "t1_ch81cb2", "created": 1399093105.0, "author_flair_text": null, "created_utc": 1399064305.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]