[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not totally sure if this the correct place to post this, but here goes. For the past several months it literally feels like I&amp;#39;m going insane. It&amp;#39;s kind of like my head has been in a fog which makes me unable to think very clearly, and its affecting both my academic and social life. When its really bad I can barely hold a conversation, and I mean its not like I was ever really good at talking (some social anxiety) but now I cant even think of what to say. Also, for the most part I always have a headache now. I used to get pretty serious migraine s every few months, but now its as if I&amp;#39;ve had one continuous one for the better part of the year. Does anyone know what my problem is? I&amp;#39;ve tried getting help from mom but she always blows it off as me being a hypochondriac, which I think is because ive always been a bit shy so I guess its not that noticable that I feel weird. Please help me out, I&amp;#39;ve been having suicidal thoughts a lot lately and i really dont want to end up like that but it feels like I cant manage my own life anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not totally sure if this the correct place to post this, but here goes. For the past several months it literally feels like I'm going insane. It's kind of like my head has been in a fog which makes me unable to think very clearly, and its affecting both my academic and social life. When its really bad I can barely hold a conversation, and I mean its not like I was ever really good at talking (some social anxiety) but now I cant even think of what to say. Also, for the most part I always have a headache now. I used to get pretty serious migraine s every few months, but now its as if I've had one continuous one for the better part of the year. Does anyone know what my problem is? I've tried getting help from mom but she always blows it off as me being a hypochondriac, which I think is because ive always been a bit shy so I guess its not that noticable that I feel weird. Please help me out, I've been having suicidal thoughts a lot lately and i really dont want to end up like that but it feels like I cant manage my own life anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24tqxi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "awrigley120", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24tqxi/what_is_wrong_with_me_17m/", "name": "t3_24tqxi", "created": 1399367831.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24tqxi/what_is_wrong_with_me_17m/", "author_flair_text": null, "title": "What is wrong with me? 17m", "created_utc": 1399339031.0, "ups": 2, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chalbub", "gilded": 0, "author": "theaftstarboard", "parent_id": "t3_24tqxi", "approved_by": null, "body": "I would suggest you decide for yourself (separate from your mom's judgements) whether there is anything emotional about it at all, even if it is just a long term slight lingering feeling of sadness, it might be coming to a head now for whatever reason. I really suggest you see a therapist/psychiatrist and you hang tough, because you are very young and there is a whole amazing world ahead of you once you become an adult.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would suggest you decide for yourself (separate from your mom&amp;#39;s judgements) whether there is anything emotional about it at all, even if it is just a long term slight lingering feeling of sadness, it might be coming to a head now for whatever reason. I really suggest you see a therapist/psychiatrist and you hang tough, because you are very young and there is a whole amazing world ahead of you once you become an adult.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tqxi", "score_hidden": false, "name": "t1_chalbub", "created": 1399369368.0, "author_flair_text": null, "created_utc": 1399340568.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chalofu", "gilded": 0, "author": "OutrageousOwls", "parent_id": "t3_24tqxi", "approved_by": null, "body": "Do not feel like you need to do this alone.:) \n\nThere are a lot of professionals who can help you out. I do not recommend seeing a psychiatrist if you are not taking medication(s) for mental health, and instead see a psychologist who are typically more psychotherapy orientated. \n\nI feel ya when you were talking about anxieties. They do sick! Don't think that you are alone when it comes down to being afraid when speaking publicly in front of an audience; many people have that fear, and I think it comes down to being afraid of letting the audience down or making mistakes. You are not alone in feeling this way. :) Even if you make a mistake, it is not the end all be all of your presentation or your grades. \n\nIf you do not have the support of your mom, try speaking to other members of your family. I am sure your relatives will listen. \n\n*edit: words", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not feel like you need to do this alone.:) &lt;/p&gt;\n\n&lt;p&gt;There are a lot of professionals who can help you out. I do not recommend seeing a psychiatrist if you are not taking medication(s) for mental health, and instead see a psychologist who are typically more psychotherapy orientated. &lt;/p&gt;\n\n&lt;p&gt;I feel ya when you were talking about anxieties. They do sick! Don&amp;#39;t think that you are alone when it comes down to being afraid when speaking publicly in front of an audience; many people have that fear, and I think it comes down to being afraid of letting the audience down or making mistakes. You are not alone in feeling this way. :) Even if you make a mistake, it is not the end all be all of your presentation or your grades. &lt;/p&gt;\n\n&lt;p&gt;If you do not have the support of your mom, try speaking to other members of your family. I am sure your relatives will listen. &lt;/p&gt;\n\n&lt;p&gt;*edit: words&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tqxi", "score_hidden": false, "name": "t1_chalofu", "created": 1399370123.0, "author_flair_text": null, "created_utc": 1399341323.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chat0es", "gilded": 0, "author": "derpeline", "parent_id": "t3_24tqxi", "approved_by": null, "body": "It sounds like you could have either derealization or brain fog, both of which are common symptoms of anxiety. They both suck, but you're not alone and there are treatments available for people who suffer from them. Talk to a professional - they'll know what to do. \n\nGood luck. You can get through this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you could have either derealization or brain fog, both of which are common symptoms of anxiety. They both suck, but you&amp;#39;re not alone and there are treatments available for people who suffer from them. Talk to a professional - they&amp;#39;ll know what to do. &lt;/p&gt;\n\n&lt;p&gt;Good luck. You can get through this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tqxi", "score_hidden": false, "name": "t1_chat0es", "created": 1399392579.0, "author_flair_text": null, "created_utc": 1399363779.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chavxy4", "gilded": 0, "author": "pollyannanimal", "parent_id": "t3_24tqxi", "approved_by": null, "body": "I know what you're going through. Ived had extreme anxiety and panic disorder in the past, The headache thing could be coming from caffeine or simply the body reacting to constant amounts of stress. When there is a constant amount of stress the mind will disassociate DR/DP from what's going on giving you that fog spacey feeling. Im a hypochondriac as well I think something new is slowly killing me every single day of my life. So you are not alone. Ive had everything you say happen to myself and what I beleive it be is a way of the body telling you something is wrong, if you feel that bad everyday its good to question how healthy you are diet wise. As a side not I discovered that I had abnormal thyroid  hormone and chronic fatigue (which is a big causer of mental fog and feeling overall retarded). And titinitus ringing in the ears and headaches. I quit drugs and began eating healty high carb vegan hoping it to help and the ringing and headaches dissapeared. Not saying you should do exactly what I do but just trying to help.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what you&amp;#39;re going through. Ived had extreme anxiety and panic disorder in the past, The headache thing could be coming from caffeine or simply the body reacting to constant amounts of stress. When there is a constant amount of stress the mind will disassociate DR/DP from what&amp;#39;s going on giving you that fog spacey feeling. Im a hypochondriac as well I think something new is slowly killing me every single day of my life. So you are not alone. Ive had everything you say happen to myself and what I beleive it be is a way of the body telling you something is wrong, if you feel that bad everyday its good to question how healthy you are diet wise. As a side not I discovered that I had abnormal thyroid  hormone and chronic fatigue (which is a big causer of mental fog and feeling overall retarded). And titinitus ringing in the ears and headaches. I quit drugs and began eating healty high carb vegan hoping it to help and the ringing and headaches dissapeared. Not saying you should do exactly what I do but just trying to help.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24tqxi", "score_hidden": false, "name": "t1_chavxy4", "created": 1399409113.0, "author_flair_text": null, "created_utc": 1399380313.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]