[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I dunno why I am posting here except for the fact I am extremely depressed. The depression eats me up inside and I can&amp;#39;t take it anymore.&lt;/p&gt;\n\n&lt;p&gt;I always felt like I never fit in anywhere and I have always been misunderstood. Like because of this I felt often distanced from society and people and have given the status of a loner. I feel there is something fucked up with me. Like I haven&amp;#39;t been in a relationship in years this bothers me that people seem to find something fucked up with me. The Loneliness kills me! And I often fantasize about not existing. Like I wish I never existed. I fantasize about not existing like a man jacking off to a big breasted woman. I feel it&amp;#39;d be great!&lt;/p&gt;\n\n&lt;p&gt;But anywho here is what is the point! Well I got outta college, graduated with a B.A. in History and Political Science, and had a nice 3.2 and a few Government jobs all lined up for me! I would be making about 40K+. Then the Recession hit, and those jobs were sacked. Now I have 28K in Loans, paying off it making next to nothing and still not happy. $10 Dollars an Hour Overnights talking to fuckwits over the phone and selling them software. How am I supposed to Settle down have a wife and kids and own a house with such shit wages, and less and less jobs? Thought about going to school for Master&amp;#39;s in something useful but what&amp;#39;s the point? Get more debt with not a guaranteed job. &lt;/p&gt;\n\n&lt;p&gt;Because I work third shift I rarely see friends and the loneliness kills me even more&lt;/p&gt;\n\n&lt;p&gt;I hate my job because there is no way I&amp;#39;ll be promoted because I am not a mindless drone whom blindly follows orders. I question things and I am a Freethinker seems like higher ups hate that! So guess I am stuck as a peon bottom feeder forever! Which means I can not get ahead in life!&lt;/p&gt;\n\n&lt;p&gt;Not worth it! I am always tired and cannot do what I am passionate about. I do Stand-up Comedy and usually perform (Being in Middle of Nowhere Sucks too from being in a bigger city moving no option because of lack of funds.), and I cannot perform because I am always tired, no time for writing nor performing. Haven&amp;#39;t performed in months nor written because of said frustration. I wanna save up $10,000 and be a road comic. Because on stage people listen to my ideas. And Feedback\ngenerally positive!&lt;/p&gt;\n\n&lt;p&gt;But here is the thing trying to Save up to 10K for my Road Comic Dream seems like mission impossible. I got slammed with two traffic tickets, ($200 a pop love it that police love to harass) and have to pay $500 in Student loans a month, thus my dream feels like it will never come into effect. &lt;/p&gt;\n\n&lt;p&gt;So basically I am in debt and have no way of pursing my dreams of having a family or my comedy dreams. I feel insignificant and I also feel like if I were gone I wouldn&amp;#39;t be missed. either. &lt;/p&gt;\n\n&lt;p&gt;I just don&amp;#39;t see a point in going on anymore! I am strongly thinking just offing myself just so I don&amp;#39;t have to deal with this shit anymore. Then there goes the loneliness etc. I am free from debt! Seems like a decent plan to me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I dunno why I am posting here except for the fact I am extremely depressed. The depression eats me up inside and I can't take it anymore.\n\n I always felt like I never fit in anywhere and I have always been misunderstood. Like because of this I felt often distanced from society and people and have given the status of a loner. I feel there is something fucked up with me. Like I haven't been in a relationship in years this bothers me that people seem to find something fucked up with me. The Loneliness kills me! And I often fantasize about not existing. Like I wish I never existed. I fantasize about not existing like a man jacking off to a big breasted woman. I feel it'd be great!\n\nBut anywho here is what is the point! Well I got outta college, graduated with a B.A. in History and Political Science, and had a nice 3.2 and a few Government jobs all lined up for me! I would be making about 40K+. Then the Recession hit, and those jobs were sacked. Now I have 28K in Loans, paying off it making next to nothing and still not happy. $10 Dollars an Hour Overnights talking to fuckwits over the phone and selling them software. How am I supposed to Settle down have a wife and kids and own a house with such shit wages, and less and less jobs? Thought about going to school for Master's in something useful but what's the point? Get more debt with not a guaranteed job. \n\nBecause I work third shift I rarely see friends and the loneliness kills me even more\n\nI hate my job because there is no way I'll be promoted because I am not a mindless drone whom blindly follows orders. I question things and I am a Freethinker seems like higher ups hate that! So guess I am stuck as a peon bottom feeder forever! Which means I can not get ahead in life!\n\nNot worth it! I am always tired and cannot do what I am passionate about. I do Stand-up Comedy and usually perform (Being in Middle of Nowhere Sucks too from being in a bigger city moving no option because of lack of funds.), and I cannot perform because I am always tired, no time for writing nor performing. Haven't performed in months nor written because of said frustration. I wanna save up $10,000 and be a road comic. Because on stage people listen to my ideas. And Feedback\ngenerally positive!\n\nBut here is the thing trying to Save up to 10K for my Road Comic Dream seems like mission impossible. I got slammed with two traffic tickets, ($200 a pop love it that police love to harass) and have to pay $500 in Student loans a month, thus my dream feels like it will never come into effect. \n\nSo basically I am in debt and have no way of pursing my dreams of having a family or my comedy dreams. I feel insignificant and I also feel like if I were gone I wouldn't be missed. either. \n\nI just don't see a point in going on anymore! I am strongly thinking just offing myself just so I don't have to deal with this shit anymore. Then there goes the loneliness etc. I am free from debt! Seems like a decent plan to me. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24wmvy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "zappyguy", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24wmvy/whats_the_point_frustrated_and_depressed/", "name": "t3_24wmvy", "created": 1399447059.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24wmvy/whats_the_point_frustrated_and_depressed/", "author_flair_text": null, "title": "What's the point? Frustrated and Depressed!", "created_utc": 1399418259.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chbi4o9", "gilded": 0, "author": "Zock123454321", "parent_id": "t3_24wmvy", "approved_by": null, "body": "Have you ever thought of trying to do some stuff and record it for youtube? I know it isn't the same but it could introduce people to you and maybe you could raise money to pursue your dream.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever thought of trying to do some stuff and record it for youtube? I know it isn&amp;#39;t the same but it could introduce people to you and maybe you could raise money to pursue your dream.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24wmvy", "score_hidden": false, "name": "t1_chbi4o9", "created": 1399458068.0, "author_flair_text": null, "created_utc": 1399429268.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]