[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Some background info. I have attempted (and clearly failed) suicide twice. The first two tries were just spur of the moment very little planning, this is different.  The last few months I have been thinking of how nice it would have been to not have failed. Or even how much better everything would be if I were no longer here. But the last few days it has been getting more real. Like full plans for how I would do it what I would tell everyone, how I would spend my last day and such. I really don&amp;#39;t think I would do anything drastic but these plans seem to make so much sense and give me a sort of relief. I know all the drawbacks to suicide but they seem less and less important. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Some background info. I have attempted (and clearly failed) suicide twice. The first two tries were just spur of the moment very little planning, this is different.  The last few months I have been thinking of how nice it would have been to not have failed. Or even how much better everything would be if I were no longer here. But the last few days it has been getting more real. Like full plans for how I would do it what I would tell everyone, how I would spend my last day and such. I really don't think I would do anything drastic but these plans seem to make so much sense and give me a sort of relief. I know all the drawbacks to suicide but they seem less and less important. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24d2sn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Lord_Abaddon", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24d2sn/when_does_si_become_something_that_i_should_try/", "name": "t3_24d2sn", "created": 1398890837.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24d2sn/when_does_si_become_something_that_i_should_try/", "author_flair_text": null, "title": "When does SI become something that I should try to get help for.", "created_utc": 1398862037.0, "ups": 1, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5x5ua", "gilded": 0, "author": "almondbutter1", "parent_id": "t3_24d2sn", "approved_by": null, "body": "1) If you don't want to be sent to the hospital, never use the P word (plan) with any mental health professional.  \n\n2) Sometimes it's nice just to enjoy the fantasy.  You may be serious about it and may not.  Either way, there's nothing wrong with that.  Whatever helps, in my opinion.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) If you don&amp;#39;t want to be sent to the hospital, never use the P word (plan) with any mental health professional.  &lt;/p&gt;\n\n&lt;p&gt;2) Sometimes it&amp;#39;s nice just to enjoy the fantasy.  You may be serious about it and may not.  Either way, there&amp;#39;s nothing wrong with that.  Whatever helps, in my opinion.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24d2sn", "score_hidden": false, "name": "t1_ch5x5ua", "created": 1398891714.0, "author_flair_text": null, "created_utc": 1398862914.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5xjy5", "gilded": 0, "author": "faramond", "parent_id": "t3_24d2sn", "approved_by": null, "body": "Everyone's opinion about this might vary, but I think that if your SI hinders you from fulfilling your duties at life (school, work, family, or whatever), and that *if you actually don't want to die but want to be normal*, then you should try to get help for it as soon as you're aware of the situation.  By the time you start acting on your SI, it's probably too late, and most probably, you really don't want to stay around anymore.\n\nHowever, getting help isn't the end all and be all of it.  Getting help is but the start of a long and often painful process of getting back to the normal world.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone&amp;#39;s opinion about this might vary, but I think that if your SI hinders you from fulfilling your duties at life (school, work, family, or whatever), and that &lt;em&gt;if you actually don&amp;#39;t want to die but want to be normal&lt;/em&gt;, then you should try to get help for it as soon as you&amp;#39;re aware of the situation.  By the time you start acting on your SI, it&amp;#39;s probably too late, and most probably, you really don&amp;#39;t want to stay around anymore.&lt;/p&gt;\n\n&lt;p&gt;However, getting help isn&amp;#39;t the end all and be all of it.  Getting help is but the start of a long and often painful process of getting back to the normal world.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24d2sn", "score_hidden": false, "name": "t1_ch5xjy5", "created": 1398892880.0, "author_flair_text": null, "created_utc": 1398864080.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]