[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll start by saying that I am bisexual, transgender, and an atheist that lives in the south. Soon, college is ending and I have three weeks with my parents to decide whether or not they want me in their lives anymore. If I fail their test, then they&amp;#39;re going to send me to live on my grandfather&amp;#39;s farm in Michigan. He knows everything about my &amp;quot;lifestyle&amp;quot; and I haven&amp;#39;t talked to him since he found out, but he&amp;#39;s very conservative Christian. I know that if I have to leave the city and live there, I&amp;#39;ll go crazy. I&amp;#39;ll have to live as a boy, and that will destroy me! I also have severe anxiety, psychosis, and OCD (diagnosed by a medical professional, not self-diagnosed). I have had problems with drugs before because it&amp;#39;s what I use to keep my psychosis at bay. When there&amp;#39;s no stimulation, like on a farm in Michigan, I know I&amp;#39;ll go back to them. He also has a lot of guns. I&amp;#39;ve been fantasizing about them... a lot... what if I&amp;#39;m too tempted? what if I just decide to blow my head off than live in a mix of external persecution and internal madness? I&amp;#39;m scared. I want to live, but at the same time, I just want to end it. I&amp;#39;m a mess and I just need someone to talk to that isn&amp;#39;t a part of my life in any way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll start by saying that I am bisexual, transgender, and an atheist that lives in the south. Soon, college is ending and I have three weeks with my parents to decide whether or not they want me in their lives anymore. If I fail their test, then they're going to send me to live on my grandfather's farm in Michigan. He knows everything about my \"lifestyle\" and I haven't talked to him since he found out, but he's very conservative Christian. I know that if I have to leave the city and live there, I'll go crazy. I'll have to live as a boy, and that will destroy me! I also have severe anxiety, psychosis, and OCD (diagnosed by a medical professional, not self-diagnosed). I have had problems with drugs before because it's what I use to keep my psychosis at bay. When there's no stimulation, like on a farm in Michigan, I know I'll go back to them. He also has a lot of guns. I've been fantasizing about them... a lot... what if I'm too tempted? what if I just decide to blow my head off than live in a mix of external persecution and internal madness? I'm scared. I want to live, but at the same time, I just want to end it. I'm a mess and I just need someone to talk to that isn't a part of my life in any way.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24inxh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "EEBrony", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399005603.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24inxh/when_their_smooth_barrels_are_within_reach_what/", "name": "t3_24inxh", "created": 1399033905.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24inxh/when_their_smooth_barrels_are_within_reach_what/", "author_flair_text": null, "title": "When their smooth barrels are within reach, what will happen?", "created_utc": 1399005105.0, "ups": 2, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7istq", "gilded": 0, "author": "emiririn", "parent_id": "t3_24inxh", "approved_by": null, "body": "Fellow trans person here, please talk to me, I know what it feels like to be rejected by people, it hurts, and I'm so sorry it's your family.\n\nAre you absolutely positive your grandfather would be unsupportive? How old are you if I may ask? Have you transitioned? You can PM me if that is any better.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fellow trans person here, please talk to me, I know what it feels like to be rejected by people, it hurts, and I&amp;#39;m so sorry it&amp;#39;s your family.&lt;/p&gt;\n\n&lt;p&gt;Are you absolutely positive your grandfather would be unsupportive? How old are you if I may ask? Have you transitioned? You can PM me if that is any better.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24inxh", "score_hidden": false, "name": "t1_ch7istq", "created": 1399036039.0, "author_flair_text": null, "created_utc": 1399007239.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch7ouzz", "gilded": 0, "author": "Genericwizardguy", "parent_id": "t3_24inxh", "approved_by": null, "body": "Seek out a help group, they can connect you with not only people who can shelter you if you need to be away from your family, but also trans people to talk to. PM me anytime for help, I'll reply as soon as I can.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seek out a help group, they can connect you with not only people who can shelter you if you need to be away from your family, but also trans people to talk to. PM me anytime for help, I&amp;#39;ll reply as soon as I can.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24inxh", "score_hidden": false, "name": "t1_ch7ouzz", "created": 1399065097.0, "author_flair_text": null, "created_utc": 1399036297.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]