[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see all these people around who have no reason to blame themselves. Who have a chance to have a good life. But are depressed for things they cannot control. Who deserve happiness.&lt;/p&gt;\n\n&lt;p&gt;Then you have me. Who has done something terrible to someone they loved years ago. Who deserves to die for what they did. But has the gall to continue living day to day. At least till it all blows up in his face, to which it will all be ended. I wish i could undo what I did. But I can&amp;#39;t, never will. And will die because of it.&lt;/p&gt;\n\n&lt;p&gt;To those of you who are sad because life is not going your way. Remember. At least you don&amp;#39;t deserve to die. It&amp;#39;s a pretty bad feeling but I can&amp;#39;t say I don&amp;#39;t deserve it. &lt;/p&gt;\n\n&lt;p&gt;If only I were not such a stupid 15 year old. If only I didn&amp;#39;t make a desicion that would forever scar me. And possibly the other person. This rushes through my head every day. If only i could go back in time and stop it from happening. If only I didn&amp;#39;t deserve to kill myself. I could have had a good life. Even with ADHD. But I did it. And it cannot be undone. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t imagine anyone would care about a person like me posting here. But some twisted part of me feels relief talking about it. I&amp;#39;m in a world that rightly hates me. At least if I&amp;#39;m hated here I will be anonymous. &lt;/p&gt;\n\n&lt;p&gt;To anyone else struggling with thoughts of suicide, hang on. And always remember. At least you are not a monster. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I see all these people around who have no reason to blame themselves. Who have a chance to have a good life. But are depressed for things they cannot control. Who deserve happiness.\n\nThen you have me. Who has done something terrible to someone they loved years ago. Who deserves to die for what they did. But has the gall to continue living day to day. At least till it all blows up in his face, to which it will all be ended. I wish i could undo what I did. But I can't, never will. And will die because of it.\n\nTo those of you who are sad because life is not going your way. Remember. At least you don't deserve to die. It's a pretty bad feeling but I can't say I don't deserve it. \n\nIf only I were not such a stupid 15 year old. If only I didn't make a desicion that would forever scar me. And possibly the other person. This rushes through my head every day. If only i could go back in time and stop it from happening. If only I didn't deserve to kill myself. I could have had a good life. Even with ADHD. But I did it. And it cannot be undone. \n\nI can't imagine anyone would care about a person like me posting here. But some twisted part of me feels relief talking about it. I'm in a world that rightly hates me. At least if I'm hated here I will be anonymous. \n\nTo anyone else struggling with thoughts of suicide, hang on. And always remember. At least you are not a monster. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24n0us", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "WhoisButaMonster", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24n0us/when_you_deserve_to_die/", "name": "t3_24n0us", "created": 1399172726.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24n0us/when_you_deserve_to_die/", "author_flair_text": null, "title": "When you deserve to die", "created_utc": 1399143926.0, "ups": 4, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8q1uo", "gilded": 0, "author": "circinia", "parent_id": "t3_24n0us", "approved_by": null, "body": "&gt; Then you have me. Who has done something terrible to someone they loved years ago. Who deserves to die for what they did. But has the gall to continue living day to day. \n\nI don't believe anyone deserves to die, no matter what you've done in life. *All* of us make mistakes, some of them major, some of them minor, and this is especially true when we're young--and we all need some way of redeeming ourselves for our mistakes and living better in the future. \n\nI found [this article](http://www.cuppacocoa.com/a-better-way-to-say-sorry/) helpful for not only thinking about how to apologize to others, but how to find forgiveness for mistakes. The author outlines four steps:\n\n* I’m sorry for…\n* This is wrong because…\n* In the future, I will…\n* Will you forgive me?\n\nThis applies as much, I think, to major wrongs as minor peccadilloes; even though it's not always possible or appropriate to apologize directly, reflecting on these aspects is as much as we *can* do.\n\nYou know what you did wrong, and how it hurt the person you loved; so that's two steps taken care of. In the ten years since you were fifteen, you've never repeated what you did; all that's left to do now is to continue to live the best you can, take any opportunities available to you to make further amends if appropriate, accept any consequences of your actions, and to try your best to be gentle with and forgive yourself.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Then you have me. Who has done something terrible to someone they loved years ago. Who deserves to die for what they did. But has the gall to continue living day to day. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t believe anyone deserves to die, no matter what you&amp;#39;ve done in life. &lt;em&gt;All&lt;/em&gt; of us make mistakes, some of them major, some of them minor, and this is especially true when we&amp;#39;re young--and we all need some way of redeeming ourselves for our mistakes and living better in the future. &lt;/p&gt;\n\n&lt;p&gt;I found &lt;a href=\"http://www.cuppacocoa.com/a-better-way-to-say-sorry/\"&gt;this article&lt;/a&gt; helpful for not only thinking about how to apologize to others, but how to find forgiveness for mistakes. The author outlines four steps:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I’m sorry for…&lt;/li&gt;\n&lt;li&gt;This is wrong because…&lt;/li&gt;\n&lt;li&gt;In the future, I will…&lt;/li&gt;\n&lt;li&gt;Will you forgive me?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This applies as much, I think, to major wrongs as minor peccadilloes; even though it&amp;#39;s not always possible or appropriate to apologize directly, reflecting on these aspects is as much as we &lt;em&gt;can&lt;/em&gt; do.&lt;/p&gt;\n\n&lt;p&gt;You know what you did wrong, and how it hurt the person you loved; so that&amp;#39;s two steps taken care of. In the ten years since you were fifteen, you&amp;#39;ve never repeated what you did; all that&amp;#39;s left to do now is to continue to live the best you can, take any opportunities available to you to make further amends if appropriate, accept any consequences of your actions, and to try your best to be gentle with and forgive yourself.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24n0us", "score_hidden": false, "name": "t1_ch8q1uo", "created": 1399175454.0, "author_flair_text": null, "created_utc": 1399146654.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8w21l", "gilded": 0, "author": "DryPunt", "parent_id": "t3_24n0us", "approved_by": null, "body": "It's hard to comment on this particular issue when you have not shred light on the incidents occurred. You were just that, a stupid 15 year old. You are not the person you once were. If you utterly regret what you did, then you have the empathy needed to commit to a good life. You would only need to worry if you possess no regret or emotional anguish for the events occurring in the past. Destruction is not evil, only intent. Killing yourself would not undo the actions committed by your former self. It would be a lot better if you discussed what happened, however. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to comment on this particular issue when you have not shred light on the incidents occurred. You were just that, a stupid 15 year old. You are not the person you once were. If you utterly regret what you did, then you have the empathy needed to commit to a good life. You would only need to worry if you possess no regret or emotional anguish for the events occurring in the past. Destruction is not evil, only intent. Killing yourself would not undo the actions committed by your former self. It would be a lot better if you discussed what happened, however. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24n0us", "score_hidden": false, "name": "t1_ch8w21l", "created": 1399191823.0, "author_flair_text": null, "created_utc": 1399163023.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch9260a", "gilded": 0, "author": "SWstuff", "parent_id": "t3_24n0us", "approved_by": null, "body": "I am a monster, too. I'm always reluctant to post here because nobody on this subreddit seems to deserve the fate that I do. I tried to go through with it recently, and the person that could not bring themself to be associated with me, after learning what I had done, is the one who stopped me and called the cops. It makes no sense...", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a monster, too. I&amp;#39;m always reluctant to post here because nobody on this subreddit seems to deserve the fate that I do. I tried to go through with it recently, and the person that could not bring themself to be associated with me, after learning what I had done, is the one who stopped me and called the cops. It makes no sense...&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24n0us", "score_hidden": false, "name": "t1_ch9260a", "created": 1399209498.0, "author_flair_text": null, "created_utc": 1399180698.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]