[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im not suicidal but my gf tells me am. Any mistake i make and it fuck me up bad. Everyday i tell people im not smart im dumb but they still hold me to a higher standard i can never reach. Im in luve but i feel im her poison. I cant even support myself finacially. I already burn all my bridges with my family and my best friend wont talk to me right now no matter how many times ive called it rings once and to voicemail. \nAll ive know is whats in the dark and depression im not taking pills again fuck that i hate pills as it is. But why is it bad to want to leave?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Im not suicidal but my gf tells me am. Any mistake i make and it fuck me up bad. Everyday i tell people im not smart im dumb but they still hold me to a higher standard i can never reach. Im in luve but i feel im her poison. I cant even support myself finacially. I already burn all my bridges with my family and my best friend wont talk to me right now no matter how many times ive called it rings once and to voicemail. \nAll ive know is whats in the dark and depression im not taking pills again fuck that i hate pills as it is. But why is it bad to want to leave?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24krwo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "wolf15t", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24krwo/why_cant_i/", "name": "t3_24krwo", "created": 1399096631.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24krwo/why_cant_i/", "author_flair_text": null, "title": "Why cant i?", "created_utc": 1399067831.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8502b", "gilded": 0, "author": "[deleted]", "parent_id": "t3_24krwo", "approved_by": null, "body": "It's not bad to want to leave, but you don't want to die, you really just want to stop hurting and feeling sad. Pills don't work for everyone. I personally don't blame you for not wanting to go back on them. \n\nThe people around you hold you to a standard they know you are capable of. Sometimes they know it better than ourselves. When we feel so down, even thinking a positive thought about ourselves can make us feel silly. \n\nFirstly, forget about your friend for now. It is causing you more stress and they may just need time. Try and distract yourself from it. Read, watch something, go for a walk or just browse reddit for a little while :).  The same principle applies to your family. Families can be hotbeds for drama. These things happen and time can fix it. \n\nIt will help you if you stop saying bad things about yourself. Even if you think them, saying them out loud validates them. Do not let these thoughts win. Sit yourself down when you're feeling calm and write the nice things about yourself. It can be hard to do, but even just thinking about a time you did something nice or good, or that you were proud off can get the ball rolling. Keep this list somewhere safe where you can refer back to it. Your girlfriend will really be able to help you with this, I am sure!\n\nAnother thing I personally like to do is write down what is worrying or upsetting me. For instance, you may write that you are worried you'll not speak to your best friend or family again, that you hate yourself for being stupid etc. Write this down, and rip it up, burn it, scrunch it into a ball and kick it about, whatever you feel best. This will relieve some tension, and its nice to think that now those thoughts are gone for now.\n\nWith the financial burden, its a problem many are facing today. Just because you can't afford yourself now doesn't mean it'll always be like this. Circumstances change, and the only way you'll have a chance is if you give yourself it. Do not give up on yourself :)\n\n", "edited": false, "author_flair_css_class": null, "downs": 5, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not bad to want to leave, but you don&amp;#39;t want to die, you really just want to stop hurting and feeling sad. Pills don&amp;#39;t work for everyone. I personally don&amp;#39;t blame you for not wanting to go back on them. &lt;/p&gt;\n\n&lt;p&gt;The people around you hold you to a standard they know you are capable of. Sometimes they know it better than ourselves. When we feel so down, even thinking a positive thought about ourselves can make us feel silly. &lt;/p&gt;\n\n&lt;p&gt;Firstly, forget about your friend for now. It is causing you more stress and they may just need time. Try and distract yourself from it. Read, watch something, go for a walk or just browse reddit for a little while :).  The same principle applies to your family. Families can be hotbeds for drama. These things happen and time can fix it. &lt;/p&gt;\n\n&lt;p&gt;It will help you if you stop saying bad things about yourself. Even if you think them, saying them out loud validates them. Do not let these thoughts win. Sit yourself down when you&amp;#39;re feeling calm and write the nice things about yourself. It can be hard to do, but even just thinking about a time you did something nice or good, or that you were proud off can get the ball rolling. Keep this list somewhere safe where you can refer back to it. Your girlfriend will really be able to help you with this, I am sure!&lt;/p&gt;\n\n&lt;p&gt;Another thing I personally like to do is write down what is worrying or upsetting me. For instance, you may write that you are worried you&amp;#39;ll not speak to your best friend or family again, that you hate yourself for being stupid etc. Write this down, and rip it up, burn it, scrunch it into a ball and kick it about, whatever you feel best. This will relieve some tension, and its nice to think that now those thoughts are gone for now.&lt;/p&gt;\n\n&lt;p&gt;With the financial burden, its a problem many are facing today. Just because you can&amp;#39;t afford yourself now doesn&amp;#39;t mean it&amp;#39;ll always be like this. Circumstances change, and the only way you&amp;#39;ll have a chance is if you give yourself it. Do not give up on yourself :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24krwo", "score_hidden": false, "name": "t1_ch8502b", "created": 1399102006.0, "author_flair_text": null, "created_utc": 1399073206.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}]