[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t leave my house. I don&amp;#39;t talk to anyone. I don&amp;#39;t have any friends. I am an introvert, so I don&amp;#39;t even want to make friends. I am paranoid. I have severe anxiety. I hate people. Just people in general disgust me. I have nothing left to contribute to this world, and I don&amp;#39;t want to stay, so why should I? To spare my family a few days of grieving? I would rather put my family through a few days of pain than spend the rest of my days being miserable, alone, slowly losing my mind in a dark room. I would much rather just end it. I don&amp;#39;t want to make decisions anymore. I don&amp;#39;t want to feel anything anymore. I don&amp;#39;t want to have to make an effort to do anything anymore. All I do is sit in my room, passing the time by smoking myself stupid or playing video games until I&amp;#39;m too tired to stay awake. No I am not a child, no I do not live with my parents. I live in a small apartment, and I don&amp;#39;t even communicate with my family that much, so I doubt they would find my body for over a week. The only time I leave is to go to my shitty job, or to go to get things from the store. My life has become the same fucking routine over and over again. I feel like I am living the movie Groundhog Day. I&amp;#39;ve tried making friends, all they do is agitate me until I get so angry that I just snap. I can&amp;#39;t do this anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't leave my house. I don't talk to anyone. I don't have any friends. I am an introvert, so I don't even want to make friends. I am paranoid. I have severe anxiety. I hate people. Just people in general disgust me. I have nothing left to contribute to this world, and I don't want to stay, so why should I? To spare my family a few days of grieving? I would rather put my family through a few days of pain than spend the rest of my days being miserable, alone, slowly losing my mind in a dark room. I would much rather just end it. I don't want to make decisions anymore. I don't want to feel anything anymore. I don't want to have to make an effort to do anything anymore. All I do is sit in my room, passing the time by smoking myself stupid or playing video games until I'm too tired to stay awake. No I am not a child, no I do not live with my parents. I live in a small apartment, and I don't even communicate with my family that much, so I doubt they would find my body for over a week. The only time I leave is to go to my shitty job, or to go to get things from the store. My life has become the same fucking routine over and over again. I feel like I am living the movie Groundhog Day. I've tried making friends, all they do is agitate me until I get so angry that I just snap. I can't do this anymore.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24t83w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Away_i_throw_", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24t83w/why_shouldnt_i_kill_myself/", "name": "t3_24t83w", "created": 1399355898.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24t83w/why_shouldnt_i_kill_myself/", "author_flair_text": null, "title": "Why shouldn't I kill myself?", "created_utc": 1399327098.0, "ups": 4, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chai9pk", "gilded": 0, "author": "Kusherz", "parent_id": "t3_24t83w", "approved_by": null, "body": "See your doctor about your anxiety, try getting some xanax perfect for any situation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See your doctor about your anxiety, try getting some xanax perfect for any situation.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24t83w", "score_hidden": false, "name": "t1_chai9pk", "created": 1399362626.0, "author_flair_text": null, "created_utc": 1399333826.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]