[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why can&amp;#39;t I end my life without being harassed about it? I&amp;#39;d love nothing more than to be able to go to sleep forever, but people say that life is precious or &amp;quot;it will get better&amp;quot; or whatever. I can&amp;#39;t think of a single thing that would make me happy. There&amp;#39;s nothing for me to look forward to. Why should I endure a life of depression just to make ends meet? Life is supposed to be fun or fulfilling or something, but all I see in my future is misery. The only thing that makes me truly happy is the thought of the end of my life. Laying in my bed, knowing that everything will end in a few minutes...that would be absolute bliss.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Why can't I end my life without being harassed about it? I'd love nothing more than to be able to go to sleep forever, but people say that life is precious or \"it will get better\" or whatever. I can't think of a single thing that would make me happy. There's nothing for me to look forward to. Why should I endure a life of depression just to make ends meet? Life is supposed to be fun or fulfilling or something, but all I see in my future is misery. The only thing that makes me truly happy is the thought of the end of my life. Laying in my bed, knowing that everything will end in a few minutes...that would be absolute bliss.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "240pio", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "throwaway3243t", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/240pio/why_is_life_so_valued/", "name": "t3_240pio", "created": 1398530066.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/240pio/why_is_life_so_valued/", "author_flair_text": null, "title": "Why is life so valued?", "created_utc": 1398501266.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch2gidv", "gilded": 0, "author": "lyndred", "parent_id": "t3_240pio", "approved_by": null, "body": "I felt the same way for a long time, a few years, to the point where I almost got hit by a truck one night and didn't even care. And things aren't wonderful now but sometimes now I'm happy, or can laugh, and those are the times I live for because I think if things got a little better, maybe they can get a little better than that in the future. I'm not trying to spout the \"it gets better\" line, I think if you find one thing that gives you hope, it at least raises the possibility that there will be more after that. So I hope you can hold on until you find that thing.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I felt the same way for a long time, a few years, to the point where I almost got hit by a truck one night and didn&amp;#39;t even care. And things aren&amp;#39;t wonderful now but sometimes now I&amp;#39;m happy, or can laugh, and those are the times I live for because I think if things got a little better, maybe they can get a little better than that in the future. I&amp;#39;m not trying to spout the &amp;quot;it gets better&amp;quot; line, I think if you find one thing that gives you hope, it at least raises the possibility that there will be more after that. So I hope you can hold on until you find that thing.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_240pio", "score_hidden": false, "name": "t1_ch2gidv", "created": 1398530926.0, "author_flair_text": null, "created_utc": 1398502126.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]