[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know where else to go for answers. All I&amp;#39;ve wanted in life is to find my soulmate, I know it sounds cheesy, and women don&amp;#39;t need a man... etc, etc, etc. But for whatever reason this is so important to me. I keep getting in relationships, and the person seems crazy about me, until 2 months in and they disappear. I try so hard to be perfect, I&amp;#39;ve heard I&amp;#39;m attractive, I try so hard to be the cool girl and witty; but for whatever reason people just think I&amp;#39;m worthless. I have a big heart, and I try so hard everyday to spread love and to be kind because I believe this is what truly matters in life; but why to do people keep treating my like I&amp;#39;m trash? I want to believe I&amp;#39;m important to someone, but everyone just ditches me. I&amp;#39;m in so much pain. I don&amp;#39;t want to wake up tomorrow. I feel like this is all a sign I should just give up. I want to end it all but I don&amp;#39;t want it to hurt. I don&amp;#39;t have access to a gun. I&amp;#39;m thinking about taking pills but several people on here have done the same and lived through it. Just wish there was an easy way out. A way to disappear. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know where else to go for answers. All I've wanted in life is to find my soulmate, I know it sounds cheesy, and women don't need a man... etc, etc, etc. But for whatever reason this is so important to me. I keep getting in relationships, and the person seems crazy about me, until 2 months in and they disappear. I try so hard to be perfect, I've heard I'm attractive, I try so hard to be the cool girl and witty; but for whatever reason people just think I'm worthless. I have a big heart, and I try so hard everyday to spread love and to be kind because I believe this is what truly matters in life; but why to do people keep treating my like I'm trash? I want to believe I'm important to someone, but everyone just ditches me. I'm in so much pain. I don't want to wake up tomorrow. I feel like this is all a sign I should just give up. I want to end it all but I don't want it to hurt. I don't have access to a gun. I'm thinking about taking pills but several people on here have done the same and lived through it. Just wish there was an easy way out. A way to disappear. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "244tqs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "red_coats_are_coming", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/244tqs/why_doesnt_anyone_care_about_me/", "name": "t3_244tqs", "created": 1398662935.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/244tqs/why_doesnt_anyone_care_about_me/", "author_flair_text": null, "title": "Why doesn't anyone care about me?", "created_utc": 1398634135.0, "ups": 6, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3lp5d", "gilded": 0, "author": "firstlastname", "parent_id": "t3_244tqs", "approved_by": null, "body": "Try meeting people outside of your friend group, or in a different scenario than you would usually meet someone in", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try meeting people outside of your friend group, or in a different scenario than you would usually meet someone in&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3lp5d", "created": 1398638763.0, "author_flair_text": null, "created_utc": 1398635163.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch40i3r", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch3tehp", "approved_by": null, "body": "You are welcome. Good luck for your search! :D", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are welcome. Good luck for your search! :D&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch40i3r", "created": 1398681375.0, "author_flair_text": null, "created_utc": 1398677775.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3tehp", "gilded": 0, "author": "red_coats_are_coming", "parent_id": "t1_ch3mdlc", "approved_by": null, "body": "Thank you for that reminder :) I guess I just look at other people and they make it seem so easy. Like they just ran into the perfect person on the street, and that person fell head over heels in love with them and it was great. When I look at myself it just makes me feel like there must be something wrong with me, that everyone else can be loved except for me. You're right, maybe I'm just frustrated that things aren't as easy as I hoped. \n\nI want to ask people why they leave, but so often, as it happened today, they just shut me out completely. I guess that's why I'm so upset, and I have a hard time trusting people. Things seemed great, our relationship was really developing and out of nowhere he just ignored all my texts/calls and won't even respond. I understand things don't always work out, but when people just cut me out completely it makes me feel like I must be some kind of freak. Thank you so much responding. I just feel like people I meet in the real world only care when it's convenient for them. It's nice to know that there are people in the world who will take time out of their day to help a stranger. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for that reminder :) I guess I just look at other people and they make it seem so easy. Like they just ran into the perfect person on the street, and that person fell head over heels in love with them and it was great. When I look at myself it just makes me feel like there must be something wrong with me, that everyone else can be loved except for me. You&amp;#39;re right, maybe I&amp;#39;m just frustrated that things aren&amp;#39;t as easy as I hoped. &lt;/p&gt;\n\n&lt;p&gt;I want to ask people why they leave, but so often, as it happened today, they just shut me out completely. I guess that&amp;#39;s why I&amp;#39;m so upset, and I have a hard time trusting people. Things seemed great, our relationship was really developing and out of nowhere he just ignored all my texts/calls and won&amp;#39;t even respond. I understand things don&amp;#39;t always work out, but when people just cut me out completely it makes me feel like I must be some kind of freak. Thank you so much responding. I just feel like people I meet in the real world only care when it&amp;#39;s convenient for them. It&amp;#39;s nice to know that there are people in the world who will take time out of their day to help a stranger. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3tehp", "created": 1398681574.0, "author_flair_text": null, "created_utc": 1398652774.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3mdlc", "gilded": 0, "author": "Nemesis1992", "parent_id": "t3_244tqs", "approved_by": null, "body": "Ehi Red_coats,\nnice to meet you.\n\nFirst of all, do not give up on your search. \nIf you think it is easy to find a good husband, you have been mislead. \nI assure you, it is an arduos task.\n\nYou said people have been leaving after two months. Have you tried asking them what made them leave?\n\nIf I were you, I wouldn't see the fact that they leave you as a bad thing. What I mean to say, is that it is through countless tries, that we as individuals grow, and start to understand what we wish to find, what we like and what we don't like. So take all these as little steps to be ready for when you'll actually find the good person that is going to love you and have the family you dream of.\n\n\n\n\n\n\n", "edited": 1398638678.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ehi Red_coats,\nnice to meet you.&lt;/p&gt;\n\n&lt;p&gt;First of all, do not give up on your search. \nIf you think it is easy to find a good husband, you have been mislead. \nI assure you, it is an arduos task.&lt;/p&gt;\n\n&lt;p&gt;You said people have been leaving after two months. Have you tried asking them what made them leave?&lt;/p&gt;\n\n&lt;p&gt;If I were you, I wouldn&amp;#39;t see the fact that they leave you as a bad thing. What I mean to say, is that it is through countless tries, that we as individuals grow, and start to understand what we wish to find, what we like and what we don&amp;#39;t like. So take all these as little steps to be ready for when you&amp;#39;ll actually find the good person that is going to love you and have the family you dream of.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3mdlc", "created": 1398665459.0, "author_flair_text": null, "created_utc": 1398636659.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3pc1p", "gilded": 0, "author": "BN91", "parent_id": "t3_244tqs", "approved_by": null, "body": "your problem is a common one. it sounds like you just haven't found the write person. another thing i noticed is when you said you try so hard to be perfect. just be yourself. could be some guys feel like they dont measure up if your coming off as so perfect. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;your problem is a common one. it sounds like you just haven&amp;#39;t found the write person. another thing i noticed is when you said you try so hard to be perfect. just be yourself. could be some guys feel like they dont measure up if your coming off as so perfect. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3pc1p", "created": 1398647159.0, "author_flair_text": null, "created_utc": 1398643559.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3yq5u", "gilded": 0, "author": "ignorethename", "parent_id": "t3_244tqs", "approved_by": null, "body": "You seem to be clingy or over dependent. Thats a big no no in any partner, because no one has the energy to take care of anyone dependent. \n\nLearn to be self dependent and then look for a relationship. \n\n\nWhat else?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem to be clingy or over dependent. Thats a big no no in any partner, because no one has the energy to take care of anyone dependent. &lt;/p&gt;\n\n&lt;p&gt;Learn to be self dependent and then look for a relationship. &lt;/p&gt;\n\n&lt;p&gt;What else?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3yq5u", "created": 1398696457.0, "author_flair_text": null, "created_utc": 1398667657.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3mpjb", "gilded": 0, "author": "lvl12", "parent_id": "t1_ch3lqgk", "approved_by": null, "body": "You're welcome! Like I said,  I'm super bored today so I like having someone to chat with while I do laundry and watch documentaries. Also I'm 24.\n\n  You really should try to focus on yourself, and not in order to be better wife material or even friend material. Don't be whatever you think other people want you to be. If you solidify your own foundations it will have a side effect of making yourself more attractive to the kind of mature men who would suit you better than the ones you're accepting now. Currently you're what's known to womanizers  as fish in a barrel, you're eager to please and love attention so much that you probably overlook red flags in the hopes that you'll finally find your happiness in someone else. One of the best lessons I've ever learned is that you can't base your happiness on any relationship, it's an excellent compliment to happiness but it cannot be the sole source. Obviously I'm making quite a few assumptions and if I'm way off the mark let me know. I see a lot of potential for you to find exactly what you want in life but you just need to work on yourself a bit first. Easier said than done I know though, I've been struggling in my own ways for years.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re welcome! Like I said,  I&amp;#39;m super bored today so I like having someone to chat with while I do laundry and watch documentaries. Also I&amp;#39;m 24.&lt;/p&gt;\n\n&lt;p&gt;You really should try to focus on yourself, and not in order to be better wife material or even friend material. Don&amp;#39;t be whatever you think other people want you to be. If you solidify your own foundations it will have a side effect of making yourself more attractive to the kind of mature men who would suit you better than the ones you&amp;#39;re accepting now. Currently you&amp;#39;re what&amp;#39;s known to womanizers  as fish in a barrel, you&amp;#39;re eager to please and love attention so much that you probably overlook red flags in the hopes that you&amp;#39;ll finally find your happiness in someone else. One of the best lessons I&amp;#39;ve ever learned is that you can&amp;#39;t base your happiness on any relationship, it&amp;#39;s an excellent compliment to happiness but it cannot be the sole source. Obviously I&amp;#39;m making quite a few assumptions and if I&amp;#39;m way off the mark let me know. I see a lot of potential for you to find exactly what you want in life but you just need to work on yourself a bit first. Easier said than done I know though, I&amp;#39;ve been struggling in my own ways for years.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3mpjb", "created": 1398641012.0, "author_flair_text": null, "created_utc": 1398637412.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3lqgk", "gilded": 0, "author": "red_coats_are_coming", "parent_id": "t1_ch3ld8n", "approved_by": null, "body": "Thank you for your response. I'm 25. I'm sure I do care too much about what others think about me, but I just see everyone around me in loving relationships. They have S.O's and friends who care about them. They're happy, and I know I can make other people happy. I love to cook, to entertain, I love to listen to other people. I just feel like for whatever reason people look at me as a second option. I'm good when there's nothing else better, but easy to throw away. I just want to find people I click with. I just wish I could find someone to connect with in real life. I don't necessarily want to kill myself but the pain of being lonely is too much to bear. I try to be healthy, but lately I can't help but drink all the time, I smoke cigarettes, eat, whatever I can to do to numb the pain but it's just not helping anymore. Thank for listening to me. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your response. I&amp;#39;m 25. I&amp;#39;m sure I do care too much about what others think about me, but I just see everyone around me in loving relationships. They have S.O&amp;#39;s and friends who care about them. They&amp;#39;re happy, and I know I can make other people happy. I love to cook, to entertain, I love to listen to other people. I just feel like for whatever reason people look at me as a second option. I&amp;#39;m good when there&amp;#39;s nothing else better, but easy to throw away. I just want to find people I click with. I just wish I could find someone to connect with in real life. I don&amp;#39;t necessarily want to kill myself but the pain of being lonely is too much to bear. I try to be healthy, but lately I can&amp;#39;t help but drink all the time, I smoke cigarettes, eat, whatever I can to do to numb the pain but it&amp;#39;s just not helping anymore. Thank for listening to me. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3lqgk", "created": 1398664039.0, "author_flair_text": null, "created_utc": 1398635239.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3ld8n", "gilded": 0, "author": "lvl12", "parent_id": "t3_244tqs", "approved_by": null, "body": "How old are you? Just curious. I'm sure you're a way better person than you give yourself credit for. If you have one problem I'd say it's that you place too much importance on what other people think of you. People can sense when you're trying too hard and it can make them feel uncomfortable. I'd like to know more about your situation and chat, and I have nothing going on today.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How old are you? Just curious. I&amp;#39;m sure you&amp;#39;re a way better person than you give yourself credit for. If you have one problem I&amp;#39;d say it&amp;#39;s that you place too much importance on what other people think of you. People can sense when you&amp;#39;re trying too hard and it can make them feel uncomfortable. I&amp;#39;d like to know more about your situation and chat, and I have nothing going on today.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3ld8n", "created": 1398663235.0, "author_flair_text": null, "created_utc": 1398634435.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch3t8hm", "gilded": 0, "author": "red_coats_are_coming", "parent_id": "t1_ch3ltt4", "approved_by": null, "body": "I like that quote, it made me laugh. Thank you so much for your response. I just needed to know that there are people in the world who care about others, thanks :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like that quote, it made me laugh. Thank you so much for your response. I just needed to know that there are people in the world who care about others, thanks :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3t8hm", "created": 1398681201.0, "author_flair_text": null, "created_utc": 1398652401.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3ltt4", "gilded": 0, "author": "cheese725", "parent_id": "t3_244tqs", "approved_by": null, "body": "You don't need a soulmate to tell you that you're important. You are. Also, there is a quote from someone, \" Before you diagnose yourself with depression, make sure you aren't surrounded by assholes.\" It's amazingly true. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need a soulmate to tell you that you&amp;#39;re important. You are. Also, there is a quote from someone, &amp;quot; Before you diagnose yourself with depression, make sure you aren&amp;#39;t surrounded by assholes.&amp;quot; It&amp;#39;s amazingly true. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_244tqs", "score_hidden": false, "name": "t1_ch3ltt4", "created": 1398664244.0, "author_flair_text": null, "created_utc": 1398635444.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]