[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The education system is completely fucked. I&amp;#39;m not learning WHY things work, or when to apply what I have learned, I&amp;#39;m only learning to memorize things. Then I&amp;#39;ll move on to post-highschool education so I can pay tens of thousands of dollars to learn information that I could learn for free. Because the government. If I ever manage to get a job in our ever-shrinking job market, I will only be doing that job to live longer. I&amp;#39;M DOING A JOB SO I CAN SUSTAIN MYSELF TO DO THAT JOB LONGER. It&amp;#39;s just a huge fucking waste of time and I don&amp;#39;t see the point in going on. Nobody will remember me, and everything I do will be a waste of time eventually. &lt;/p&gt;\n\n&lt;p&gt;Fuck it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The education system is completely fucked. I'm not learning WHY things work, or when to apply what I have learned, I'm only learning to memorize things. Then I'll move on to post-highschool education so I can pay tens of thousands of dollars to learn information that I could learn for free. Because the government. If I ever manage to get a job in our ever-shrinking job market, I will only be doing that job to live longer. I'M DOING A JOB SO I CAN SUSTAIN MYSELF TO DO THAT JOB LONGER. It's just a huge fucking waste of time and I don't see the point in going on. Nobody will remember me, and everything I do will be a waste of time eventually. \n\nFuck it.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24c3j0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tw0123", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24c3j0/why_bother/", "name": "t3_24c3j0", "created": 1398854488.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24c3j0/why_bother/", "author_flair_text": null, "title": "Why bother?", "created_utc": 1398825688.0, "ups": 3, "num_comments": 5, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5ndsb", "gilded": 0, "author": "sunflower0123", "parent_id": "t3_24c3j0", "approved_by": null, "body": "I'm sorry you despise the education system. It's definitely imperfect. But I do hope you feel better. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you despise the education system. It&amp;#39;s definitely imperfect. But I do hope you feel better. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c3j0", "score_hidden": false, "name": "t1_ch5ndsb", "created": 1398829751.0, "author_flair_text": null, "created_utc": 1398826151.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5nkyf", "gilded": 0, "author": "XxFluffyToastxX", "parent_id": "t3_24c3j0", "approved_by": null, "body": "The education system really does suck. But the best path would probably be self employement. Tap into your skills and use them for profit, screw education. Memorizing things to go to a boring cubicle job sucks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The education system really does suck. But the best path would probably be self employement. Tap into your skills and use them for profit, screw education. Memorizing things to go to a boring cubicle job sucks.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c3j0", "score_hidden": false, "name": "t1_ch5nkyf", "created": 1398830171.0, "author_flair_text": null, "created_utc": 1398826571.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5zjf6", "gilded": 0, "author": "circinia", "parent_id": "t1_ch5noy4", "approved_by": null, "body": "Here are a couple of ways I can think of right now: they're certainly not the only ones, but they might get you started thinking.\n\n-Become an educator yourself, working to connect the things people are learning. This doesn't necessarily mean becoming a teacher--although you can if you want to, and there's certainly value to changing the system from within, although with current educational legislation this is sometimes challenging. You could also work in an after-school program, tutor people outside of school, even teach classes or give private lessons in a non-academic thing you like and enjoy.\n\n-You can also become an activist within your community, working for laws that allows people to live better lives and against laws that confine them to live worse ones; or working or volunteering at organizations that help people live better lives. (Even better, help organize young people to get involved in these things, since you know how much it matters to feel like you're making a meaningful contribution to the world.)\n\n-Minimize your financial needs, so that you can work as little as possible (and do other things you enjoy with your time); make sure you're only spending money on things that bring you more enjoyment than the time and energy it took to earn their cost.\n\nI am always super delighted to brainstorm more things with people on this topic, so please feel free to make your own suggestions, poke holes in mine, or ask questions. Having these conversations with people is in itself a helpful thing! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here are a couple of ways I can think of right now: they&amp;#39;re certainly not the only ones, but they might get you started thinking.&lt;/p&gt;\n\n&lt;p&gt;-Become an educator yourself, working to connect the things people are learning. This doesn&amp;#39;t necessarily mean becoming a teacher--although you can if you want to, and there&amp;#39;s certainly value to changing the system from within, although with current educational legislation this is sometimes challenging. You could also work in an after-school program, tutor people outside of school, even teach classes or give private lessons in a non-academic thing you like and enjoy.&lt;/p&gt;\n\n&lt;p&gt;-You can also become an activist within your community, working for laws that allows people to live better lives and against laws that confine them to live worse ones; or working or volunteering at organizations that help people live better lives. (Even better, help organize young people to get involved in these things, since you know how much it matters to feel like you&amp;#39;re making a meaningful contribution to the world.)&lt;/p&gt;\n\n&lt;p&gt;-Minimize your financial needs, so that you can work as little as possible (and do other things you enjoy with your time); make sure you&amp;#39;re only spending money on things that bring you more enjoyment than the time and energy it took to earn their cost.&lt;/p&gt;\n\n&lt;p&gt;I am always super delighted to brainstorm more things with people on this topic, so please feel free to make your own suggestions, poke holes in mine, or ask questions. Having these conversations with people is in itself a helpful thing! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c3j0", "score_hidden": false, "name": "t1_ch5zjf6", "created": 1398897839.0, "author_flair_text": null, "created_utc": 1398869039.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5noy4", "gilded": 0, "author": "tw0123", "parent_id": "t1_ch5nlou", "approved_by": null, "body": "&gt; Lastly, we need people like you who have this insight and who care deeply to work toward changing the system, to make it more rational, and to build a healthier community that gives more people a feeling of meaning and belonging. \n\nHow can I help do this?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Lastly, we need people like you who have this insight and who care deeply to work toward changing the system, to make it more rational, and to build a healthier community that gives more people a feeling of meaning and belonging. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How can I help do this?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c3j0", "score_hidden": false, "name": "t1_ch5noy4", "created": 1398855603.0, "author_flair_text": null, "created_utc": 1398826803.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5nlou", "gilded": 0, "author": "circinia", "parent_id": "t3_24c3j0", "approved_by": null, "body": "I actually agree with you about our education system to a significant extent; it's pretty terribly screwed up the extent to which teaching to the test gets prioritized over developing a deep understanding of the material, and requiring people to go to college in order to get any sort of meaningful employment (to the extent it exists) seems indeed unreasonable.\n\nThere are a couple of things that can potentially mitigate the terribleness of this situation. First of all, as you're aware, there are a *lot* of resources out there to help you learn things as deeply as you'd like to understand them on your own: books, online materials, discussion forums. \n\nSecond, to the extent the experience of college has value, it's because it gives you an opportunity to connect with other people who care about learning things deeply. (Even if many of your classmates don't care about this, your professors will be thrilled about this and will be delighted to help you with this. And it's likely at least a few of your classmates will care as well.)\n\nLastly, we need people like you who have this insight and who care deeply to work toward changing the system to make it more rational, and to build a healthier community that gives more people a feeling of meaning and belonging.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually agree with you about our education system to a significant extent; it&amp;#39;s pretty terribly screwed up the extent to which teaching to the test gets prioritized over developing a deep understanding of the material, and requiring people to go to college in order to get any sort of meaningful employment (to the extent it exists) seems indeed unreasonable.&lt;/p&gt;\n\n&lt;p&gt;There are a couple of things that can potentially mitigate the terribleness of this situation. First of all, as you&amp;#39;re aware, there are a &lt;em&gt;lot&lt;/em&gt; of resources out there to help you learn things as deeply as you&amp;#39;d like to understand them on your own: books, online materials, discussion forums. &lt;/p&gt;\n\n&lt;p&gt;Second, to the extent the experience of college has value, it&amp;#39;s because it gives you an opportunity to connect with other people who care about learning things deeply. (Even if many of your classmates don&amp;#39;t care about this, your professors will be thrilled about this and will be delighted to help you with this. And it&amp;#39;s likely at least a few of your classmates will care as well.)&lt;/p&gt;\n\n&lt;p&gt;Lastly, we need people like you who have this insight and who care deeply to work toward changing the system to make it more rational, and to build a healthier community that gives more people a feeling of meaning and belonging.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24c3j0", "score_hidden": false, "name": "t1_ch5nlou", "created": 1398855415.0, "author_flair_text": null, "created_utc": 1398826615.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]