[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I read somewhere that you should give yourself 3 days (or more) before you do it “Wait three days, or better still a week, until you actually go through with it. If you are going to be dead for the rest of time, what&amp;#39;s another few days wait?” so I guess I’ll give myself some time to think and to see where life’s heading .&lt;/p&gt;\n\n&lt;p&gt;But it feels like no one loves me even thought i have a family that loves me (I think) I just never talk to them.. I don’t know how.. I have a friend I hang out now and then.. I have a girlfriend who loves me (at least that’s what she says) and I love her more than anything in the world but sometimes it feels that I’m just a pillow where she can cry, dump all her worries/stress and every other shit.. of course I want to help/comfort/be there for her and i want her to cry to me and tell all her worries if it makes her feel better but then the mood kinda transferres to me all that stress and sadness and then I have no one to talk.. I know I can talk to her about my feelings and stuff and she has said that she likes when I do but I also know it kina hurts her to know my sad thoughts and I don’t want to hurt her but being silent and distant hurts her too.. everything I do just hurts people that’s all I can do right in this world.\nI’m failing in school and I have no future plans.. it feels like I have nothing.. nothing to try and accomplish no hobbies no interests, nothing to look forward in life.. nothing .&lt;/p&gt;\n\n&lt;p&gt;i used to be kinda scared of thinking about suicide not the dying but i don’t want to hurt anyone and what if something goes wrong ? I also used to think what’s so hard about killing yourself why does so many people fail in it.\nThere’s so many ways to do it so how can one fail in it if you really want it ? But i guess anything can happen&lt;br/&gt;\nI’ve read all kinds of statics about suicide how the odds are against you and stories of failed attempts.. i think they’re just to scare you and to make you change your mind but why do people do this ? Why do they want you not to kill yourself  ? \nStrangers on the internet saying don’t do it if you ask/ say something even related to suicide.. they don’t care about me why are they acting like they do.. why are they telling me what not to do with my life.. they’re not living it (I’m not saying my life is the worst of all of course it’s not. I think i have somewhat decent life and I don’t feel so bad right now but I’m just not happy and i don’t want to live)\nwhy do they care if a person they don’t know in the other side of the world decides to end their life.. some random person in the internet saying &amp;quot;don’t do it.. i care about you.. other people care about you.. i can be your friend &amp;quot; is that supposed to make me feel something ?\nActually i find it bit funny.. but anyways it doesn&amp;#39;t make me feel any different but then there’s the ones saying &amp;quot;think about your family and loved ones.. think about the pain you’re going to cause for them&amp;quot; .. well that just makes me feel worse \nso when you’re thinking that you’re doing a good deed and by trying to help someone change their mind about killing themselves you’re not helping you’re only hurting. (I’m only speaking for myself thought.. if that really helps someone out there good for them) &lt;/p&gt;\n\n&lt;p&gt;It scared me and made me cry to think what way would i do it, when would i do it, what does my suicide note say, what happens when i die, what about my family and other stuff but not any more now I’m just calm like all the fear is gone.. maybe  I’m ready and it’s time to go &lt;/p&gt;\n\n&lt;p&gt;I’ve always thought of jumping.. i just find it &amp;#39;cool&amp;#39; I’m little scared of heights cause i always think what if i accidentally fall and it’s not the time i want to go hehe but high places, base jumping, sky diving etc. has always interested me so that would be kinda nice way to go i think.. also i have thought of drop hanging that’s a fast way to go i can jump from somewhere high in that too\nI can also wait about 2 months that my army starts and i get access to guns.&lt;/p&gt;\n\n&lt;p&gt;I’ve written my suicide note (kinda) there’s still few things I’d maybe like to add but otherwise I’m all ready.. well i guess i  have to go buy rope if I’m going to do the drop hanging or wait 2 months if i want to go with gun.. but jumping I pretty much could do now.&lt;/p&gt;\n\n&lt;p&gt;It feels that ive already decided to kill myself and I’m in peace with that thought (like i said it used to kinda scare me but not anymore) but then again i don’t know if I really want to do it.. what if there’s more to life.. what if i want to live ? it feels silly to want to die but maybe not really wanting it. Other part of my brain saying “die you piece of shit no one cares about you” and the other “maybe there’s something to live for (my gf) maybe I can go trough all the pain for her.. maybe this will all go away in time “&lt;/p&gt;\n\n&lt;p&gt;I don’t know which voice to listen.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I read somewhere that you should give yourself 3 days (or more) before you do it “Wait three days, or better still a week, until you actually go through with it. If you are going to be dead for the rest of time, what's another few days wait?” so I guess I’ll give myself some time to think and to see where life’s heading .\n\nBut it feels like no one loves me even thought i have a family that loves me (I think) I just never talk to them.. I don’t know how.. I have a friend I hang out now and then.. I have a girlfriend who loves me (at least that’s what she says) and I love her more than anything in the world but sometimes it feels that I’m just a pillow where she can cry, dump all her worries/stress and every other shit.. of course I want to help/comfort/be there for her and i want her to cry to me and tell all her worries if it makes her feel better but then the mood kinda transferres to me all that stress and sadness and then I have no one to talk.. I know I can talk to her about my feelings and stuff and she has said that she likes when I do but I also know it kina hurts her to know my sad thoughts and I don’t want to hurt her but being silent and distant hurts her too.. everything I do just hurts people that’s all I can do right in this world.\nI’m failing in school and I have no future plans.. it feels like I have nothing.. nothing to try and accomplish no hobbies no interests, nothing to look forward in life.. nothing .\n\ni used to be kinda scared of thinking about suicide not the dying but i don’t want to hurt anyone and what if something goes wrong ? I also used to think what’s so hard about killing yourself why does so many people fail in it.\nThere’s so many ways to do it so how can one fail in it if you really want it ? But i guess anything can happen  \nI’ve read all kinds of statics about suicide how the odds are against you and stories of failed attempts.. i think they’re just to scare you and to make you change your mind but why do people do this ? Why do they want you not to kill yourself  ? \nStrangers on the internet saying don’t do it if you ask/ say something even related to suicide.. they don’t care about me why are they acting like they do.. why are they telling me what not to do with my life.. they’re not living it (I’m not saying my life is the worst of all of course it’s not. I think i have somewhat decent life and I don’t feel so bad right now but I’m just not happy and i don’t want to live)\nwhy do they care if a person they don’t know in the other side of the world decides to end their life.. some random person in the internet saying \"don’t do it.. i care about you.. other people care about you.. i can be your friend \" is that supposed to make me feel something ?\nActually i find it bit funny.. but anyways it doesn't make me feel any different but then there’s the ones saying \"think about your family and loved ones.. think about the pain you’re going to cause for them\" .. well that just makes me feel worse \nso when you’re thinking that you’re doing a good deed and by trying to help someone change their mind about killing themselves you’re not helping you’re only hurting. (I’m only speaking for myself thought.. if that really helps someone out there good for them) \n\nIt scared me and made me cry to think what way would i do it, when would i do it, what does my suicide note say, what happens when i die, what about my family and other stuff but not any more now I’m just calm like all the fear is gone.. maybe  I’m ready and it’s time to go \n\nI’ve always thought of jumping.. i just find it 'cool' I’m little scared of heights cause i always think what if i accidentally fall and it’s not the time i want to go hehe but high places, base jumping, sky diving etc. has always interested me so that would be kinda nice way to go i think.. also i have thought of drop hanging that’s a fast way to go i can jump from somewhere high in that too\nI can also wait about 2 months that my army starts and i get access to guns.\n\nI’ve written my suicide note (kinda) there’s still few things I’d maybe like to add but otherwise I’m all ready.. well i guess i  have to go buy rope if I’m going to do the drop hanging or wait 2 months if i want to go with gun.. but jumping I pretty much could do now.\n\nIt feels that ive already decided to kill myself and I’m in peace with that thought (like i said it used to kinda scare me but not anymore) but then again i don’t know if I really want to do it.. what if there’s more to life.. what if i want to live ? it feels silly to want to die but maybe not really wanting it. Other part of my brain saying “die you piece of shit no one cares about you” and the other “maybe there’s something to live for (my gf) maybe I can go trough all the pain for her.. maybe this will all go away in time “\n\nI don’t know which voice to listen.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "257bbx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "pikkuj", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/257bbx/why_cant_i_just_be_happy/", "name": "t3_257bbx", "created": 1399753366.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/257bbx/why_cant_i_just_be_happy/", "author_flair_text": null, "title": "Why can't i just be happy ?", "created_utc": 1399724566.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]