[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why is committing suicide a bad thing? All my life I have been told that suicide is selfish. They&amp;#39;ll say it&amp;#39;s against the sanctity of life, against god, pointless, a waste of a life, eventually it gets better, you could accomplish so much, or you&amp;#39;ll be happy one day.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t enjoy life. I have no goals or aspirations. I have nothing to look forward to. I do not enjoy this life. Nothing is fun. There&amp;#39;s nothing here that I want to do.&lt;/p&gt;\n\n&lt;p&gt;So why isn&amp;#39;t it my choice? I&amp;#39;ve always been told it&amp;#39;s my body, and that as an adult it&amp;#39;s my choice how I take care of it. Except when it comes to suicide, that is the big taboo. &lt;/p&gt;\n\n&lt;p&gt;They say it&amp;#39;s selfish to commit suicide. But isn&amp;#39;t it selfish in the opposite respect to tell someone who is suffering that they don&amp;#39;t have the right to end their life?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Why is committing suicide a bad thing? All my life I have been told that suicide is selfish. They'll say it's against the sanctity of life, against god, pointless, a waste of a life, eventually it gets better, you could accomplish so much, or you'll be happy one day.\n\nI don't enjoy life. I have no goals or aspirations. I have nothing to look forward to. I do not enjoy this life. Nothing is fun. There's nothing here that I want to do.\n\nSo why isn't it my choice? I've always been told it's my body, and that as an adult it's my choice how I take care of it. Except when it comes to suicide, that is the big taboo. \n\nThey say it's selfish to commit suicide. But isn't it selfish in the opposite respect to tell someone who is suffering that they don't have the right to end their life?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "249lc2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "nullrandom", "media": null, "score": 30, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1398770001.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 12, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/249lc2/why_is_committing_suicide_a_bad_thing/", "name": "t3_249lc2", "created": 1398795438.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/249lc2/why_is_committing_suicide_a_bad_thing/", "author_flair_text": null, "title": "Why is committing suicide a \"bad\" thing?", "created_utc": 1398766638.0, "ups": 42, "num_comments": 34, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4ynk5", "gilded": 0, "author": "roast_spud", "parent_id": "t1_ch4yeby", "approved_by": null, "body": "You are most welcome.\n\nI think it must be in our instinct to want to keep other people alive, no matter what they tell us about the actual quality of life they live.  I would be a complete hypocrite if I called myself pro-choice and supported things like medically assisted suicide and abortion, but then demanded an otherwise physically well person be kept alive against their will.\n\n.. Doesn't stop me doing my best to help people out of depression, but I acknowledge that it isn't my decision, and I will never make someone feel bad about contemplating ending their own life. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are most welcome.&lt;/p&gt;\n\n&lt;p&gt;I think it must be in our instinct to want to keep other people alive, no matter what they tell us about the actual quality of life they live.  I would be a complete hypocrite if I called myself pro-choice and supported things like medically assisted suicide and abortion, but then demanded an otherwise physically well person be kept alive against their will.&lt;/p&gt;\n\n&lt;p&gt;.. Doesn&amp;#39;t stop me doing my best to help people out of depression, but I acknowledge that it isn&amp;#39;t my decision, and I will never make someone feel bad about contemplating ending their own life. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4ynk5", "created": 1398801424.0, "author_flair_text": null, "created_utc": 1398772624.0, "distinguished": null, "num_reports": null, "ups": 13}}], "after": null, "before": null}}, "saved": false, "id": "ch4yeby", "gilded": 0, "author": "nullrandom", "parent_id": "t1_ch4y4yn", "approved_by": null, "body": "Thank you, it's nice to hear a different perspective on it. An honest one.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, it&amp;#39;s nice to hear a different perspective on it. An honest one.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4yeby", "created": 1398800251.0, "author_flair_text": null, "created_utc": 1398771451.0, "distinguished": null, "num_reports": null, "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5qhda", "gilded": 0, "author": "roast_spud", "parent_id": "t1_ch5naat", "approved_by": null, "body": "Thank you. It took me ages to try and write that, because I haven't really had to explain it before. \n\nI think there's a real sense of freedom when you realise you don't owe anyone anything. Then life (and what you do with it) becomes a choice, and when you have choices, you have control.\n\n.. I want to stick around to see what else is out there for me. There's no hurry to see what's on the other side. Best wishes to you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. It took me ages to try and write that, because I haven&amp;#39;t really had to explain it before. &lt;/p&gt;\n\n&lt;p&gt;I think there&amp;#39;s a real sense of freedom when you realise you don&amp;#39;t owe anyone anything. Then life (and what you do with it) becomes a choice, and when you have choices, you have control.&lt;/p&gt;\n\n&lt;p&gt;.. I want to stick around to see what else is out there for me. There&amp;#39;s no hurry to see what&amp;#39;s on the other side. Best wishes to you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5qhda", "created": 1398862078.0, "author_flair_text": null, "created_utc": 1398833278.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch5naat", "gilded": 0, "author": "ShannonBananan", "parent_id": "t1_ch4y4yn", "approved_by": null, "body": "You have a good outlook on this topic, I am commenting so I can find it again.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have a good outlook on this topic, I am commenting so I can find it again.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5naat", "created": 1398854752.0, "author_flair_text": null, "created_utc": 1398825952.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4y4yn", "gilded": 0, "author": "roast_spud", "parent_id": "t3_249lc2", "approved_by": null, "body": "Oh, mate.. It's not bad.  It's *sad*.\n\nIt is absolutely your life. Each of us makes choices every day.  Choosing to continue living isn't 'normally' one of those choices (self preservation is a really strong instinct) - but it is absolutely in your control.  \n\n.. I think generally people inadvertently make suicidal thoughts seem selfish or shameful for a couple of reasons.  Firstly, they have no comprehension of how dark someone's life has become, so they don't give self-inflicted harm/verbalisation the gravity it deserves. They are glib - 'such a waste' etc.\n\nSecondly, there's still an aura of shame around a family who have experienced someone committing suicide.  This is historical and unhelpful and comes from a time where mental health was given no attention whatsoever. They are insensitive.\n\nMy friend - your life is your own.  People around this sub have generally have had personal experiences with suicide of a loved one, or unsuccessful attempts of their own.  The people who attempted suicide and are relieved that it didn't work are so full of gratitude and joy that they have a 'second chance', that they want to help others get through the dark days.  For the ones who have lost someone - well, they just want the chance to offer support when they may have missed the signs before.  These are genuine people wanting to provide support and lend an ear.\n\nIt is YOUR life.  Your body.  Your experiences and your choices.  Those are my thoughts.", "edited": false, "author_flair_css_class": null, "downs": 7, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, mate.. It&amp;#39;s not bad.  It&amp;#39;s &lt;em&gt;sad&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;It is absolutely your life. Each of us makes choices every day.  Choosing to continue living isn&amp;#39;t &amp;#39;normally&amp;#39; one of those choices (self preservation is a really strong instinct) - but it is absolutely in your control.  &lt;/p&gt;\n\n&lt;p&gt;.. I think generally people inadvertently make suicidal thoughts seem selfish or shameful for a couple of reasons.  Firstly, they have no comprehension of how dark someone&amp;#39;s life has become, so they don&amp;#39;t give self-inflicted harm/verbalisation the gravity it deserves. They are glib - &amp;#39;such a waste&amp;#39; etc.&lt;/p&gt;\n\n&lt;p&gt;Secondly, there&amp;#39;s still an aura of shame around a family who have experienced someone committing suicide.  This is historical and unhelpful and comes from a time where mental health was given no attention whatsoever. They are insensitive.&lt;/p&gt;\n\n&lt;p&gt;My friend - your life is your own.  People around this sub have generally have had personal experiences with suicide of a loved one, or unsuccessful attempts of their own.  The people who attempted suicide and are relieved that it didn&amp;#39;t work are so full of gratitude and joy that they have a &amp;#39;second chance&amp;#39;, that they want to help others get through the dark days.  For the ones who have lost someone - well, they just want the chance to offer support when they may have missed the signs before.  These are genuine people wanting to provide support and lend an ear.&lt;/p&gt;\n\n&lt;p&gt;It is YOUR life.  Your body.  Your experiences and your choices.  Those are my thoughts.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4y4yn", "created": 1398798937.0, "author_flair_text": null, "created_utc": 1398770137.0, "distinguished": null, "num_reports": null, "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5a2gf", "gilded": 0, "author": "lilsunnybee", "parent_id": "t3_249lc2", "approved_by": null, "body": "A lot of prevention efforts are directed towards the many suicides that are spur of the moment, when someone's in a particularly bad place and overcome with negative emotions. For a lot of people it *will* get better, even though in their current state they aren't able to see that. Especially when people are going through transitional periods of their lives, like their teenage years or early twenties, maybe college, when a lot of stuff happens thats not permanent but might seem like it, a lot of potentially regretable and unnecessary suicides occur.\n\nFriends and family are always going to be stricken and really sad when someone they are close to dies, but especially when it was their own choice. It's sorta like if you were to say bye to all your friends and family one day, that you were moving to a different country and not coming back to visit, won't call or write, just cutting off all contact. That's a hard thing to hear a friend or family member you care about say. They'll almost definitely grieve your loss, and though you might have been in a lot of pain and just wanted out, since they could never experience that it will just seem confusing and upsetting.\n\nWhether you are pro- or anti-suicide, i think all of us can agree that it is a big life-changing decision to make, one that shouldn't be taken lightly, and given much consideration and hesitation. Plus depending on the method you might use, unless you succeed (most attempts dont) you might have new and serious health problems to deal with on top of what you were already going through, which sucks even more.\n\n\"bad\" is subjective in this case, but thats some of the reasons some people are so opposed to it.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of prevention efforts are directed towards the many suicides that are spur of the moment, when someone&amp;#39;s in a particularly bad place and overcome with negative emotions. For a lot of people it &lt;em&gt;will&lt;/em&gt; get better, even though in their current state they aren&amp;#39;t able to see that. Especially when people are going through transitional periods of their lives, like their teenage years or early twenties, maybe college, when a lot of stuff happens thats not permanent but might seem like it, a lot of potentially regretable and unnecessary suicides occur.&lt;/p&gt;\n\n&lt;p&gt;Friends and family are always going to be stricken and really sad when someone they are close to dies, but especially when it was their own choice. It&amp;#39;s sorta like if you were to say bye to all your friends and family one day, that you were moving to a different country and not coming back to visit, won&amp;#39;t call or write, just cutting off all contact. That&amp;#39;s a hard thing to hear a friend or family member you care about say. They&amp;#39;ll almost definitely grieve your loss, and though you might have been in a lot of pain and just wanted out, since they could never experience that it will just seem confusing and upsetting.&lt;/p&gt;\n\n&lt;p&gt;Whether you are pro- or anti-suicide, i think all of us can agree that it is a big life-changing decision to make, one that shouldn&amp;#39;t be taken lightly, and given much consideration and hesitation. Plus depending on the method you might use, unless you succeed (most attempts dont) you might have new and serious health problems to deal with on top of what you were already going through, which sucks even more.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;bad&amp;quot; is subjective in this case, but thats some of the reasons some people are so opposed to it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5a2gf", "created": 1398827871.0, "author_flair_text": null, "created_utc": 1398799071.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch52len", "gilded": 0, "author": "indigovisions", "parent_id": "t3_249lc2", "approved_by": null, "body": "I always thought that saying a person who has committed suicide is selfish. Is possibly one of the most selfish things you could say, maybe they were so selfless that they took there own lives, due to stupid comments such as that.", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always thought that saying a person who has committed suicide is selfish. Is possibly one of the most selfish things you could say, maybe they were so selfless that they took there own lives, due to stupid comments such as that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch52len", "created": 1398812685.0, "author_flair_text": null, "created_utc": 1398783885.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5ocma", "gilded": 0, "author": "k__hooper__", "parent_id": "t1_ch5999k", "approved_by": null, "body": "Commenting so I can find this later. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Commenting so I can find this later. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5ocma", "created": 1398857048.0, "author_flair_text": null, "created_utc": 1398828248.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5999k", "gilded": 0, "author": "cokecaine", "parent_id": "t3_249lc2", "approved_by": null, "body": "I suggest you watch this: https://www.youtube.com/watch?v=MajfZIyHP8U", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suggest you watch this: &lt;a href=\"https://www.youtube.com/watch?v=MajfZIyHP8U\"&gt;https://www.youtube.com/watch?v=MajfZIyHP8U&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5999k", "created": 1398826309.0, "author_flair_text": null, "created_utc": 1398797509.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch56msj", "gilded": 0, "author": "ediciusTemp", "parent_id": "t3_249lc2", "approved_by": null, "body": "I personally feel the way you do. And make no mistake that society judges it as -very bad- even in the case of malignant illness.  Check this article out (http://mobile.abc.net.au/news/2014-04-22/police-raid-homes-of-euthanasia-group-members/5403866)-\nRecently police raided the homes of cancer patients and other near death Australians just because they didn't want to have the end of their lives to be forcefully and painfully extended by the medical procedures that would have been forced on them involuntarily\n\n-the only way a terminal patient can end their lives once the pain near the end becomes unbearable and uncontrollable is through starving themselves to death- and even then in most cases the patient is force fed-(and this is considered acceptable and humane)\n\nThese Australians demanded to go peacefully and painlessly and for that they deserve to go to jail in the eyes of law enforcement.\n\n", "edited": 1398795776.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally feel the way you do. And make no mistake that society judges it as -very bad- even in the case of malignant illness.  Check this article out (&lt;a href=\"http://mobile.abc.net.au/news/2014-04-22/police-raid-homes-of-euthanasia-group-members/5403866)-\"&gt;http://mobile.abc.net.au/news/2014-04-22/police-raid-homes-of-euthanasia-group-members/5403866)-&lt;/a&gt;\nRecently police raided the homes of cancer patients and other near death Australians just because they didn&amp;#39;t want to have the end of their lives to be forcefully and painfully extended by the medical procedures that would have been forced on them involuntarily&lt;/p&gt;\n\n&lt;p&gt;-the only way a terminal patient can end their lives once the pain near the end becomes unbearable and uncontrollable is through starving themselves to death- and even then in most cases the patient is force fed-(and this is considered acceptable and humane)&lt;/p&gt;\n\n&lt;p&gt;These Australians demanded to go peacefully and painlessly and for that they deserve to go to jail in the eyes of law enforcement.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch56msj", "created": 1398821086.0, "author_flair_text": null, "created_utc": 1398792286.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5iwaq", "gilded": 0, "author": "ediciusTemp", "parent_id": "t1_ch4xmwm", "approved_by": null, "body": "&gt;&gt;if the person in question doesn't have a terminal illness, we assume that he/she must not be operating in the proper state of mind to make their own decisions.\n\nThat's so biased and is actually the less advanced view. If I was an author I could think of a million reasons for a main character to commit suicide that doesn't include mental illness. So it appears on this topic at least we have regressed backwards into a state of denial", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;if the person in question doesn&amp;#39;t have a terminal illness, we assume that he/she must not be operating in the proper state of mind to make their own decisions.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s so biased and is actually the less advanced view. If I was an author I could think of a million reasons for a main character to commit suicide that doesn&amp;#39;t include mental illness. So it appears on this topic at least we have regressed backwards into a state of denial&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5iwaq", "created": 1398845727.0, "author_flair_text": null, "created_utc": 1398816927.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4y9gr", "gilded": 0, "author": "nullrandom", "parent_id": "t1_ch4xmwm", "approved_by": null, "body": "My question is a personal one. It has been a constant struggle between wanting to kill myself and knowing there are people who care about me. I just don't understand the obligation. Why do I have to stay alive for these people while I'm suffering? ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My question is a personal one. It has been a constant struggle between wanting to kill myself and knowing there are people who care about me. I just don&amp;#39;t understand the obligation. Why do I have to stay alive for these people while I&amp;#39;m suffering? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4y9gr", "created": 1398799590.0, "author_flair_text": null, "created_utc": 1398770790.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "saved": false, "id": "ch4xmwm", "gilded": 0, "author": "newtonsapple", "parent_id": "t3_249lc2", "approved_by": null, "body": "This is certainly a question for philosophers to mull over.  The ancient Greeks and Romans thought an individual had the right to do that, however I'd like to think we've progressed since then.  I guess the main reason that we don't usually allow it is that, if the person in question doesn't have a terminal illness, we assume that he/she must not be operating in the proper state of mind to make their own decisions.\n\n\nWhat about you?  Are you posting a purely hypothetical question, or a personal one?", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is certainly a question for philosophers to mull over.  The ancient Greeks and Romans thought an individual had the right to do that, however I&amp;#39;d like to think we&amp;#39;ve progressed since then.  I guess the main reason that we don&amp;#39;t usually allow it is that, if the person in question doesn&amp;#39;t have a terminal illness, we assume that he/she must not be operating in the proper state of mind to make their own decisions.&lt;/p&gt;\n\n&lt;p&gt;What about you?  Are you posting a purely hypothetical question, or a personal one?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4xmwm", "created": 1398796078.0, "author_flair_text": null, "created_utc": 1398767278.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5j24t", "gilded": 0, "author": "ediciusTemp", "parent_id": "t1_ch51dnh", "approved_by": null, "body": "As I said above, if I was an author I could think of millions of scenarios where a character is driven to taking their lives not out of mental illness but for a completely rational reason. I think you've taken a rather narrow view of the subject.", "edited": 1398824391.0, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I said above, if I was an author I could think of millions of scenarios where a character is driven to taking their lives not out of mental illness but for a completely rational reason. I think you&amp;#39;ve taken a rather narrow view of the subject.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch5j24t", "created": 1398846081.0, "author_flair_text": null, "created_utc": 1398817281.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch51dnh", "gilded": 0, "author": "benzidrine", "parent_id": "t3_249lc2", "approved_by": null, "body": "I do not believe suicide to be selfish but I find it to be unfortunate, an example of society failing to care for one of its member and a person succumbing to a treatable mental health issue. I try to be a part of society that cares.\n\nThere are very few situations in which suicide can come from a rational perspective. If someone posted on here: I have an illness that will cause me to suffer three months of absolute agony before my eventual death, I intend to commit suicide before that happens. Then I wouldn't have anything to say to them.\n\nHowever most suicide is inspired by an irrational depression, a mental illness that is causing them to suffer. However depression can be helped, the mind is not static but can changed. I believe people that are suicidal with sufficient help would no longer be suicidal. \n\nIt is your choice but humans should care for one another and you can't blame people for caring whether you live or die. If no one ever cared then you would be dead already. Suicide would be totally unnecessary in such a world as babies would be discarded at birth and no one would care. In times there would be no humans at all.   ", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not believe suicide to be selfish but I find it to be unfortunate, an example of society failing to care for one of its member and a person succumbing to a treatable mental health issue. I try to be a part of society that cares.&lt;/p&gt;\n\n&lt;p&gt;There are very few situations in which suicide can come from a rational perspective. If someone posted on here: I have an illness that will cause me to suffer three months of absolute agony before my eventual death, I intend to commit suicide before that happens. Then I wouldn&amp;#39;t have anything to say to them.&lt;/p&gt;\n\n&lt;p&gt;However most suicide is inspired by an irrational depression, a mental illness that is causing them to suffer. However depression can be helped, the mind is not static but can changed. I believe people that are suicidal with sufficient help would no longer be suicidal. &lt;/p&gt;\n\n&lt;p&gt;It is your choice but humans should care for one another and you can&amp;#39;t blame people for caring whether you live or die. If no one ever cared then you would be dead already. Suicide would be totally unnecessary in such a world as babies would be discarded at birth and no one would care. In times there would be no humans at all.   &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch51dnh", "created": 1398809880.0, "author_flair_text": null, "created_utc": 1398781080.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch53vvp", "gilded": 0, "author": "Razatron", "parent_id": "t3_249lc2", "approved_by": null, "body": "I don't think it is. I've always believed that if I have the right to live, I should also have the right to die.", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it is. I&amp;#39;ve always believed that if I have the right to live, I should also have the right to die.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch53vvp", "created": 1398815468.0, "author_flair_text": null, "created_utc": 1398786668.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch56r2r", "gilded": 0, "author": "ediciusTemp", "parent_id": "t1_ch4z1fs", "approved_by": null, "body": "Do you think people are really that ignorant? I would think most would know suicide is a way to escape pain not to create more pain.  But perhaps I'm wrong", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think people are really that ignorant? I would think most would know suicide is a way to escape pain not to create more pain.  But perhaps I&amp;#39;m wrong&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch56r2r", "created": 1398821334.0, "author_flair_text": null, "created_utc": 1398792534.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "ch4z1fs", "gilded": 0, "author": "suicidethrowaaway", "parent_id": "t3_249lc2", "approved_by": null, "body": "I think people imagine it like this: You tell people that you want to set your arm on fire and let it burn to the bone. People insist that burning your arm couldn't possibly be beneficial. \"Anyone who thinks that burning their own arm is a good thing must not be completely sane,\" they say. People view suicide in a similar way; they believe it is senseless self-harm.\n", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think people imagine it like this: You tell people that you want to set your arm on fire and let it burn to the bone. People insist that burning your arm couldn&amp;#39;t possibly be beneficial. &amp;quot;Anyone who thinks that burning their own arm is a good thing must not be completely sane,&amp;quot; they say. People view suicide in a similar way; they believe it is senseless self-harm.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4z1fs", "created": 1398803018.0, "author_flair_text": null, "created_utc": 1398774218.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch4zc83", "gilded": 0, "author": "Nemesis1992", "parent_id": "t1_ch4yvmv", "approved_by": null, "body": "Thanks for your explanation.\nYou are 21 years old. I'm 21 years old also.  You could be one of my friend. I wanna hug you. :)\nSo where should I start?\n\nFirst of all, I'm sorry to hear about you being verbally abused. \nI'm happy to know, that you moved out to Sacramento.\n\nIsn't this the chance for you, to get out of this limbo?\nFor me that would be it.\n\nI've got some idea of what you could do, to spice things up. You live in a great city.\n\n1) The first thing that came to my mind that could help you fighting against your habit of isolating, plus improving your social skills would be volunteering.\nCommunity Services Planning Council’s Hands On Sacramento program arranges opportunities for you to volunteer however many hours you desire at a variety of organizations. Choices include working with children, seniors, the homeless, animals, in nature and for the arts. \n\nBasically, you could do something different, and check what you love the most. Do you like helping the children? Help them. Do you like helping the homeless? That's your chance.\nYou don't know what you like? Try doing them all :)\n\n2) Start doing some running. So you'll be ready for Sacramento's is famous for his thanksgiving running &lt;&lt;Run To Feed The Hungry, a 5K walk/run and 10K run through East Sacramento and midtown on Thanksgiving morning&gt;&gt;. It's your chance to get some fun.\n\n3) Start reading. It may seem a bad suggestion, but a good book is great to stop malevolent thoughts. \n\n4) Go check Tunes into local music at Pops in the Park, concerts held in East Sacramento and River Park neighborhood parks; Friday Night Concerts in the Park at Cesar Chavez Plaza downtown; and Harmony on the River, held along River Walk Park in West Sacramento.\n\n5) Go take a peek to Paws.\n\n6) Attend local live performances. Whether it’s a show by the Sacramento Theatre Company, the B Street Theatre, The Sacramento Ballet, Sacramento Opera or Sacramento Philharmonic, you’ll witness the best in area talent. \n\n7) Embrace the animals (figuratively) at Folsom Zoo Sanctuary. Lions and tigers and bears—oh, my! And monkeys, foxes, bobcats, coyotes. . . . A refuge for animals that have been injured, orphaned or rejected, this zoo has a goal of “teaching responsible human behavior toward all animals.”\n\nWell, I've given you some idea on how to get out of this limbo. Little steps, you have to want it. And I know you do :). If you want other idea and things to do, I could suggest you others.", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your explanation.\nYou are 21 years old. I&amp;#39;m 21 years old also.  You could be one of my friend. I wanna hug you. :)\nSo where should I start?&lt;/p&gt;\n\n&lt;p&gt;First of all, I&amp;#39;m sorry to hear about you being verbally abused. \nI&amp;#39;m happy to know, that you moved out to Sacramento.&lt;/p&gt;\n\n&lt;p&gt;Isn&amp;#39;t this the chance for you, to get out of this limbo?\nFor me that would be it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got some idea of what you could do, to spice things up. You live in a great city.&lt;/p&gt;\n\n&lt;p&gt;1) The first thing that came to my mind that could help you fighting against your habit of isolating, plus improving your social skills would be volunteering.\nCommunity Services Planning Council’s Hands On Sacramento program arranges opportunities for you to volunteer however many hours you desire at a variety of organizations. Choices include working with children, seniors, the homeless, animals, in nature and for the arts. &lt;/p&gt;\n\n&lt;p&gt;Basically, you could do something different, and check what you love the most. Do you like helping the children? Help them. Do you like helping the homeless? That&amp;#39;s your chance.\nYou don&amp;#39;t know what you like? Try doing them all :)&lt;/p&gt;\n\n&lt;p&gt;2) Start doing some running. So you&amp;#39;ll be ready for Sacramento&amp;#39;s is famous for his thanksgiving running &amp;lt;&amp;lt;Run To Feed The Hungry, a 5K walk/run and 10K run through East Sacramento and midtown on Thanksgiving morning&amp;gt;&amp;gt;. It&amp;#39;s your chance to get some fun.&lt;/p&gt;\n\n&lt;p&gt;3) Start reading. It may seem a bad suggestion, but a good book is great to stop malevolent thoughts. &lt;/p&gt;\n\n&lt;p&gt;4) Go check Tunes into local music at Pops in the Park, concerts held in East Sacramento and River Park neighborhood parks; Friday Night Concerts in the Park at Cesar Chavez Plaza downtown; and Harmony on the River, held along River Walk Park in West Sacramento.&lt;/p&gt;\n\n&lt;p&gt;5) Go take a peek to Paws.&lt;/p&gt;\n\n&lt;p&gt;6) Attend local live performances. Whether it’s a show by the Sacramento Theatre Company, the B Street Theatre, The Sacramento Ballet, Sacramento Opera or Sacramento Philharmonic, you’ll witness the best in area talent. &lt;/p&gt;\n\n&lt;p&gt;7) Embrace the animals (figuratively) at Folsom Zoo Sanctuary. Lions and tigers and bears—oh, my! And monkeys, foxes, bobcats, coyotes. . . . A refuge for animals that have been injured, orphaned or rejected, this zoo has a goal of “teaching responsible human behavior toward all animals.”&lt;/p&gt;\n\n&lt;p&gt;Well, I&amp;#39;ve given you some idea on how to get out of this limbo. Little steps, you have to want it. And I know you do :). If you want other idea and things to do, I could suggest you others.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4zc83", "created": 1398804112.0, "author_flair_text": null, "created_utc": 1398775312.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch4yvmv", "gilded": 0, "author": "nullrandom", "parent_id": "t1_ch4yjwx", "approved_by": null, "body": "Where do I start? I'm a 21 year old male. My life began when I was 3 years old. Unfortunately, my parents divorced soon after. I spent most of my time with my mom, visiting my dad frequently. My dad met a girl, who years later became his step-wife. My brother, during this whole time isolated. I never really knew my brother very much, I barely even knew he existed, and what I did know of him he was an asshole. I think he was jealous of me, since he was very antisocial and always got in trouble, while I was the perfect child that could do no wrong. \n\nMy mom, a lesbian, partnered up with another lesbo. This was when I was around 8, and at first things went pretty swell. But after awhile it became apparent that she did not like children, and became verbally abusive. This began the loss of my innocence, and things really went down hill from there.\n\nWhen i was about 14, my mom came up to me and said, \"son we're moving to Elk Grove. Gated community. It's gonna be awesooooooome.\" I cried. \n\nThere was nothing to do there. I lost all of my friends. I learned how to entertain myself, since, there was nothing to do. This was the beginning of my depression, and thoughts of death and suicide. \n\nSo as an adult now, I moved to Sacramento, but nothing has really changed. I have the bad habit of isolating, I have a hard time making friends or doing social activities. Nothing really excites me. I spend my days watching Netflix, or listening to music. My life is really like a state of limbo, nothing really happens, and I'll do anything to numb myself. ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do I start? I&amp;#39;m a 21 year old male. My life began when I was 3 years old. Unfortunately, my parents divorced soon after. I spent most of my time with my mom, visiting my dad frequently. My dad met a girl, who years later became his step-wife. My brother, during this whole time isolated. I never really knew my brother very much, I barely even knew he existed, and what I did know of him he was an asshole. I think he was jealous of me, since he was very antisocial and always got in trouble, while I was the perfect child that could do no wrong. &lt;/p&gt;\n\n&lt;p&gt;My mom, a lesbian, partnered up with another lesbo. This was when I was around 8, and at first things went pretty swell. But after awhile it became apparent that she did not like children, and became verbally abusive. This began the loss of my innocence, and things really went down hill from there.&lt;/p&gt;\n\n&lt;p&gt;When i was about 14, my mom came up to me and said, &amp;quot;son we&amp;#39;re moving to Elk Grove. Gated community. It&amp;#39;s gonna be awesooooooome.&amp;quot; I cried. &lt;/p&gt;\n\n&lt;p&gt;There was nothing to do there. I lost all of my friends. I learned how to entertain myself, since, there was nothing to do. This was the beginning of my depression, and thoughts of death and suicide. &lt;/p&gt;\n\n&lt;p&gt;So as an adult now, I moved to Sacramento, but nothing has really changed. I have the bad habit of isolating, I have a hard time making friends or doing social activities. Nothing really excites me. I spend my days watching Netflix, or listening to music. My life is really like a state of limbo, nothing really happens, and I&amp;#39;ll do anything to numb myself. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4yvmv", "created": 1398802387.0, "author_flair_text": null, "created_utc": 1398773587.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch50k45", "gilded": 0, "author": "suicidethrowaaway", "parent_id": "t1_ch4zh5l", "approved_by": null, "body": "I realize that life isn't easy, but it should be rewarding/meaningful. If there's no meaning in my life other than survival then what's the point? \n\nI'm not just \"bursting out on rage\", I think about this stuff constantly. I know what my situation is and how my brain works. Some things can't be fixed no matter how much time, will, therapy, or drugs I put into them. ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I realize that life isn&amp;#39;t easy, but it should be rewarding/meaningful. If there&amp;#39;s no meaning in my life other than survival then what&amp;#39;s the point? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not just &amp;quot;bursting out on rage&amp;quot;, I think about this stuff constantly. I know what my situation is and how my brain works. Some things can&amp;#39;t be fixed no matter how much time, will, therapy, or drugs I put into them. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch50k45", "created": 1398807776.0, "author_flair_text": null, "created_utc": 1398778976.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "saved": false, "id": "ch4zh5l", "gilded": 0, "author": "[deleted]", "parent_id": "t1_ch4z79v", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4zh5l", "created": 1398804568.0, "author_flair_text": null, "created_utc": 1398775768.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch4z79v", "gilded": 0, "author": "suicidethrowaaway", "parent_id": "t1_ch4yjwx", "approved_by": null, "body": "And when will these opportunities come? In 6 months? In 6 years? Never? Not everyone wants to endure daily misery in the hopes of things getting better down the road. Depressed people may hail the nothingness of dreamless sleep as the best parts of their days; death is the logical extension of this.", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And when will these opportunities come? In 6 months? In 6 years? Never? Not everyone wants to endure daily misery in the hopes of things getting better down the road. Depressed people may hail the nothingness of dreamless sleep as the best parts of their days; death is the logical extension of this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4z79v", "created": 1398803617.0, "author_flair_text": null, "created_utc": 1398774817.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "ch4yjwx", "gilded": 0, "author": "[deleted]", "parent_id": "t3_249lc2", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4yjwx", "created": 1398800963.0, "author_flair_text": null, "created_utc": 1398772163.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch55vdo", "gilded": 0, "author": "gmc16gry", "parent_id": "t1_ch4ybhp", "approved_by": null, "body": "You misunderstand, people who haven't been through depression and suicide think of it as selfish, but I know that it has nothing to do with why people commit suicide. If anything people who commit suicide are more likely to feel like what they are doing is a very selfless act. I was in no way saying that you are selfish", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You misunderstand, people who haven&amp;#39;t been through depression and suicide think of it as selfish, but I know that it has nothing to do with why people commit suicide. If anything people who commit suicide are more likely to feel like what they are doing is a very selfless act. I was in no way saying that you are selfish&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch55vdo", "created": 1398819539.0, "author_flair_text": null, "created_utc": 1398790739.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch4ybhp", "gilded": 0, "author": "nullrandom", "parent_id": "t1_ch4xnnr", "approved_by": null, "body": "I've been in treatment for years. I'm probably going to end up as an inpatient, again. \n\nSelfish? Maybe. But why isn't it selfish to let someone suffer? ", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in treatment for years. I&amp;#39;m probably going to end up as an inpatient, again. &lt;/p&gt;\n\n&lt;p&gt;Selfish? Maybe. But why isn&amp;#39;t it selfish to let someone suffer? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4ybhp", "created": 1398799867.0, "author_flair_text": null, "created_utc": 1398771067.0, "distinguished": null, "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "saved": false, "id": "ch4xnnr", "gilded": 0, "author": "[deleted]", "parent_id": "t3_249lc2", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 4, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_249lc2", "score_hidden": false, "name": "t1_ch4xnnr", "created": 1398796203.0, "author_flair_text": null, "created_utc": 1398767403.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]