[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me just start by saying I&amp;#39;m only 17 and I&amp;#39;ve already had enough of my life. I just don&amp;#39;t see the point to go on if I know I&amp;#39;m not going to become anything more in my life. I constantly fuck up everything I do, I feel alone even when surrounded by people, and I just can&amp;#39;t help but not know what I want in life and am afraid because every time I want something I end up coming up short. I don&amp;#39;t know why I feel the way I do because I don&amp;#39;t have the struggle that most do but I always have this cloud over me that I have never been able to understand. It&amp;#39;s like I see everybody around me happy and I just wonder why I don&amp;#39;t feel the same. I&amp;#39;ve never felt loved by anyone including family or friends no matter what they say. I just don&amp;#39;t understand my life and I know I&amp;#39;m going to die alone at some point so why not now? Why not just end the pain of constantly feeling alone by ending all feeling? I&amp;#39;ve considered it for as long as I can remember and I just don&amp;#39;t know why not. I&amp;#39;m sorry about any grammar mistakes or anything... I&amp;#39;m on my phone because I&amp;#39;m too afraid to have anybody see.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let me just start by saying I'm only 17 and I've already had enough of my life. I just don't see the point to go on if I know I'm not going to become anything more in my life. I constantly fuck up everything I do, I feel alone even when surrounded by people, and I just can't help but not know what I want in life and am afraid because every time I want something I end up coming up short. I don't know why I feel the way I do because I don't have the struggle that most do but I always have this cloud over me that I have never been able to understand. It's like I see everybody around me happy and I just wonder why I don't feel the same. I've never felt loved by anyone including family or friends no matter what they say. I just don't understand my life and I know I'm going to die alone at some point so why not now? Why not just end the pain of constantly feeling alone by ending all feeling? I've considered it for as long as I can remember and I just don't know why not. I'm sorry about any grammar mistakes or anything... I'm on my phone because I'm too afraid to have anybody see.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bpnd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Throwawaydfg", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24bpnd/why_not_now/", "name": "t3_24bpnd", "created": 1398845825.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24bpnd/why_not_now/", "author_flair_text": null, "title": "Why not now?", "created_utc": 1398817025.0, "ups": 4, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch5jwhu", "gilded": 0, "author": "ediciusTemp", "parent_id": "t3_24bpnd", "approved_by": null, "body": "Hey I'm 30 but when I was 16 I also wanted to kill myself- even though I still feel that way to this day- I have managed to survive.  If I had killed myself I wouldn't have seen Obama become president, I wouldn't have seen gay marriage become legal, I wouldn't have seen the creation of Oculus Rift,Google Glass,Google Car, the new World Trade Center building, the creation of an entire city Dubai in its futuristic glory, the beginning of Masdar City entirely powered by the sun,etc.\n\nThink about what the next 15 years will bring for you and what will become reality. Do you want to miss out on that?  Also treatment for depression will invariably improve and if nothing helps now, maybe a few years from now there will be something that does.  In the next 15 years they might have drugs that can make us happier and smarter.  If you can survive that long, you would have decades to enjoy your life.\n\nIf you end your life now, you might miss out on some pretty amazing stuff....", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey I&amp;#39;m 30 but when I was 16 I also wanted to kill myself- even though I still feel that way to this day- I have managed to survive.  If I had killed myself I wouldn&amp;#39;t have seen Obama become president, I wouldn&amp;#39;t have seen gay marriage become legal, I wouldn&amp;#39;t have seen the creation of Oculus Rift,Google Glass,Google Car, the new World Trade Center building, the creation of an entire city Dubai in its futuristic glory, the beginning of Masdar City entirely powered by the sun,etc.&lt;/p&gt;\n\n&lt;p&gt;Think about what the next 15 years will bring for you and what will become reality. Do you want to miss out on that?  Also treatment for depression will invariably improve and if nothing helps now, maybe a few years from now there will be something that does.  In the next 15 years they might have drugs that can make us happier and smarter.  If you can survive that long, you would have decades to enjoy your life.&lt;/p&gt;\n\n&lt;p&gt;If you end your life now, you might miss out on some pretty amazing stuff....&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24bpnd", "score_hidden": false, "name": "t1_ch5jwhu", "created": 1398847857.0, "author_flair_text": null, "created_utc": 1398819057.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]