[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She had the child porn. I gave it to the cops after the divorce. They did nothing. And for... Other reasons I can&amp;#39;t shout it out to everyone. It makes me so angry that I want to down every pill in the house - All the painkillers so I won&amp;#39;t feel it. All the anti anxiety meds so I won&amp;#39;t care. All the alcohol so I&amp;#39;ll be hulk-levels of raged out. Then wrist slitting (my EMT friend suggested that an x over the interior elbow is hardest to stitch up)...&lt;/p&gt;\n\n&lt;p&gt;Why do I feel like doing this over someone else? &lt;/p&gt;\n\n&lt;p&gt;Because I know. Because I know and I have to stay silent for legal reasons. Because I let It fuck me so I&amp;#39;m close enough to know this shit - if It weren&amp;#39;t my ex I would have never found the files. Fuck I do not want any part of this fucking world ever again.&lt;/p&gt;\n\n&lt;p&gt;Let&lt;/p&gt;\n\n&lt;p&gt;Me&lt;/p&gt;\n\n&lt;p&gt;Out&lt;/p&gt;\n\n&lt;p&gt;I need another drink. And a lot more than that...&lt;/p&gt;\n\n&lt;p&gt;Edit: SO had weird timing and is watching over me tonight. Direct your attention to those who need it more. Not drunks like me. &lt;/p&gt;\n\n&lt;p&gt;Edit edit: mods feel free to delete if appropriate. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "She had the child porn. I gave it to the cops after the divorce. They did nothing. And for... Other reasons I can't shout it out to everyone. It makes me so angry that I want to down every pill in the house - All the painkillers so I won't feel it. All the anti anxiety meds so I won't care. All the alcohol so I'll be hulk-levels of raged out. Then wrist slitting (my EMT friend suggested that an x over the interior elbow is hardest to stitch up)...\n\nWhy do I feel like doing this over someone else? \n\nBecause I know. Because I know and I have to stay silent for legal reasons. Because I let It fuck me so I'm close enough to know this shit - if It weren't my ex I would have never found the files. Fuck I do not want any part of this fucking world ever again.\n\nLet\n\nMe\n\nOut\n\nI need another drink. And a lot more than that...\n\n\nEdit: SO had weird timing and is watching over me tonight. Direct your attention to those who need it more. Not drunks like me. \n\nEdit edit: mods feel free to delete if appropriate. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2537by", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Aisenth", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": 1399598329.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2537by/why_do_i_want_to_do_this_to_punish_someone_else/", "name": "t3_2537by", "created": 1399624310.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2537by/why_do_i_want_to_do_this_to_punish_someone_else/", "author_flair_text": null, "title": "Why do I want to do this to punish someone else??", "created_utc": 1399595510.0, "ups": 5, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdin88", "gilded": 0, "author": "Aisenth", "parent_id": "t1_chdc0au", "approved_by": null, "body": "She doesn't have access to kids so not really. Doesn't make it any less disgusting and wrong but it's one of the major reasons the cops gave for refusing to open a case.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She doesn&amp;#39;t have access to kids so not really. Doesn&amp;#39;t make it any less disgusting and wrong but it&amp;#39;s one of the major reasons the cops gave for refusing to open a case.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdin88", "created": 1399658215.0, "author_flair_text": null, "created_utc": 1399629415.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdc0au", "gilded": 0, "author": "TangentialThreat", "parent_id": "t1_chdan56", "approved_by": null, "body": "Do you feel that she is dangerous?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you feel that she is dangerous?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdc0au", "created": 1399633313.0, "author_flair_text": null, "created_utc": 1399604513.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chdiy35", "gilded": 0, "author": "Aisenth", "parent_id": "t1_chdc4g9", "approved_by": null, "body": "Dealing with local cops. \n\nAnd no I didn't know.\n\nOf course it's a crime. Why do you think I took it to the police? But: It's too old, she didn't make it, and she has no one in her family or our social circle with kids so there wasn't anyone in \"imminent danger.\" And she couldn't lead them to anyone who had been producing it. Going to court would look like I'd made all this up in the wake of a very bad breakup.\n\nThe police did file it as a suspicious incident.\n\nI had no idea until after she moved out and left a few DVRs that she'd burned to save from her old computer - mixed in with old mp3 CDRs and random other junk. Stuff never touched my comp except through a preview window.\n\nA bitter part of me wants to whine that justice is only for those who can afford it. But that's not true. We have a Justice System. I went through that system. The results are not unjust simply because I dislike them. Justice means that they had to consider her innocent until proven guilty and a few ancient DVRs weren't nearly enough for them to go bashing down her door and seizing her computer. The police weren't lazy, I just happened to be working with one who respected those boundaries. \n\nThat being said, I hit really bad depressed moments like last night where I feel so disgusted that I didn't see sooner how horrific a person she was. I get wasted and feel like I can't come up with enough good to balance out the wrong. And I just get so fucking tired of hanging on.\n\nAnd: Yes, my SO - current partner - came over and stayed with me all last night. Sobered me up so I could head to work today.\n\nI don't have any contact with my ex whatsoever. Cut it off when she moved out. Bit of depressed google stalking makes it look like she lost her job and was couch surfing in a shithole part of the state. So maybe having it \"just noted as a suspicious incident\" was enough to cost her that. Maybe it was karma. I don't know. \n\n\nEdit: misread what you wrote. And yes, given that it was saved with a bunch of the \"novels\" she was writing (non-con, really violent smut), she knew. ", "edited": 1399631497.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dealing with local cops. &lt;/p&gt;\n\n&lt;p&gt;And no I didn&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;Of course it&amp;#39;s a crime. Why do you think I took it to the police? But: It&amp;#39;s too old, she didn&amp;#39;t make it, and she has no one in her family or our social circle with kids so there wasn&amp;#39;t anyone in &amp;quot;imminent danger.&amp;quot; And she couldn&amp;#39;t lead them to anyone who had been producing it. Going to court would look like I&amp;#39;d made all this up in the wake of a very bad breakup.&lt;/p&gt;\n\n&lt;p&gt;The police did file it as a suspicious incident.&lt;/p&gt;\n\n&lt;p&gt;I had no idea until after she moved out and left a few DVRs that she&amp;#39;d burned to save from her old computer - mixed in with old mp3 CDRs and random other junk. Stuff never touched my comp except through a preview window.&lt;/p&gt;\n\n&lt;p&gt;A bitter part of me wants to whine that justice is only for those who can afford it. But that&amp;#39;s not true. We have a Justice System. I went through that system. The results are not unjust simply because I dislike them. Justice means that they had to consider her innocent until proven guilty and a few ancient DVRs weren&amp;#39;t nearly enough for them to go bashing down her door and seizing her computer. The police weren&amp;#39;t lazy, I just happened to be working with one who respected those boundaries. &lt;/p&gt;\n\n&lt;p&gt;That being said, I hit really bad depressed moments like last night where I feel so disgusted that I didn&amp;#39;t see sooner how horrific a person she was. I get wasted and feel like I can&amp;#39;t come up with enough good to balance out the wrong. And I just get so fucking tired of hanging on.&lt;/p&gt;\n\n&lt;p&gt;And: Yes, my SO - current partner - came over and stayed with me all last night. Sobered me up so I could head to work today.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any contact with my ex whatsoever. Cut it off when she moved out. Bit of depressed google stalking makes it look like she lost her job and was couch surfing in a shithole part of the state. So maybe having it &amp;quot;just noted as a suspicious incident&amp;quot; was enough to cost her that. Maybe it was karma. I don&amp;#39;t know. &lt;/p&gt;\n\n&lt;p&gt;Edit: misread what you wrote. And yes, given that it was saved with a bunch of the &amp;quot;novels&amp;quot; she was writing (non-con, really violent smut), she knew. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdiy35", "created": 1399660092.0, "author_flair_text": null, "created_utc": 1399631292.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdc4g9", "gilded": 0, "author": "Dogg_92", "parent_id": "t1_chdan56", "approved_by": null, "body": "But she was in possession of the files, correct?? Did she know she was in possession of the files? She has committed a crime according to 18 U.S.C. § 2252- Certain activities relating to material involving the sexual exploitation of minors (Possession, distribution and receipt of child pornography). Here is the source where I got this from: http://www.justice.gov/criminal/ceos/citizensguide/citizensguide_porn.html\n\n\nHave you been dealing with the local city police? Or have you been dealing with the state or federal police (FBI)? It sounds like the police are being really lazy. Here is the government website where you can report this crime to the FBI: http://www.missingkids.com/cybertipline/\n\nI really hope things get better for you. When you said that your SO was watching over you, does that mean \"Significant Other\"? Do you have any other contact with this person that had the porn?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But she was in possession of the files, correct?? Did she know she was in possession of the files? She has committed a crime according to 18 U.S.C. § 2252- Certain activities relating to material involving the sexual exploitation of minors (Possession, distribution and receipt of child pornography). Here is the source where I got this from: &lt;a href=\"http://www.justice.gov/criminal/ceos/citizensguide/citizensguide_porn.html\"&gt;http://www.justice.gov/criminal/ceos/citizensguide/citizensguide_porn.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Have you been dealing with the local city police? Or have you been dealing with the state or federal police (FBI)? It sounds like the police are being really lazy. Here is the government website where you can report this crime to the FBI: &lt;a href=\"http://www.missingkids.com/cybertipline/\"&gt;http://www.missingkids.com/cybertipline/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I really hope things get better for you. When you said that your SO was watching over you, does that mean &amp;quot;Significant Other&amp;quot;? Do you have any other contact with this person that had the porn?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdc4g9", "created": 1399633576.0, "author_flair_text": null, "created_utc": 1399604776.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdan56", "gilded": 0, "author": "Aisenth", "parent_id": "t1_chdaess", "approved_by": null, "body": "I am in the US, but the police won't follow up. She was not \"involved in the A**direct** exploration of children.\" Police filed a note about it but there was no way to press charges. They're too overworked here to follow up on every instance.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am in the US, but the police won&amp;#39;t follow up. She was not &amp;quot;involved in the A&lt;strong&gt;direct&lt;/strong&gt; exploration of children.&amp;quot; Police filed a note about it but there was no way to press charges. They&amp;#39;re too overworked here to follow up on every instance.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdan56", "created": 1399630350.0, "author_flair_text": null, "created_utc": 1399601550.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chdaess", "gilded": 0, "author": "Dogg_92", "parent_id": "t1_chd9xpv", "approved_by": null, "body": "I'm not sure if I understand, but is this what you are saying: your ex had kiddy porn files, but the police can't do anything because she didn't make it? I understand if you can't say yes or no due to a legal lawsuit. \n\nWhere are you located? Here in the States, you get charged for possession of child porn, whether or not you made it doesn't matter. Was she in possession of the porn? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if I understand, but is this what you are saying: your ex had kiddy porn files, but the police can&amp;#39;t do anything because she didn&amp;#39;t make it? I understand if you can&amp;#39;t say yes or no due to a legal lawsuit. &lt;/p&gt;\n\n&lt;p&gt;Where are you located? Here in the States, you get charged for possession of child porn, whether or not you made it doesn&amp;#39;t matter. Was she in possession of the porn? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chdaess", "created": 1399629888.0, "author_flair_text": null, "created_utc": 1399601088.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd9xpv", "gilded": 0, "author": "Aisenth", "parent_id": "t1_chd9jc2", "approved_by": null, "body": "Thank you. \n\nI just... You think you know that you'd do the black-and-white Right thing to do. I mean. It doesn't get any more clear than fucking kiddy porn. And the police said they can't do anything because she wasn't MAKING it. So.. All that waits if I put the word out is a defamation lawsuit that I know I can't afford and my lawyer has warned me about... Going into thousands MORE in legal fees would cripple me and those I love. \n\nI just feel like I'm enabling a pedo. So when I get drunk I feel like that is enough to make me deserve to die just like I believe she does. I don't do well with moral grey.    ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. &lt;/p&gt;\n\n&lt;p&gt;I just... You think you know that you&amp;#39;d do the black-and-white Right thing to do. I mean. It doesn&amp;#39;t get any more clear than fucking kiddy porn. And the police said they can&amp;#39;t do anything because she wasn&amp;#39;t MAKING it. So.. All that waits if I put the word out is a defamation lawsuit that I know I can&amp;#39;t afford and my lawyer has warned me about... Going into thousands MORE in legal fees would cripple me and those I love. &lt;/p&gt;\n\n&lt;p&gt;I just feel like I&amp;#39;m enabling a pedo. So when I get drunk I feel like that is enough to make me deserve to die just like I believe she does. I don&amp;#39;t do well with moral grey.    &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chd9xpv", "created": 1399628975.0, "author_flair_text": null, "created_utc": 1399600175.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chd9jc2", "gilded": 0, "author": "Dogg_92", "parent_id": "t3_2537by", "approved_by": null, "body": "I know you said that someone else is watching over you tonight. But, I just wanted to let you know that I read this. If I could give you a hug, I would. I'm not exactly sure what is going on in your situation, but it sounds like you are under a LOT of stress. I'm not exactly sure what to say, but I just wanted to let you know that I do not want you to kill yourself. I don't know who you are, where you live, or what your situation is. But that doesn't matter. All I know is that you are human, and for that simple reason, you deserve life. I wish the best for you. Please stay safe.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you said that someone else is watching over you tonight. But, I just wanted to let you know that I read this. If I could give you a hug, I would. I&amp;#39;m not exactly sure what is going on in your situation, but it sounds like you are under a LOT of stress. I&amp;#39;m not exactly sure what to say, but I just wanted to let you know that I do not want you to kill yourself. I don&amp;#39;t know who you are, where you live, or what your situation is. But that doesn&amp;#39;t matter. All I know is that you are human, and for that simple reason, you deserve life. I wish the best for you. Please stay safe.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2537by", "score_hidden": false, "name": "t1_chd9jc2", "created": 1399628213.0, "author_flair_text": null, "created_utc": 1399599413.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]