[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After waking up for one morning, I wanted to kill myself for no apparent reason. Maybe it&amp;#39;s because I work every morning and don&amp;#39;t have enough free time for friends as their schedules are busy. But now, I am really trying to do better. I already attempted once almost 2 years ago, and now I choose to live. I am trying to balance working 60+ hours a week with life as I&amp;#39;m 26, and my youth is draining. I&amp;#39;m trying to make time to work out, and now I&amp;#39;m trying &lt;a href=\"/r/nofap\"&gt;/r/nofap&lt;/a&gt;, and just enjoy life alone at home with a couple friends. I live by myself, and I do get lonely from time to time, but that&amp;#39;s because my lifestyle habits were always bad; I ate junk food, even though I have high metabolism. I resented having autism a lot, thinking I should die because I think I&amp;#39;m too socially awkward for anyone, now I&amp;#39;m transitioning to not caring about what people think so much. I&amp;#39;m just trying to be myself. of course, never had a girlfriend. I&amp;#39;m just going to &amp;quot;hang out&amp;quot; as a friend with this one girl, but not try to be intimate as I am the one to not make moves because I&amp;#39;m shy and I&amp;#39;m afraid of getting shut out making one mistake. i.e. trying to kiss her when I think the moment is right, then she thinks i&amp;#39;m a creep and avoids me forever. Well, wish me luck. I am trying to see a therapist, but I think internet info would be best. I&amp;#39;m not expecting anyone here to be an online therapist, but I would like some suggestions. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After waking up for one morning, I wanted to kill myself for no apparent reason. Maybe it's because I work every morning and don't have enough free time for friends as their schedules are busy. But now, I am really trying to do better. I already attempted once almost 2 years ago, and now I choose to live. I am trying to balance working 60+ hours a week with life as I'm 26, and my youth is draining. I'm trying to make time to work out, and now I'm trying /r/nofap, and just enjoy life alone at home with a couple friends. I live by myself, and I do get lonely from time to time, but that's because my lifestyle habits were always bad; I ate junk food, even though I have high metabolism. I resented having autism a lot, thinking I should die because I think I'm too socially awkward for anyone, now I'm transitioning to not caring about what people think so much. I'm just trying to be myself. of course, never had a girlfriend. I'm just going to \"hang out\" as a friend with this one girl, but not try to be intimate as I am the one to not make moves because I'm shy and I'm afraid of getting shut out making one mistake. i.e. trying to kiss her when I think the moment is right, then she thinks i'm a creep and avoids me forever. Well, wish me luck. I am trying to see a therapist, but I think internet info would be best. I'm not expecting anyone here to be an online therapist, but I would like some suggestions. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24m49e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "PatrickIIDX", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/24m49e/woke_up_one_morning_thought_of_suicide/", "name": "t3_24m49e", "created": 1399143678.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/24m49e/woke_up_one_morning_thought_of_suicide/", "author_flair_text": null, "title": "Woke up one morning thought of suicide.", "created_utc": 1399114878.0, "ups": 2, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "ch8m3ae", "gilded": 0, "author": "ColorMeReckless", "parent_id": "t3_24m49e", "approved_by": null, "body": "You're already seeking help, which is great. Keep in mind that transitioning is sometimes the worst part. You're changing now, whether you believe it or not. You're desire to improve indicates that.\n\nGive yourself some time. You can't rush breaking out of your shell. It's a slow process but it's one worth taking.  \n\nAlso, I suggest cutting out the junk food. Crap can bog down the system and make people feel shittier than usual. Try eating more fruits, vegetables, and protein. Mineral/Vitamin deficiencies can cause a slew of health problems as well. It sucks eating healthy but you'll feel better overall.\n\nThings will get better eventually. Just weather the storm and everything will be alright.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re already seeking help, which is great. Keep in mind that transitioning is sometimes the worst part. You&amp;#39;re changing now, whether you believe it or not. You&amp;#39;re desire to improve indicates that.&lt;/p&gt;\n\n&lt;p&gt;Give yourself some time. You can&amp;#39;t rush breaking out of your shell. It&amp;#39;s a slow process but it&amp;#39;s one worth taking.  &lt;/p&gt;\n\n&lt;p&gt;Also, I suggest cutting out the junk food. Crap can bog down the system and make people feel shittier than usual. Try eating more fruits, vegetables, and protein. Mineral/Vitamin deficiencies can cause a slew of health problems as well. It sucks eating healthy but you&amp;#39;ll feel better overall.&lt;/p&gt;\n\n&lt;p&gt;Things will get better eventually. Just weather the storm and everything will be alright.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_24m49e", "score_hidden": false, "name": "t1_ch8m3ae", "created": 1399165527.0, "author_flair_text": null, "created_utc": 1399136727.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]