[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t made for this. I&amp;#39;m bound to be this way forever anyways.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I wasn't made for this. I'm bound to be this way forever anyways.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "2572hk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "limbooo", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/2572hk/yea_im_done/", "name": "t3_2572hk", "created": 1399739795.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/2572hk/yea_im_done/", "author_flair_text": null, "title": "Yea. I'm done.", "created_utc": 1399710995.0, "ups": 4, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chess6d", "gilded": 0, "author": "limbooo", "parent_id": "t1_chepz16", "approved_by": null, "body": "Yea. I guess a lot of that made sense logically. But some things just defy logic, thanks though, have a good weekend too", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea. I guess a lot of that made sense logically. But some things just defy logic, thanks though, have a good weekend too&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chess6d", "created": 1399795333.0, "author_flair_text": null, "created_utc": 1399766533.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "chepz16", "gilded": 0, "author": "tryify", "parent_id": "t3_2572hk", "approved_by": null, "body": "You sound pretty empathic, and your sudden onset depression... was it an external stimuli, or was it some sort of information that you processed internally, thus changing your world view? Or was it caused by physical pain/distress, perhaps caused by an illness or disease that you have to live with? Or did you always have the depression, it just suddenly got worse?\n\nYou recommended I look at past comments so I did.\n\nIt sounds like a lot of your depression comes from what I call risk aversion niche switching, r.a.n.s.\n\nThere's a spillover affect of failure in that singular instances of failure, when not properly assessed and compartmentalized correctly as historical data points from which to learn and rather as signs of continued failure on the part of the actor disproportionately causes you to underestimate your own ability and mastery of environment in even completely unrelated future calculations.\n\nThis reduction in the sense of self may stem from one area of life that mystifies you or many others, such as finding someone to spend time with.\n\nLet's say that mate selection is something in human society where female sexual selection for a mate occurs on asymmetric lines to what men are conditioned to believe women want.\n\nR.a.n.s. is the period of time that occurs in the brain after a moment of rejection. If pain of rejection is outsized in an individual due to a lack of coping mechanisms for the rejection (no bro to fistbump, no one to call up and rant or talk to) and a lack of understanding of the points of failure then there remains with the subject both an inability to properly improve future attempts, and a persistent reduced sense of ability of self (that is supposed to be ameliorated by those who would encourage you in your endeavors).\n\nSome of this is society's fault, actually a lot of it is. It trains us that being independent is being strong, when in my opinion this overstated reliance on \"independence\" really means \"forget the interconnected network of friends and family who really like you and care for you, buy into our system of goods and services and working to pay for them instead\". So while a good friend might tell you a reality you cannot perceive from your current viewpoint \"Hey man I saw what went down at the bar, don't worry she just was there to have fun not get into a long-term relationship\" or things like \"Hey bro try relax man, you're not trying to scare her off with your thoughts of marriage on the first date are you? Just focus on having a good time\".\n\nWhen faced with rejection or defeat people will try to search for answers as to why they failed. Relationships are sometimes a raw numbers game, and creating a buffer zone where you can separate your failed attempts at getting a girl (hint, the reason why it's called \"the one\" isn't because there is literally 1 person out there for you in most cases, but because deep, meaningful compatibility, chemistry, and goal-sharing really is rare and has to be worked towards mutually, something a lot of people don't understand) from your own sense of worth as a person.\n\nStop thinking along the lines of \"I'm so worthless, life sucks, my attempts are futile\" to \"This entity did not recognize my value. Are they correct in their assessment? Who has a positive assessment of my value? Who has a negative one? What are ways that I can improve my standing on multiple levels as to increase my marketability and true underlying market value?\"\n\nLet's say you are a company. You would want to design your systems, habits, culture, etc. around the concept of longevity, appropriate and insightful responses to challenges, the promotion of good health and the accomplishment of desired goals. You would want to balance long and short-term goals such that you could maximize your overall output levels in a way that was balanced with your environment. To do so you need to perfect your internal systems efficiency. Because you are one company among many (not a monopoly) you do not have control over the demand for your own product, you simply have control over the quality of your product, how it is marketed, and how efficiently you can produce it, as well as how you innovate and plan for future shifts in demand and meeting those needs.\n\nLet's say an event impedes your capability to produce. What caused this? Was there an internal issue or conflict between management and labor? Did the members of your company not like the direction you were headed? It is important to wrestle appropriately with any moralistic battles you may have before pressing forward with previously considered courses of action.\n\nAlso, your family believes in you and supports you for a reason. They know that you were capable of getting into school and completing the first year with ease. They may not know the depths of your internal struggle, but surely they can see some of the external symptoms and worry for you. That they are still supportive of you hints at their accepting nature of your situation, and you need not worry about having failed them, for it's quite possible they completely accept you as you are and just want to give you the time to come to your own understandings of the way your mind and the world work and interact.\n\nThese are all hypothetical and I have no idea what your condition is or what bothers you on a day to day basis. I do hope we talk again soon and you have a good weekend, my friend.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound pretty empathic, and your sudden onset depression... was it an external stimuli, or was it some sort of information that you processed internally, thus changing your world view? Or was it caused by physical pain/distress, perhaps caused by an illness or disease that you have to live with? Or did you always have the depression, it just suddenly got worse?&lt;/p&gt;\n\n&lt;p&gt;You recommended I look at past comments so I did.&lt;/p&gt;\n\n&lt;p&gt;It sounds like a lot of your depression comes from what I call risk aversion niche switching, r.a.n.s.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a spillover affect of failure in that singular instances of failure, when not properly assessed and compartmentalized correctly as historical data points from which to learn and rather as signs of continued failure on the part of the actor disproportionately causes you to underestimate your own ability and mastery of environment in even completely unrelated future calculations.&lt;/p&gt;\n\n&lt;p&gt;This reduction in the sense of self may stem from one area of life that mystifies you or many others, such as finding someone to spend time with.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say that mate selection is something in human society where female sexual selection for a mate occurs on asymmetric lines to what men are conditioned to believe women want.&lt;/p&gt;\n\n&lt;p&gt;R.a.n.s. is the period of time that occurs in the brain after a moment of rejection. If pain of rejection is outsized in an individual due to a lack of coping mechanisms for the rejection (no bro to fistbump, no one to call up and rant or talk to) and a lack of understanding of the points of failure then there remains with the subject both an inability to properly improve future attempts, and a persistent reduced sense of ability of self (that is supposed to be ameliorated by those who would encourage you in your endeavors).&lt;/p&gt;\n\n&lt;p&gt;Some of this is society&amp;#39;s fault, actually a lot of it is. It trains us that being independent is being strong, when in my opinion this overstated reliance on &amp;quot;independence&amp;quot; really means &amp;quot;forget the interconnected network of friends and family who really like you and care for you, buy into our system of goods and services and working to pay for them instead&amp;quot;. So while a good friend might tell you a reality you cannot perceive from your current viewpoint &amp;quot;Hey man I saw what went down at the bar, don&amp;#39;t worry she just was there to have fun not get into a long-term relationship&amp;quot; or things like &amp;quot;Hey bro try relax man, you&amp;#39;re not trying to scare her off with your thoughts of marriage on the first date are you? Just focus on having a good time&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;When faced with rejection or defeat people will try to search for answers as to why they failed. Relationships are sometimes a raw numbers game, and creating a buffer zone where you can separate your failed attempts at getting a girl (hint, the reason why it&amp;#39;s called &amp;quot;the one&amp;quot; isn&amp;#39;t because there is literally 1 person out there for you in most cases, but because deep, meaningful compatibility, chemistry, and goal-sharing really is rare and has to be worked towards mutually, something a lot of people don&amp;#39;t understand) from your own sense of worth as a person.&lt;/p&gt;\n\n&lt;p&gt;Stop thinking along the lines of &amp;quot;I&amp;#39;m so worthless, life sucks, my attempts are futile&amp;quot; to &amp;quot;This entity did not recognize my value. Are they correct in their assessment? Who has a positive assessment of my value? Who has a negative one? What are ways that I can improve my standing on multiple levels as to increase my marketability and true underlying market value?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say you are a company. You would want to design your systems, habits, culture, etc. around the concept of longevity, appropriate and insightful responses to challenges, the promotion of good health and the accomplishment of desired goals. You would want to balance long and short-term goals such that you could maximize your overall output levels in a way that was balanced with your environment. To do so you need to perfect your internal systems efficiency. Because you are one company among many (not a monopoly) you do not have control over the demand for your own product, you simply have control over the quality of your product, how it is marketed, and how efficiently you can produce it, as well as how you innovate and plan for future shifts in demand and meeting those needs.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say an event impedes your capability to produce. What caused this? Was there an internal issue or conflict between management and labor? Did the members of your company not like the direction you were headed? It is important to wrestle appropriately with any moralistic battles you may have before pressing forward with previously considered courses of action.&lt;/p&gt;\n\n&lt;p&gt;Also, your family believes in you and supports you for a reason. They know that you were capable of getting into school and completing the first year with ease. They may not know the depths of your internal struggle, but surely they can see some of the external symptoms and worry for you. That they are still supportive of you hints at their accepting nature of your situation, and you need not worry about having failed them, for it&amp;#39;s quite possible they completely accept you as you are and just want to give you the time to come to your own understandings of the way your mind and the world work and interact.&lt;/p&gt;\n\n&lt;p&gt;These are all hypothetical and I have no idea what your condition is or what bothers you on a day to day basis. I do hope we talk again soon and you have a good weekend, my friend.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chepz16", "created": 1399788124.0, "author_flair_text": null, "created_utc": 1399759324.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chec0gq", "gilded": 0, "author": "limbooo", "parent_id": "t1_chebye7", "approved_by": null, "body": "Read previous post I've made . Tired of typing it", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read previous post I&amp;#39;ve made . Tired of typing it&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chec0gq", "created": 1399740759.0, "author_flair_text": null, "created_utc": 1399711959.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chebye7", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2572hk", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chebye7", "created": 1399740381.0, "author_flair_text": null, "created_utc": 1399711581.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfqky8", "gilded": 0, "author": "Truh-Truh", "parent_id": "t1_chfm4ze", "approved_by": null, "body": "Then your parents are stupid. You need to be helped, not rejected. Seek out help of your own volition. There's bound to be somewhere near you you can get help or at least advice\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then your parents are stupid. You need to be helped, not rejected. Seek out help of your own volition. There&amp;#39;s bound to be somewhere near you you can get help or at least advice&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chfqky8", "created": 1399900579.0, "author_flair_text": null, "created_utc": 1399871779.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chfm4ze", "gilded": 0, "author": "limbooo", "parent_id": "t1_chflex8", "approved_by": null, "body": "Yea. I just don't care to try anymore, don't even know where to start. Parents getting tired of me being an empty shell with no future prospects.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea. I just don&amp;#39;t care to try anymore, don&amp;#39;t even know where to start. Parents getting tired of me being an empty shell with no future prospects.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chfm4ze", "created": 1399889085.0, "author_flair_text": null, "created_utc": 1399860285.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chflex8", "gilded": 0, "author": "Truh-Truh", "parent_id": "t1_chf1ggf", "approved_by": null, "body": "You think that now, but give it a shot. If you kill yourself as a solution, then you can't try any other possible solutions. Best to exhaust every other possibility before you take any drastic measures.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You think that now, but give it a shot. If you kill yourself as a solution, then you can&amp;#39;t try any other possible solutions. Best to exhaust every other possibility before you take any drastic measures.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chflex8", "created": 1399887355.0, "author_flair_text": null, "created_utc": 1399858555.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf1ggf", "gilded": 0, "author": "limbooo", "parent_id": "t1_chf1d69", "approved_by": null, "body": "Even if I talk they can't help me. People talk too much anyways", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if I talk they can&amp;#39;t help me. People talk too much anyways&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chf1ggf", "created": 1399822025.0, "author_flair_text": null, "created_utc": 1399793225.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chf1d69", "gilded": 0, "author": "Truh-Truh", "parent_id": "t1_chez05v", "approved_by": null, "body": "I think it would worry them far more if you killed yourself. Anyone would rather you worry them for help than worry them for a funeral.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it would worry them far more if you killed yourself. Anyone would rather you worry them for help than worry them for a funeral.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chf1d69", "created": 1399821539.0, "author_flair_text": null, "created_utc": 1399792739.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chez05v", "gilded": 0, "author": "limbooo", "parent_id": "t1_chey1k9", "approved_by": null, "body": "yea. i dont have the need to talk to anyone about it really, if i really wanted to end it no one can really do anything, rather not worry em", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea. i dont have the need to talk to anyone about it really, if i really wanted to end it no one can really do anything, rather not worry em&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chez05v", "created": 1399812356.0, "author_flair_text": null, "created_utc": 1399783556.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "chey1k9", "gilded": 0, "author": "Truh-Truh", "parent_id": "t1_cheljyp", "approved_by": null, "body": "I know it might look like that, but if the alternative is wanting to kill yourself, then why not? Any option to get yourself out of where you are now, right?  \nFind someone; a councilor, a friend, a random dude on the street. It can't hurt to try as much as you can before you adopt the permanent solution to a problem that doesn't have to be.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it might look like that, but if the alternative is wanting to kill yourself, then why not? Any option to get yourself out of where you are now, right?&lt;br/&gt;\nFind someone; a councilor, a friend, a random dude on the street. It can&amp;#39;t hurt to try as much as you can before you adopt the permanent solution to a problem that doesn&amp;#39;t have to be.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_chey1k9", "created": 1399809490.0, "author_flair_text": null, "created_utc": 1399780690.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cheljyp", "gilded": 0, "author": "limbooo", "parent_id": "t1_cheecw3", "approved_by": null, "body": "Yea. One thing I cannot do is talk to people about how I feel.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea. One thing I cannot do is talk to people about how I feel.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_cheljyp", "created": 1399776681.0, "author_flair_text": null, "created_utc": 1399747881.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cheecw3", "gilded": 0, "author": "[deleted]", "parent_id": "t3_2572hk", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_2572hk", "score_hidden": false, "name": "t1_cheecw3", "created": 1399755436.0, "author_flair_text": null, "created_utc": 1399726636.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]