[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.SuicideWatch", "banned_by": null, "media_embed": {}, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;but yet when somebody goes through with the act it suddenly becomes &amp;quot;what a selfish asshole&amp;quot;. This goes especially if that person jumps in front of a train, because then he &amp;quot;traumatizes the conductor and makes people late for work&amp;quot;. Because I&amp;#39;m sure somebody so desperate that they want to off themselves cares about such things. &lt;/p&gt;\n\n&lt;p&gt;This goes for mental health in general as well. So many people claim to care but when push comes to shove (no pun) and it&amp;#39;s time to actually help you find they were blowing smoke up your ass the whole time - all the posturing about &amp;quot;preventing suicide&amp;quot; and caring for those with mental health issues - it&amp;#39;s just words people tell themselves because they want to think they are &amp;quot;nice and caring&amp;quot; cause that feels good. Actually dealing with these issues and those who suffer from them, that does not feel good, but quite the opposite. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not suicidal right now and don&amp;#39;t anticipate I will be anytime soon but I still have a great many mental health issues to deal with (that I keep mostly hidden from others). The lack of genuine support available is incredibly frustrating on it&amp;#39;s own, but all the hypocrisy on top of it makes it down right maddening. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "but yet when somebody goes through with the act it suddenly becomes \"what a selfish asshole\". This goes especially if that person jumps in front of a train, because then he \"traumatizes the conductor and makes people late for work\". Because I'm sure somebody so desperate that they want to off themselves cares about such things. \n\nThis goes for mental health in general as well. So many people claim to care but when push comes to shove (no pun) and it's time to actually help you find they were blowing smoke up your ass the whole time - all the posturing about \"preventing suicide\" and caring for those with mental health issues - it's just words people tell themselves because they want to think they are \"nice and caring\" cause that feels good. Actually dealing with these issues and those who suffer from them, that does not feel good, but quite the opposite. \n\nI'm not suicidal right now and don't anticipate I will be anytime soon but I still have a great many mental health issues to deal with (that I keep mostly hidden from others). The lack of genuine support available is incredibly frustrating on it's own, but all the hypocrisy on top of it makes it down right maddening. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25bynq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "mount_shasta", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qpzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/SuicideWatch/comments/25bynq/you_ever_notice_how_so_many_people_claim_to_care/", "name": "t3_25bynq", "created": 1399894737.0, "url": "http://www.reddit.com/r/SuicideWatch/comments/25bynq/you_ever_notice_how_so_many_people_claim_to_care/", "author_flair_text": null, "title": "You ever notice how so many people claim to care about those considering suicide...", "created_utc": 1399865937.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfvc32", "gilded": 0, "author": "mount_shasta", "parent_id": "t1_chfow58", "approved_by": null, "body": "&gt; We live in a society that doesn't publicize suicides for risk of copycats.\n\nThis is another great point I've thought about. I understand the pragmatic reasons for not wanting to publicize suicide incidents but it's always rubbed me the wrong way because it's really just another slap in the face to the mentally ill. It's basically saying we don't/shouldn't exist, or at the very least we need to be hidden from view. \n\nWhen somebody dies of cancer we get all kinds of write ups and memorandums and discussion as to what a horrible disease it is and how it needs to be dealt with and how \"brave\" somebody is for trying to fight it. No such case with suicide even though it's basically the same exact thing - mental illness is a disease, and not everybody can \"beat it\". \n\nIt's a classic case of not wanting to deal with a problem cause it's too uncomfortable and has no easy solutions, so let's just pretend it doesn't exist or is brought on by the victim themselves. Unfortunately unlike with cancer it's completely socially acceptable to take this attitude with mental illness. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We live in a society that doesn&amp;#39;t publicize suicides for risk of copycats.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is another great point I&amp;#39;ve thought about. I understand the pragmatic reasons for not wanting to publicize suicide incidents but it&amp;#39;s always rubbed me the wrong way because it&amp;#39;s really just another slap in the face to the mentally ill. It&amp;#39;s basically saying we don&amp;#39;t/shouldn&amp;#39;t exist, or at the very least we need to be hidden from view. &lt;/p&gt;\n\n&lt;p&gt;When somebody dies of cancer we get all kinds of write ups and memorandums and discussion as to what a horrible disease it is and how it needs to be dealt with and how &amp;quot;brave&amp;quot; somebody is for trying to fight it. No such case with suicide even though it&amp;#39;s basically the same exact thing - mental illness is a disease, and not everybody can &amp;quot;beat it&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a classic case of not wanting to deal with a problem cause it&amp;#39;s too uncomfortable and has no easy solutions, so let&amp;#39;s just pretend it doesn&amp;#39;t exist or is brought on by the victim themselves. Unfortunately unlike with cancer it&amp;#39;s completely socially acceptable to take this attitude with mental illness. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bynq", "score_hidden": false, "name": "t1_chfvc32", "created": 1399924356.0, "author_flair_text": null, "created_utc": 1399895556.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "chfow58", "gilded": 0, "author": "[deleted]", "parent_id": "t3_25bynq", "approved_by": null, "body": "What you've touched on is basically par for the course for mental illness. We live in a society that doesn't publicize suicides for risk of copycats. We live in a world in which mental illness is still seen as a moral failure or divine punishment. To the wider population, we're seen as week, selfish assholes for even considering suicide. \n\nThere is no support here except for ourselves, and even we agree that that there are some situations so untenable that death is the answer. So what answer is out there? I have no idea.  I just understand what you're saying. ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you&amp;#39;ve touched on is basically par for the course for mental illness. We live in a society that doesn&amp;#39;t publicize suicides for risk of copycats. We live in a world in which mental illness is still seen as a moral failure or divine punishment. To the wider population, we&amp;#39;re seen as week, selfish assholes for even considering suicide. &lt;/p&gt;\n\n&lt;p&gt;There is no support here except for ourselves, and even we agree that that there are some situations so untenable that death is the answer. So what answer is out there? I have no idea.  I just understand what you&amp;#39;re saying. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bynq", "score_hidden": false, "name": "t1_chfow58", "created": 1399895649.0, "author_flair_text": null, "created_utc": 1399866849.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "banned_by": null, "subreddit": "SuicideWatch", "likes": null, "replies": "", "saved": false, "id": "chfq7k0", "gilded": 0, "author": "Follow214", "parent_id": "t3_25bynq", "approved_by": null, "body": "The people claim to care yet don't act like it because they haven't been through it. There's that proverb about the walking a mile in another person's shoes that almost applies here. It's like when a soldier returns from war. We haven't experienced it so we can't truly understand it; we can't get these things vicariously.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The people claim to care yet don&amp;#39;t act like it because they haven&amp;#39;t been through it. There&amp;#39;s that proverb about the walking a mile in another person&amp;#39;s shoes that almost applies here. It&amp;#39;s like when a soldier returns from war. We haven&amp;#39;t experienced it so we can&amp;#39;t truly understand it; we can&amp;#39;t get these things vicariously.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_25bynq", "score_hidden": false, "name": "t1_chfq7k0", "created": 1399899401.0, "author_flair_text": null, "created_utc": 1399870601.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]