[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;last night was the first time i snuck out, my first kiss, and this weekend will (hopefully) be the first time i get properly drunk (i&amp;#39;ve been pretty buzzed, but always sober enough) and smoke weed. i&amp;#39;m shocked at the things i&amp;#39;m doing because people see me as moralistic and straight edge but at the same time i am incredibly content because now i&amp;#39;m finally being the person i want to be and not being governed by my strict parents or societal constructs on how i should behave based on my grades and appearance. and i&amp;#39;m not just talking about the rebellion, i&amp;#39;m talking about in everything: music, clothing and makeup, games, movies, the way i speak, etc. I used to hide things because it wasn&amp;#39;t who people thought I was but the way my boyfriend looks at me when i shock him when i share something new i love and the way he accepts it and LIKES it have just made me want to actually share myself with other people in a way that i usually don&amp;#39;t. i just feel incredibly content and secure right now. there&amp;#39;s something so so wonderful about being found beautiful inside and out by another person that just makes you want to give yourself to the world. i&amp;#39;m happy reddit. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "last night was the first time i snuck out, my first kiss, and this weekend will (hopefully) be the first time i get properly drunk (i've been pretty buzzed, but always sober enough) and smoke weed. i'm shocked at the things i'm doing because people see me as moralistic and straight edge but at the same time i am incredibly content because now i'm finally being the person i want to be and not being governed by my strict parents or societal constructs on how i should behave based on my grades and appearance. and i'm not just talking about the rebellion, i'm talking about in everything: music, clothing and makeup, games, movies, the way i speak, etc. I used to hide things because it wasn't who people thought I was but the way my boyfriend looks at me when i shock him when i share something new i love and the way he accepts it and LIKES it have just made me want to actually share myself with other people in a way that i usually don't. i just feel incredibly content and secure right now. there's something so so wonderful about being found beautiful inside and out by another person that just makes you want to give yourself to the world. i'm happy reddit. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "25a8jt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "bobhang", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/happy/comments/25a8jt/a_list_of_firsts/", "name": "t3_25a8jt", "created": 1399850722.0, "url": "http://www.reddit.com/r/happy/comments/25a8jt/a_list_of_firsts/", "author_flair_text": null, "title": "a list of firsts", "created_utc": 1399821922.0, "ups": 7, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]