[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long story short, I&amp;#39;m a second-year university student studying political science, and I&amp;#39;ve come to the realization that both polici and university as a whole just isn&amp;#39;t for me.&lt;/p&gt;\n\n&lt;p&gt;So today I met with my adviser and officially changed to a three year general degree (I didn&amp;#39;t want to just completely drop out of uni).  Then, I will be pursing my dream and go to college for culinary management. &lt;/p&gt;\n\n&lt;p&gt;I am so happy.  I am beyond excited to follow my passion and the more I think about working in a kitchen the rest of my life the more happy I feel.  &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s making me feel even better is the love and support I&amp;#39;ve gotten from my friends and family... it&amp;#39;s almost overwhelming, really!  Brought me to tears that so many people are behind my decision 100%.  &lt;/p&gt;\n\n&lt;p&gt;I seriously can&amp;#39;t wait to start!!!!!! Gahh I can&amp;#39;t stop smiling!! :D&lt;/p&gt;\n\n&lt;p&gt;EDIT:  Also want to add that I had a very promising job interview that I am really excited about. It&amp;#39;s an outdoor maintenance position for the summer in this amazing beautiful town in Northern Ontario.  That also means I&amp;#39;ll get to live at my camp for the summer... and be OUTDOORS!  I&amp;#39;ve only ever had office jobs before so I can&amp;#39;t wait to actually enjoy the nice warm weather, maybe even get a tan hehe &lt;/p&gt;\n\n&lt;p&gt;EDIT#2: I GOT THE JOB!!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Long story short, I'm a second-year university student studying political science, and I've come to the realization that both polici and university as a whole just isn't for me.\n\nSo today I met with my adviser and officially changed to a three year general degree (I didn't want to just completely drop out of uni).  Then, I will be pursing my dream and go to college for culinary management. \n\nI am so happy.  I am beyond excited to follow my passion and the more I think about working in a kitchen the rest of my life the more happy I feel.  \n\nWhat's making me feel even better is the love and support I've gotten from my friends and family... it's almost overwhelming, really!  Brought me to tears that so many people are behind my decision 100%.  \n\nI seriously can't wait to start!!!!!! Gahh I can't stop smiling!! :D\n\n\nEDIT:  Also want to add that I had a very promising job interview that I am really excited about. It's an outdoor maintenance position for the summer in this amazing beautiful town in Northern Ontario.  That also means I'll get to live at my camp for the summer... and be OUTDOORS!  I've only ever had office jobs before so I can't wait to actually enjoy the nice warm weather, maybe even get a tan hehe \n\nEDIT#2: I GOT THE JOB!!!!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "20vi1m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sham_wowza", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": 1395893823.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/20vi1m/change_is_in_the_air_for_the_better_of_course/", "name": "t3_20vi1m", "created": 1395315782.0, "url": "http://www.reddit.com/r/happy/comments/20vi1m/change_is_in_the_air_for_the_better_of_course/", "author_flair_text": null, "title": "Change is in the air (for the better, of course)!", "created_utc": 1395286982.0, "ups": 3, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]