[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So much going on lately.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve quit smoking, got a promotion, decided on saving money for a trip to California (yesterday... I decided this yesterday lol), become a regular at Ulteria (and apparently also a regular stage dancer xP), and just launched a new gaming channel on YouTube.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.youtube.com/MMOGOfficial\"&gt;http://www.youtube.com/MMOGOfficial&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Every day I&amp;#39;ve found some excitement in something. I&amp;#39;ve been trying to sort out my own head lately and I can tell you one thing, despite the storm that constantly rages in my head... things definitely do get better.&lt;/p&gt;\n\n&lt;p&gt;I used to suffer from depression. I was so bad that I used to starve myself and self-harm. I drank too much, I risked too much, and I abused myself too much. I was always so angry, sad, and upset with everything, especially myself.&lt;/p&gt;\n\n&lt;p&gt;I almost literally just woke up one day and decided that this is not how it&amp;#39;s going down. I&amp;#39;m not going to just wallow in what life has dealt me so far and I&amp;#39;m going to enjoy the hell out of everything. I&amp;#39;m going to do what I love and have fun doing it.&lt;/p&gt;\n\n&lt;p&gt;So I launched a YouTube channel because I love to play video games and I love to entertain people. I get a very great feeling from making people smile and laugh. I know not everyone&amp;#39;s going to love it, but I know someone will. As long as someone is smiling with me I&amp;#39;m happy.&lt;/p&gt;\n\n&lt;p&gt;I just want to hug everyone and let them all know that even though I don&amp;#39;t know you, I love you. Things do get better and it&amp;#39;s not always easy. I really do understand. I suffered mental abuse, depression, my mother&amp;#39;s alcoholism, my father&amp;#39;s absenteeism, bad relationships, crappy friends, self-harm, suicidal thoughts, homelessness, and a slew of other not so awesome things. It was a long, hard road out of my own personal hell, but I did it. You can too.&lt;/p&gt;\n\n&lt;p&gt;Love, live, and give freely. Don&amp;#39;t take anyone&amp;#39;s crap and don&amp;#39;t do anything that makes you unhappy for too long. What other people think of you really doesn&amp;#39;t matter. It&amp;#39;s what you think and feel about yourself. Enjoy the hell out of your life. It&amp;#39;s yours. No one has the power to destroy you that you don&amp;#39;t give to them yourself.&lt;/p&gt;\n\n&lt;p&gt;Keep on swimming. :)&lt;/p&gt;\n\n&lt;p&gt;More to come from me, beautiful.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So much going on lately.\n\nI've quit smoking, got a promotion, decided on saving money for a trip to California (yesterday... I decided this yesterday lol), become a regular at Ulteria (and apparently also a regular stage dancer xP), and just launched a new gaming channel on YouTube.\n\nhttp://www.youtube.com/MMOGOfficial\n\nEvery day I've found some excitement in something. I've been trying to sort out my own head lately and I can tell you one thing, despite the storm that constantly rages in my head... things definitely do get better.\n\nI used to suffer from depression. I was so bad that I used to starve myself and self-harm. I drank too much, I risked too much, and I abused myself too much. I was always so angry, sad, and upset with everything, especially myself.\n\nI almost literally just woke up one day and decided that this is not how it's going down. I'm not going to just wallow in what life has dealt me so far and I'm going to enjoy the hell out of everything. I'm going to do what I love and have fun doing it.\n\nSo I launched a YouTube channel because I love to play video games and I love to entertain people. I get a very great feeling from making people smile and laugh. I know not everyone's going to love it, but I know someone will. As long as someone is smiling with me I'm happy.\n\nI just want to hug everyone and let them all know that even though I don't know you, I love you. Things do get better and it's not always easy. I really do understand. I suffered mental abuse, depression, my mother's alcoholism, my father's absenteeism, bad relationships, crappy friends, self-harm, suicidal thoughts, homelessness, and a slew of other not so awesome things. It was a long, hard road out of my own personal hell, but I did it. You can too.\n\nLove, live, and give freely. Don't take anyone's crap and don't do anything that makes you unhappy for too long. What other people think of you really doesn't matter. It's what you think and feel about yourself. Enjoy the hell out of your life. It's yours. No one has the power to destroy you that you don't give to them yourself.\n\nKeep on swimming. :)\n\nMore to come from me, beautiful.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23k4vo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "VenusDoomXO", "media": null, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/happy/comments/23k4vo/chchchchaaangeesss/", "name": "t3_23k4vo", "created": 1398075941.0, "url": "http://www.reddit.com/r/happy/comments/23k4vo/chchchchaaangeesss/", "author_flair_text": null, "title": "Ch-ch-ch-CHAAANGEESSS~", "created_utc": 1398047141.0, "ups": 14, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]