[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;r/happy, I just wanted to share this with you because I know there are readers of this subreddit who, like me, are inspired every day by the wonderful things that people post. I hope this might strike a chord with those of you who needed to read this today! Please bear with me, as this is somewhat of a long post!&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t believe in love. Growing up, I couldn&amp;#39;t help but feel that the sort of love that movies sold was to be dreamed of but never truly found. Each relationship - from the most toxic to the most supportive and healthy - only solidified my knowledge, as I grew to care for my boyfriends without ever truly falling in love. After my most recent breakup, I decided I wanted to take time to discover myself and figure out what was most important to me. I focused my efforts on school and work, while I continued to better myself in any way possible. &lt;/p&gt;\n\n&lt;p&gt;And then, six months ago, I met the most amazing person. He caught my attention the moment he walked in the room, his presence was undeniable. Tall, handsome, a little shy, totally geeky, and with a truly warm personality and manner of speech that captivated me from the beginning. His kindness towards the people around him, his abstinence from mindless gossip, his desire to think and talk about philosophical questions, his humility and yet wisdom about life are all things that have only continued to grow as I&amp;#39;ve come to know him. If it was attraction at first sight, it became the deepest and truest love by the second coffee date. We connected immediately in a way that I have never, ever felt with anyone. &lt;/p&gt;\n\n&lt;p&gt;You must understand I was very wary at first. Even as I could feel myself falling deeper and deeper in love, I reminded myself that love was an illusion invented by fairy tales and Hollywood. &lt;/p&gt;\n\n&lt;p&gt;Still, one month went by and I could no longer deny it - I was undeniably in love, and I couldn&amp;#39;t, and still can&amp;#39;t, stop thanking my lucky stars for having met such an incredible human being. &lt;/p&gt;\n\n&lt;p&gt;After one month, he sat with me at a park underneath the fall foliage, and told me there was something very important he wanted to share with me. He spoke softly and calmly about his struggles with opiate addiction in his early twenties. He told me embarrassedly about how he lied to and stole from his family to support his habit, how he got arrested for legal infringement, how he wound up homeless for more than a year living in a shelter. He paused often as he teared up, and although he held my hands he often couldn&amp;#39;t meet my gaze. He told me how he realized how much he was hurting his family, started seeking therapy and began a methadone program that would get him off the streets. He started the program seven years ago, he told me, and in the past five years he started really wanting to live a completely medication-free lifestyle. He told me that although he still occasionally has PTSD from his past experiences, he&amp;#39;s ultimately grateful for his newfound appreciation for life and love. He&amp;#39;s apologized to his family, and to this day continues to support his mother at home, with whom he now shares a better relationship. &lt;/p&gt;\n\n&lt;p&gt;He concluded by telling me that he understood if it was a lot to take in, and understood if I could no longer see him the same way again - that he would respect my decision should I choose to no longer speak to him. &lt;/p&gt;\n\n&lt;p&gt;I was totally shocked. Having lived a totally sheltered life, I had never been exposed to drugs, nor to the struggles that come with addiction. It was, honestly, a lot to take in. I cried as he told me his story, and as I came to understand the pain he went through and continues to face every day. I hugged him and assured him that if I saw him any differently, it was because I had found a new source of respect for his journey in recovery. &lt;/p&gt;\n\n&lt;p&gt;Not a week later, we started dating. It&amp;#39;s been, honestly, the most amazing, joyous, love filled, healthy relationship I have ever, ever been in. I am more in love today than I was when we first started dating, and I grow more and more convinced that we may end up married someday (something I thought I would never actively desire!). &lt;/p&gt;\n\n&lt;p&gt;Now, as we&amp;#39;ve been dating, I&amp;#39;ve come to understand more and more about addiction, and have had the opportunity to educate myself about the lifelong path to recovery. How little I ever actually knew at all!! The way I once thought about rape - that it was a crime committed mostly by strangers lurking in dark alleys to girls in short skirts, which is what society taught me growing up - I realized I thought about addicts - that they were mostly bad people with weak minds and poor moral values. And just as I came to realize the truth about rape - that it&amp;#39;s a crime mostly committed by acquaintances and friends to men and women alike regardless of manner of dress - I came to realize the truth about addiction - that it&amp;#39;s a debilitating mental illness that could affect anybody, like depression, that requires attention and care for recovery. &lt;/p&gt;\n\n&lt;p&gt;This weekend was a huge, huge deal for us. My boyfriend was going to switch to a different medication, called suboxone, which while not total sobriety, would be a step in the right direction from the methadone program he was attending. Among other things, because his program requires him to come into a clinic every single morning, he has not been able to leave the city in seven long years. The new medicine would not only help him transition to total sobriety by helping to manage the long and painful withdrawal period from the methadone, but also afford him the ability to leave town every once in a while. Making the transition is a calculated risk, as there is a chance a patient&amp;#39;s body will not react well to the medicine, but my boyfriend decided he really wanted to take the leap.&lt;/p&gt;\n\n&lt;p&gt;This weekend, my boyfriend needed to let the methadone completely leave his system so he could start the new medicine. This meant a weekend of violent vomiting and diarrhea, cold chills, sweating, and general anxiety, among other symptoms. It was a long, long weekend with lots of cuddling, lots of blankets, lots of warm soaks in the bath, and lots of bathroom. All in all not a pretty time. Side note: I was so touched that while he was in full withdrawal, he still offered to make me coffee, still massaged my back as I was falling asleep, and still apologized every time he came back to bed for accidentally waking me up. &lt;/p&gt;\n\n&lt;p&gt;Tonight, we both sat nervously as he took the first dose of suboxone and waited for his body&amp;#39;s reaction. Fifteen nervous minutes later, his withdrawal symptoms were all cleared up! No violent illness, no feelings of malaise, no negative reactions. He started tearing up, and so did I. He turned to me and thanked me for being there to support him - from the time he told me about his past, to being with him for his transition. He told me how long he&amp;#39;s waited to finally make the leap, and how excited he is to finally start transitioning to no medication at all. He told me how excited he is to finally be able to travel the world together. &lt;/p&gt;\n\n&lt;p&gt;Reddit, I know it&amp;#39;s not total sobriety yet, and I know so much still can, and probably will go wrong sometime in the future. But tonight, I am so happy and so proud of my boyfriend and his strength through recovery. He has taught me the meaning of patience and strength, and he inspires me every day to become a better person. &lt;/p&gt;\n\n&lt;p&gt;And tomorrow, I&amp;#39;m giving him his birthday present - a week long trip for the both of us to Rome this June. :)&lt;/p&gt;\n\n&lt;p&gt;Anyway, I know it&amp;#39;s been a long read, but I wanted to thank you for coming all this way! I hope I was able to help some of you who maybe needed to hear this - to anyone who wants to lead a sober lifestyle and hi struggling with addiction, please know that it&amp;#39;s possible! It&amp;#39;s so hard, and you may not get there perfectly - you might stumble and fall - but you can do it. :) Please feel free to PM me if you feel like it, and thanks again for reading!!&lt;/p&gt;\n\n&lt;p&gt;tldr: My amazing boyfriend just made a huge step towards total sobriety after spending seven years in a drug addiction recovery program, and we&amp;#39;re both so happy!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "r/happy, I just wanted to share this with you because I know there are readers of this subreddit who, like me, are inspired every day by the wonderful things that people post. I hope this might strike a chord with those of you who needed to read this today! Please bear with me, as this is somewhat of a long post!\n\n\nI didn't believe in love. Growing up, I couldn't help but feel that the sort of love that movies sold was to be dreamed of but never truly found. Each relationship - from the most toxic to the most supportive and healthy - only solidified my knowledge, as I grew to care for my boyfriends without ever truly falling in love. After my most recent breakup, I decided I wanted to take time to discover myself and figure out what was most important to me. I focused my efforts on school and work, while I continued to better myself in any way possible. \n\nAnd then, six months ago, I met the most amazing person. He caught my attention the moment he walked in the room, his presence was undeniable. Tall, handsome, a little shy, totally geeky, and with a truly warm personality and manner of speech that captivated me from the beginning. His kindness towards the people around him, his abstinence from mindless gossip, his desire to think and talk about philosophical questions, his humility and yet wisdom about life are all things that have only continued to grow as I've come to know him. If it was attraction at first sight, it became the deepest and truest love by the second coffee date. We connected immediately in a way that I have never, ever felt with anyone. \n\nYou must understand I was very wary at first. Even as I could feel myself falling deeper and deeper in love, I reminded myself that love was an illusion invented by fairy tales and Hollywood. \n\nStill, one month went by and I could no longer deny it - I was undeniably in love, and I couldn't, and still can't, stop thanking my lucky stars for having met such an incredible human being. \n\nAfter one month, he sat with me at a park underneath the fall foliage, and told me there was something very important he wanted to share with me. He spoke softly and calmly about his struggles with opiate addiction in his early twenties. He told me embarrassedly about how he lied to and stole from his family to support his habit, how he got arrested for legal infringement, how he wound up homeless for more than a year living in a shelter. He paused often as he teared up, and although he held my hands he often couldn't meet my gaze. He told me how he realized how much he was hurting his family, started seeking therapy and began a methadone program that would get him off the streets. He started the program seven years ago, he told me, and in the past five years he started really wanting to live a completely medication-free lifestyle. He told me that although he still occasionally has PTSD from his past experiences, he's ultimately grateful for his newfound appreciation for life and love. He's apologized to his family, and to this day continues to support his mother at home, with whom he now shares a better relationship. \n\nHe concluded by telling me that he understood if it was a lot to take in, and understood if I could no longer see him the same way again - that he would respect my decision should I choose to no longer speak to him. \n\nI was totally shocked. Having lived a totally sheltered life, I had never been exposed to drugs, nor to the struggles that come with addiction. It was, honestly, a lot to take in. I cried as he told me his story, and as I came to understand the pain he went through and continues to face every day. I hugged him and assured him that if I saw him any differently, it was because I had found a new source of respect for his journey in recovery. \n\nNot a week later, we started dating. It's been, honestly, the most amazing, joyous, love filled, healthy relationship I have ever, ever been in. I am more in love today than I was when we first started dating, and I grow more and more convinced that we may end up married someday (something I thought I would never actively desire!). \n\nNow, as we've been dating, I've come to understand more and more about addiction, and have had the opportunity to educate myself about the lifelong path to recovery. How little I ever actually knew at all!! The way I once thought about rape - that it was a crime committed mostly by strangers lurking in dark alleys to girls in short skirts, which is what society taught me growing up - I realized I thought about addicts - that they were mostly bad people with weak minds and poor moral values. And just as I came to realize the truth about rape - that it's a crime mostly committed by acquaintances and friends to men and women alike regardless of manner of dress - I came to realize the truth about addiction - that it's a debilitating mental illness that could affect anybody, like depression, that requires attention and care for recovery. \n\nThis weekend was a huge, huge deal for us. My boyfriend was going to switch to a different medication, called suboxone, which while not total sobriety, would be a step in the right direction from the methadone program he was attending. Among other things, because his program requires him to come into a clinic every single morning, he has not been able to leave the city in seven long years. The new medicine would not only help him transition to total sobriety by helping to manage the long and painful withdrawal period from the methadone, but also afford him the ability to leave town every once in a while. Making the transition is a calculated risk, as there is a chance a patient's body will not react well to the medicine, but my boyfriend decided he really wanted to take the leap.\n\nThis weekend, my boyfriend needed to let the methadone completely leave his system so he could start the new medicine. This meant a weekend of violent vomiting and diarrhea, cold chills, sweating, and general anxiety, among other symptoms. It was a long, long weekend with lots of cuddling, lots of blankets, lots of warm soaks in the bath, and lots of bathroom. All in all not a pretty time. Side note: I was so touched that while he was in full withdrawal, he still offered to make me coffee, still massaged my back as I was falling asleep, and still apologized every time he came back to bed for accidentally waking me up. \n\nTonight, we both sat nervously as he took the first dose of suboxone and waited for his body's reaction. Fifteen nervous minutes later, his withdrawal symptoms were all cleared up! No violent illness, no feelings of malaise, no negative reactions. He started tearing up, and so did I. He turned to me and thanked me for being there to support him - from the time he told me about his past, to being with him for his transition. He told me how long he's waited to finally make the leap, and how excited he is to finally start transitioning to no medication at all. He told me how excited he is to finally be able to travel the world together. \n\nReddit, I know it's not total sobriety yet, and I know so much still can, and probably will go wrong sometime in the future. But tonight, I am so happy and so proud of my boyfriend and his strength through recovery. He has taught me the meaning of patience and strength, and he inspires me every day to become a better person. \n\nAnd tomorrow, I'm giving him his birthday present - a week long trip for the both of us to Rome this June. :)\n\nAnyway, I know it's been a long read, but I wanted to thank you for coming all this way! I hope I was able to help some of you who maybe needed to hear this - to anyone who wants to lead a sober lifestyle and hi struggling with addiction, please know that it's possible! It's so hard, and you may not get there perfectly - you might stumble and fall - but you can do it. :) Please feel free to PM me if you feel like it, and thanks again for reading!!\n\ntldr: My amazing boyfriend just made a huge step towards total sobriety after spending seven years in a drug addiction recovery program, and we're both so happy!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "20owe6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "The_Ewe_Pilgrim", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/20owe6/he_made_it_long_post/", "name": "t3_20owe6", "created": 1395143063.0, "url": "http://www.reddit.com/r/happy/comments/20owe6/he_made_it_long_post/", "author_flair_text": null, "title": "He made it! [long post]", "created_utc": 1395114263.0, "ups": 7, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cg5exho", "gilded": 0, "author": "sham_wowza", "parent_id": "t3_20owe6", "approved_by": null, "body": "This made me tear up.  So happy for the both of you - enjoy your time in Rome, you both deserve it!!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This made me tear up.  So happy for the both of you - enjoy your time in Rome, you both deserve it!!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20owe6", "score_hidden": false, "name": "t1_cg5exho", "created": 1395123674.0, "author_flair_text": null, "created_utc": 1395120074.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]