[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hope this is the right place to post. I made a short paragraph outlining how I keep myself happy, thought I&amp;#39;d share it with you guys!&lt;/p&gt;\n\n&lt;p&gt;Be happy with yourself! Be happy with your body, your looks, and you! If you aren&amp;#39;t happy with something you can change, work on improving that! I&amp;#39;ll take art as an example. I&amp;#39;m not happy with the way I draw, but I can improve, as can you with whatever you are trying to get better at! Don&amp;#39;t feel discouraged when other people are better than you at something! Try to be like them, see how they are good and mimic that, and remember they were shitty at some point, so it takes work to have talent! Don&amp;#39;t hate people unless you have a legitimate reason, in which case either ignore them or sort it out. There&amp;#39;s this one girl in my school who I have a lot of classes with, and she&amp;#39;s pretty annoying. However, whenever I see myself feeling Schadefreude over her or am angry at her, I constantly remind myself to not be mean and that she&amp;#39;s a fellow human being even if I don&amp;#39;t like her very much. Don&amp;#39;t do things that you feel the need to do because everyone else does such as trying to look sexy or buying stuff you don&amp;#39;t need with money you don&amp;#39;t have (my rule is that if I want to buy something that isn&amp;#39;t candy, I&amp;#39;ll wait a week before I actually buy it. If I still remember about it/want it a week later then I&amp;#39;ll get it because then I know I actually want it.). Do things that make you happy! As long as it isn&amp;#39;t hurting you or other people, this world is yours :) Try to make the best of a shitty situation. Sometimes I&amp;#39;m having not-so-good of a day, and I&amp;#39;m listening to sad music, but I think that nothing is bad- I just keep telling myself to love life and that I&amp;#39;m not in a bad mood, and that the music isn&amp;#39;t sad but melodic and beautiful. Also, if you are legitimately in a bad mood, like the kind that you can&amp;#39;t get out of by telling yourself that you&amp;#39;re happy, do whatever the hell it takes to be happy again, even if it involves sitting at the computer for 5 hours, browsing &lt;a href=\"/r/happy\"&gt;/r/happy&lt;/a&gt; and eating lots of ice cream. When your sanity is in jeopardy, stop caring about the calories.&lt;/p&gt;\n\n&lt;p&gt;This is pretty much how I feel happy every day of my life. A few months ago I wasn&amp;#39;t happy because I kept telling myself that life is sad (literally having this monologue of sadness in my head) but now I keep reminding myself that I have no reason to be sad (literally noticing and saying happy things in my head).&lt;/p&gt;\n\n&lt;p&gt;Love you all, have a wonderful day! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hope this is the right place to post. I made a short paragraph outlining how I keep myself happy, thought I'd share it with you guys!\n\nBe happy with yourself! Be happy with your body, your looks, and you! If you aren't happy with something you can change, work on improving that! I'll take art as an example. I'm not happy with the way I draw, but I can improve, as can you with whatever you are trying to get better at! Don't feel discouraged when other people are better than you at something! Try to be like them, see how they are good and mimic that, and remember they were shitty at some point, so it takes work to have talent! Don't hate people unless you have a legitimate reason, in which case either ignore them or sort it out. There's this one girl in my school who I have a lot of classes with, and she's pretty annoying. However, whenever I see myself feeling Schadefreude over her or am angry at her, I constantly remind myself to not be mean and that she's a fellow human being even if I don't like her very much. Don't do things that you feel the need to do because everyone else does such as trying to look sexy or buying stuff you don't need with money you don't have (my rule is that if I want to buy something that isn't candy, I'll wait a week before I actually buy it. If I still remember about it/want it a week later then I'll get it because then I know I actually want it.). Do things that make you happy! As long as it isn't hurting you or other people, this world is yours :) Try to make the best of a shitty situation. Sometimes I'm having not-so-good of a day, and I'm listening to sad music, but I think that nothing is bad- I just keep telling myself to love life and that I'm not in a bad mood, and that the music isn't sad but melodic and beautiful. Also, if you are legitimately in a bad mood, like the kind that you can't get out of by telling yourself that you're happy, do whatever the hell it takes to be happy again, even if it involves sitting at the computer for 5 hours, browsing /r/happy and eating lots of ice cream. When your sanity is in jeopardy, stop caring about the calories.\n\nThis is pretty much how I feel happy every day of my life. A few months ago I wasn't happy because I kept telling myself that life is sad (literally having this monologue of sadness in my head) but now I keep reminding myself that I have no reason to be sad (literally noticing and saying happy things in my head).\n\nLove you all, have a wonderful day! ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zoo1f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tardis3134", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1zoo1f/how_i_stay_happy/", "name": "t3_1zoo1f", "created": 1394073572.0, "url": "http://www.reddit.com/r/happy/comments/1zoo1f/how_i_stay_happy/", "author_flair_text": null, "title": "How I Stay Happy", "created_utc": 1394073572.0, "ups": 4, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]