[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve struggled with emotional problems for many years and it shows all the time. On a normal day I’m reserved and pretty removed. I feel like I seem cold most of the time. I’ve learned a lot about myself in the last year, and now I’m going to work on the problems I have which limit me from being truly happy. I have problems with abandonment, and trust, and I’ve felt like I’ll always be rejected or anything but someone’s first choice in people or girlfriends. In my past, I faced emotional, verbal, and sexual abuse as well as rejection. Not the worst things, but they were definitely deep rooted and they ruled me. They ruled my relationships. It’s very hard for me to enjoy the sex in my relationships. I don’t feel vulnerable or close when I do anything sexual because I trained myself to shut down and just do it when the time comes. I thought that it would help me get over my past if I just shut it out. I found someone who I want to be close to, and so far we&amp;#39;ve had a great relationship. &lt;/p&gt;\n\n&lt;p&gt;The other night, I had a nightmare that I caught him with another woman and there was nothing I could do to stop them. It wasn’t my usual type of nightmare, but it’s one that I won’t have again. The context seemed like we were in an open relationship, and I didn’t agree with it. I just stood there hopeless and broken hearted, and he kept asking me “What..?” I know that that is something that he will never do to me, but I realized that I need to confront my fear. I’m not sure if I’m afraid of being close to someone, or afraid that they’ll find out something that they don’t like and leave. If I confront it, my dreams won&amp;#39;t be as painful. If i confront this, I can learn to trust people.&lt;/p&gt;\n\n&lt;p&gt;I already told my boyfriend that I was sexually abused, and he is very supportive, but didn’t understand it like I do. I try to explain, but I never said what I really needed to say until this day. I can talk to him about these things because he wants to help me, but he doesn’t look at me like I’m a kicked puppy. The day after the nightmare, I felt completely vulnerable. I was hurt because of a dream I had, and I thought too much about my past. I just wanted to cuddle something or drive. Mostly, I wanted to see him to confirm that he was still my man. I called him and went to his house for a casual movie or whatever we wanted. When he opened the door, I felt completely leveled by him. I’m so close to this person, and I’m terrified by it, but want to be closer. Later that night, I told him everything I was rehearsing throughout the day, and it was so relieving. I told him that I’ve never really let myself be close to anyone, but that with him, I didn’t know how not to be close. I don’t know how not to care about him. I told him that I “tease” him in bed because I do want to do sexual things with him, but lately, when it’s in action, I freeze. I don’t want to shut myself off like I did before. With him, I want a connection that makes us a couple. I want to stop the cycle that makes sex nothing more to me than reenactments of my past, and keeps me from forgetting my dad’s greedy stare. I told my boyfriend that some days, I can’t shake it, and I don’t want to be touched. &lt;/p&gt;\n\n&lt;p&gt;What happened next was what I needed to happen for a long time. He squeezed me and told me that he loved all the little things about me. He complimented my body, and for the first time, I believed him. He made me believe that if he wanted sex above anything else, I would’ve known by now like I unfortunately learned about a couple past boyfriends. He told me that he wanted to help me work through my problems. He suggested that the next time I wanted to do something sexual, we can stop the moment I feel uncomfortable. I think I know that it won’t be a problem anymore because I know that he is aware, and he is so supportive. &lt;/p&gt;\n\n&lt;p&gt;I feel like it’s the start of a new life for me where I can have close relationships with my friends and maybe my family too. I have such a free feeling now, and I want to take this boy to all the places we want to see once we have money. I want to do everything with this person. I’m taking baby steps in my relationships, but I’m finally taking steps! I couldn’t be happier about this, and I’m so lucky to have people in my life like him. I’m lucky to have been able to do this before I push him or anyone else away. Now I can be in love, and I can finally be happy, and I already am!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR The past is in the past, and I’m finally going to let people in.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I’ve struggled with emotional problems for many years and it shows all the time. On a normal day I’m reserved and pretty removed. I feel like I seem cold most of the time. I’ve learned a lot about myself in the last year, and now I’m going to work on the problems I have which limit me from being truly happy. I have problems with abandonment, and trust, and I’ve felt like I’ll always be rejected or anything but someone’s first choice in people or girlfriends. In my past, I faced emotional, verbal, and sexual abuse as well as rejection. Not the worst things, but they were definitely deep rooted and they ruled me. They ruled my relationships. It’s very hard for me to enjoy the sex in my relationships. I don’t feel vulnerable or close when I do anything sexual because I trained myself to shut down and just do it when the time comes. I thought that it would help me get over my past if I just shut it out. I found someone who I want to be close to, and so far we've had a great relationship. \n\nThe other night, I had a nightmare that I caught him with another woman and there was nothing I could do to stop them. It wasn’t my usual type of nightmare, but it’s one that I won’t have again. The context seemed like we were in an open relationship, and I didn’t agree with it. I just stood there hopeless and broken hearted, and he kept asking me “What..?” I know that that is something that he will never do to me, but I realized that I need to confront my fear. I’m not sure if I’m afraid of being close to someone, or afraid that they’ll find out something that they don’t like and leave. If I confront it, my dreams won't be as painful. If i confront this, I can learn to trust people.\n\nI already told my boyfriend that I was sexually abused, and he is very supportive, but didn’t understand it like I do. I try to explain, but I never said what I really needed to say until this day. I can talk to him about these things because he wants to help me, but he doesn’t look at me like I’m a kicked puppy. The day after the nightmare, I felt completely vulnerable. I was hurt because of a dream I had, and I thought too much about my past. I just wanted to cuddle something or drive. Mostly, I wanted to see him to confirm that he was still my man. I called him and went to his house for a casual movie or whatever we wanted. When he opened the door, I felt completely leveled by him. I’m so close to this person, and I’m terrified by it, but want to be closer. Later that night, I told him everything I was rehearsing throughout the day, and it was so relieving. I told him that I’ve never really let myself be close to anyone, but that with him, I didn’t know how not to be close. I don’t know how not to care about him. I told him that I “tease” him in bed because I do want to do sexual things with him, but lately, when it’s in action, I freeze. I don’t want to shut myself off like I did before. With him, I want a connection that makes us a couple. I want to stop the cycle that makes sex nothing more to me than reenactments of my past, and keeps me from forgetting my dad’s greedy stare. I told my boyfriend that some days, I can’t shake it, and I don’t want to be touched. \n\nWhat happened next was what I needed to happen for a long time. He squeezed me and told me that he loved all the little things about me. He complimented my body, and for the first time, I believed him. He made me believe that if he wanted sex above anything else, I would’ve known by now like I unfortunately learned about a couple past boyfriends. He told me that he wanted to help me work through my problems. He suggested that the next time I wanted to do something sexual, we can stop the moment I feel uncomfortable. I think I know that it won’t be a problem anymore because I know that he is aware, and he is so supportive. \n\nI feel like it’s the start of a new life for me where I can have close relationships with my friends and maybe my family too. I have such a free feeling now, and I want to take this boy to all the places we want to see once we have money. I want to do everything with this person. I’m taking baby steps in my relationships, but I’m finally taking steps! I couldn’t be happier about this, and I’m so lucky to have people in my life like him. I’m lucky to have been able to do this before I push him or anyone else away. Now I can be in love, and I can finally be happy, and I already am!\n\n**TL;DR The past is in the past, and I’m finally going to let people in.**\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1yxu1s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "My_Beloved_Ice_Cream", "media": null, "score": 53, "approved_by": null, "over_18": true, "hidden": false, "thumbnail": "nsfw", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 16, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1yxu1s/i_19f_am_not_going_to_be_afraid_to_be_close_to/", "name": "t3_1yxu1s", "created": 1393372432.0, "url": "http://www.reddit.com/r/happy/comments/1yxu1s/i_19f_am_not_going_to_be_afraid_to_be_close_to/", "author_flair_text": null, "title": "I [19F] am not going to be afraid to be close to someone anymore. Possibly NSFW", "created_utc": 1393372432.0, "ups": 69, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfoz9n8", "gilded": 0, "author": "My_Beloved_Ice_Cream", "parent_id": "t1_cfotytl", "approved_by": null, "body": "Thanks! ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfoz9n8", "created": 1393393039.0, "author_flair_text": null, "created_utc": 1393393039.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "saved": false, "id": "cfotytl", "gilded": 0, "author": "truckrckr", "parent_id": "t3_1yxu1s", "approved_by": null, "body": "Glad to hear that you've overcome your fears and that you found someone to open up to. Sounds like things are getting better for you. Good luck! ", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to hear that you&amp;#39;ve overcome your fears and that you found someone to open up to. Sounds like things are getting better for you. Good luck! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfotytl", "created": 1393380672.0, "author_flair_text": null, "created_utc": 1393380672.0, "distinguished": null, "num_reports": null, "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfp7tqy", "gilded": 0, "author": "My_Beloved_Ice_Cream", "parent_id": "t1_cfp0w6b", "approved_by": null, "body": "Thank you, and that is a really good quote. I think the one that I can relate to pretty well is from a movie i saw recently. \"We accept the love we think we deserve.\" It has been 5 years since I've seen that man, but it's been a slow transition. I still hear songs that I can't stand, and I still drive by that old house on occasion. The good thing is that I learned to change the song, and when I see the house, I always drive away. I'm finally doing more! I know that I'm young, but I've matured a lot, and I still have a lot of years in front of me to learn new things and go home happy :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, and that is a really good quote. I think the one that I can relate to pretty well is from a movie i saw recently. &amp;quot;We accept the love we think we deserve.&amp;quot; It has been 5 years since I&amp;#39;ve seen that man, but it&amp;#39;s been a slow transition. I still hear songs that I can&amp;#39;t stand, and I still drive by that old house on occasion. The good thing is that I learned to change the song, and when I see the house, I always drive away. I&amp;#39;m finally doing more! I know that I&amp;#39;m young, but I&amp;#39;ve matured a lot, and I still have a lot of years in front of me to learn new things and go home happy :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfp7tqy", "created": 1393429728.0, "author_flair_text": null, "created_utc": 1393429728.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfp0w6b", "gilded": 0, "author": "sweetrevelation", "parent_id": "t3_1yxu1s", "approved_by": null, "body": "this, although I (of course) just think you're still sooo young, is such a huge, amazing accomplishment. once you stop letting your past, your brain, your thoughts..mindset, ultimately yourself as a whole, stop victimizing yourself, you can BE happy. keep that attitude and continue to work to improve and relish in it. which leads me to my favorite quote, \"there are no such things as victims, only volunteers.\" that quote runs so deep and you've officially begun the whole hearted commitment and comprehension of it. you go girl!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this, although I (of course) just think you&amp;#39;re still sooo young, is such a huge, amazing accomplishment. once you stop letting your past, your brain, your thoughts..mindset, ultimately yourself as a whole, stop victimizing yourself, you can BE happy. keep that attitude and continue to work to improve and relish in it. which leads me to my favorite quote, &amp;quot;there are no such things as victims, only volunteers.&amp;quot; that quote runs so deep and you&amp;#39;ve officially begun the whole hearted commitment and comprehension of it. you go girl!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfp0w6b", "created": 1393398621.0, "author_flair_text": null, "created_utc": 1393398621.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfp8pwj", "gilded": 0, "author": "My_Beloved_Ice_Cream", "parent_id": "t1_cfp3xjg", "approved_by": null, "body": "I went through a lot of people for help. School counselors would've helped if i had let them in. I went to several counselors who suggested that i needed to be more assertive. They just thought I had a low self esteem from being pushed around. They didn't know that I lived with it. If i assertive at my houses, it would've got me in trouble. For a long time, I did give up. I only knew one way out of the situation, and it wasn't a happy one, but it would've made everything stop. I finally \"acted out\" at school and got a real psychiatrist paid for by the state. She helped me a ton. This was a couple years ago now. I would've kept going, but I ran out of free visits, and my mom wouldn't pay for more. \n\nAt least now i'm moving forward. I am strong, and I can do anything. If I know its the right decision, then I'll never have to look back. \n\nI'm going to school for psychology, or maybe interior design.. and I'm going to bartend for a while. I'm going to surround myself with everything that makes me happy, and I'm going to BE happy. It's terrifying in a good way, and I'm excited for myself. \n\nI'm not going to count the days. I know that'll only set me back. The best thing I can say to anyone is visualize what you want out of life. Start with things like what kind of house you want. How many pets do you want. Do you want to live within the city, or somewhere outside. Do you want to race cars or skydive? All these things can happen someday if you go get them. *You just have to start working on it.* Don't let money be an issue that comes to mind. Right now, I'm a broke college student, but I have a \"Rome Jar\". \n\nI hope this helps. It helps me anyways. And thank you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a lot of people for help. School counselors would&amp;#39;ve helped if i had let them in. I went to several counselors who suggested that i needed to be more assertive. They just thought I had a low self esteem from being pushed around. They didn&amp;#39;t know that I lived with it. If i assertive at my houses, it would&amp;#39;ve got me in trouble. For a long time, I did give up. I only knew one way out of the situation, and it wasn&amp;#39;t a happy one, but it would&amp;#39;ve made everything stop. I finally &amp;quot;acted out&amp;quot; at school and got a real psychiatrist paid for by the state. She helped me a ton. This was a couple years ago now. I would&amp;#39;ve kept going, but I ran out of free visits, and my mom wouldn&amp;#39;t pay for more. &lt;/p&gt;\n\n&lt;p&gt;At least now i&amp;#39;m moving forward. I am strong, and I can do anything. If I know its the right decision, then I&amp;#39;ll never have to look back. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to school for psychology, or maybe interior design.. and I&amp;#39;m going to bartend for a while. I&amp;#39;m going to surround myself with everything that makes me happy, and I&amp;#39;m going to BE happy. It&amp;#39;s terrifying in a good way, and I&amp;#39;m excited for myself. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to count the days. I know that&amp;#39;ll only set me back. The best thing I can say to anyone is visualize what you want out of life. Start with things like what kind of house you want. How many pets do you want. Do you want to live within the city, or somewhere outside. Do you want to race cars or skydive? All these things can happen someday if you go get them. &lt;em&gt;You just have to start working on it.&lt;/em&gt; Don&amp;#39;t let money be an issue that comes to mind. Right now, I&amp;#39;m a broke college student, but I have a &amp;quot;Rome Jar&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I hope this helps. It helps me anyways. And thank you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfp8pwj", "created": 1393431774.0, "author_flair_text": null, "created_utc": 1393431774.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfp3xjg", "gilded": 0, "author": "tothelight", "parent_id": "t3_1yxu1s", "approved_by": null, "body": "&gt; sexual abuse \n\nI can empathize.  I've been there, too.  I'm glad you are making the decision to move forward with all of this.  I've been in therapy for this for quite some time, and I'm going to be realistic with you and tell you what you probably already know - that while you've made the decision being the first step, the following may take a long time to achieve and it won't come overnight.  I was told it could take years.  Reshaping attitudes and physical responses about the past is not an easy task.\n\nOn the bright side - you are strong.  It's evidenced by your past that these rough things have happened to you and you are here and working your way through them.  You persevere.  A lot of people give up after things like that simply because they don't have the strength.  You should be proud of yourself for living with the thoughts every day.\n\nThe worst is already over, and you're going to let people in.  It may terrify you for a while yet, but just keep reminding yourself that you're strong and you can do it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;sexual abuse &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can empathize.  I&amp;#39;ve been there, too.  I&amp;#39;m glad you are making the decision to move forward with all of this.  I&amp;#39;ve been in therapy for this for quite some time, and I&amp;#39;m going to be realistic with you and tell you what you probably already know - that while you&amp;#39;ve made the decision being the first step, the following may take a long time to achieve and it won&amp;#39;t come overnight.  I was told it could take years.  Reshaping attitudes and physical responses about the past is not an easy task.&lt;/p&gt;\n\n&lt;p&gt;On the bright side - you are strong.  It&amp;#39;s evidenced by your past that these rough things have happened to you and you are here and working your way through them.  You persevere.  A lot of people give up after things like that simply because they don&amp;#39;t have the strength.  You should be proud of yourself for living with the thoughts every day.&lt;/p&gt;\n\n&lt;p&gt;The worst is already over, and you&amp;#39;re going to let people in.  It may terrify you for a while yet, but just keep reminding yourself that you&amp;#39;re strong and you can do it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yxu1s", "score_hidden": false, "name": "t1_cfp3xjg", "created": 1393416672.0, "author_flair_text": null, "created_utc": 1393416672.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]