[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Back in highschool, I struggled with social anxiety. I was the quiet, nerdy type with a solid group of friend that didn&amp;#39;t really go out of my social circle. That started changing near the end of highschool but I think that that was more because people were more accepting of me. I still felt shy, lacked confidence about myself, and had difficulty talking to others.&lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m finishing up my second year of university, and the change if mind blowing. Gone is the kid who was scared to talk to others; if I&amp;#39;m in class and someone sits beside me whom I judge to be friendly and nice, I start a small chat with them. I&amp;#39;ve made awesome, new friends with whom I go out with, which by extension allows me to meet new people.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had my first girlfriend, and even though we&amp;#39;re going through some rough times and the relationship could potentially end, I feel confident in myself to meet other women, and start something anew.&lt;/p&gt;\n\n&lt;p&gt;But the two biggest things happened not too long ago. I was having lunch with class friends, and we were chatting and joking, and one of them said &amp;quot;Out of all of us, I&amp;#39;m probably the least confident.&amp;quot; I half jokingly replied with &amp;quot;No, I&amp;#39;m pretty sure I am.&amp;quot; And in my head, I still believed it. But they thought I was joking. At that moment, I realized that they perceive me as a confident person. It was all I could think about that day. For once in my life, I wasn&amp;#39;t the least confident person in my social group.&lt;/p&gt;\n\n&lt;p&gt;And lastly, yesterday, I ended up going to a networking event to try and find a summer job. I don&amp;#39;t think I succeeded in finding one, but I learned something more about myself. For one, I made a new contact. I didn&amp;#39;t get his info, so I&amp;#39;ll probably never see him again. But during those three hours, I felt like I had made a friend. We chatted, we networked together, seeked jobs together, and he even drove me to my car which was across the city so that I didn&amp;#39;t have to take the bus.&lt;/p&gt;\n\n&lt;p&gt;On top of that, during the event, I was watching the other people I shared a table with, and I could tell how nervous they were. Heck, they reminded me of me two years ago. But what was I doing? I was chatting with the employers, actively participating with the events, talking with the pretty girl, and having a grand old time. I got home and thought &amp;quot;Wow, this is who I&amp;#39;ve become&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;This has been a week of revelations. And I feel like I&amp;#39;ve finally overcome something that&amp;#39;s been a big part of my life for most of my teenage years. &lt;/p&gt;\n\n&lt;p&gt;And I couldn&amp;#39;t be happier!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Back in highschool, I struggled with social anxiety. I was the quiet, nerdy type with a solid group of friend that didn't really go out of my social circle. That started changing near the end of highschool but I think that that was more because people were more accepting of me. I still felt shy, lacked confidence about myself, and had difficulty talking to others.\n\nNow, I'm finishing up my second year of university, and the change if mind blowing. Gone is the kid who was scared to talk to others; if I'm in class and someone sits beside me whom I judge to be friendly and nice, I start a small chat with them. I've made awesome, new friends with whom I go out with, which by extension allows me to meet new people.\n\nI've had my first girlfriend, and even though we're going through some rough times and the relationship could potentially end, I feel confident in myself to meet other women, and start something anew.\n\nBut the two biggest things happened not too long ago. I was having lunch with class friends, and we were chatting and joking, and one of them said \"Out of all of us, I'm probably the least confident.\" I half jokingly replied with \"No, I'm pretty sure I am.\" And in my head, I still believed it. But they thought I was joking. At that moment, I realized that they perceive me as a confident person. It was all I could think about that day. For once in my life, I wasn't the least confident person in my social group.\n\nAnd lastly, yesterday, I ended up going to a networking event to try and find a summer job. I don't think I succeeded in finding one, but I learned something more about myself. For one, I made a new contact. I didn't get his info, so I'll probably never see him again. But during those three hours, I felt like I had made a friend. We chatted, we networked together, seeked jobs together, and he even drove me to my car which was across the city so that I didn't have to take the bus.\n\nOn top of that, during the event, I was watching the other people I shared a table with, and I could tell how nervous they were. Heck, they reminded me of me two years ago. But what was I doing? I was chatting with the employers, actively participating with the events, talking with the pretty girl, and having a grand old time. I got home and thought \"Wow, this is who I've become\".\n\nThis has been a week of revelations. And I feel like I've finally overcome something that's been a big part of my life for most of my teenage years. \n\nAnd I couldn't be happier!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "21n12g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Therrester", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/happy/comments/21n12g/i_cant_believe_how_confident_ive_become/", "name": "t3_21n12g", "created": 1396083788.0, "url": "http://www.reddit.com/r/happy/comments/21n12g/i_cant_believe_how_confident_ive_become/", "author_flair_text": null, "title": "I can't believe how confident I've become", "created_utc": 1396054988.0, "ups": 14, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]