[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a whole bunch of friends, so I had to tell somebody. I thought i&amp;#39;d share here.&lt;/p&gt;\n\n&lt;p&gt;I am an 18 year old kid that struggled a lot during high school. I had failed numerous classes and Junior (11th) year, I realized I may not be able to graduate with my class, class of 2014. I literally thought I would drop out if I couldn&amp;#39;t, because of how embarrassing it&amp;#39;d be to graduate with people I had always considered &amp;#39;lower class-men&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;I talked to my guidance counselor and she put me in some online classes. This was very difficult for me because I learn better one on one with someone showing me examples of how to do things, I just suck at learning when it&amp;#39;s reading something and memorizing it. Also, a bunch of other things got in the way that prevented me from getting the online classes done, such as getting a job to help my mom with bills (my first job and nearly all of my paycheck would go to groceries and any bills my mom needed help with) and family disputes.&lt;/p&gt;\n\n&lt;p&gt;This is now my senior year. There are 44 days left of my year. Just now, I finally finished my last online class, and im passing ever class in school now, and i&amp;#39;m in no danger of being held behind.&lt;/p&gt;\n\n&lt;p&gt;Class of 2014! I&amp;#39;ll be receiving my diploma on June 12th! I finally did what everyone doubted I could accomplish! I can&amp;#39;t stop smiling right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't have a whole bunch of friends, so I had to tell somebody. I thought i'd share here.\n\nI am an 18 year old kid that struggled a lot during high school. I had failed numerous classes and Junior (11th) year, I realized I may not be able to graduate with my class, class of 2014. I literally thought I would drop out if I couldn't, because of how embarrassing it'd be to graduate with people I had always considered 'lower class-men'\n\nI talked to my guidance counselor and she put me in some online classes. This was very difficult for me because I learn better one on one with someone showing me examples of how to do things, I just suck at learning when it's reading something and memorizing it. Also, a bunch of other things got in the way that prevented me from getting the online classes done, such as getting a job to help my mom with bills (my first job and nearly all of my paycheck would go to groceries and any bills my mom needed help with) and family disputes.\n\nThis is now my senior year. There are 44 days left of my year. Just now, I finally finished my last online class, and im passing ever class in school now, and i'm in no danger of being held behind.\n\nClass of 2014! I'll be receiving my diploma on June 12th! I finally did what everyone doubted I could accomplish! I can't stop smiling right now.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24bynz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Cacophobic", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/happy/comments/24bynz/i_did_it_just_hand_me_my_diploma_now/", "name": "t3_24bynz", "created": 1398851428.0, "url": "http://www.reddit.com/r/happy/comments/24bynz/i_did_it_just_hand_me_my_diploma_now/", "author_flair_text": null, "title": "I did it! Just hand me my diploma now!", "created_utc": 1398822628.0, "ups": 7, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]