[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up, my dad drilled it into my head that I needed to be thankful for him. That he went to work and did everything for us because my mom was lazy and useless. While she didn&amp;#39;t work, she took us to doctor&amp;#39;s appointments. Made sure there was more than just seafood in the house (my dad loves seafood, I hate it). She got us supplies for school projects. Yes, my dad provided financially but at the cost of making us all feel horrible for it. We didn&amp;#39;t say thank you for something? We were ungrateful pieces of shit, according to him.&lt;/p&gt;\n\n&lt;p&gt;Then there was the abuse. Told me he wished my mom miscarried me (I&amp;#39;m the older one, he favored my sister). Told me he wished I wasn&amp;#39;t born. Told me I was ugly because I fell off my bike and skinned my knee (girls can&amp;#39;t have scars or they&amp;#39;re ugly). Told me my mom was ugly because she didn&amp;#39;t wear dresses or makeup. Beat the shit out of me. Broke a shoe horn over my back. Whipped me with an extension cord. Punched me, slapped me, slammed me into the wall. Beat me while my mom was driving with my best friend sitting next to me because I told him not to hit my sister (his favor of her obviously diminished). He nearly killed me one night when he choked me out on the floor. Two years later and my nose still hurts from the fracture. I had blood bruises all over my face for weeks. I drove off that night with not so much as shoes on my feet. Luckily my purse and phone were still in my car. I drove to the church. It was a Wednesday night. I called my friend and her brother and his friend were ready and determined to fight my dad. Especially when I showed up to church with a bruises, crying, and a bloody and cut face. A member who is a nurse checked me out. I stayed with my friend for a while. I went to church that weekend. Everyone saw my injuries. I wasn&amp;#39;t ashamed. I wasn&amp;#39;t the one who beat their own daughter in &lt;strong&gt;&amp;#39;self-defense&amp;#39;&lt;/strong&gt; because she told you to quit screaming at and insulting her mother. Yes, he really beat me because I SAID something. He beat me for reporting that his distant cousin molested me. He did coke and heroin around me as a small child and would terrify me, causing me to have night terrors where my mom would have to hold me down so I didn&amp;#39;t get hurt from flailing around. There&amp;#39;s so much more.&lt;/p&gt;\n\n&lt;p&gt;Then there&amp;#39;s the screwing me over. I had $20,000 roughly in savings bonds from my grandparents for college/car/etc. I obviously couldn&amp;#39;t cash them until I was old enough. When I was 18, I got to buy a Jeep with it. $1,500 out of $20k isn&amp;#39;t much. He would cash them, use them for our trips up north to see his sister, and then because we&amp;#39;d see my grandpa (mom&amp;#39;s dad) as well, make my grandpa pay him back (my grandpa didn&amp;#39;t know they spent my money and was just helping since he is very well off). My dad also did that to my sister.&lt;/p&gt;\n\n&lt;p&gt;He took me off the health insurance once my parents divorced, even though their divorce isn&amp;#39;t my fault. I have ovarian cysts and need birth control as well as some other health conditions that involve me getting injured or being in chronic pain. I had an ear infection and had to pay the money for urgent care, way too much for ibuprofen and amoxicillin, and then I still have a bill I can&amp;#39;t afford to pay.&lt;/p&gt;\n\n&lt;p&gt;I asked him today if he could help me out, since he took away my insurance around the time the visit for my ear infection would have been billed. He told me to get a job. I&amp;#39;ve applied to 100+ places in the last few months alone. I got scammed into working at an insurance company (lesson learned) and that obviously didn&amp;#39;t pan out. My husband and I only have one car and no one near us wants to hire young people it seems.&lt;/p&gt;\n\n&lt;p&gt;But you know what? Screw it. I&amp;#39;d rather be dirt poor than ever deal with his verbal/physical abuse or his delusions. I&amp;#39;m going to make it in life. And he can just fume with rage when I am doing well and won&amp;#39;t &amp;quot;pay him back&amp;quot; for &amp;quot;everything&amp;quot; he&amp;#39;s &amp;quot;done&amp;quot; for me.&lt;/p&gt;\n\n&lt;p&gt;I AM FREE! :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Growing up, my dad drilled it into my head that I needed to be thankful for him. That he went to work and did everything for us because my mom was lazy and useless. While she didn't work, she took us to doctor's appointments. Made sure there was more than just seafood in the house (my dad loves seafood, I hate it). She got us supplies for school projects. Yes, my dad provided financially but at the cost of making us all feel horrible for it. We didn't say thank you for something? We were ungrateful pieces of shit, according to him.\n\nThen there was the abuse. Told me he wished my mom miscarried me (I'm the older one, he favored my sister). Told me he wished I wasn't born. Told me I was ugly because I fell off my bike and skinned my knee (girls can't have scars or they're ugly). Told me my mom was ugly because she didn't wear dresses or makeup. Beat the shit out of me. Broke a shoe horn over my back. Whipped me with an extension cord. Punched me, slapped me, slammed me into the wall. Beat me while my mom was driving with my best friend sitting next to me because I told him not to hit my sister (his favor of her obviously diminished). He nearly killed me one night when he choked me out on the floor. Two years later and my nose still hurts from the fracture. I had blood bruises all over my face for weeks. I drove off that night with not so much as shoes on my feet. Luckily my purse and phone were still in my car. I drove to the church. It was a Wednesday night. I called my friend and her brother and his friend were ready and determined to fight my dad. Especially when I showed up to church with a bruises, crying, and a bloody and cut face. A member who is a nurse checked me out. I stayed with my friend for a while. I went to church that weekend. Everyone saw my injuries. I wasn't ashamed. I wasn't the one who beat their own daughter in **'self-defense'** because she told you to quit screaming at and insulting her mother. Yes, he really beat me because I SAID something. He beat me for reporting that his distant cousin molested me. He did coke and heroin around me as a small child and would terrify me, causing me to have night terrors where my mom would have to hold me down so I didn't get hurt from flailing around. There's so much more.\n\nThen there's the screwing me over. I had $20,000 roughly in savings bonds from my grandparents for college/car/etc. I obviously couldn't cash them until I was old enough. When I was 18, I got to buy a Jeep with it. $1,500 out of $20k isn't much. He would cash them, use them for our trips up north to see his sister, and then because we'd see my grandpa (mom's dad) as well, make my grandpa pay him back (my grandpa didn't know they spent my money and was just helping since he is very well off). My dad also did that to my sister.\n\nHe took me off the health insurance once my parents divorced, even though their divorce isn't my fault. I have ovarian cysts and need birth control as well as some other health conditions that involve me getting injured or being in chronic pain. I had an ear infection and had to pay the money for urgent care, way too much for ibuprofen and amoxicillin, and then I still have a bill I can't afford to pay.\n\nI asked him today if he could help me out, since he took away my insurance around the time the visit for my ear infection would have been billed. He told me to get a job. I've applied to 100+ places in the last few months alone. I got scammed into working at an insurance company (lesson learned) and that obviously didn't pan out. My husband and I only have one car and no one near us wants to hire young people it seems.\n\n\nBut you know what? Screw it. I'd rather be dirt poor than ever deal with his verbal/physical abuse or his delusions. I'm going to make it in life. And he can just fume with rage when I am doing well and won't \"pay him back\" for \"everything\" he's \"done\" for me.\n\n\nI AM FREE! :)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1xu3tu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cosmicdusting", "media": null, "score": 73, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 11, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1xu3tu/i_finally_stood_up_to_my_dad_im_free/", "name": "t3_1xu3tu", "created": 1392325839.0, "url": "http://www.reddit.com/r/happy/comments/1xu3tu/i_finally_stood_up_to_my_dad_im_free/", "author_flair_text": null, "title": "I finally stood up to my dad. I'm free.", "created_utc": 1392325839.0, "ups": 84, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cffb0z2", "gilded": 0, "author": "cosmicdusting", "parent_id": "t1_cfendr6", "approved_by": null, "body": "Thank you so much! I wish you luck as well. :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! I wish you luck as well. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffb0z2", "created": 1392398894.0, "author_flair_text": null, "created_utc": 1392398894.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "cfendr6", "gilded": 0, "author": "OfficerPanda", "parent_id": "t3_1xu3tu", "approved_by": null, "body": "Good read, glad you're away from him. I wish you luck in life. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good read, glad you&amp;#39;re away from him. I wish you luck in life. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cfendr6", "created": 1392327794.0, "author_flair_text": null, "created_utc": 1392327794.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cffjnap", "gilded": 0, "author": "jackfreeman", "parent_id": "t1_cffazwp", "approved_by": null, "body": "Whatever kills you keeps trying, but it only wins if you let it. \n\nYou're already tougher than you have any clue of, kiddo. You're going to do great. It'll suck, and there are times where you are going to want to throw in the towel, but take it from someone who had a very, very similar upbringing- don't quit. You were gifted the lesson that many learn too late: the only person that you can expect to watch your back is you. You don't have to ruin someone else's life to get ahead, but no one has the right to ruin yours. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whatever kills you keeps trying, but it only wins if you let it. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re already tougher than you have any clue of, kiddo. You&amp;#39;re going to do great. It&amp;#39;ll suck, and there are times where you are going to want to throw in the towel, but take it from someone who had a very, very similar upbringing- don&amp;#39;t quit. You were gifted the lesson that many learn too late: the only person that you can expect to watch your back is you. You don&amp;#39;t have to ruin someone else&amp;#39;s life to get ahead, but no one has the right to ruin yours. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffjnap", "created": 1392417777.0, "author_flair_text": null, "created_utc": 1392417777.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cffazwp", "gilded": 0, "author": "cosmicdusting", "parent_id": "t1_cff5l6e", "approved_by": null, "body": "He played the perfect family at church and if we didn't play along, we knew he'd make it known in an ugly way. My dad was never much of a parent growing up and if nothing else, I can prevent it from even possibly happening to my children one day because he'll never see them.\n\nThank you, I love weird people, honestly. Things feel super hard sometimes but I know they'll get better.\n\n\"Everything gets better in the end. If it isn't better, it isn't the end.\" :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He played the perfect family at church and if we didn&amp;#39;t play along, we knew he&amp;#39;d make it known in an ugly way. My dad was never much of a parent growing up and if nothing else, I can prevent it from even possibly happening to my children one day because he&amp;#39;ll never see them.&lt;/p&gt;\n\n&lt;p&gt;Thank you, I love weird people, honestly. Things feel super hard sometimes but I know they&amp;#39;ll get better.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Everything gets better in the end. If it isn&amp;#39;t better, it isn&amp;#39;t the end.&amp;quot; :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffazwp", "created": 1392398829.0, "author_flair_text": null, "created_utc": 1392398829.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "cff5l6e", "gilded": 0, "author": "jackfreeman", "parent_id": "t3_1xu3tu", "approved_by": null, "body": "How did he get away with all of that damage? You're female, and you were a child! It's taking everything that I have in me to hate him, so I'll focus on your strength. \n\nYou're going to do incredible things with weird people. You're tougher than an old steak, and stronger than anyone you know. You've earned this freedom. Your scars are a badge of honor. Don't you dare regret a single one. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How did he get away with all of that damage? You&amp;#39;re female, and you were a child! It&amp;#39;s taking everything that I have in me to hate him, so I&amp;#39;ll focus on your strength. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re going to do incredible things with weird people. You&amp;#39;re tougher than an old steak, and stronger than anyone you know. You&amp;#39;ve earned this freedom. Your scars are a badge of honor. Don&amp;#39;t you dare regret a single one. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cff5l6e", "created": 1392384455.0, "author_flair_text": null, "created_utc": 1392384455.0, "distinguished": null, "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cffk7tj", "gilded": 0, "author": "Shezzam", "parent_id": "t1_cffb0nn", "approved_by": null, "body": ":0) there are enough people in the world trying to hurt us without giving them permission?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:0) there are enough people in the world trying to hurt us without giving them permission?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffk7tj", "created": 1392419131.0, "author_flair_text": null, "created_utc": 1392419131.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cffb0nn", "gilded": 0, "author": "cosmicdusting", "parent_id": "t1_cff57dn", "approved_by": null, "body": "Thank you, it feels really nice hearing that. It's easy to get stuck in my own head and feel I deserved it so things like this remind me I didn't. Thank you. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, it feels really nice hearing that. It&amp;#39;s easy to get stuck in my own head and feel I deserved it so things like this remind me I didn&amp;#39;t. Thank you. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffb0nn", "created": 1392398874.0, "author_flair_text": null, "created_utc": 1392398874.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cff57dn", "gilded": 0, "author": "Shezzam", "parent_id": "t3_1xu3tu", "approved_by": null, "body": "If it's any consolation, I'm proud of you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s any consolation, I&amp;#39;m proud of you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cff57dn", "created": 1392382857.0, "author_flair_text": null, "created_utc": 1392382857.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cffbc9v", "gilded": 0, "author": "2OQuestions", "parent_id": "t1_cffavi6", "approved_by": null, "body": "Good for you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffbc9v", "created": 1392399576.0, "author_flair_text": null, "created_utc": 1392399576.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cffavi6", "gilded": 0, "author": "cosmicdusting", "parent_id": "t1_cffaokd", "approved_by": null, "body": "He's in his later 80's now and struggling with living in a nursing home since my mom's sisters (one is 20 minutes away and one is 2 hours away, we are 14 hours away) sold his house. He also seems to be falling deeper into dementia and the closer living aunt is the one in control of his finances, except his will and final things. So things will be tough for a bit but I know they'll get better. Telling my dad off released such a burden off of me. First I was crying because I was mad and then I was bawling because, holy mess, he doesn't control my life anymore! :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s in his later 80&amp;#39;s now and struggling with living in a nursing home since my mom&amp;#39;s sisters (one is 20 minutes away and one is 2 hours away, we are 14 hours away) sold his house. He also seems to be falling deeper into dementia and the closer living aunt is the one in control of his finances, except his will and final things. So things will be tough for a bit but I know they&amp;#39;ll get better. Telling my dad off released such a burden off of me. First I was crying because I was mad and then I was bawling because, holy mess, he doesn&amp;#39;t control my life anymore! :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffavi6", "created": 1392398569.0, "author_flair_text": null, "created_utc": 1392398569.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cffaokd", "gilded": 0, "author": "2OQuestions", "parent_id": "t3_1xu3tu", "approved_by": null, "body": "Can your grandpa help you out? Sorry you had to endure this.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can your grandpa help you out? Sorry you had to endure this.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffaokd", "created": 1392398151.0, "author_flair_text": null, "created_utc": 1392398151.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cffg8ln", "gilded": 0, "author": "BurnerGeek", "parent_id": "t3_1xu3tu", "approved_by": null, "body": "It's good to hear that you got out. You are so strong. Keep going! :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s good to hear that you got out. You are so strong. Keep going! :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xu3tu", "score_hidden": false, "name": "t1_cffg8ln", "created": 1392410177.0, "author_flair_text": null, "created_utc": 1392410177.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]