[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m usually very untrusting of my skills as a (very small scale) SVN server admin. The research group i&amp;#39;m a part of trusts me to handle it, so when someone has a problem, i often panick.&lt;/p&gt;\n\n&lt;p&gt;Today, my colleague came to me asking why he didn&amp;#39;t have anymore access to his SVN. I checked and my own access had stopped working.&lt;/p&gt;\n\n&lt;p&gt;At first, i checked anything i could have done - beating myself up for not being all-the-latest-up-to-date in upgrades and backups (although there is a weekly system backup happening).&lt;/p&gt;\n\n&lt;p&gt;After talking a bit with him, trying to isolate the problem, and then checking by elimination, i found the culprit. A little line he had removed without thinking (or maybe that other line he should have removed as well). Anyway, i changed that line, and that fixed the problem (alltogether less than 6 hours after the problem was discovered).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m happy, very happy, because i managed to fix the problem with minimal help, because the problem wasn&amp;#39;t due to an error of my part... also because without my help, the problem could have evolved into a nuisance for several colleagues and a whole class of students.&lt;/p&gt;\n\n&lt;p&gt;Sometimes small things like that give back some self-esteem, and when it also helps others, that&amp;#39;s something that brings me true happiness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm usually very untrusting of my skills as a (very small scale) SVN server admin. The research group i'm a part of trusts me to handle it, so when someone has a problem, i often panick.\n\nToday, my colleague came to me asking why he didn't have anymore access to his SVN. I checked and my own access had stopped working.\n\nAt first, i checked anything i could have done - beating myself up for not being all-the-latest-up-to-date in upgrades and backups (although there is a weekly system backup happening).\n\nAfter talking a bit with him, trying to isolate the problem, and then checking by elimination, i found the culprit. A little line he had removed without thinking (or maybe that other line he should have removed as well). Anyway, i changed that line, and that fixed the problem (alltogether less than 6 hours after the problem was discovered).\n\nI'm happy, very happy, because i managed to fix the problem with minimal help, because the problem wasn't due to an error of my part... also because without my help, the problem could have evolved into a nuisance for several colleagues and a whole class of students.\n\nSometimes small things like that give back some self-esteem, and when it also helps others, that's something that brings me true happiness.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "21ikhz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stingap", "media": null, "score": 17, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/happy/comments/21ikhz/i_found_an_error_and_saved_everyones_svn_access/", "name": "t3_21ikhz", "created": 1395966471.0, "url": "http://www.reddit.com/r/happy/comments/21ikhz/i_found_an_error_and_saved_everyones_svn_access/", "author_flair_text": null, "title": "I found an error and saved everyone's SVN access in my research group.", "created_utc": 1395937671.0, "ups": 21, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]