[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been experimenting with psychedelics with years, but have met with disapproval from my younger sister, who only drinks. This weekend she informed me I had a one-time-only window to make her trip, because her best friend was in town and she wanted him there for it.&lt;/p&gt;\n\n&lt;p&gt;I gave her an eighth of shrooms, and we watched Wreck-It Ralph, Planet Earth and Across the Universe, she ran around her apartment touching everything, staring at the ceiling, laughing her ass off - all the things that make for a great time. When it was over, she told me she had a wonderful day, and would be willing to do it again - something I never thought I&amp;#39;d hear from her. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll turn her into a hippie yet!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been experimenting with psychedelics with years, but have met with disapproval from my younger sister, who only drinks. This weekend she informed me I had a one-time-only window to make her trip, because her best friend was in town and she wanted him there for it.\n\nI gave her an eighth of shrooms, and we watched Wreck-It Ralph, Planet Earth and Across the Universe, she ran around her apartment touching everything, staring at the ceiling, laughing her ass off - all the things that make for a great time. When it was over, she told me she had a wonderful day, and would be willing to do it again - something I never thought I'd hear from her. \n\nI'll turn her into a hippie yet!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1xk8zq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "allthemolecules", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 14, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1xk8zq/i_introduced_my_straightedge_sister_to_magic/", "name": "t3_1xk8zq", "created": 1392074832.0, "url": "http://www.reddit.com/r/happy/comments/1xk8zq/i_introduced_my_straightedge_sister_to_magic/", "author_flair_text": null, "title": "I introduced my straightedge sister to magic mushrooms, and she had a blast!", "created_utc": 1392074832.0, "ups": 7, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]