[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really depressed. I don&amp;#39;t know what I&amp;#39;m doing here. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm really depressed. I don't know what I'm doing here. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "23kltu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "genetically_witless", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 3, "saved": false, "is_self": true, "permalink": "/r/happy/comments/23kltu/im_so_freaking_happy_i_could_die/", "name": "t3_23kltu", "created": 1398089709.0, "url": "http://www.reddit.com/r/happy/comments/23kltu/im_so_freaking_happy_i_could_die/", "author_flair_text": null, "title": "I'm so freaking happy I could die", "created_utc": 1398060909.0, "ups": 8, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cgzpnkn", "gilded": 0, "author": "genetically_witless", "parent_id": "t1_cgyueq1", "approved_by": null, "body": "I have an irrational fear that everyone around me hates me. I've spent the last 5 years in college. I don't feel like I've made any friends. I probably have, but I have a hard time establishing any kind of an emotional connection to anyone. Everyone feels like a stranger. I regret picking my major. It was a lot of work. I barely managed to keep my head above water. \n\n\nI lost my job waiting tables because my manager said I was not 'outgoing enough.' I was too depressed/tired to be able to act happy at my job and they noticed. I spent too much time studying/avoiding people and not networking. I haven't participated in extra curricular projects and have no experience in the field I majored in. I fear that I will not find a job and will have wasted my time here. \n\n\nMy girlfriend broke up with me because she believes in god and I don't. At least that's what she said. I feel like it was probably because of how withdrawn I act most of of the time. My social circle consist of 3 room mates who I barely talk to. I can't sleep because I'm too stressed about money/finding a job. I don't have anyone to talk to. Not that I would. I have a bad habit of keeping everything to my self when I'm stressed. \n\n\nThe only thing keeping me sane is that I go the gym to lift weights and run everyday. I feel less anxious afterwards, but I still can't sleep. I sleep off and on for 4 to 6 hours every night. I don't eat very much anymore, I just don't feel like it. I've lost 15 lbs in the past 3 weeks. All of this just makes me physically exhausted, and mentally sluggish. I've fallen behind in school. I can't focus on anything and I keep missing deadlines. I'm not even sure if some of my grades are passing.\n\n\nI'd talk to my parents, but I feel like I'd be disappointing them. Besides they are already under a lot of stress. My grandfather suffered a stroke a few months ago. They can't afford a nursing home, so my mom takes care of him all day. I can see its starting to wear her down. My dad's going through testing for prostate cancer. He's hiding it well, but I can see how worried he is. \n\n\nI know people have gone through worse. I know I'd be much better at coping with this if I just didn't feel so damned alone. \n\n\n\n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an irrational fear that everyone around me hates me. I&amp;#39;ve spent the last 5 years in college. I don&amp;#39;t feel like I&amp;#39;ve made any friends. I probably have, but I have a hard time establishing any kind of an emotional connection to anyone. Everyone feels like a stranger. I regret picking my major. It was a lot of work. I barely managed to keep my head above water. &lt;/p&gt;\n\n&lt;p&gt;I lost my job waiting tables because my manager said I was not &amp;#39;outgoing enough.&amp;#39; I was too depressed/tired to be able to act happy at my job and they noticed. I spent too much time studying/avoiding people and not networking. I haven&amp;#39;t participated in extra curricular projects and have no experience in the field I majored in. I fear that I will not find a job and will have wasted my time here. &lt;/p&gt;\n\n&lt;p&gt;My girlfriend broke up with me because she believes in god and I don&amp;#39;t. At least that&amp;#39;s what she said. I feel like it was probably because of how withdrawn I act most of of the time. My social circle consist of 3 room mates who I barely talk to. I can&amp;#39;t sleep because I&amp;#39;m too stressed about money/finding a job. I don&amp;#39;t have anyone to talk to. Not that I would. I have a bad habit of keeping everything to my self when I&amp;#39;m stressed. &lt;/p&gt;\n\n&lt;p&gt;The only thing keeping me sane is that I go the gym to lift weights and run everyday. I feel less anxious afterwards, but I still can&amp;#39;t sleep. I sleep off and on for 4 to 6 hours every night. I don&amp;#39;t eat very much anymore, I just don&amp;#39;t feel like it. I&amp;#39;ve lost 15 lbs in the past 3 weeks. All of this just makes me physically exhausted, and mentally sluggish. I&amp;#39;ve fallen behind in school. I can&amp;#39;t focus on anything and I keep missing deadlines. I&amp;#39;m not even sure if some of my grades are passing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d talk to my parents, but I feel like I&amp;#39;d be disappointing them. Besides they are already under a lot of stress. My grandfather suffered a stroke a few months ago. They can&amp;#39;t afford a nursing home, so my mom takes care of him all day. I can see its starting to wear her down. My dad&amp;#39;s going through testing for prostate cancer. He&amp;#39;s hiding it well, but I can see how worried he is. &lt;/p&gt;\n\n&lt;p&gt;I know people have gone through worse. I know I&amp;#39;d be much better at coping with this if I just didn&amp;#39;t feel so damned alone. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23kltu", "score_hidden": false, "name": "t1_cgzpnkn", "created": 1398260906.0, "author_flair_text": null, "created_utc": 1398232106.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cgyueq1", "gilded": 0, "author": "DarthHeeder", "parent_id": "t1_cgxxfxr", "approved_by": null, "body": "Don't be sorry! Is there a reason you're depressed?", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be sorry! Is there a reason you&amp;#39;re depressed?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23kltu", "score_hidden": false, "name": "t1_cgyueq1", "created": 1398182274.0, "author_flair_text": null, "created_utc": 1398153474.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cgxxfxr", "gilded": 0, "author": "genetically_witless", "parent_id": "t3_23kltu", "approved_by": null, "body": "sorry", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sorry&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_23kltu", "score_hidden": false, "name": "t1_cgxxfxr", "created": 1398089718.0, "author_flair_text": null, "created_utc": 1398060918.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]