[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And that makes me happy.&lt;/p&gt;\n\n&lt;p&gt;After a rough year, rough week, and in attempt to not go back down the raging alcoholic path again, I&amp;#39;ve been trying to keep myself busy with all the things I used to love to do on the regular. Sunday&amp;#39;s are becoming my favorite day of the week. The past few I&amp;#39;ve woken up early to make breakfast for the family (made homemade biscuits and sausage gravy for the first time ever and they were so good), and then walk the dogs around the park, listen to music, and drink my morning tea. Go bust my ass at work for a few hours. Come home and take a wonderful, much deserved nap. Make dinner for everyone (tonight was watermelon gazpacho....everyone else loved it, but they could just be saying that, ha, I thought it was pretty gross). Then I head off for a nice drive and hike out at the lake with the more adventurous dog. Today was the first day that I&amp;#39;ve noticed that all the trees and plants have pretty much completely flourished. It was really beautiful and put my heart in a happy place. Now the lake just needs to warm up a little more so I can jump on in it, because then I&amp;#39;ll be incredibly happy. I hope everyone else was able to find some happiness in their day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "And that makes me happy.\n\nAfter a rough year, rough week, and in attempt to not go back down the raging alcoholic path again, I've been trying to keep myself busy with all the things I used to love to do on the regular. Sunday's are becoming my favorite day of the week. The past few I've woken up early to make breakfast for the family (made homemade biscuits and sausage gravy for the first time ever and they were so good), and then walk the dogs around the park, listen to music, and drink my morning tea. Go bust my ass at work for a few hours. Come home and take a wonderful, much deserved nap. Make dinner for everyone (tonight was watermelon gazpacho....everyone else loved it, but they could just be saying that, ha, I thought it was pretty gross). Then I head off for a nice drive and hike out at the lake with the more adventurous dog. Today was the first day that I've noticed that all the trees and plants have pretty much completely flourished. It was really beautiful and put my heart in a happy place. Now the lake just needs to warm up a little more so I can jump on in it, because then I'll be incredibly happy. I hope everyone else was able to find some happiness in their day.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "24qw1o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "bisonison", "media": null, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/happy/comments/24qw1o/its_warm_doesnt_get_dark_til_almost_nine_and/", "name": "t3_24qw1o", "created": 1399289050.0, "url": "http://www.reddit.com/r/happy/comments/24qw1o/its_warm_doesnt_get_dark_til_almost_nine_and/", "author_flair_text": null, "title": "It's warm, doesn't get dark til almost nine, and green leaves are back on all the trees.", "created_utc": 1399260250.0, "ups": 12, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]