[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 25 and I&amp;#39;ve been hopping from job to job since I was 13. I&amp;#39;ve always hated all my jobs, pretty much from day one. I have 3 more semesters of college left, and I decided to move back home so I didn&amp;#39;t have to worry about working 40 hours at a garbage job that pushed me into discontent within fifteen minutes of clocking in each day. I quit my job at Panera Bread (worst job by-far), and I lived off my savings (and parents) for a few months.&lt;/p&gt;\n\n&lt;p&gt;In March, I reluctantly started looking for a new job. I half-assed my way through several applications and two interviews. I really didn&amp;#39;t want any of those jobs - they were just gonna be fillers &amp;quot;til I find something better.&amp;quot; Luckily I didn&amp;#39;t get hired anywhere, because my Grandma told me about a gardening company her best friend&amp;#39;s daughter has. Turns out the lady was looking for help, and I was just the person! I got hired two days after putting in my application, and I started working two weeks after that.&lt;/p&gt;\n\n&lt;p&gt;Since I started working there, I&amp;#39;ve been so happy. I look forward to going to bed early so that I can give 100% the next day at work; I don&amp;#39;t hate the alarm clock, and I don&amp;#39;t mind driving through 30 minutes of rush-hour traffic each morning; I don&amp;#39;t mind working for 10 hours straight.&lt;/p&gt;\n\n&lt;p&gt;I usually have a pretty high level of social anxiety, but I can talk to my co-workers like I&amp;#39;ve known them for years. All of them (including the boss/owner) are so down-to-earth, compassionate, and realistic. The work isn&amp;#39;t real heavy, and it makes me feel good and active. We eat lunch outside in a park every day, the pay is great, and I get holidays off. If it rains, then we get to go home to our families.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so excited for what the summer is going to bring - I love being outside, especially in the summer time. I love going home every day with dirt all over me, so I might as well get paid for it while spending my time with good people!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna take it all in and appreciate every moment of it, because I don&amp;#39;t think my post-college job will be this flexible, healthy, or fun.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 25 and I've been hopping from job to job since I was 13. I've always hated all my jobs, pretty much from day one. I have 3 more semesters of college left, and I decided to move back home so I didn't have to worry about working 40 hours at a garbage job that pushed me into discontent within fifteen minutes of clocking in each day. I quit my job at Panera Bread (worst job by-far), and I lived off my savings (and parents) for a few months.\n\nIn March, I reluctantly started looking for a new job. I half-assed my way through several applications and two interviews. I really didn't want any of those jobs - they were just gonna be fillers \"til I find something better.\" Luckily I didn't get hired anywhere, because my Grandma told me about a gardening company her best friend's daughter has. Turns out the lady was looking for help, and I was just the person! I got hired two days after putting in my application, and I started working two weeks after that.\n\nSince I started working there, I've been so happy. I look forward to going to bed early so that I can give 100% the next day at work; I don't hate the alarm clock, and I don't mind driving through 30 minutes of rush-hour traffic each morning; I don't mind working for 10 hours straight.\n\nI usually have a pretty high level of social anxiety, but I can talk to my co-workers like I've known them for years. All of them (including the boss/owner) are so down-to-earth, compassionate, and realistic. The work isn't real heavy, and it makes me feel good and active. We eat lunch outside in a park every day, the pay is great, and I get holidays off. If it rains, then we get to go home to our families.\n\nI'm so excited for what the summer is going to bring - I love being outside, especially in the summer time. I love going home every day with dirt all over me, so I might as well get paid for it while spending my time with good people!\n\nI'm gonna take it all in and appreciate every moment of it, because I don't think my post-college job will be this flexible, healthy, or fun.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "256avd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "eizoop", "media": null, "score": 13, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/happy/comments/256avd/ive_been_working_for_12_years_i_finally_found_a/", "name": "t3_256avd", "created": 1399712385.0, "url": "http://www.reddit.com/r/happy/comments/256avd/ive_been_working_for_12_years_i_finally_found_a/", "author_flair_text": null, "title": "I've been working for 12 years &amp; I finally found a job I love!", "created_utc": 1399683585.0, "ups": 14, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "chfxqyw", "gilded": 0, "author": "DarkwaterV2", "parent_id": "t1_cheq3q3", "approved_by": null, "body": "Well then may you get all you possibly can out of this!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well then may you get all you possibly can out of this!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256avd", "score_hidden": false, "name": "t1_chfxqyw", "created": 1399932566.0, "author_flair_text": null, "created_utc": 1399903766.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cheq3q3", "gilded": 0, "author": "eizoop", "parent_id": "t1_cheiskh", "approved_by": null, "body": "I can live off my wages, but it's a seasonal job, so I won't be able to live off them in the winter. Plus, just living off the wage isn't enough - I'm trying to build something better for myself. I need land and a farm. This job won't give me enough money to do anything but support my current lifestyle (which isn't desirable for me).", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can live off my wages, but it&amp;#39;s a seasonal job, so I won&amp;#39;t be able to live off them in the winter. Plus, just living off the wage isn&amp;#39;t enough - I&amp;#39;m trying to build something better for myself. I need land and a farm. This job won&amp;#39;t give me enough money to do anything but support my current lifestyle (which isn&amp;#39;t desirable for me).&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256avd", "score_hidden": false, "name": "t1_cheq3q3", "created": 1399788467.0, "author_flair_text": null, "created_utc": 1399759667.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cheiskh", "gilded": 0, "author": "DarkwaterV2", "parent_id": "t3_256avd", "approved_by": null, "body": "&gt;I'm gonna take it all in and appreciate every moment of it, because I don't think my post-college job will be this flexible, healthy, or fun.\n\nEizoop, am I missing something here? If this job really makes you as happy as it seems, why don't you just keep it? If it makes you this happy and you can live off the wages, then what else do you have to wish for? You're living a life where you look *forward* to working, man!", "edited": 1399747712.0, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m gonna take it all in and appreciate every moment of it, because I don&amp;#39;t think my post-college job will be this flexible, healthy, or fun.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Eizoop, am I missing something here? If this job really makes you as happy as it seems, why don&amp;#39;t you just keep it? If it makes you this happy and you can live off the wages, then what else do you have to wish for? You&amp;#39;re living a life where you look &lt;em&gt;forward&lt;/em&gt; to working, man!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_256avd", "score_hidden": false, "name": "t1_cheiskh", "created": 1399769458.0, "author_flair_text": null, "created_utc": 1399740658.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}]