[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For Valentine&amp;#39;s Day, just four days ago, I felt lonely as I usually did, and a few days prior I wad worried about my depression being really bad with that sort of smack of reality. Then, my best friend decided that her, two of our friends and I would go to McDonalds as a sort of condolence to the fact that we all felt so lonely. Somehow, a boy we are friends with was invited along, and he actually attended. Normally he hates &amp;#39;stupid&amp;#39; things like that, so it surprised me that he decided to actually join us. Later, while we planned it, he invited me over to hang out at the mall afterward. I thought nothing of it, and agreed to it. Somewhere along the way, he invited me to go to his house to play Minecraft, explaining he never had anyone to play it with. I happily agreed, as we were once best friends and I was happy that we could become friends again. My best friend was teasing me, saying that he would &amp;quot;make his move&amp;quot; that evening. I had considered it, though not seriously and we simply laughed about it. While we hung out later, we did exactly what he had invited me to do. We played Minecraft for an hour and q half before I had to go home. We laughed and joked and talked and just had fun. Soon enough, he asked me to hang out again the next day. After talking to my friends about it, I realized that it looks as if he has feelings for me, and that I have feelings for him. I spoke excitedly with my friends, and when we hung out again, it was exactly as before. We played GTA for some time before going to Minecraft as before. We laughed a lot, more him than myself, at the fact that I was not used to XBOX controls and continuously messed things up in game, we ended up having some pizza while I was there and it all around felt like two friends just hanging out. He asked me to hang out again, and as I was busy with family and chores it had to wait until today, where he spent four and a half hours at my house. My family was there for most of the time, whom he got along with just fine. I let him try out a horror game, Outlast, I had recently downloaded, and I was impressed he did not put on a tough guy attitude. He screamed when he got scared, got angry when I didn&amp;#39;t warn him about jump scares, and even told me not to make fun of him when he screamed like a girl. One thing I now notice is that while he was playing, as I knew the controls, I would tell him what to do fairly often. Sometimes he would not want to do as I said, and I persistently went to press the button on the controller to do it myself. Although he stubbornly refused to let me do anything, claiming to be capable of playing it himself, he did not seem at all uneasy at the motion of me touching him. While hanging out with him, I completely forget about anything between us and we just hang out like friends, making me oblivious to times when I now realize he appeared to be flirting. I mentioned that my birthday is less than a week away and I still have yet to actually plan my birthday party and he asked, &amp;quot;So, who&amp;#39;s going?&amp;quot; Clearly wanting to attend himself, though not wanting to outwardly ask. I am being honest, my birthday party will consist of going to Build a Bear and Sky Zone. We will be making stuffed animals and jumping on trampolines for half the day. I told him this exactly. This is the guy who doesn&amp;#39;t even like playing board games or participating in gym class. He agreed to go. I am genuinely amazed, and realized that he is most likely attending simply for a chance to spend time with me, and that also might have been the same reason for him joining us on Valentine&amp;#39;s Day. My face is sore from smiling for at least an hour straight now, but I have never been happier. No one has ever shown the slightest interest in me whatsoever. I can&amp;#39;t wait for my birthday party, this very Saturday, and hope that something will happen between us to the point where Valentine&amp;#39;s Day will be considered our anniversary.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For Valentine's Day, just four days ago, I felt lonely as I usually did, and a few days prior I wad worried about my depression being really bad with that sort of smack of reality. Then, my best friend decided that her, two of our friends and I would go to McDonalds as a sort of condolence to the fact that we all felt so lonely. Somehow, a boy we are friends with was invited along, and he actually attended. Normally he hates 'stupid' things like that, so it surprised me that he decided to actually join us. Later, while we planned it, he invited me over to hang out at the mall afterward. I thought nothing of it, and agreed to it. Somewhere along the way, he invited me to go to his house to play Minecraft, explaining he never had anyone to play it with. I happily agreed, as we were once best friends and I was happy that we could become friends again. My best friend was teasing me, saying that he would \"make his move\" that evening. I had considered it, though not seriously and we simply laughed about it. While we hung out later, we did exactly what he had invited me to do. We played Minecraft for an hour and q half before I had to go home. We laughed and joked and talked and just had fun. Soon enough, he asked me to hang out again the next day. After talking to my friends about it, I realized that it looks as if he has feelings for me, and that I have feelings for him. I spoke excitedly with my friends, and when we hung out again, it was exactly as before. We played GTA for some time before going to Minecraft as before. We laughed a lot, more him than myself, at the fact that I was not used to XBOX controls and continuously messed things up in game, we ended up having some pizza while I was there and it all around felt like two friends just hanging out. He asked me to hang out again, and as I was busy with family and chores it had to wait until today, where he spent four and a half hours at my house. My family was there for most of the time, whom he got along with just fine. I let him try out a horror game, Outlast, I had recently downloaded, and I was impressed he did not put on a tough guy attitude. He screamed when he got scared, got angry when I didn't warn him about jump scares, and even told me not to make fun of him when he screamed like a girl. One thing I now notice is that while he was playing, as I knew the controls, I would tell him what to do fairly often. Sometimes he would not want to do as I said, and I persistently went to press the button on the controller to do it myself. Although he stubbornly refused to let me do anything, claiming to be capable of playing it himself, he did not seem at all uneasy at the motion of me touching him. While hanging out with him, I completely forget about anything between us and we just hang out like friends, making me oblivious to times when I now realize he appeared to be flirting. I mentioned that my birthday is less than a week away and I still have yet to actually plan my birthday party and he asked, \"So, who's going?\" Clearly wanting to attend himself, though not wanting to outwardly ask. I am being honest, my birthday party will consist of going to Build a Bear and Sky Zone. We will be making stuffed animals and jumping on trampolines for half the day. I told him this exactly. This is the guy who doesn't even like playing board games or participating in gym class. He agreed to go. I am genuinely amazed, and realized that he is most likely attending simply for a chance to spend time with me, and that also might have been the same reason for him joining us on Valentine's Day. My face is sore from smiling for at least an hour straight now, but I have never been happier. No one has ever shown the slightest interest in me whatsoever. I can't wait for my birthday party, this very Saturday, and hope that something will happen between us to the point where Valentine's Day will be considered our anniversary.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1y7ujx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "PurpleSpyral", "media": null, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1y7ujx/ive_never_been_so_happy/", "name": "t3_1y7ujx", "created": 1392702024.0, "url": "http://www.reddit.com/r/happy/comments/1y7ujx/ive_never_been_so_happy/", "author_flair_text": null, "title": "I've never been so happy", "created_utc": 1392702024.0, "ups": 12, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]