[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m doing a study abroad year in England right now and I made it my goal to see some area of Scotland before my time was up. And now it&amp;#39;s official! Just booked my tickets for a solid 6 nights/5 days in Edinburgh (and probably surrounding areas). &lt;/p&gt;\n\n&lt;p&gt;This will be my first official &amp;quot;solo&amp;quot; trip by myself and while I&amp;#39;m nervous for it, I&amp;#39;m incredibly stoked too. I damn well deserve a nice vacation by myself, I say. &lt;/p&gt;\n\n&lt;p&gt;Even better, this whole planning has taken me out of my little funk of depression I&amp;#39;ve been in, so that&amp;#39;s a major plus. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm doing a study abroad year in England right now and I made it my goal to see some area of Scotland before my time was up. And now it's official! Just booked my tickets for a solid 6 nights/5 days in Edinburgh (and probably surrounding areas). \n\nThis will be my first official \"solo\" trip by myself and while I'm nervous for it, I'm incredibly stoked too. I damn well deserve a nice vacation by myself, I say. \n\nEven better, this whole planning has taken me out of my little funk of depression I've been in, so that's a major plus. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1ydhpq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "DidSomeoneSaySloth", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1ydhpq/just_booked_a_solo_trip_to_edinburgh/", "name": "t3_1ydhpq", "created": 1392842609.0, "url": "http://www.reddit.com/r/happy/comments/1ydhpq/just_booked_a_solo_trip_to_edinburgh/", "author_flair_text": null, "title": "Just booked a solo trip to Edinburgh!", "created_utc": 1392842609.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfk28p9", "gilded": 0, "author": "DidSomeoneSaySloth", "parent_id": "t1_cfjq0sd", "approved_by": null, "body": "I would say what I'm most nervous for is also what I'm most excited for - Going to explore a place all by myself with only **me** to direct where I want to go. After travelling with family and such, I realize I enjoy places at my own pace, and really hate having to stick with a group of people who don't want to do what I want to do, so this will be a great time to just have a good time doing what I really want to do. \n\nAs for tips.... well, how I decided on Edinburgh was that when I came on exchange to the UK, I said it constantly that I wanted to see Wales and Scotland (going to Wales sometime soon too with a friend). I couldn't say why I want to go, I just do. So I did my research slowly over time, and finally booked that flight. Just do it, really. \n\nAnd now, planning will be my own little 'solo project' I can do when I don't want to do work or something. I can get excited about this trip for the next few months until I go. \n\n*Best I can say is what I keep telling myself when I'm nervous about it* - You bloody owe it to yourself to go on this trip you've always wanted to go on. You know you do. Therefore, what should stop you if you really want to do it? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say what I&amp;#39;m most nervous for is also what I&amp;#39;m most excited for - Going to explore a place all by myself with only &lt;strong&gt;me&lt;/strong&gt; to direct where I want to go. After travelling with family and such, I realize I enjoy places at my own pace, and really hate having to stick with a group of people who don&amp;#39;t want to do what I want to do, so this will be a great time to just have a good time doing what I really want to do. &lt;/p&gt;\n\n&lt;p&gt;As for tips.... well, how I decided on Edinburgh was that when I came on exchange to the UK, I said it constantly that I wanted to see Wales and Scotland (going to Wales sometime soon too with a friend). I couldn&amp;#39;t say why I want to go, I just do. So I did my research slowly over time, and finally booked that flight. Just do it, really. &lt;/p&gt;\n\n&lt;p&gt;And now, planning will be my own little &amp;#39;solo project&amp;#39; I can do when I don&amp;#39;t want to do work or something. I can get excited about this trip for the next few months until I go. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Best I can say is what I keep telling myself when I&amp;#39;m nervous about it&lt;/em&gt; - You bloody owe it to yourself to go on this trip you&amp;#39;ve always wanted to go on. You know you do. Therefore, what should stop you if you really want to do it? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1ydhpq", "score_hidden": false, "name": "t1_cfk28p9", "created": 1392897262.0, "author_flair_text": null, "created_utc": 1392897262.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfjq0sd", "gilded": 0, "author": "renh21", "parent_id": "t3_1ydhpq", "approved_by": null, "body": "What are you most excited about the \"solo trip?\" What are you most nervous for?\n\nI am pondering about taking a solo trip myself somewhere. But I don't know where or how to start. Care to help a fellow person struck with wanderlust? ", "edited": false, "author_flair_css_class": "", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are you most excited about the &amp;quot;solo trip?&amp;quot; What are you most nervous for?&lt;/p&gt;\n\n&lt;p&gt;I am pondering about taking a solo trip myself somewhere. But I don&amp;#39;t know where or how to start. Care to help a fellow person struck with wanderlust? &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1ydhpq", "score_hidden": false, "name": "t1_cfjq0sd", "created": 1392861541.0, "author_flair_text": "Blessed", "created_utc": 1392857941.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]