[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;About 2 years ago my brother passed away. Not only was it a massive emotional loss, but a financial one, too, as my mom and I took care of him in-home. At 22 I was left to pack a house, and find an apartment while taking care of my disabled mom. Unemployment wasn&amp;#39;t steady, and finding work in a new town was daunting. My boyfriend at the time turned out to be a major (now in Fed) creep &amp;amp; my anxiety and grief really took over. &lt;/p&gt;\n\n&lt;p&gt;Last October though, I decided to open up a bit, and met an amazing man! He&amp;#39;s extremely kind, talented, and working on his degree. He helped me through the process of starting at the local JC, and he quiets my anxiety.&lt;/p&gt;\n\n&lt;p&gt;In January I started classes, and so far I&amp;#39;m pulling in A&amp;#39;s! Last week, my neighbor got me in contact with a customer of hers that needed a caregiver for her clients. 2 hours after contacting her I was at an interview, and totally nailed it! &lt;/p&gt;\n\n&lt;p&gt;Today is my 1st full day of legitimate work in 2 years! It also happens to be my 6th month anniversary with said awesome boyfriend :) . I just feel like life is finally coming together after being stagnant for so long. I have a job, doing well in school, I can provide for my mom, and my boyfriend (and his family) is so supportive! I&amp;#39;m just SO very thankful for the good things that have happened! :D&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "About 2 years ago my brother passed away. Not only was it a massive emotional loss, but a financial one, too, as my mom and I took care of him in-home. At 22 I was left to pack a house, and find an apartment while taking care of my disabled mom. Unemployment wasn't steady, and finding work in a new town was daunting. My boyfriend at the time turned out to be a major (now in Fed) creep &amp; my anxiety and grief really took over. \n\n Last October though, I decided to open up a bit, and met an amazing man! He's extremely kind, talented, and working on his degree. He helped me through the process of starting at the local JC, and he quiets my anxiety.\n\nIn January I started classes, and so far I'm pulling in A's! Last week, my neighbor got me in contact with a customer of hers that needed a caregiver for her clients. 2 hours after contacting her I was at an interview, and totally nailed it! \n\nToday is my 1st full day of legitimate work in 2 years! It also happens to be my 6th month anniversary with said awesome boyfriend :) . I just feel like life is finally coming together after being stagnant for so long. I have a job, doing well in school, I can provide for my mom, and my boyfriend (and his family) is so supportive! I'm just SO very thankful for the good things that have happened! :D", "likes": null, "secure_media": null, "link_flair_text": null, "id": "22ajnm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "niteofthelivingcunt", "media": null, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/22ajnm/life_is_finally_coming_together/", "name": "t3_22ajnm", "created": 1396756568.0, "url": "http://www.reddit.com/r/happy/comments/22ajnm/life_is_finally_coming_together/", "author_flair_text": null, "title": "Life is finally coming together!", "created_utc": 1396727768.0, "ups": 9, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglpybd", "gilded": 0, "author": "GRRATU", "parent_id": "t3_22ajnm", "approved_by": null, "body": "That's awesome! Good for you! My own life is starting to come together so i know first hand how amazing it is. Stay strong!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s awesome! Good for you! My own life is starting to come together so i know first hand how amazing it is. Stay strong!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22ajnm", "score_hidden": false, "name": "t1_cglpybd", "created": 1396824205.0, "author_flair_text": null, "created_utc": 1396820605.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]