[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We met on OKC in August 2012, and I fell for him quickly and hard, a lot faster than I generally do. I just had this sense of belonging with him that I haven&amp;#39;t had in a really long time. He was pretty reticent, though, and he gave me the stiff-arm for a relationship, so we kept it casual and non-exclusive for more than a year. This past summer, I asked him to move in with me, partly because I was in love with him and partly because I needed a roommate, and due to circumstances had to have a roommate with whom I could share a bed. Mostly I just wanted the relationship, wanted to be his girlfriend, but needing help with the rent gave me the cover to ask him to move in.&lt;/p&gt;\n\n&lt;p&gt;At first, he said no. He told me he didn&amp;#39;t love me and that he didn&amp;#39;t want to lead me on by moving in, and then not being able to invest in a relationship. He didn&amp;#39;t want to hurt me. I was pretty broken when he told me that, and after a year of pining for him fruitlessly, when he said that &amp;quot;no,&amp;quot; I was about ready to throw in the towel and walk away.&lt;/p&gt;\n\n&lt;p&gt;But he reversed himself the next day, and we gingerly began making preparations for his moving in and transitioning to Relationship Mode with each other. &lt;/p&gt;\n\n&lt;p&gt;It went very well, and just kept getting better as we got more and more used to living with each other. My kids adore him, and he grew more and more fond of them and said he actually feels paternal toward them, which of course made my heart go all squoze (he is child-free). He really fit into the family, though, and our household ran so much more smoothly with him here than it did when I was doing it all by myself. Everything just kind of fell into place when he moved in. Of course, we both actively work on the relationship, but it doesn&amp;#39;t seem like WORK. And so everything seems seamless and rather easy, and like it is supposed to fit. He hasn&amp;#39;t been in a relationship like this before, but he seems to be naturally good at being an excellent partner. Hits all the right notes, almost every time. Considerate and thoughtful, fun and active, honest and communicative, mind-bendingly good sex with well-aligned libidos and kinks, just a REALLY great partner in pretty much every way.&lt;/p&gt;\n\n&lt;p&gt;But even with that, he never told me he loved me. I knew he cared about me and was fond of me; he&amp;#39;s made no secret of that, he&amp;#39;s very up-front and generous with compliments. But he was just very cautious about his emotions, and honest. I never was sure just HOW fond of me he was, and I never was certain that the love would happen. It occurred to me fairly often that he might never feel more than a very strong liking for me.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve talked vaguely about a future, a longer-term future, that has helped me feel more secure about our relationship. And our relationship has been remarkably smooth and has felt so good, and I was pretty sure it was mutual. But with me loving him (and him knowing), but me not sure how he felt about me, there was a sense of incompleteness. &lt;/p&gt;\n\n&lt;p&gt;Anyway, the last few weeks, he&amp;#39;s been a lot mushier and effusive than usual, and it&amp;#39;s been wonderful. Also difficult, because every time he said some wonderfully emotional thing about how happy he is or how right he feels he was to make the decision to move in, I&amp;#39;ve had to bite my tongue not to bust out with the &amp;quot;I love you!!!1!!!&amp;quot; thing. I have loved him so long, and it&amp;#39;s slipped out a few times over the course of the last year-and-a-half, but I&amp;#39;ve tried to keep it under control because I didn&amp;#39;t want to put him on the spot and make him uncomfortable. Also, it kind of hurts to say it and know you won&amp;#39;t hear it back. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve felt like he was hovering on the edge of it, of feeling it and maybe saying it, for the last few weeks. Sometimes he gets this look on his face when he looks at me. And he&amp;#39;s been extremely effusive about how much he enjoys being with me. I think it rather surprises him. He hasn&amp;#39;t been much of a relationship guy in the past, I don&amp;#39;t think. And he also doesn&amp;#39;t think as well of himself as I think of him. He doesn&amp;#39;t feel, I think, that he deserves something as good as we have. But he&amp;#39;s been so wonderfully open-minded, open about possibilities, and I&amp;#39;ve tried to be patient and not to press him. I didn&amp;#39;t know if it would pay off, I didn&amp;#39;t know if he would ever come to love me, so I tried to focus just on how good life had become for me since I met him, since he moved in.&lt;/p&gt;\n\n&lt;p&gt;Last night, I went to bed before he and my older kids did, and as I was heading out, I pointed to each of my kids, and said, &amp;quot;[Name], I love you,&amp;quot; and then wished my boyfriend goodnight like usual. He called me back to the living room as I was walking toward the bedroom, and I ducked my head back in, and he mouthed, behind his hand, &amp;quot;Love YOU.&amp;quot; And that was the first time he had ever said it. I couldn&amp;#39;t do anything but grin like the happiest fool in the world.&lt;/p&gt;\n\n&lt;p&gt;He wasn&amp;#39;t long coming to bed, and I was still awake, and he said it again, and again, and (at my request because I loved hearing it), again. He said he loves me, he said he loves my kids. He said he had no idea it could be this good. He whispered me the sweetest things as we snuggled together, and it was the most wonderful thing. I was as thoroughly content and happy last night as I ever remember being, like it felt more complete and right than any other happiness I&amp;#39;ve experienced, except when my kids were born. Like I&amp;#39;ve finally gotten to a healthy point in my life where I can fully appreciate the good things that happen to me, and it isn&amp;#39;t grossly codependent or anything else like that, but a genuinely good thing rooted in a more healthy, solid foundation than the relationships I&amp;#39;ve had before.&lt;/p&gt;\n\n&lt;p&gt;Anyway, my patience paid off. I KNEW he was worth waiting for. I knew we were a good fit. And knowing that he took his time to come to this point, and was deliberate about it, makes me feel like this is the real deal. I feel like our relationship is steady and solid, and only becoming more so as we settle into a routine with each other and plan for a long-term future together. I feel like it&amp;#39;s more complete now that I know he loves me, and has told me, and that I can tell him how much I love him instead of throttling myself. I am so happy. I can&amp;#39;t remember ever being this happy with a partner. I got everything I wanted. He is everything I wanted. Life is good.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We met on OKC in August 2012, and I fell for him quickly and hard, a lot faster than I generally do. I just had this sense of belonging with him that I haven't had in a really long time. He was pretty reticent, though, and he gave me the stiff-arm for a relationship, so we kept it casual and non-exclusive for more than a year. This past summer, I asked him to move in with me, partly because I was in love with him and partly because I needed a roommate, and due to circumstances had to have a roommate with whom I could share a bed. Mostly I just wanted the relationship, wanted to be his girlfriend, but needing help with the rent gave me the cover to ask him to move in.\n\nAt first, he said no. He told me he didn't love me and that he didn't want to lead me on by moving in, and then not being able to invest in a relationship. He didn't want to hurt me. I was pretty broken when he told me that, and after a year of pining for him fruitlessly, when he said that \"no,\" I was about ready to throw in the towel and walk away.\n\nBut he reversed himself the next day, and we gingerly began making preparations for his moving in and transitioning to Relationship Mode with each other. \n\nIt went very well, and just kept getting better as we got more and more used to living with each other. My kids adore him, and he grew more and more fond of them and said he actually feels paternal toward them, which of course made my heart go all squoze (he is child-free). He really fit into the family, though, and our household ran so much more smoothly with him here than it did when I was doing it all by myself. Everything just kind of fell into place when he moved in. Of course, we both actively work on the relationship, but it doesn't seem like WORK. And so everything seems seamless and rather easy, and like it is supposed to fit. He hasn't been in a relationship like this before, but he seems to be naturally good at being an excellent partner. Hits all the right notes, almost every time. Considerate and thoughtful, fun and active, honest and communicative, mind-bendingly good sex with well-aligned libidos and kinks, just a REALLY great partner in pretty much every way.\n\nBut even with that, he never told me he loved me. I knew he cared about me and was fond of me; he's made no secret of that, he's very up-front and generous with compliments. But he was just very cautious about his emotions, and honest. I never was sure just HOW fond of me he was, and I never was certain that the love would happen. It occurred to me fairly often that he might never feel more than a very strong liking for me.\n\nWe've talked vaguely about a future, a longer-term future, that has helped me feel more secure about our relationship. And our relationship has been remarkably smooth and has felt so good, and I was pretty sure it was mutual. But with me loving him (and him knowing), but me not sure how he felt about me, there was a sense of incompleteness. \n\nAnyway, the last few weeks, he's been a lot mushier and effusive than usual, and it's been wonderful. Also difficult, because every time he said some wonderfully emotional thing about how happy he is or how right he feels he was to make the decision to move in, I've had to bite my tongue not to bust out with the \"I love you!!!1!!!\" thing. I have loved him so long, and it's slipped out a few times over the course of the last year-and-a-half, but I've tried to keep it under control because I didn't want to put him on the spot and make him uncomfortable. Also, it kind of hurts to say it and know you won't hear it back. \n\nI've felt like he was hovering on the edge of it, of feeling it and maybe saying it, for the last few weeks. Sometimes he gets this look on his face when he looks at me. And he's been extremely effusive about how much he enjoys being with me. I think it rather surprises him. He hasn't been much of a relationship guy in the past, I don't think. And he also doesn't think as well of himself as I think of him. He doesn't feel, I think, that he deserves something as good as we have. But he's been so wonderfully open-minded, open about possibilities, and I've tried to be patient and not to press him. I didn't know if it would pay off, I didn't know if he would ever come to love me, so I tried to focus just on how good life had become for me since I met him, since he moved in.\n\nLast night, I went to bed before he and my older kids did, and as I was heading out, I pointed to each of my kids, and said, \"[Name], I love you,\" and then wished my boyfriend goodnight like usual. He called me back to the living room as I was walking toward the bedroom, and I ducked my head back in, and he mouthed, behind his hand, \"Love YOU.\" And that was the first time he had ever said it. I couldn't do anything but grin like the happiest fool in the world.\n\nHe wasn't long coming to bed, and I was still awake, and he said it again, and again, and (at my request because I loved hearing it), again. He said he loves me, he said he loves my kids. He said he had no idea it could be this good. He whispered me the sweetest things as we snuggled together, and it was the most wonderful thing. I was as thoroughly content and happy last night as I ever remember being, like it felt more complete and right than any other happiness I've experienced, except when my kids were born. Like I've finally gotten to a healthy point in my life where I can fully appreciate the good things that happen to me, and it isn't grossly codependent or anything else like that, but a genuinely good thing rooted in a more healthy, solid foundation than the relationships I've had before.\n\nAnyway, my patience paid off. I KNEW he was worth waiting for. I knew we were a good fit. And knowing that he took his time to come to this point, and was deliberate about it, makes me feel like this is the real deal. I feel like our relationship is steady and solid, and only becoming more so as we settle into a routine with each other and plan for a long-term future together. I feel like it's more complete now that I know he loves me, and has told me, and that I can tell him how much I love him instead of throttling myself. I am so happy. I can't remember ever being this happy with a partner. I got everything I wanted. He is everything I wanted. Life is good.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "20lt0b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "projectedwinner", "media": null, "score": 42, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": 1395030531.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 8, "saved": false, "is_self": true, "permalink": "/r/happy/comments/20lt0b/my_boyfriend_told_me_he_loved_me_and_my_kids_last/", "name": "t3_20lt0b", "created": 1395057236.0, "url": "http://www.reddit.com/r/happy/comments/20lt0b/my_boyfriend_told_me_he_loved_me_and_my_kids_last/", "author_flair_text": null, "title": "My boyfriend told me he loved me and my kids last night. I've been waiting for this for more than a year.", "created_utc": 1395028436.0, "ups": 50, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cg4x58e", "gilded": 0, "author": "projectedwinner", "parent_id": "t1_cg4x1iv", "approved_by": null, "body": "Thank you. :) It's a great place to be.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. :) It&amp;#39;s a great place to be.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20lt0b", "score_hidden": false, "name": "t1_cg4x58e", "created": 1395084728.0, "author_flair_text": null, "created_utc": 1395081128.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cg4x1iv", "gilded": 0, "author": "ShowersInYoghurt", "parent_id": "t3_20lt0b", "approved_by": null, "body": "I'm so happy for you and your kids!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so happy for you and your kids!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20lt0b", "score_hidden": false, "name": "t1_cg4x1iv", "created": 1395084515.0, "author_flair_text": null, "created_utc": 1395080915.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cg657y3", "gilded": 0, "author": "ryder631", "parent_id": "t3_20lt0b", "approved_by": null, "body": "This is the sweetest :) congrats on such a great relationship!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the sweetest :) congrats on such a great relationship!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20lt0b", "score_hidden": false, "name": "t1_cg657y3", "created": 1395197231.0, "author_flair_text": null, "created_utc": 1395193631.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]