[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yep, parents won an all-expenses paid trip to Miami to stay in a swanky hotel, enjoy comedy shows and explore. I took them to the airport at 330 am Tuesday. All week, my mom had been distinctly taciturn, a huge change from her usual constant texting and nightly calling while she&amp;#39;s gone. I had a sense that something was up, but had no idea what. &lt;/p&gt;\n\n&lt;p&gt;I pick them up this afternoon and mom says &amp;quot;you have to drive home, your father had a really great vacation&amp;quot; - then proceeds to tell me how he had chest pain Tuesday night, was taken via ambulance to Mt. Sinai in Miami, was released the next morning with a stern warning to come back if the pain comes back... 8 pm Wednesday they&amp;#39;re back, after a full day of tests, cardiac cath shows that one artery is 95% blocked and he had a heart attack... Goes in on Friday for heart surgery and has a stent placed! He didn&amp;#39;t get out of the hospital until Saturday evening. &lt;/p&gt;\n\n&lt;p&gt;So they didn&amp;#39;t tell me ANY of this because they didn&amp;#39;t want me to worry all the way up here and not be able to do anything, and this is the first week at my new job so I&amp;#39;ve been in orientation all week and wouldn&amp;#39;t have been able to fly down if I wanted to. So they stayed quiet til they got home. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s fine now, they fixed him all up and he&amp;#39;ll be on more heart meds now (already had a heart attack 40 years ago and a quadruple bypass 24 years ago) so this goes into the HAPPY file because it all could have turned out a hell of a lot differently. He&amp;#39;s 74 this year and despite never ever smoking, drinking or doing pretty much ANYTHING unwholesome, he just got hit with the shitty heart card and this was so random... I don&amp;#39;t have an excellent relationship with my parents, but I still love them and am extremely glad he&amp;#39;s okay... They did the right thing I suppose not telling me, I&amp;#39;m not mad, just glad everything is ok and that of all places, they were vacationing near a world premiere heart center with fabulous staff who made them feel 100% taken care of.&lt;/p&gt;\n\n&lt;p&gt;Also, &lt;strong&gt;don&amp;#39;t ever stay at the SLS South Beach&lt;/strong&gt; - they would not allow the ambulance to park quickly in front of the hotel, made them go down a narrow, dark back alley instead, and take my dad out on the stretcher down the service elevator and THROUGH THE TINY LAUNDRY FACILITIES because they didn&amp;#39;t want anyone to see EMS in the building. Ridiculous. Should have been more concerned with their guest&amp;#39;s wellbeing than someone seeing a damn ambulance. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yep, parents won an all-expenses paid trip to Miami to stay in a swanky hotel, enjoy comedy shows and explore. I took them to the airport at 330 am Tuesday. All week, my mom had been distinctly taciturn, a huge change from her usual constant texting and nightly calling while she's gone. I had a sense that something was up, but had no idea what. \n\nI pick them up this afternoon and mom says \"you have to drive home, your father had a really great vacation\" - then proceeds to tell me how he had chest pain Tuesday night, was taken via ambulance to Mt. Sinai in Miami, was released the next morning with a stern warning to come back if the pain comes back... 8 pm Wednesday they're back, after a full day of tests, cardiac cath shows that one artery is 95% blocked and he had a heart attack... Goes in on Friday for heart surgery and has a stent placed! He didn't get out of the hospital until Saturday evening. \n\nSo they didn't tell me ANY of this because they didn't want me to worry all the way up here and not be able to do anything, and this is the first week at my new job so I've been in orientation all week and wouldn't have been able to fly down if I wanted to. So they stayed quiet til they got home. \n\nHe's fine now, they fixed him all up and he'll be on more heart meds now (already had a heart attack 40 years ago and a quadruple bypass 24 years ago) so this goes into the HAPPY file because it all could have turned out a hell of a lot differently. He's 74 this year and despite never ever smoking, drinking or doing pretty much ANYTHING unwholesome, he just got hit with the shitty heart card and this was so random... I don't have an excellent relationship with my parents, but I still love them and am extremely glad he's okay... They did the right thing I suppose not telling me, I'm not mad, just glad everything is ok and that of all places, they were vacationing near a world premiere heart center with fabulous staff who made them feel 100% taken care of.\n\nAlso, **don't ever stay at the SLS South Beach** - they would not allow the ambulance to park quickly in front of the hotel, made them go down a narrow, dark back alley instead, and take my dad out on the stretcher down the service elevator and THROUGH THE TINY LAUNDRY FACILITIES because they didn't want anyone to see EMS in the building. Ridiculous. Should have been more concerned with their guest's wellbeing than someone seeing a damn ambulance. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "22crq2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "NEKKHAMMA", "media": null, "score": 66, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 8, "saved": false, "is_self": true, "permalink": "/r/happy/comments/22crq2/my_parents_went_on_vacation_and_my_dad_had_a/", "name": "t3_22crq2", "created": 1396832288.0, "url": "http://www.reddit.com/r/happy/comments/22crq2/my_parents_went_on_vacation_and_my_dad_had_a/", "author_flair_text": null, "title": "My parents went on vacation, and my dad had a heart attack. Nobody told me until I picked them up today.", "created_utc": 1396803488.0, "ups": 74, "num_comments": 12, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglvm4g", "gilded": 0, "author": "NEKKHAMMA", "parent_id": "t1_cgllt44", "approved_by": null, "body": "Thank you! Me too!!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Me too!!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglvm4g", "created": 1396837267.0, "author_flair_text": null, "created_utc": 1396833667.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cgllt44", "gilded": 0, "author": "YoungApollo", "parent_id": "t3_22crq2", "approved_by": null, "body": "Glad your dad is ok!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad your dad is ok!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cgllt44", "created": 1396814318.0, "author_flair_text": null, "created_utc": 1396810718.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglvjqe", "gilded": 0, "author": "NEKKHAMMA", "parent_id": "t1_cglmqvd", "approved_by": null, "body": "Thanks! And dude, I know!! This surprised the hell outta me, because I'm an only child and my mom is NOT good with emergencies. When he has medical problems here at home, I get a frantic call to leave wherever I am and speed home to be able to drive to the hospital with them, and mom proceeds to constantly freak the entire time \"he's gonna be ok right?\" even when it's really minor (this has only gotten worse since I've been in medical school). I can't believe she held it together all week. I'm really proud of her. I was a little mad when they told me, but after a few minutes I realized they'd done it in my best interest and I chilled out.", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! And dude, I know!! This surprised the hell outta me, because I&amp;#39;m an only child and my mom is NOT good with emergencies. When he has medical problems here at home, I get a frantic call to leave wherever I am and speed home to be able to drive to the hospital with them, and mom proceeds to constantly freak the entire time &amp;quot;he&amp;#39;s gonna be ok right?&amp;quot; even when it&amp;#39;s really minor (this has only gotten worse since I&amp;#39;ve been in medical school). I can&amp;#39;t believe she held it together all week. I&amp;#39;m really proud of her. I was a little mad when they told me, but after a few minutes I realized they&amp;#39;d done it in my best interest and I chilled out.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglvjqe", "created": 1396837118.0, "author_flair_text": null, "created_utc": 1396833518.0, "distinguished": null, "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "saved": false, "id": "cglmqvd", "gilded": 0, "author": "danaofdoom", "parent_id": "t3_22crq2", "approved_by": null, "body": "I'm glad your dad is okay!\n\nAnd holy crap, the capacity that parents have to think of their kids even when they're in pain or afraid is amazing. If I was going through that, I would be calling my mother immediately just so she could help me calm down. But I bet if she had something like that happen to her, she'd keep it a secret from me until she could talk to me in person. It drives me a little nuts sometimes though. I want to know how my parents are doing!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad your dad is okay!&lt;/p&gt;\n\n&lt;p&gt;And holy crap, the capacity that parents have to think of their kids even when they&amp;#39;re in pain or afraid is amazing. If I was going through that, I would be calling my mother immediately just so she could help me calm down. But I bet if she had something like that happen to her, she&amp;#39;d keep it a secret from me until she could talk to me in person. It drives me a little nuts sometimes though. I want to know how my parents are doing!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglmqvd", "created": 1396816567.0, "author_flair_text": null, "created_utc": 1396812967.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglvlsw", "gilded": 0, "author": "NEKKHAMMA", "parent_id": "t1_cglps7r", "approved_by": null, "body": "Oh I will :) I'm a med student, and I also was an egg donor so I've been recently tested literally from head to toe for everything that could ever exist, and I'm excellent for now. But I'll definitely keep up with it, since he probably was the same way at my age, then had his first heart attack at 36... ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I will :) I&amp;#39;m a med student, and I also was an egg donor so I&amp;#39;ve been recently tested literally from head to toe for everything that could ever exist, and I&amp;#39;m excellent for now. But I&amp;#39;ll definitely keep up with it, since he probably was the same way at my age, then had his first heart attack at 36... &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglvlsw", "created": 1396837249.0, "author_flair_text": null, "created_utc": 1396833649.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cglps7r", "gilded": 0, "author": "TheStaggeringGenius", "parent_id": "t3_22crq2", "approved_by": null, "body": "With a family history like that, make sure you're keeping an eye on your own health so you can continue to post in this sub ;)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With a family history like that, make sure you&amp;#39;re keeping an eye on your own health so you can continue to post in this sub ;)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglps7r", "created": 1396823801.0, "author_flair_text": null, "created_utc": 1396820201.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglvekd", "gilded": 0, "author": "NEKKHAMMA", "parent_id": "t1_cglumnc", "approved_by": null, "body": "Nope not at all. He's 6'2\" and 180 lbs now. He even has lost 10 lbs since October because he was diagnosed with diabetes surprisingly. He also was found to still have an A1C of 6.6 despite keeping his glucose readings excellent since then. They're really not sure what caused this blockage, since his cholesterol was excellent and controlled with drugs as well, his diet has been MUCH improved since October and he's been exercising more since then too. Just very surprising overall.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope not at all. He&amp;#39;s 6&amp;#39;2&amp;quot; and 180 lbs now. He even has lost 10 lbs since October because he was diagnosed with diabetes surprisingly. He also was found to still have an A1C of 6.6 despite keeping his glucose readings excellent since then. They&amp;#39;re really not sure what caused this blockage, since his cholesterol was excellent and controlled with drugs as well, his diet has been MUCH improved since October and he&amp;#39;s been exercising more since then too. Just very surprising overall.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglvekd", "created": 1396836785.0, "author_flair_text": null, "created_utc": 1396833185.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cglumnc", "gilded": 0, "author": "Zurevu", "parent_id": "t3_22crq2", "approved_by": null, "body": "I'm glad your father is doing better. Is he overweight?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad your father is doing better. Is he overweight?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglumnc", "created": 1396835018.0, "author_flair_text": null, "created_utc": 1396831418.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cglwdok", "gilded": 0, "author": "angelbeliever", "parent_id": "t3_22crq2", "approved_by": null, "body": "Whew. Glad you Dad is ok now.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whew. Glad you Dad is ok now.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglwdok", "created": 1396839023.0, "author_flair_text": null, "created_utc": 1396835423.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cgm266y", "gilded": 0, "author": "martiiin", "parent_id": "t1_cglvprv", "approved_by": null, "body": "As long as he is aware of the problem, everything is going to work out :)\n\nAparently my grandparents got this opinion, if they feel something is wrong, they'll just wait and see if it gets better. Really stupid decision, since healthcare is free anyway.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As long as he is aware of the problem, everything is going to work out :)&lt;/p&gt;\n\n&lt;p&gt;Aparently my grandparents got this opinion, if they feel something is wrong, they&amp;#39;ll just wait and see if it gets better. Really stupid decision, since healthcare is free anyway.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cgm266y", "created": 1396853996.0, "author_flair_text": null, "created_utc": 1396850396.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cglvprv", "gilded": 0, "author": "NEKKHAMMA", "parent_id": "t1_cglm4k4", "approved_by": null, "body": "Oh I'm so sorry to hear about that :( the heart and blood are such tough things to take care of, because they can show no symptoms until something is VERY wrong. Since my Dad already had a heart attack at 36 and then quadruple bypass later at 48, he's been extremely cognizant of even little pains and warning signs. The chest pain he had in Miami was the very first time he had any sign of something wrong. He had even just been to the cardiologist in February AND the local hospital in October for what he thought was chest pains, but turned out to be just a pulled muscle. (So they said - now I'm wondering if it wasn't the beginnings of this?)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I&amp;#39;m so sorry to hear about that :( the heart and blood are such tough things to take care of, because they can show no symptoms until something is VERY wrong. Since my Dad already had a heart attack at 36 and then quadruple bypass later at 48, he&amp;#39;s been extremely cognizant of even little pains and warning signs. The chest pain he had in Miami was the very first time he had any sign of something wrong. He had even just been to the cardiologist in February AND the local hospital in October for what he thought was chest pains, but turned out to be just a pulled muscle. (So they said - now I&amp;#39;m wondering if it wasn&amp;#39;t the beginnings of this?)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglvprv", "created": 1396837496.0, "author_flair_text": null, "created_utc": 1396833896.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cglm4k4", "gilded": 0, "author": "martiiin", "parent_id": "t3_22crq2", "approved_by": null, "body": "So nice to hear :)\n\nMy grandad had problems with his heart/arteries, and everybody knew. He even survived a blood clot in the brain, and it only affected his left hand very slightly.\n\nOne day, autumn 2013, when my grandmother got home he was gone. I would say luckily, but not sure, she spoke on the phone with him a few hours before.\n\nIt just kills me that everyone knew he had problems, but nothing (serious?) was done. Still, he was on heart medication, since it is free in Denmark.\n\nAnd then tjere is the usual \"I should have talked with him more, visited more, etc.\".. :/\n\nNobody expected anything, since he was a very smart man, really smart and had a quick mind. But of course in hindsight, mental ≠ physical.\n\nQuick edit: and I am so glad my mom called me on the phone and said it happened, spend the next 30 minutes in tears, and got my act a little together before they picked me up.  ", "edited": 1396817027.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So nice to hear :)&lt;/p&gt;\n\n&lt;p&gt;My grandad had problems with his heart/arteries, and everybody knew. He even survived a blood clot in the brain, and it only affected his left hand very slightly.&lt;/p&gt;\n\n&lt;p&gt;One day, autumn 2013, when my grandmother got home he was gone. I would say luckily, but not sure, she spoke on the phone with him a few hours before.&lt;/p&gt;\n\n&lt;p&gt;It just kills me that everyone knew he had problems, but nothing (serious?) was done. Still, he was on heart medication, since it is free in Denmark.&lt;/p&gt;\n\n&lt;p&gt;And then tjere is the usual &amp;quot;I should have talked with him more, visited more, etc.&amp;quot;.. :/&lt;/p&gt;\n\n&lt;p&gt;Nobody expected anything, since he was a very smart man, really smart and had a quick mind. But of course in hindsight, mental ≠ physical.&lt;/p&gt;\n\n&lt;p&gt;Quick edit: and I am so glad my mom called me on the phone and said it happened, spend the next 30 minutes in tears, and got my act a little together before they picked me up.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_22crq2", "score_hidden": false, "name": "t1_cglm4k4", "created": 1396815090.0, "author_flair_text": null, "created_utc": 1396811490.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]