[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had her for just over a year and until now she has made incredible strides being more affectionate with me and not freaking out when I would pet her. She is still pretty shy and was considered a &amp;#39;private investigator&amp;#39; by the shelter, so she still has that personality trait of course. Tonight though I carried her to bed with me and cradled her in my arms. She purred like crazy which she hardly ever did before and passed out. My arm got numb! Then she heard me yawn and turned her head back to meet my face like in some kind of children&amp;#39;s film where the damn animal and little kid have this awesome moment of friendship and understanding. Then she licked my nose and forehead then layed down some more. My cell buzzed so she got startled and went to sleep in the living room like normal. But that was awesomeeeeee . &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had her for just over a year and until now she has made incredible strides being more affectionate with me and not freaking out when I would pet her. She is still pretty shy and was considered a 'private investigator' by the shelter, so she still has that personality trait of course. Tonight though I carried her to bed with me and cradled her in my arms. She purred like crazy which she hardly ever did before and passed out. My arm got numb! Then she heard me yawn and turned her head back to meet my face like in some kind of children's film where the damn animal and little kid have this awesome moment of friendship and understanding. Then she licked my nose and forehead then layed down some more. My cell buzzed so she got startled and went to sleep in the living room like normal. But that was awesomeeeeee . ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1yrm51", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "[deleted]", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1yrm51/my_rescue_cat_cuddled_with_me_tonight/", "name": "t3_1yrm51", "created": 1393216339.0, "url": "http://www.reddit.com/r/happy/comments/1yrm51/my_rescue_cat_cuddled_with_me_tonight/", "author_flair_text": null, "title": "My rescue cat cuddled with me tonight!!", "created_utc": 1393216339.0, "ups": 7, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfn9w3g", "gilded": 0, "author": "TargetAttack", "parent_id": "t3_1yrm51", "approved_by": null, "body": "How sweet! I hope your cat shows that affection more and more!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How sweet! I hope your cat shows that affection more and more!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yrm51", "score_hidden": false, "name": "t1_cfn9w3g", "created": 1393232271.0, "author_flair_text": null, "created_utc": 1393232271.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfnjpjq", "gilded": 0, "author": "Frankie_In_Like", "parent_id": "t3_1yrm51", "approved_by": null, "body": "Awww, that is so sweet!  What a great feeling! :)  Good on you for taking in one of the timid cats, and congrats on having that beautiful bonding moment!  I had a \"scaredy cat\" for nine years and she *rarely* opened up, she would hide under the couch, bed, whatever constantly and only came out to eat, use the litter box (would never cover anything up, just peed and ran), and very rarely sleep at the foot of my bed with my other - very outgoing and gregarious - cat.\n\nNo matter how patient and kind and loving I was with her, whether it was waiting to let her open up on her own or trying to push the boundaries just a little and get her a bit out of her comfort zone (we're talking just coaxing her to stick her head out of her hidey hole, that's all), she was just terrified of everything.  She was definitely abused severely by her previous owners, but we'll never know the extent of it because she was a rescue and was surrendered with no information given on her past.\n\nIt was just so sad, because on the rare occasions she opened up and came out and let me pet her, she was SO happy and would just THROW herself at my hand as if she would die if she didn't get petted NOW, and she'd purr and drool everywhere.  She obviously loved me (though my grandma was her favorite person for the short time she lived with us), but the slightest too-fast movement from me would send her running back to hide.  She just couldn't overcome her fear :(\n\nWe had to have her put to sleep, but I'll never forget my little girl.  RIP Blu &lt;3", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awww, that is so sweet!  What a great feeling! :)  Good on you for taking in one of the timid cats, and congrats on having that beautiful bonding moment!  I had a &amp;quot;scaredy cat&amp;quot; for nine years and she &lt;em&gt;rarely&lt;/em&gt; opened up, she would hide under the couch, bed, whatever constantly and only came out to eat, use the litter box (would never cover anything up, just peed and ran), and very rarely sleep at the foot of my bed with my other - very outgoing and gregarious - cat.&lt;/p&gt;\n\n&lt;p&gt;No matter how patient and kind and loving I was with her, whether it was waiting to let her open up on her own or trying to push the boundaries just a little and get her a bit out of her comfort zone (we&amp;#39;re talking just coaxing her to stick her head out of her hidey hole, that&amp;#39;s all), she was just terrified of everything.  She was definitely abused severely by her previous owners, but we&amp;#39;ll never know the extent of it because she was a rescue and was surrendered with no information given on her past.&lt;/p&gt;\n\n&lt;p&gt;It was just so sad, because on the rare occasions she opened up and came out and let me pet her, she was SO happy and would just THROW herself at my hand as if she would die if she didn&amp;#39;t get petted NOW, and she&amp;#39;d purr and drool everywhere.  She obviously loved me (though my grandma was her favorite person for the short time she lived with us), but the slightest too-fast movement from me would send her running back to hide.  She just couldn&amp;#39;t overcome her fear :(&lt;/p&gt;\n\n&lt;p&gt;We had to have her put to sleep, but I&amp;#39;ll never forget my little girl.  RIP Blu &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yrm51", "score_hidden": false, "name": "t1_cfnjpjq", "created": 1393266102.0, "author_flair_text": null, "created_utc": 1393266102.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfna5bq", "gilded": 0, "author": "I_Think_Alot", "parent_id": "t3_1yrm51", "approved_by": null, "body": "P.I.X", "edited": false, "author_flair_css_class": null, "downs": 2, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;P.I.X&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yrm51", "score_hidden": false, "name": "t1_cfna5bq", "created": 1393233728.0, "author_flair_text": null, "created_utc": 1393233728.0, "distinguished": null, "num_reports": null, "ups": 4}}], "after": null, "before": null}}]