[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday at uni I saw a young man I consider my son from another mother, whom I haven&amp;#39;t seen in a good 18 months, but stayed in touch with on FB. I&amp;#39;ve watched him grow his hair and the dreadlocks appear, seen his life stabilise, seen him get past a mugging where his bike was stolen from him on his way to work (no drivers licence). Seen him gain and lose a girlfriend. He is about 6&amp;#39;2&amp;quot;, metal as fuck, has a gorgeously drawn alien tattoo, lives to love kind of guy.&lt;/p&gt;\n\n&lt;p&gt;He is a beautiful, caring and sweet young man who has not had anything come easy - his mother took her own life when he was 16. His father wasn&amp;#39;t a very good man, my son fam was kicked out and started uni at 20 having got himself through school and graduation. &lt;/p&gt;\n\n&lt;p&gt;To see him was wonderful, he is going to graduate this semester with me, and begin a Masters at another uni to become a librarian. He has a girlfriend and drove himself to uni for the first time ever, having earned his licence last week. &lt;/p&gt;\n\n&lt;p&gt;In a world where I see a lot more shit than success, I am so happy and pleased for my fam, he is truly an inspiration and great example of rising above what the world gives you and how trusting the universe to bring you what you deserve actually works.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yesterday at uni I saw a young man I consider my son from another mother, whom I haven't seen in a good 18 months, but stayed in touch with on FB. I've watched him grow his hair and the dreadlocks appear, seen his life stabilise, seen him get past a mugging where his bike was stolen from him on his way to work (no drivers licence). Seen him gain and lose a girlfriend. He is about 6'2\", metal as fuck, has a gorgeously drawn alien tattoo, lives to love kind of guy.\n\nHe is a beautiful, caring and sweet young man who has not had anything come easy - his mother took her own life when he was 16. His father wasn't a very good man, my son fam was kicked out and started uni at 20 having got himself through school and graduation. \n\nTo see him was wonderful, he is going to graduate this semester with me, and begin a Masters at another uni to become a librarian. He has a girlfriend and drove himself to uni for the first time ever, having earned his licence last week. \n\nIn a world where I see a lot more shit than success, I am so happy and pleased for my fam, he is truly an inspiration and great example of rising above what the world gives you and how trusting the universe to bring you what you deserve actually works.\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zrn7p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Shezzam", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1zrn7p/my_son_from_another_mother_fam/", "name": "t3_1zrn7p", "created": 1394152298.0, "url": "http://www.reddit.com/r/happy/comments/1zrn7p/my_son_from_another_mother_fam/", "author_flair_text": null, "title": "My son from another mother (fam)", "created_utc": 1394152298.0, "ups": 2, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]