[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work with special needs students once a month. The children range in age from 3-12 and they are so much fun to hang out with. In fact, if this wasn&amp;#39;t a centre for special needs kids then I wouldn&amp;#39;t know they would need special accommodations.&lt;br/&gt;\nAnyway, I dressed up as a Spider-Man character and when I walked into the gym all of the kids (there were about 15 of them) went insane and wanted hugs, high fives, autographs, etc. Every kid except for one little tike. I tried to give him a high five and he started to cry. He ran over to his mom and said, &amp;quot;he&amp;#39;s scary, I don&amp;#39;t like him. I want to leave!&amp;quot;&lt;br/&gt;\nAs they were leaving he was walking by me and he was holding a soccer ball. He dropped it and I picked it up with my feet and started juggling it and he just said, &amp;quot;cool.&amp;quot; I kicked the ball back to him and then he laughed, picked it up, and punted the ball back to me (he&amp;#39;s only 3 so it thankfully wasn&amp;#39;t a ginormous punt). During the hour I was there I played with all of the kids but this little guy stuck by my side through soccer, volleyball, basketball, rock climbing (he stayed at the bottom), and tag (&amp;quot;you&amp;#39;re it!&amp;quot;).&lt;br/&gt;\nI said my goodbyes and was leaving when I heard one of the loudest screams of my life. I turned around to see what happened and the little boy who was afraid of me started sprinting towards me and I squatted down to his level to talk to him but he ran at me so quickly that he almost tackled me and gave me a giant hug with all of his tears running down his face.&lt;br/&gt;\nI asked what was wrong and he said, &amp;quot;I don&amp;#39;t want you to leave. I love you, don&amp;#39;t go.&amp;quot; I about lost it under my mask. My eyes watered up but I gained composure and said I would be back next month. He didn&amp;#39;t want to let go of my hand but after a few moments of talking and reassuring him that I would return, he reluctantly said his final goodbyes.&lt;br/&gt;\nI never thought working with children could be so emotionally draining, but that was such an unbelievable experience. I&amp;#39;m both so happy and so sad at this story, but I know it is something I&amp;#39;ll never forget.&lt;br/&gt;\nTL;DR A little boy was afraid of me in a Spider-Man costume but after an hour of playing he didn&amp;#39;t want me to leave &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work with special needs students once a month. The children range in age from 3-12 and they are so much fun to hang out with. In fact, if this wasn't a centre for special needs kids then I wouldn't know they would need special accommodations.  \nAnyway, I dressed up as a Spider-Man character and when I walked into the gym all of the kids (there were about 15 of them) went insane and wanted hugs, high fives, autographs, etc. Every kid except for one little tike. I tried to give him a high five and he started to cry. He ran over to his mom and said, \"he's scary, I don't like him. I want to leave!\"  \nAs they were leaving he was walking by me and he was holding a soccer ball. He dropped it and I picked it up with my feet and started juggling it and he just said, \"cool.\" I kicked the ball back to him and then he laughed, picked it up, and punted the ball back to me (he's only 3 so it thankfully wasn't a ginormous punt). During the hour I was there I played with all of the kids but this little guy stuck by my side through soccer, volleyball, basketball, rock climbing (he stayed at the bottom), and tag (\"you're it!\").  \nI said my goodbyes and was leaving when I heard one of the loudest screams of my life. I turned around to see what happened and the little boy who was afraid of me started sprinting towards me and I squatted down to his level to talk to him but he ran at me so quickly that he almost tackled me and gave me a giant hug with all of his tears running down his face.  \nI asked what was wrong and he said, \"I don't want you to leave. I love you, don't go.\" I about lost it under my mask. My eyes watered up but I gained composure and said I would be back next month. He didn't want to let go of my hand but after a few moments of talking and reassuring him that I would return, he reluctantly said his final goodbyes.  \nI never thought working with children could be so emotionally draining, but that was such an unbelievable experience. I'm both so happy and so sad at this story, but I know it is something I'll never forget.  \nTL;DR A little boy was afraid of me in a Spider-Man costume but after an hour of playing he didn't want me to leave ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1y9lat", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Take_A_Penguin_Break", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1y9lat/never_knew_working_with_a_child_i_just_met_could/", "name": "t3_1y9lat", "created": 1392751022.0, "url": "http://www.reddit.com/r/happy/comments/1y9lat/never_knew_working_with_a_child_i_just_met_could/", "author_flair_text": null, "title": "Never knew working with a child I just met could make me cry and be so happy in one short hour", "created_utc": 1392751022.0, "ups": 11, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfioi6k", "gilded": 0, "author": "devinthebaws", "parent_id": "t3_1y9lat", "approved_by": null, "body": "This is incredibly inspiring. And emotionally moving. Good for you to change a child's look on something thy thought scary. This story makes me incredibly happy :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is incredibly inspiring. And emotionally moving. Good for you to change a child&amp;#39;s look on something thy thought scary. This story makes me incredibly happy :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1y9lat", "score_hidden": false, "name": "t1_cfioi6k", "created": 1392762159.0, "author_flair_text": null, "created_utc": 1392762159.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]