[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a young person I was pretty happy. I lived in a safe neighborhood in a 2 parent home. I was a very good student and an outspoken critical thinker who most of my teachers respected (as much as anyone can respect a teenager, anyway), and all signs pointed towards success as an adult. When I was 17 I was gangraped by 4 men, and it derailed my entire life. I developed an eating disorder, then started dating a meth head and minor criminal, and naturally the relationship was &lt;em&gt;very&lt;/em&gt; emotionally unstable. I still went to college and did well, but I had a lot of emotional issues, and ended up in an emotionally and sexually abusive relationship (different guy) which may have been even more destructive than the rape, because he &amp;quot;loved&amp;quot; me. After we broke up I was utterly wrecked, isolated, and miserable. My emotional instability at this point destroyed most of my friendships in the area I lived in, and I felt rejected and alone. I attempted to fill the void by seducing men who I didn&amp;#39;t really value and, if I did, was completely unable to emotionally connect to them, or even to myself.&lt;/p&gt;\n\n&lt;p&gt;A few years ago I had had enough. I moved back to where I grew up, where my lifelong friends were, I started therapy, and went back to school for &amp;quot;science&amp;quot; with only a vague idea of where I&amp;#39;d take it. The therapy helped me with my body issues, with my hatred or myself and self blame for my emotional/sexual traumas, and helped me to find it in myself to love myself as what I was: a smart young woman who had had her bright future stolen from her for a while by the violence and cruelty of others. I was able to pick up friendships from years earlier and forge new bonds. My group of friends is small but supportive, and more like family. I know they will never reject me.\n Because of this, I became almost okay, then, a little later, pretty okay, then, later, kind of even happy. I started taking classes and kicking ass in them, like in the top 3 performing students in difficult science classes, and my fellow students and professors respected me. A professor told me I was a &amp;quot;impressive person&amp;quot;, and suggested I go into medicine. \nAlso, eventually, in a physics class, I met a really kind, wonderful man, and he didn&amp;#39;t try to seduce me, and I didn&amp;#39;t try to seduce him. We became platonic friends. When I described this man to a friend for the first time, not knowing at the time that I&amp;#39;d ever even interact with him again, all I could say was that he was an incredibly kind and ethical person.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m in the last couple semesters of prerequisites to apply to a Doctor of Physical Therapy program, and beginning to prepare for the GRE, and already scoring in my practice tests above the GRE scores I need to be competitive with my first choice school. My GPA is awesome. To put the icing on the cake, that wonderful man eventually became my boyfriend. We&amp;#39;ve been living together for a few months, and recently we&amp;#39;ve gone from highly hypothetical discussions of marriage to discussing ring design and locations for the ceremony. We have a relationship that is healthier than I ever knew possible. I want to cry just thinking of it. I am so grateful to not be miserable anymore that the littlest things move me to tears. I don&amp;#39;t think you get to be this happy without suffering first.&lt;/p&gt;\n\n&lt;p&gt;I exercise, eat mostly meals I cook myself, I neither hate myself nor treat anyone else with disdain, I have a healthy sex life (remarkable for a rape/abuse survivor), and my house is clean and well organized. I just looked at the curriculum for DPT school, and the balance between challenging coursework, research, and working directly with patients is so good I&amp;#39;m tingling. I&amp;#39;m also happy to report that it&amp;#39;s entirely possible to be a parent while in DPT school and as a practicing doctor of physical therapy. This is good because my boyfriend and I are thinking sometime within the next 4 years would be the ideal to have our first child. Oh, and I like all my socks. That&amp;#39;s a big deal.&lt;/p&gt;\n\n&lt;p&gt;So here is a resounding FUCK YOU to my rapists and abuser! :) You can&amp;#39;t hold me down any longer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a young person I was pretty happy. I lived in a safe neighborhood in a 2 parent home. I was a very good student and an outspoken critical thinker who most of my teachers respected (as much as anyone can respect a teenager, anyway), and all signs pointed towards success as an adult. When I was 17 I was gangraped by 4 men, and it derailed my entire life. I developed an eating disorder, then started dating a meth head and minor criminal, and naturally the relationship was *very* emotionally unstable. I still went to college and did well, but I had a lot of emotional issues, and ended up in an emotionally and sexually abusive relationship (different guy) which may have been even more destructive than the rape, because he \"loved\" me. After we broke up I was utterly wrecked, isolated, and miserable. My emotional instability at this point destroyed most of my friendships in the area I lived in, and I felt rejected and alone. I attempted to fill the void by seducing men who I didn't really value and, if I did, was completely unable to emotionally connect to them, or even to myself.\n\nA few years ago I had had enough. I moved back to where I grew up, where my lifelong friends were, I started therapy, and went back to school for \"science\" with only a vague idea of where I'd take it. The therapy helped me with my body issues, with my hatred or myself and self blame for my emotional/sexual traumas, and helped me to find it in myself to love myself as what I was: a smart young woman who had had her bright future stolen from her for a while by the violence and cruelty of others. I was able to pick up friendships from years earlier and forge new bonds. My group of friends is small but supportive, and more like family. I know they will never reject me.\n Because of this, I became almost okay, then, a little later, pretty okay, then, later, kind of even happy. I started taking classes and kicking ass in them, like in the top 3 performing students in difficult science classes, and my fellow students and professors respected me. A professor told me I was a \"impressive person\", and suggested I go into medicine. \nAlso, eventually, in a physics class, I met a really kind, wonderful man, and he didn't try to seduce me, and I didn't try to seduce him. We became platonic friends. When I described this man to a friend for the first time, not knowing at the time that I'd ever even interact with him again, all I could say was that he was an incredibly kind and ethical person.\n\nNow I'm in the last couple semesters of prerequisites to apply to a Doctor of Physical Therapy program, and beginning to prepare for the GRE, and already scoring in my practice tests above the GRE scores I need to be competitive with my first choice school. My GPA is awesome. To put the icing on the cake, that wonderful man eventually became my boyfriend. We've been living together for a few months, and recently we've gone from highly hypothetical discussions of marriage to discussing ring design and locations for the ceremony. We have a relationship that is healthier than I ever knew possible. I want to cry just thinking of it. I am so grateful to not be miserable anymore that the littlest things move me to tears. I don't think you get to be this happy without suffering first.\n\nI exercise, eat mostly meals I cook myself, I neither hate myself nor treat anyone else with disdain, I have a healthy sex life (remarkable for a rape/abuse survivor), and my house is clean and well organized. I just looked at the curriculum for DPT school, and the balance between challenging coursework, research, and working directly with patients is so good I'm tingling. I'm also happy to report that it's entirely possible to be a parent while in DPT school and as a practicing doctor of physical therapy. This is good because my boyfriend and I are thinking sometime within the next 4 years would be the ideal to have our first child. Oh, and I like all my socks. That's a big deal.\n\nSo here is a resounding FUCK YOU to my rapists and abuser! :) You can't hold me down any longer.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zuyfv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "buggerbees", "media": null, "score": 72, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 13, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1zuyfv/not_only_have_i_recovered_from_my_abuserape_but/", "name": "t3_1zuyfv", "created": 1394243687.0, "url": "http://www.reddit.com/r/happy/comments/1zuyfv/not_only_have_i_recovered_from_my_abuserape_but/", "author_flair_text": null, "title": "Not only have I recovered from my abuse/rape, but I'm THRIVING, and will soon be helping others thrive despite trauma or disease.", "created_utc": 1394243687.0, "ups": 85, "num_comments": 11, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfx9g89", "gilded": 0, "author": "ElJefeFinal", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "Congratulations! You have done so much with your life and you sound like you're in an amazing place. Go you! You control your life and you're doing a damn good job. I hope for continued happiness. You deserve it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations! You have done so much with your life and you sound like you&amp;#39;re in an amazing place. Go you! You control your life and you&amp;#39;re doing a damn good job. I hope for continued happiness. You deserve it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfx9g89", "created": 1394249985.0, "author_flair_text": null, "created_utc": 1394249985.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxlya0", "gilded": 0, "author": "buggerbees", "parent_id": "t1_cfxdkru", "approved_by": null, "body": "I guess that *is* the alternative to therapy for some.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess that &lt;em&gt;is&lt;/em&gt; the alternative to therapy for some.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxlya0", "created": 1394302314.0, "author_flair_text": null, "created_utc": 1394302314.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfxdkru", "gilded": 0, "author": "[deleted]", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxdkru", "created": 1394264050.0, "author_flair_text": null, "created_utc": 1394264050.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxudlm", "gilded": 0, "author": "Irish_Chick", "parent_id": "t1_cfxm1t2", "approved_by": null, "body": "As should you be! You've done amazing.\nThanks hun though.  It was but bringing up my siblings gave a distraction. \nI guess we all deal with things how we can at the time . . . Process later. xxxx", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As should you be! You&amp;#39;ve done amazing.\nThanks hun though.  It was but bringing up my siblings gave a distraction. \nI guess we all deal with things how we can at the time . . . Process later. xxxx&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxudlm", "created": 1394324730.0, "author_flair_text": null, "created_utc": 1394324730.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfxm1t2", "gilded": 0, "author": "buggerbees", "parent_id": "t1_cfxfjjp", "approved_by": null, "body": "Thank you so much! Congratulations! Your situation sounds really, really difficult, because it sounds like you had no place to escape to. You should be so proud to not have let it crush you.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! Congratulations! Your situation sounds really, really difficult, because it sounds like you had no place to escape to. You should be so proud to not have let it crush you.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxm1t2", "created": 1394302588.0, "author_flair_text": null, "created_utc": 1394302588.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfxfjjp", "gilded": 0, "author": "Irish_Chick", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "I'm a survivor of child sexual abuse which went in for 7 years. An alcoholic for mother who left me with the man, her father who was my abuser and a father who ran out when I was ten after running uo a crippling debt through gambling . . . Not a great start but my frame of mind has been for years has been . . .  I can either let these things define me and these people win (I chose not to act as a victim . . . It hasn't and wont kill me)or I can take control and be outspoken . . . Within the right setting and deal with the issues if and as they come up. Which from time to time they do.\nLike yourself I don't think people can be this happy without having been through something to appreciate it. \nGranted it consume many people for many years and with the right help I believe they too can become the flower they are trying so hard to become. \nI'm now 28 with my husband ten years and 34 weeks pregnant with our first child. \nYes you will likely be a very overprotective mam . . . As will I . . . Rather that than one second of pain. \nI wish you all the best and if you hit one of those days (you know the type I mean) feel free to mail me. You are not alone xx\nBest of luck and go you!!!! \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a survivor of child sexual abuse which went in for 7 years. An alcoholic for mother who left me with the man, her father who was my abuser and a father who ran out when I was ten after running uo a crippling debt through gambling . . . Not a great start but my frame of mind has been for years has been . . .  I can either let these things define me and these people win (I chose not to act as a victim . . . It hasn&amp;#39;t and wont kill me)or I can take control and be outspoken . . . Within the right setting and deal with the issues if and as they come up. Which from time to time they do.\nLike yourself I don&amp;#39;t think people can be this happy without having been through something to appreciate it. \nGranted it consume many people for many years and with the right help I believe they too can become the flower they are trying so hard to become. \nI&amp;#39;m now 28 with my husband ten years and 34 weeks pregnant with our first child. \nYes you will likely be a very overprotective mam . . . As will I . . . Rather that than one second of pain. \nI wish you all the best and if you hit one of those days (you know the type I mean) feel free to mail me. You are not alone xx\nBest of luck and go you!!!! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxfjjp", "created": 1394276127.0, "author_flair_text": null, "created_utc": 1394276127.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxizbd", "gilded": 0, "author": "[deleted]", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "Awesome. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxizbd", "created": 1394293568.0, "author_flair_text": null, "created_utc": 1394293568.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxauv7", "gilded": 0, "author": "Dearlybelovedd", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "What a great, really inspiring post. Congrats on all your hard work and thanks for sharing!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a great, really inspiring post. Congrats on all your hard work and thanks for sharing!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxauv7", "created": 1394254136.0, "author_flair_text": null, "created_utc": 1394254136.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxbicj", "gilded": 0, "author": "lymnlym", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "You're an inspiration to fellow survivors like me. Unfortunately when I thought I was well into my recovery I've been thrown backwards by a crippling illness. My abuse is healing and doing well, but my illness leaves me lots of time to think on the past since I'm immobile. Really messes with your head, thinking. Anyway, awesome that you are thriving and I hope to join your ranks soon! :-) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re an inspiration to fellow survivors like me. Unfortunately when I thought I was well into my recovery I&amp;#39;ve been thrown backwards by a crippling illness. My abuse is healing and doing well, but my illness leaves me lots of time to think on the past since I&amp;#39;m immobile. Really messes with your head, thinking. Anyway, awesome that you are thriving and I hope to join your ranks soon! :-) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxbicj", "created": 1394256220.0, "author_flair_text": null, "created_utc": 1394256220.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfxnn6c", "gilded": 0, "author": "bruinbabe", "parent_id": "t1_cfxlzhu", "approved_by": null, "body": "Thank you. I have made it from the darkest depths... The battle now is shining the light brighter when the darkness creeps up on me from time to time. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I have made it from the darkest depths... The battle now is shining the light brighter when the darkness creeps up on me from time to time. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxnn6c", "created": 1394306745.0, "author_flair_text": null, "created_utc": 1394306745.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfxlzhu", "gilded": 0, "author": "buggerbees", "parent_id": "t1_cfxep8u", "approved_by": null, "body": "Thank you. I hope you have made it out, and if you haven't I hope eventually you do. You deserve to. I don't even have to know you to know that.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I hope you have made it out, and if you haven&amp;#39;t I hope eventually you do. You deserve to. I don&amp;#39;t even have to know you to know that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxlzhu", "created": 1394302408.0, "author_flair_text": null, "created_utc": 1394302408.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfxep8u", "gilded": 0, "author": "bruinbabe", "parent_id": "t3_1zuyfv", "approved_by": null, "body": "As a victim of sexual abuse, this made me so elated to read. Almost all of the persons who have suffered abuse at another's hands have gone into a dark place. The ability to become removed from that deep despair and selftorture is often varied. It's so wonderful to hear that you've made it out on the otherside, and that you're facing the future head-on. \n\nGodspeed to you, and good luck. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a victim of sexual abuse, this made me so elated to read. Almost all of the persons who have suffered abuse at another&amp;#39;s hands have gone into a dark place. The ability to become removed from that deep despair and selftorture is often varied. It&amp;#39;s so wonderful to hear that you&amp;#39;ve made it out on the otherside, and that you&amp;#39;re facing the future head-on. &lt;/p&gt;\n\n&lt;p&gt;Godspeed to you, and good luck. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1zuyfv", "score_hidden": false, "name": "t1_cfxep8u", "created": 1394270294.0, "author_flair_text": null, "created_utc": 1394270294.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]