[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I love being alone. I love spending time with myself. I love not owing attention to any friends around me or anything. &lt;/p&gt;\n\n&lt;p&gt;I love getting into my car, going to google maps/beeradvocates and finding a fantastic brewery 300 miles away.. and driving there. \nI love the hours where I&amp;#39;ll listen to Reggae and Alanis Morisette and scream the lyrics at the top of my lungs. I love finding something interesting at the corner of my eye... and pulling over to check it out. &lt;/p&gt;\n\n&lt;p&gt;I love getting to the brewery, I&amp;#39;m starving, tired, and anxious to try some good beers. I love ordering a flight of everything they offer. I love tasting all the beers and writing down in my little &amp;quot;beer journal&amp;quot; how good I thought some beers were. I love sitting at the bar and talking to people next to me (I have a hugely jovial disposition so it&amp;#39;s easy to make people laugh with me) and entertaining them with the massive amounts of stories I have. I love being able to leave and never seeing them again .&lt;/p&gt;\n\n&lt;p&gt;I love finding the nearest camp site that evening and throwing my 6x6 tent up and passing out with a half eaten sandwich next to me with &amp;quot;it&amp;#39;s always sunny in philadelphia&amp;quot; playing throughout the night. &lt;/p&gt;\n\n&lt;p&gt;I love waiting up in the morning, feeling groggy, gross, alone and free. &lt;/p&gt;\n\n&lt;p&gt;I love the drive back to my house where I can make plans with hanging out with friends later and telling them the cool shit I&amp;#39;ve seen or the cool people I met on my mini-journey. &lt;/p&gt;\n\n&lt;p&gt;I love repeating this every fucking week. &lt;/p&gt;\n\n&lt;p&gt;Be happy with yourself, and you&amp;#39;ll truly be a happy person. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I love being alone. I love spending time with myself. I love not owing attention to any friends around me or anything. \n\nI love getting into my car, going to google maps/beeradvocates and finding a fantastic brewery 300 miles away.. and driving there. \nI love the hours where I'll listen to Reggae and Alanis Morisette and scream the lyrics at the top of my lungs. I love finding something interesting at the corner of my eye... and pulling over to check it out. \n\nI love getting to the brewery, I'm starving, tired, and anxious to try some good beers. I love ordering a flight of everything they offer. I love tasting all the beers and writing down in my little \"beer journal\" how good I thought some beers were. I love sitting at the bar and talking to people next to me (I have a hugely jovial disposition so it's easy to make people laugh with me) and entertaining them with the massive amounts of stories I have. I love being able to leave and never seeing them again .\n\nI love finding the nearest camp site that evening and throwing my 6x6 tent up and passing out with a half eaten sandwich next to me with \"it's always sunny in philadelphia\" playing throughout the night. \n\nI love waiting up in the morning, feeling groggy, gross, alone and free. \n\nI love the drive back to my house where I can make plans with hanging out with friends later and telling them the cool shit I've seen or the cool people I met on my mini-journey. \n\nI love repeating this every fucking week. \n\nBe happy with yourself, and you'll truly be a happy person. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "21ensf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "kabylewolf", "media": null, "score": 17, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/21ensf/nothing_makes_me_happier_than/", "name": "t3_21ensf", "created": 1395863473.0, "url": "http://www.reddit.com/r/happy/comments/21ensf/nothing_makes_me_happier_than/", "author_flair_text": null, "title": "Nothing makes me happier than...", "created_utc": 1395834673.0, "ups": 17, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cgceikz", "gilded": 0, "author": "Shark_Bait_Buddy", "parent_id": "t3_21ensf", "approved_by": null, "body": "I think learning to enjoy being alone is so important.  Your first love should be with yourself, it makes things so much easier if your not dependent on others for happiness. Props for camping alone! I'd be so scared!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think learning to enjoy being alone is so important.  Your first love should be with yourself, it makes things so much easier if your not dependent on others for happiness. Props for camping alone! I&amp;#39;d be so scared!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_21ensf", "score_hidden": false, "name": "t1_cgceikz", "created": 1395850521.0, "author_flair_text": null, "created_utc": 1395846921.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]