[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been using the same desk chair for my PC for a number of years and it&amp;#39;s still going strong, but the armrests were another story. I had  They were worn out and desintegrating. So i unscrew them and head to Staples, as i was instructed to do by an employee working there months before (I just never took the time until then)&lt;/p&gt;\n\n&lt;p&gt;I was on my way to my parent&amp;#39;s home so i stop at the Staples closest to them. It&amp;#39;s a saturday and i was pretty happy that day if i remember correctly after having spent the night with a good friend :)&lt;/p&gt;\n\n&lt;p&gt;But my happyness was short lived when i went to talk to this snotty little teenager who, i could clearly see, just didn&amp;#39;t want to do any kind of work that day. He tells me they don&amp;#39;t have any spare armrests and to come back Monday instead when the &amp;quot;regular guy&amp;quot; who does this comes in. Bullshit. I leave and head home.&lt;/p&gt;\n\n&lt;p&gt;I was still in a decent mood at that point so i said to myself, fuck it. I&amp;#39;m heading to the other Staples closer to MY house that time. Reach the back where all the chairs are at and i wait my turn to talk to an employee then. Right then, i knew that guy was made for customer support. He approaches me with a smile, gets my problem right off the bat and goes in the back, grabs a set of armrests that fit the screw holes and asks me to pick the set i want. Professional all the way. He even comes with me to the register to tell the clerk the right code to enter for the bill.&lt;/p&gt;\n\n&lt;p&gt;At that point, i was really happy to be treated correctly. Rarely have i seen good customer support like this. I demande the cashier to bring me the manager. &lt;/p&gt;\n\n&lt;p&gt;I waited for him like 10 minutes. I WANTED to wait and i DID wait. When he comes up to me, i tell him i had a bad run in with an employee. His eyes widen and asks me who it was. I tell him it was another Staples employe from another store and that his employee was awesome and i wanted him to know.&lt;/p&gt;\n\n&lt;p&gt;He looks at me with a smile and tells me he appreciated me telling him that and to fill out an evaluation paper next to the exit. I took my time and filled it out with glee.&lt;/p&gt;\n\n&lt;p&gt;I hope this guy gets a raise or a promotion. I really do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been using the same desk chair for my PC for a number of years and it's still going strong, but the armrests were another story. I had  They were worn out and desintegrating. So i unscrew them and head to Staples, as i was instructed to do by an employee working there months before (I just never took the time until then)\n\nI was on my way to my parent's home so i stop at the Staples closest to them. It's a saturday and i was pretty happy that day if i remember correctly after having spent the night with a good friend :)\n\nBut my happyness was short lived when i went to talk to this snotty little teenager who, i could clearly see, just didn't want to do any kind of work that day. He tells me they don't have any spare armrests and to come back Monday instead when the \"regular guy\" who does this comes in. Bullshit. I leave and head home.\n\nI was still in a decent mood at that point so i said to myself, fuck it. I'm heading to the other Staples closer to MY house that time. Reach the back where all the chairs are at and i wait my turn to talk to an employee then. Right then, i knew that guy was made for customer support. He approaches me with a smile, gets my problem right off the bat and goes in the back, grabs a set of armrests that fit the screw holes and asks me to pick the set i want. Professional all the way. He even comes with me to the register to tell the clerk the right code to enter for the bill.\n\nAt that point, i was really happy to be treated correctly. Rarely have i seen good customer support like this. I demande the cashier to bring me the manager. \n\nI waited for him like 10 minutes. I WANTED to wait and i DID wait. When he comes up to me, i tell him i had a bad run in with an employee. His eyes widen and asks me who it was. I tell him it was another Staples employe from another store and that his employee was awesome and i wanted him to know.\n\nHe looks at me with a smile and tells me he appreciated me telling him that and to fill out an evaluation paper next to the exit. I took my time and filled it out with glee.\n\nI hope this guy gets a raise or a promotion. I really do.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "20xh96", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "1leggeddog", "media": null, "score": 25, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/happy/comments/20xh96/probably_made_an_employee_happy/", "name": "t3_20xh96", "created": 1395372698.0, "url": "http://www.reddit.com/r/happy/comments/20xh96/probably_made_an_employee_happy/", "author_flair_text": null, "title": "Probably made an employee happy", "created_utc": 1395343898.0, "ups": 29, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cg7s4ki", "gilded": 0, "author": "chuckitatthewall", "parent_id": "t3_20xh96", "approved_by": null, "body": "Oh my gosh. Just reading that made me smile. I'm glad you did that and I'm sure the employee appreciates it even if there isn't a financial reward. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my gosh. Just reading that made me smile. I&amp;#39;m glad you did that and I&amp;#39;m sure the employee appreciates it even if there isn&amp;#39;t a financial reward. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20xh96", "score_hidden": false, "name": "t1_cg7s4ki", "created": 1395358191.0, "author_flair_text": null, "created_utc": 1395354591.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cg87v1f", "gilded": 0, "author": "NeonNeologist", "parent_id": "t3_20xh96", "approved_by": null, "body": "People LOVE to report shitty things that happen; it's a great change of pace when someone decides to report a job well done. That guy is definitely thanking you", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People LOVE to report shitty things that happen; it&amp;#39;s a great change of pace when someone decides to report a job well done. That guy is definitely thanking you&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_20xh96", "score_hidden": false, "name": "t1_cg87v1f", "created": 1395410583.0, "author_flair_text": null, "created_utc": 1395406983.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]