[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been very depressed lately, I&amp;#39;m a broke college student, and I have been really lonely the past few weeks because of lack of social interaction. I just got out of a 3 year relationship, I&amp;#39;ve tried my game on picking up women but they all have just played me like a fiddle, I have been gaining a lot of weight and I have little to no motivation. \nI have been watching the Olympics recently and fell in love with (in my mind) the most beautiful girl on this planet, Figure skater Kaetlyn Osmond. All my friends know that I have a huge crush on her and I watch her every chance I get. &lt;/p&gt;\n\n&lt;p&gt;Every wednesday people on twitter post a Woman Crush Wednesday post, and as you might have guessed it, I posted that my crush was Kaetlyn. &lt;/p&gt;\n\n&lt;p&gt;Well Reddit, she saw it and she responded to it. My heart exploded and I showed all of my friends and they knew how much it meant to\n me. I couldn&amp;#39;t be any more happier over the littlest thing. It changed my mind set completely and I found a new motivation to transform myself and stop moping around. I hit the gym today and worked my ass off, finished all the homework I had set aside this week, and I even told the girl that was being a total bitch to me that I was over all her shenanigans and that I was cutting her off from me. &lt;/p&gt;\n\n&lt;p&gt;I feel so happy and motivated and I owe it all to this girl, that I will never know other than from behind a TV screen. It&amp;#39;s crazy how such a little thing can make me so happy that I am now starting to turn my life around for the better. If you are feeling down, just remember that there is no reason to mope around and that being the best you can be is all that you need to worry about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been very depressed lately, I'm a broke college student, and I have been really lonely the past few weeks because of lack of social interaction. I just got out of a 3 year relationship, I've tried my game on picking up women but they all have just played me like a fiddle, I have been gaining a lot of weight and I have little to no motivation. \nI have been watching the Olympics recently and fell in love with (in my mind) the most beautiful girl on this planet, Figure skater Kaetlyn Osmond. All my friends know that I have a huge crush on her and I watch her every chance I get. \n\nEvery wednesday people on twitter post a Woman Crush Wednesday post, and as you might have guessed it, I posted that my crush was Kaetlyn. \n\nWell Reddit, she saw it and she responded to it. My heart exploded and I showed all of my friends and they knew how much it meant to\n me. I couldn't be any more happier over the littlest thing. It changed my mind set completely and I found a new motivation to transform myself and stop moping around. I hit the gym today and worked my ass off, finished all the homework I had set aside this week, and I even told the girl that was being a total bitch to me that I was over all her shenanigans and that I was cutting her off from me. \n\nI feel so happy and motivated and I owe it all to this girl, that I will never know other than from behind a TV screen. It's crazy how such a little thing can make me so happy that I am now starting to turn my life around for the better. If you are feeling down, just remember that there is no reason to mope around and that being the best you can be is all that you need to worry about.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1xshl5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "OhSoMessi", "media": null, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1xshl5/really_little_things_can_go_a_long_ways_how_a/", "name": "t3_1xshl5", "created": 1392283807.0, "url": "http://www.reddit.com/r/happy/comments/1xshl5/really_little_things_can_go_a_long_ways_how_a/", "author_flair_text": null, "title": "Really little things can go a long ways. How a favorite on Twitter is turning my life around.", "created_utc": 1392283807.0, "ups": 17, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfe9y16", "gilded": 0, "author": "2OQuestions", "parent_id": "t3_1xshl5", "approved_by": null, "body": "Wow!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xshl5", "score_hidden": false, "name": "t1_cfe9y16", "created": 1392295573.0, "author_flair_text": null, "created_utc": 1392295573.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfenzs9", "gilded": 0, "author": "Glarabelles", "parent_id": "t3_1xshl5", "approved_by": null, "body": "Aww! First of all, I love this. Second, there was a time in my life where I was truly happy and truly in love, and it's simply amazing how much one can accomplish with that level of gratitude and support - my life goals, which I did not realize before, became so real to me. \n\nUnfoooooortunately, I lost that love, and have been struggling through the most difficult time of my life. But I need to fall in love with myself and reach that level of happiness of my own volition - that means that no one can take that away from me. :))))) \n\nAlso, my first though was, \"Damn, will you be my super awesome accountability buddy!\" I'm just reminded so much of how effective an individual is with true happiness. I finished an assignment last night, after failing a semester and having seizures make me go nuts enough to put me in a mental hospital - I felt SO accomplished. It really is the little things. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aww! First of all, I love this. Second, there was a time in my life where I was truly happy and truly in love, and it&amp;#39;s simply amazing how much one can accomplish with that level of gratitude and support - my life goals, which I did not realize before, became so real to me. &lt;/p&gt;\n\n&lt;p&gt;Unfoooooortunately, I lost that love, and have been struggling through the most difficult time of my life. But I need to fall in love with myself and reach that level of happiness of my own volition - that means that no one can take that away from me. :))))) &lt;/p&gt;\n\n&lt;p&gt;Also, my first though was, &amp;quot;Damn, will you be my super awesome accountability buddy!&amp;quot; I&amp;#39;m just reminded so much of how effective an individual is with true happiness. I finished an assignment last night, after failing a semester and having seizures make me go nuts enough to put me in a mental hospital - I felt SO accomplished. It really is the little things. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1xshl5", "score_hidden": false, "name": "t1_cfenzs9", "created": 1392329012.0, "author_flair_text": null, "created_utc": 1392329012.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]