[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL;DR Sometimes it&amp;#39;s good to remind yourself that you don&amp;#39;t always need to do something new, or attain a goal you&amp;#39;ve set just to be happy: being happy with what you&amp;#39;ve accomplished in the past is a better baseline. What have you done already, or what are some of your characteristics that make glad to be who you are?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Backstory:&lt;/em&gt; I&amp;#39;m writing this post after my first counseling session with my psychologist. She advised me to think about some aspects of myself I&amp;#39;m happy about.&lt;/p&gt;\n\n&lt;p&gt;Lately I&amp;#39;ve been quite frustrated with myself because I couldn&amp;#39;t attain some goals I had set for myself, so much that sometimes I wouldn&amp;#39;t take steps toward those goals anymore just because I knew I would fail. \nThe biggest goal I set for myself was becoming a more social person: saying hello to people I don&amp;#39;t know, making smalltalk etc. \nMost of the times I just had a huge mental block and couldn&amp;#39;t make myself say simple things like &amp;quot;hello, how are you?&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;The fact of the matter is that in comparison with high school, I&amp;#39;ve already become way more social, I have a solid group of friends, so actually I&amp;#39;ve already made a lot of progress. But apparently I&amp;#39;m stuck in the mindset of &lt;strong&gt;having&lt;/strong&gt; to be even more social. While I am happy with who I am, I continuously want to be even better. This has been putting a lot of pressure on me and is actually quite counterproductive. It would be better to keep in mind that I&amp;#39;ve actually accomplished quite a lot already and I should be glad with the progress that I&amp;#39;ve already made. Extra steps I take in this process of becoming more social are nice but shouldn&amp;#39;t be the only way to be happy. I&amp;#39;ts a road without an end, and if it gets hard along the way there&amp;#39;s nothing left, no backup, to be happy with. &lt;/p&gt;\n\n&lt;p&gt;So here are some of my &amp;quot;happy points&amp;quot;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I&amp;#39;ve already become way more social since High School: lots more friends, very good friends even. Once I get a conversation going with someone I have no problem keeping it going.&lt;/li&gt;\n&lt;li&gt;I go to the gym regularly and I give it everything I&amp;#39;ve got. Even outside the gym I do the effort of stretching, foam rolling, icing,...&lt;/li&gt;\n&lt;li&gt;My diet is on point. I know what I eat, how much I eat,... Everything is under control.&lt;/li&gt;\n&lt;li&gt;I&amp;#39;ve been reading more lately. I said myself that I should spend less time on facebook,reddit,... and while I haven&amp;#39;t totally quit, I&amp;#39;ve been reading much more the last few months. &lt;/li&gt;\n&lt;li&gt;I&amp;#39;m frugal, but not in an obsessive way. I know what I should spend money on, and don&amp;#39;t buy more than the necessary. &lt;/li&gt;\n&lt;li&gt;While I started my university degree with doubts if I could handle it, if I was smart enough, I&amp;#39;m now in my final Masters year, and with decent grades. I worked hard and got the results. &lt;/li&gt;\n&lt;li&gt;I&amp;#39;m good at (and enjoy) explaining concepts to people. I plan on becoming a teacher mainly because of this.&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m actually quite funny. No shame in saying that. &lt;/li&gt;\n&lt;li&gt;I dress a lot better (thanks to &lt;a href=\"/r/malefashionadvice\"&gt;/r/malefashionadvice&lt;/a&gt; mostly), and I actually have an interest in clothes now. A couple of years ago I couldn&amp;#39;t care less how I dressed and probably looked shit because of that attitude. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This is already a good start I think, it&amp;#39;s more then I  thought I&amp;#39;d think of when I started writing this. I&amp;#39;ll probably read this once a day to remind myself that I shouldn&amp;#39;t continuously chase after goals and only get happiness from reaching those. Looking back and seeing what I&amp;#39;ve already accomplished should be enough.&lt;/p&gt;\n\n&lt;p&gt;I know this is quite long, but maybe some people will read this and get a little shift in their mindset as well, with increased happiness as a result.&lt;/p&gt;\n\n&lt;p&gt;:)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TL;DR Sometimes it's good to remind yourself that you don't always need to do something new, or attain a goal you've set just to be happy: being happy with what you've accomplished in the past is a better baseline. What have you done already, or what are some of your characteristics that make glad to be who you are?\n\n*Backstory:* I'm writing this post after my first counseling session with my psychologist. She advised me to think about some aspects of myself I'm happy about.\n\nLately I've been quite frustrated with myself because I couldn't attain some goals I had set for myself, so much that sometimes I wouldn't take steps toward those goals anymore just because I knew I would fail. \nThe biggest goal I set for myself was becoming a more social person: saying hello to people I don't know, making smalltalk etc. \nMost of the times I just had a huge mental block and couldn't make myself say simple things like \"hello, how are you?\". \n\nThe fact of the matter is that in comparison with high school, I've already become way more social, I have a solid group of friends, so actually I've already made a lot of progress. But apparently I'm stuck in the mindset of **having** to be even more social. While I am happy with who I am, I continuously want to be even better. This has been putting a lot of pressure on me and is actually quite counterproductive. It would be better to keep in mind that I've actually accomplished quite a lot already and I should be glad with the progress that I've already made. Extra steps I take in this process of becoming more social are nice but shouldn't be the only way to be happy. I'ts a road without an end, and if it gets hard along the way there's nothing left, no backup, to be happy with. \n\nSo here are some of my \"happy points\"\n\n* I've already become way more social since High School: lots more friends, very good friends even. Once I get a conversation going with someone I have no problem keeping it going.\n* I go to the gym regularly and I give it everything I've got. Even outside the gym I do the effort of stretching, foam rolling, icing,...\n* My diet is on point. I know what I eat, how much I eat,... Everything is under control.\n* I've been reading more lately. I said myself that I should spend less time on facebook,reddit,... and while I haven't totally quit, I've been reading much more the last few months. \n* I'm frugal, but not in an obsessive way. I know what I should spend money on, and don't buy more than the necessary. \n* While I started my university degree with doubts if I could handle it, if I was smart enough, I'm now in my final Masters year, and with decent grades. I worked hard and got the results. \n* I'm good at (and enjoy) explaining concepts to people. I plan on becoming a teacher mainly because of this.\n* I'm actually quite funny. No shame in saying that. \n* I dress a lot better (thanks to /r/malefashionadvice mostly), and I actually have an interest in clothes now. A couple of years ago I couldn't care less how I dressed and probably looked shit because of that attitude. \n\nThis is already a good start I think, it's more then I  thought I'd think of when I started writing this. I'll probably read this once a day to remind myself that I shouldn't continuously chase after goals and only get happiness from reaching those. Looking back and seeing what I've already accomplished should be enough.\n\nI know this is quite long, but maybe some people will read this and get a little shift in their mindset as well, with increased happiness as a result.\n\n:)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "201cqp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Foezjie", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/happy/comments/201cqp/reasons_why_i_like_myself_for_who_i_am/", "name": "t3_201cqp", "created": 1394449874.0, "url": "http://www.reddit.com/r/happy/comments/201cqp/reasons_why_i_like_myself_for_who_i_am/", "author_flair_text": null, "title": "Reasons why I like myself for who I am", "created_utc": 1394446274.0, "ups": 10, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]