[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of my best friends husband took a terrible fall a few months ago.  He was taking down decorations on a very tall latter in his house, when the latter slipped and he fell to the floor and slammed his head through a wall. His wife heard the fall and found him unconscious and not breathing. John broke his neck, shoulder, some ribs, however the brain damage was what affected him most.   He had trouble remembering everyday words, and was very combative and nasty.  On one occasion he had to be restrained calling his wife a fu***** b***** as well as screaming profanities at the doctors.  You have to understand this is one of the most loving and caring couples I know, and that John would never treat or talk to her like that.  His wife told me it was so bad it had the nurses and doctors in tears over what he was saying, much less herself.  A few days after the hostility, John was showing signs of improvement.  One day the doctors came in for his morning check up.  The doctor came up to him and looked at him, asking him to tell him who he was.  John, slurred &amp;quot;doctor&amp;quot; (He was still having trouble with pronunciation).  Then they moved and pointed to his wife, asking if he knew who she was.  He stopped for a few seconds before revealing a faint smile.  Out came the words, &amp;quot;Thats my beautiful wife&amp;quot;  Everyone in room fell silent, for they all knew how much this couple had went through, and how much meaning those words really held&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "One of my best friends husband took a terrible fall a few months ago.  He was taking down decorations on a very tall latter in his house, when the latter slipped and he fell to the floor and slammed his head through a wall. His wife heard the fall and found him unconscious and not breathing. John broke his neck, shoulder, some ribs, however the brain damage was what affected him most.   He had trouble remembering everyday words, and was very combative and nasty.  On one occasion he had to be restrained calling his wife a fu***** b***** as well as screaming profanities at the doctors.  You have to understand this is one of the most loving and caring couples I know, and that John would never treat or talk to her like that.  His wife told me it was so bad it had the nurses and doctors in tears over what he was saying, much less herself.  A few days after the hostility, John was showing signs of improvement.  One day the doctors came in for his morning check up.  The doctor came up to him and looked at him, asking him to tell him who he was.  John, slurred \"doctor\" (He was still having trouble with pronunciation).  Then they moved and pointed to his wife, asking if he knew who she was.  He stopped for a few seconds before revealing a faint smile.  Out came the words, \"Thats my beautiful wife\"  Everyone in room fell silent, for they all knew how much this couple had went through, and how much meaning those words really held", "likes": null, "secure_media": null, "link_flair_text": null, "id": "250l1b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stanskey", "media": null, "score": 11, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/250l1b/thats_my_beautiful_wife/", "name": "t3_250l1b", "created": 1399551814.0, "url": "http://www.reddit.com/r/happy/comments/250l1b/thats_my_beautiful_wife/", "author_flair_text": null, "title": "Thats My Beautiful Wife", "created_utc": 1399523014.0, "ups": 11, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]