[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my husband and I had a lot of splurges last year on extra money we got and would be like, &amp;#39;Oh we&amp;#39;ll have enough left. Let&amp;#39;s go get a tattoo&amp;#39; and then something wouldn&amp;#39;t get paid off. Well, we were given another set amount to &amp;quot;do what we please&amp;quot; with, but of course are already in over our head, etc. Once we get our taxes back this year, we will be out of financial debt. Like, nothing needs paid off, we own what we have and just pay rent, monthly phone bills and stuff like that. We may even get a second car that we so need. YAY. &lt;/p&gt;\n\n&lt;p&gt;And the second thing is recently I&amp;#39;ve decided to go vegetarian. I also switched from 2% milk to almond milk and probably cut out a few other things. And what I find weird about it, is that normally doing something like this I would just be like &amp;#39;Let&amp;#39;s see how long I last this time&amp;#39; kind of attitude and I&amp;#39;m just not. Lately meat just seems to get more and more gross, wherever I eat meat-even home. But I feel much better because of it.&lt;/p&gt;\n\n&lt;p&gt;Very happy about the both of these (as would anyone, especially about the first one). Just had to share!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So my husband and I had a lot of splurges last year on extra money we got and would be like, 'Oh we'll have enough left. Let's go get a tattoo' and then something wouldn't get paid off. Well, we were given another set amount to \"do what we please\" with, but of course are already in over our head, etc. Once we get our taxes back this year, we will be out of financial debt. Like, nothing needs paid off, we own what we have and just pay rent, monthly phone bills and stuff like that. We may even get a second car that we so need. YAY. \n\nAnd the second thing is recently I've decided to go vegetarian. I also switched from 2% milk to almond milk and probably cut out a few other things. And what I find weird about it, is that normally doing something like this I would just be like 'Let's see how long I last this time' kind of attitude and I'm just not. Lately meat just seems to get more and more gross, wherever I eat meat-even home. But I feel much better because of it.\n\nVery happy about the both of these (as would anyone, especially about the first one). Just had to share!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1xqput", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "GrimaldiJ", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1xqput/the_two_things_that_really_tap_my_fancy_lately/", "name": "t3_1xqput", "created": 1392240050.0, "url": "http://www.reddit.com/r/happy/comments/1xqput/the_two_things_that_really_tap_my_fancy_lately/", "author_flair_text": null, "title": "The two things that really tap my fancy lately are the best things for me!", "created_utc": 1392240050.0, "ups": 5, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]