[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve started as the assistant veep for US operations for a Canadian company with 50k employees after toiling in operations for the last 5 years. I get paid 6 figures and I get to go to Chicago at least twice a month, even more. I lived in the States for 10 years and had to move to Canada when I got laid off. I&amp;#39;m happy to be in the States again, regardless of status.&lt;/p&gt;\n\n&lt;p&gt;I went in to talk to my boss the first day. He tells me that this is actually just a placeholder position for me to get used to doing veep stuff. The veep of compliance is on track to retire in 5 years and I&amp;#39;m to take over once he does. This is contingent on me (1) passing my bar exam (which I&amp;#39;m taking in June); and (2) getting an MBA - which the company will pay for (yay free degree!). I get to do a weekend MBA at UChicago of which the company will fly me in every week (that I&amp;#39;m not in Chicago) to do. I&amp;#39;ll have an apartment there too, company paid.&lt;/p&gt;\n\n&lt;p&gt;I love my new job! The pay is great, and there are are so many benefits and in the 2 weeks that I&amp;#39;ve been here people are telling me how much more approachable I am compared to the previous veep because she was a total wretch and how much more they prefer me.&lt;/p&gt;\n\n&lt;p&gt;I skiied my first black diamond yesterday and did it several times after!&lt;/p&gt;\n\n&lt;p&gt;I start roller derby on Sunday! I&amp;#39;m scared but looking forward to it finally starting!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m making a trip to Ann Arbor next weekend to see my old college friends there and meeting a couple of new people I met online.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also making a quick trip to meet a friend in St Louis while I&amp;#39;m in Chicago!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to Disneyworld in April, and also Tampa, Miami and the Florida keys!&lt;/p&gt;\n\n&lt;p&gt;A friend moved to town and we&amp;#39;re gonna hang out Saturday!&lt;/p&gt;\n\n&lt;p&gt;I reconnected with a long-lost friend. She has a daughter now and invited me to North Carolina to visit! Maybe next winter!&lt;/p&gt;\n\n&lt;p&gt;My condo will be ready within a year after being on hold for 4 years, so I&amp;#39;m excited to move out of my parents&amp;#39; place finally!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost 40 pounds so far and I&amp;#39;m going to the gym and trying to keep it off! I have another 20 to go before my goal weight and I&amp;#39;m trying to keep it up!&lt;/p&gt;\n\n&lt;p&gt;I met a girl who actually likes me and who loves to ski. We&amp;#39;re taking it slow &amp;#39;cos she lives an hour away and I travel a lot, but I&amp;#39;m happy to have someone in my life and not be lonely anymore!&lt;/p&gt;\n\n&lt;p&gt;I came to Canada 5 years ago, depressed at not having any job, no friends, no girlfriend,  having to move in with my parents again, working a menial call center job to pay the bills. I was fat and had no motivation to exercise. I was ready to give it all up. I&amp;#39;m happy I came this far and for once I can truly say I&amp;#39;m happy with my life!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've started as the assistant veep for US operations for a Canadian company with 50k employees after toiling in operations for the last 5 years. I get paid 6 figures and I get to go to Chicago at least twice a month, even more. I lived in the States for 10 years and had to move to Canada when I got laid off. I'm happy to be in the States again, regardless of status.\n\nI went in to talk to my boss the first day. He tells me that this is actually just a placeholder position for me to get used to doing veep stuff. The veep of compliance is on track to retire in 5 years and I'm to take over once he does. This is contingent on me (1) passing my bar exam (which I'm taking in June); and (2) getting an MBA - which the company will pay for (yay free degree!). I get to do a weekend MBA at UChicago of which the company will fly me in every week (that I'm not in Chicago) to do. I'll have an apartment there too, company paid.\n\nI love my new job! The pay is great, and there are are so many benefits and in the 2 weeks that I've been here people are telling me how much more approachable I am compared to the previous veep because she was a total wretch and how much more they prefer me.\n\nI skiied my first black diamond yesterday and did it several times after!\n\nI start roller derby on Sunday! I'm scared but looking forward to it finally starting!\n\nI'm making a trip to Ann Arbor next weekend to see my old college friends there and meeting a couple of new people I met online.\n\nI'm also making a quick trip to meet a friend in St Louis while I'm in Chicago!\n\nI'm going to Disneyworld in April, and also Tampa, Miami and the Florida keys!\n\nA friend moved to town and we're gonna hang out Saturday!\n\nI reconnected with a long-lost friend. She has a daughter now and invited me to North Carolina to visit! Maybe next winter!\n\nMy condo will be ready within a year after being on hold for 4 years, so I'm excited to move out of my parents' place finally!\n\nI've lost 40 pounds so far and I'm going to the gym and trying to keep it off! I have another 20 to go before my goal weight and I'm trying to keep it up!\n\nI met a girl who actually likes me and who loves to ski. We're taking it slow 'cos she lives an hour away and I travel a lot, but I'm happy to have someone in my life and not be lonely anymore!\n\nI came to Canada 5 years ago, depressed at not having any job, no friends, no girlfriend,  having to move in with my parents again, working a menial call center job to pay the bills. I was fat and had no motivation to exercise. I was ready to give it all up. I'm happy I came this far and for once I can truly say I'm happy with my life!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1z3w9a", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "_mediajunkie", "media": null, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 6, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1z3w9a/the_reasons_why_im_happy/", "name": "t3_1z3w9a", "created": 1393527412.0, "url": "http://www.reddit.com/r/happy/comments/1z3w9a/the_reasons_why_im_happy/", "author_flair_text": null, "title": "The reasons why I'm happy!", "created_utc": 1393527412.0, "ups": 6, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]