[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Wednesday I asked a girl out, even though I was very nervous. Thursday she said yes, and yesterday we went out and had (I think) a really good time. She said that she might be able to hang out next weekend. This has been my first date in over 2 years, so words don&amp;#39;t describe how amazing I feel! She laughed all throughout the date, we didn&amp;#39;t really have any awkward moments (except for the end when I forgot to walk her to her door), and we seemed to click. It was really stupendous how well I did given how long it&amp;#39;s been since I&amp;#39;ve gone out like that.&lt;/p&gt;\n\n&lt;p&gt;Also, this week, I&amp;#39;ve noticed that I&amp;#39;ve been writing quicker poems. Instead of a poem taking an hour to write, they often take 10 - 20 minutes to write. Now, I just need to work on weaving in more imagery, writing profound poems, and utilize all the details of a poem with care. But, I know what my goals are, and given how easier writing has become, for the first time in a while, I&amp;#39;m ecstatic to be writing again.&lt;/p&gt;\n\n&lt;p&gt;Last, but definitely not least, I&amp;#39;ve been losing weight consistently. This morning I weighed in at 193 lbs, although I was at 197 lbs earlier this week. I wanted to cheat last night, but I decided not to, saying that if I was going to cheat on my diet at all, it would be better on a Saturday, as a celebration of the end of an amazing week. While I still want to celebrate, I might have a lighter cheat meal.&lt;/p&gt;\n\n&lt;p&gt;For the first time in months, I feel good, as if some beatitude has swept over my apartment and laid its blessing on every aspect of my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Wednesday I asked a girl out, even though I was very nervous. Thursday she said yes, and yesterday we went out and had (I think) a really good time. She said that she might be able to hang out next weekend. This has been my first date in over 2 years, so words don't describe how amazing I feel! She laughed all throughout the date, we didn't really have any awkward moments (except for the end when I forgot to walk her to her door), and we seemed to click. It was really stupendous how well I did given how long it's been since I've gone out like that.\n\nAlso, this week, I've noticed that I've been writing quicker poems. Instead of a poem taking an hour to write, they often take 10 - 20 minutes to write. Now, I just need to work on weaving in more imagery, writing profound poems, and utilize all the details of a poem with care. But, I know what my goals are, and given how easier writing has become, for the first time in a while, I'm ecstatic to be writing again.\n\nLast, but definitely not least, I've been losing weight consistently. This morning I weighed in at 193 lbs, although I was at 197 lbs earlier this week. I wanted to cheat last night, but I decided not to, saying that if I was going to cheat on my diet at all, it would be better on a Saturday, as a celebration of the end of an amazing week. While I still want to celebrate, I might have a lighter cheat meal.\n\nFor the first time in months, I feel good, as if some beatitude has swept over my apartment and laid its blessing on every aspect of my life.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1z9n3y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ringsnmodules", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1z9n3y/the_last_few_days_have_been_spectacular_d/", "name": "t3_1z9n3y", "created": 1393686007.0, "url": "http://www.reddit.com/r/happy/comments/1z9n3y/the_last_few_days_have_been_spectacular_d/", "author_flair_text": null, "title": "The last few days have been spectacular :D", "created_utc": 1393686007.0, "ups": 6, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfs5m9o", "gilded": 0, "author": "ringsnmodules", "parent_id": "t1_cfs4ksc", "approved_by": null, "body": "Thanks. It's actually been a pretty horrible year so far, but things are getting better. I can't even describe how happy I am to have gone on a date after so long, and so relieved that I didn't totally blow it, either.\n\nThe biggest thing to work on that I haven't have done or started is my career. I don't know what I want to do in the long run, but I think for now I'm not in a huge rush. I think my hobbies are my largest ambition currently.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. It&amp;#39;s actually been a pretty horrible year so far, but things are getting better. I can&amp;#39;t even describe how happy I am to have gone on a date after so long, and so relieved that I didn&amp;#39;t totally blow it, either.&lt;/p&gt;\n\n&lt;p&gt;The biggest thing to work on that I haven&amp;#39;t have done or started is my career. I don&amp;#39;t know what I want to do in the long run, but I think for now I&amp;#39;m not in a huge rush. I think my hobbies are my largest ambition currently.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1z9n3y", "score_hidden": false, "name": "t1_cfs5m9o", "created": 1393728699.0, "author_flair_text": null, "created_utc": 1393728699.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfs4ksc", "gilded": 0, "author": "j_overland_f", "parent_id": "t3_1z9n3y", "approved_by": null, "body": "Congrats! It's awesome when happy things happen, sounds like you're having a great week, that's wonderful... Well done to you for effectively making yourself happier!", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats! It&amp;#39;s awesome when happy things happen, sounds like you&amp;#39;re having a great week, that&amp;#39;s wonderful... Well done to you for effectively making yourself happier!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1z9n3y", "score_hidden": false, "name": "t1_cfs4ksc", "created": 1393729408.0, "author_flair_text": null, "created_utc": 1393725808.0, "distinguished": null, "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "cfs8dss", "gilded": 0, "author": "HomoRapien", "parent_id": "t3_1z9n3y", "approved_by": null, "body": "Keep up the good work man! :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep up the good work man! :) &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1z9n3y", "score_hidden": false, "name": "t1_cfs8dss", "created": 1393736414.0, "author_flair_text": null, "created_utc": 1393736414.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}]