[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Warning: First part of story not so happy, but it definitely makes the happy stuff all the better. :)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Last year I got out of an emotionally (and sometimes a bit physically) abusive relationship. I fell hard and fast for that person, but it was clear that we had issues. I was 18 at the time and I saw him as the guy who saved me from a terrible cycle of depression/anxiety and loneliness. It wasn&amp;#39;t a happy time, but I was happier than I&amp;#39;ve ever been with him.&lt;/p&gt;\n\n&lt;p&gt;I lived with him and dated until I was 20. I left everything behind to be with him. I gave him all of me, and maybe that was my mistake. In that time, I constantly took his verbal beatings, but I loved him and I stayed with him still. Things ended when I cheated on him. I know it was a terrible thing and I have never been more sorry for something in my life, but I&amp;#39;ve been through a lot of therapy as to the &amp;quot;why&amp;quot; and I&amp;#39;ve worked through those issues (and let me say, the saying &amp;quot;once a cheater always a cheater&amp;quot; is simply not true. You can bet that is something I never want to do ever again). In the following months after the breakup, I experienced symptoms my therapist said were very reminiscent of PTSD. Some nights I woke up in terror and cold sweats from nightmares about him, I got severe anxiety if I heard from him...things were really really bad. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;About five months after the breakup, I started chatting with one of my former high school classmates. I was always the shy and quiet good girl in high school, and he was loud and obnoxious. This was all I remembered of him haha. Safe to say we didn&amp;#39;t hang out...well ever. But we started chatting and he surprised me by being really sweet and kind and funny. I even told him the reason my last relationship ended so terribly, and despite having been cheated on by both his exes, he still wanted to be with me. I was really touched by that. We went out for our first date to get ice cream and he made me laugh so much that I cried. It was really nice to cry tears of happiness and not tears of sadness like I had been doing almost every night. We &amp;quot;dated&amp;quot; for about three months, but I was too scared to label it. I didn&amp;#39;t want to make it official until I could no longer lie to myself. He was my boyfriend and I was...okay with that. I was surprised at how okay I felt about it.&lt;/p&gt;\n\n&lt;p&gt;I guess we&amp;#39;ve been officially dating for almost five months since then. I had a really hard time giving him any feelings of love for a long time because I still had feelings for my ex. Slowly and with lots of therapy, I started to get over things and accept things better. I was still a little scared to make myself completely available because I was hurt so much last time that happened. But he has been there for me through all of this even though I know it&amp;#39;s been hard on him. I&amp;#39;ve made myself emotionally unavailable and I&amp;#39;ve been difficult and emotional and mean sometimes. He showed me the patience, kindness, and understanding that I&amp;#39;ve never received from any guy before. I am so thankful for that. &lt;/p&gt;\n\n&lt;p&gt;I wanted to tell him I loved him for a while, but I still had doubts and I was still weary. I knew I needed the right moment when I unquestionably knew I loved him. So as I thought about this while we were laying together listening to Pandora and one of our favorite songs starts to play, I knew I couldn&amp;#39;t keep it in any longer. And he told me he loved me and it felt good to hear those words from someone who truly means it and has done nothing but show me how much he loves me every day. And I know his feelings for me are true and he was just waiting for me to work through things so I could tell him when I was ready. I finally am. This was such a milestone for me, I feel like in just the span of a year I&amp;#39;ve come so far. I feel so strong. I can&amp;#39;t explain how happy I am...I&amp;#39;m tearing up and smiling like a goofball to myself just thinking about it right now. It feels good. It feels good to move on and let myself be happy and to be with someone who makes me happy. I&amp;#39;m proud of myself.&lt;/p&gt;\n\n&lt;p&gt;On an additional happy note, I can now focus on me. I&amp;#39;ve struggled with severe self-esteem issues and depression for as long as I could remember, and my previous relationship did not help with that at all. I&amp;#39;ve been going to therapy and I&amp;#39;ve come to understand and love so much about myself because gosh darn it I am a really wonderful person. I&amp;#39;ve made so much improvement. I think that is a big reason why I can love my boyfriend now. He supports me, but I can do all of this independent of the relationship too, which I think is really important. In the past few months of my life, I feel like so many good things have come my way and it feels even better to feel like I deserve them. I got a job with great people, I got accepted to college, I have a &lt;em&gt;healthy&lt;/em&gt; relationship with someone who shows me kindness and makes me laugh...things just feel really good. And I&amp;#39;m happy. It&amp;#39;s been a long time since I&amp;#39;ve been able to say that with as much truth as I can now.&lt;/p&gt;\n\n&lt;p&gt;And Kyle, I love you. I love you a lot actually. Thank you for everything.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr: Got out of emotionally abusive relationship a year ago, current boyfriend comes along and shows me kindness and understanding. Initially unable to give him love because previous relationship scarred me. Finally let go and allowed myself to love him and he loves me too. :D&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: grammar&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Warning: First part of story not so happy, but it definitely makes the happy stuff all the better. :)**\n\nLast year I got out of an emotionally (and sometimes a bit physically) abusive relationship. I fell hard and fast for that person, but it was clear that we had issues. I was 18 at the time and I saw him as the guy who saved me from a terrible cycle of depression/anxiety and loneliness. It wasn't a happy time, but I was happier than I've ever been with him.\n\nI lived with him and dated until I was 20. I left everything behind to be with him. I gave him all of me, and maybe that was my mistake. In that time, I constantly took his verbal beatings, but I loved him and I stayed with him still. Things ended when I cheated on him. I know it was a terrible thing and I have never been more sorry for something in my life, but I've been through a lot of therapy as to the \"why\" and I've worked through those issues (and let me say, the saying \"once a cheater always a cheater\" is simply not true. You can bet that is something I never want to do ever again). In the following months after the breakup, I experienced symptoms my therapist said were very reminiscent of PTSD. Some nights I woke up in terror and cold sweats from nightmares about him, I got severe anxiety if I heard from him...things were really really bad. \n\n______________________________________________________________________________________________________________\n\n\nAbout five months after the breakup, I started chatting with one of my former high school classmates. I was always the shy and quiet good girl in high school, and he was loud and obnoxious. This was all I remembered of him haha. Safe to say we didn't hang out...well ever. But we started chatting and he surprised me by being really sweet and kind and funny. I even told him the reason my last relationship ended so terribly, and despite having been cheated on by both his exes, he still wanted to be with me. I was really touched by that. We went out for our first date to get ice cream and he made me laugh so much that I cried. It was really nice to cry tears of happiness and not tears of sadness like I had been doing almost every night. We \"dated\" for about three months, but I was too scared to label it. I didn't want to make it official until I could no longer lie to myself. He was my boyfriend and I was...okay with that. I was surprised at how okay I felt about it.\n\nI guess we've been officially dating for almost five months since then. I had a really hard time giving him any feelings of love for a long time because I still had feelings for my ex. Slowly and with lots of therapy, I started to get over things and accept things better. I was still a little scared to make myself completely available because I was hurt so much last time that happened. But he has been there for me through all of this even though I know it's been hard on him. I've made myself emotionally unavailable and I've been difficult and emotional and mean sometimes. He showed me the patience, kindness, and understanding that I've never received from any guy before. I am so thankful for that. \n\nI wanted to tell him I loved him for a while, but I still had doubts and I was still weary. I knew I needed the right moment when I unquestionably knew I loved him. So as I thought about this while we were laying together listening to Pandora and one of our favorite songs starts to play, I knew I couldn't keep it in any longer. And he told me he loved me and it felt good to hear those words from someone who truly means it and has done nothing but show me how much he loves me every day. And I know his feelings for me are true and he was just waiting for me to work through things so I could tell him when I was ready. I finally am. This was such a milestone for me, I feel like in just the span of a year I've come so far. I feel so strong. I can't explain how happy I am...I'm tearing up and smiling like a goofball to myself just thinking about it right now. It feels good. It feels good to move on and let myself be happy and to be with someone who makes me happy. I'm proud of myself.\n\nOn an additional happy note, I can now focus on me. I've struggled with severe self-esteem issues and depression for as long as I could remember, and my previous relationship did not help with that at all. I've been going to therapy and I've come to understand and love so much about myself because gosh darn it I am a really wonderful person. I've made so much improvement. I think that is a big reason why I can love my boyfriend now. He supports me, but I can do all of this independent of the relationship too, which I think is really important. In the past few months of my life, I feel like so many good things have come my way and it feels even better to feel like I deserve them. I got a job with great people, I got accepted to college, I have a *healthy* relationship with someone who shows me kindness and makes me laugh...things just feel really good. And I'm happy. It's been a long time since I've been able to say that with as much truth as I can now.\n\nAnd Kyle, I love you. I love you a lot actually. Thank you for everything.\n\n**tl;dr: Got out of emotionally abusive relationship a year ago, current boyfriend comes along and shows me kindness and understanding. Initially unable to give him love because previous relationship scarred me. Finally let go and allowed myself to love him and he loves me too. :D**\n\nEdit: grammar\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "245wx6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "so_very_special", "media": null, "score": 56, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": 1398705080.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 7, "saved": false, "is_self": true, "permalink": "/r/happy/comments/245wx6/today_i_was_finally_able_to_tell_my_boyfriend/", "name": "t3_245wx6", "created": 1398690323.0, "url": "http://www.reddit.com/r/happy/comments/245wx6/today_i_was_finally_able_to_tell_my_boyfriend/", "author_flair_text": null, "title": "Today I was finally able to tell my boyfriend that I love him.", "created_utc": 1398661523.0, "ups": 63, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "ch42abd", "gilded": 0, "author": "so_very_special", "parent_id": "t1_ch3zbo7", "approved_by": null, "body": "Woo thank you!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woo thank you!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch42abd", "created": 1398716561.0, "author_flair_text": null, "created_utc": 1398687761.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch3zbo7", "gilded": 0, "author": "greenhoney92", "parent_id": "t3_245wx6", "approved_by": null, "body": "You go girl! Congrats :)", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You go girl! Congrats :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch3zbo7", "created": 1398699285.0, "author_flair_text": null, "created_utc": 1398670485.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "ch429om", "gilded": 0, "author": "so_very_special", "parent_id": "t1_ch3zw8o", "approved_by": null, "body": "I do feel incredibly lucky. And I'll never forget that. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do feel incredibly lucky. And I&amp;#39;ll never forget that. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch429om", "created": 1398716483.0, "author_flair_text": null, "created_utc": 1398687683.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "ch3zw8o", "gilded": 0, "author": "motorbikeguy91", "parent_id": "t3_245wx6", "approved_by": null, "body": "Lucky you!! ", "edited": false, "author_flair_css_class": null, "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lucky you!! &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch3zw8o", "created": 1398702575.0, "author_flair_text": null, "created_utc": 1398673775.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh5i", "banned_by": null, "subreddit": "happy", "likes": null, "replies": "", "saved": false, "id": "ch7udqe", "gilded": 0, "author": "so_very_special", "parent_id": "t1_ch69689", "approved_by": null, "body": "That's wonderful! And really encouraging and reassuring. You deserve all the happiness headed your way!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s wonderful! And really encouraging and reassuring. You deserve all the happiness headed your way!&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch7udqe", "created": 1399053056.0, "author_flair_text": null, "created_utc": 1399049456.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch69689", "gilded": 0, "author": "buggerbees", "parent_id": "t1_ch5f8gh", "approved_by": null, "body": "&gt;I kinda feel like I'm tearing everything down and rebuilding on a stronger foundation for a much happier and fulfilling life.\n\nYES. It's called post-traumatic growth. We should be proud, not everyone grows from trauma. \n\nThank you, it was not easy, but I can finally say that I have attained actual, real happiness, and am on a great path towards marriage and a graduate degree and babies. :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I kinda feel like I&amp;#39;m tearing everything down and rebuilding on a stronger foundation for a much happier and fulfilling life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;YES. It&amp;#39;s called post-traumatic growth. We should be proud, not everyone grows from trauma. &lt;/p&gt;\n\n&lt;p&gt;Thank you, it was not easy, but I can finally say that I have attained actual, real happiness, and am on a great path towards marriage and a graduate degree and babies. :)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch69689", "created": 1398917498.0, "author_flair_text": null, "created_utc": 1398888698.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5f8gh", "gilded": 0, "author": "so_very_special", "parent_id": "t1_ch5drcw", "approved_by": null, "body": "That's actually something I discussed with my therapist before. I am so thankful that all this happened to me in my teenage years to now at 21 years old. While I am upset that I missed out on a happy, fun teenage life (because of the self-esteem and depression and the fact that I moved in with a SO at such a young age), I think I would have been so much worse if I wasn't working through all of these issues right now. I kinda feel like I'm tearing everything down and rebuilding on a stronger foundation for a much happier and fulfilling life. \n\nI wish you all the best too. I hope you find happiness in your journey as well.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s actually something I discussed with my therapist before. I am so thankful that all this happened to me in my teenage years to now at 21 years old. While I am upset that I missed out on a happy, fun teenage life (because of the self-esteem and depression and the fact that I moved in with a SO at such a young age), I think I would have been so much worse if I wasn&amp;#39;t working through all of these issues right now. I kinda feel like I&amp;#39;m tearing everything down and rebuilding on a stronger foundation for a much happier and fulfilling life. &lt;/p&gt;\n\n&lt;p&gt;I wish you all the best too. I hope you find happiness in your journey as well.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch5f8gh", "created": 1398837907.0, "author_flair_text": null, "created_utc": 1398809107.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "ch5drcw", "gilded": 0, "author": "buggerbees", "parent_id": "t3_245wx6", "approved_by": null, "body": "I was in a similar situation, and I to had a hard time feeling, acknowledging, and acting on emotions, so I want to say congratulations on your hard work, and also know this: while things may seem to get bad at an exponential rate, they can also improve at an exponential rate. Happiness breeds happiness. While it may seem realistic to expect slow baby steps, you can encourage yourself with the notion that maybe it won't take as long as you think to reach that lovely state of being an emotionally stable person. I'm not sure people who haven't been acutely traumatized always reach that state of stability; we almost have an advantage in that we NEED therapy, while many with less obvious problems leave them unexamined. Glass half full, you know?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a similar situation, and I to had a hard time feeling, acknowledging, and acting on emotions, so I want to say congratulations on your hard work, and also know this: while things may seem to get bad at an exponential rate, they can also improve at an exponential rate. Happiness breeds happiness. While it may seem realistic to expect slow baby steps, you can encourage yourself with the notion that maybe it won&amp;#39;t take as long as you think to reach that lovely state of being an emotionally stable person. I&amp;#39;m not sure people who haven&amp;#39;t been acutely traumatized always reach that state of stability; we almost have an advantage in that we NEED therapy, while many with less obvious problems leave them unexamined. Glass half full, you know?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_245wx6", "score_hidden": false, "name": "t1_ch5drcw", "created": 1398834937.0, "author_flair_text": null, "created_utc": 1398806137.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]