[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.happy", "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, my husband and I got married about a month ago and ever since then, we&amp;#39;d been looking for a place to live. We had been living separately while we&amp;#39;re dating; He lives with his dad and I live in a tiny, tiny apartment with a roommate in the next city over.&lt;/p&gt;\n\n&lt;p&gt;Apartment searching was just as bad as job searching, especially since we had a couple things that we required, like a washer and dryer.&lt;/p&gt;\n\n&lt;p&gt;There were a few times were we came really close to locking an apartment down. But every time, we got dicked over. Basically, units were just taken from us for ridiculous reasons. Either, someone we pre-leasing a unit and we weren&amp;#39;t even notified even though we told we would be, a tenant changed their mind after we put down $400+, and having an appointment cancelled the day of because someone else put money down on it first. We didn&amp;#39;t even know someone else was working on getting the same place we wanted.&lt;/p&gt;\n\n&lt;p&gt;Anyway, yesterday and today was filled with frantic calling and searches. We were basically cold-calling leasing offices.&lt;/p&gt;\n\n&lt;p&gt;Today, we finally were able to get a place! The fees for reserving the place, admin, application fees, etc are really expensive (about $1000) but we don&amp;#39;t care at this point. We&amp;#39;re just relieved to finally end the search and have a place to go. :D &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t stop smiling. We&amp;#39;re finally going to be able to live like a normal married couple!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, my husband and I got married about a month ago and ever since then, we'd been looking for a place to live. We had been living separately while we're dating; He lives with his dad and I live in a tiny, tiny apartment with a roommate in the next city over.\n\n\nApartment searching was just as bad as job searching, especially since we had a couple things that we required, like a washer and dryer.\n\n\nThere were a few times were we came really close to locking an apartment down. But every time, we got dicked over. Basically, units were just taken from us for ridiculous reasons. Either, someone we pre-leasing a unit and we weren't even notified even though we told we would be, a tenant changed their mind after we put down $400+, and having an appointment cancelled the day of because someone else put money down on it first. We didn't even know someone else was working on getting the same place we wanted.\n\n\nAnyway, yesterday and today was filled with frantic calling and searches. We were basically cold-calling leasing offices.\n\nToday, we finally were able to get a place! The fees for reserving the place, admin, application fees, etc are really expensive (about $1000) but we don't care at this point. We're just relieved to finally end the search and have a place to go. :D \n\n\nI can't stop smiling. We're finally going to be able to live like a normal married couple!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1y0i8i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Tinyclayforest", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/happy/comments/1y0i8i/we_finally_found_a_place_to_live_d/", "name": "t3_1y0i8i", "created": 1392502844.0, "url": "http://www.reddit.com/r/happy/comments/1y0i8i/we_finally_found_a_place_to_live_d/", "author_flair_text": null, "title": "We FINALLY found a place to live! :D", "created_utc": 1392502844.0, "ups": 8, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]